{"product_id": "B008FHL56S", "context": "does this work with E 360 slim?", "response": "Yes it works perfectly and has not shown any signs of malfunction.."}
{"product_id": "B003VH5Z2C", "context": "I didnt realize my TV didnt have a Yellow in for video. Is there anythying I can buy that will convert the yellow and white plugs to HDMI?", "response": "They do not make those type of cords. Sorry"}
{"product_id": "B0098F1Y3K", "context": "Is Brainage suitable for a 12 year old?", "response": "No, it's not suitable for a 12 year old. In fact, I would not recommend buying it, because it wouldn't be fun for any aged person."}
{"product_id": "B002I0K3CK", "context": "Can this game be played on the original wii system", "response": "No. But there is another made for the old wii you can buy instead. This one is made for Wii U"}
{"product_id": "B00BMFIXOW", "context": "what is the region ?", "response": "Hispaniola or the Caribbean. Mainly Jamaca and Cuba"}
{"product_id": "B000B9RI00", "context": "Are the codes used for the xbox live or will we be able to use the codes after we purchase it", "response": "It's the XBOX live code, once used, it's no longer a good code, it's just for 12 months, with one month extra."}
{"product_id": "B00DC7O77A", "context": "Is this a very hard game compared to Donkey Kong Country Returns? Or is it hard in general? I don't want to buy something that will be too difficult.", "response": "Both games are a bit challenging. I haven't completed Donkey Kong Tropical Freeze to assess the whole game, but I don't think Returns is any harder. If you thought the previous one was too difficult, you might not like this one either. I would recommend Super Mario 3D World as it is easier but a lot of fun."}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "No, the Wii U does not have GameCube ports. However, you can make it work if you buy an adapter:http://www.nintendolife.com/news/2013/06/you_can_now_use_your_gamecube_pad_on_your_wii_u"}
{"product_id": "B006NU6HAS", "context": "will it run on windows 8 or 8.1", "response": "I run it on win 7. No lags and other problems."}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "The Reel 'Em In game you download to the pc. You don't need to have it in the disc drive. However, some of the other games you will need to keep in the drive. The Zeus slots is one of them."}
{"product_id": "B00D6PTMHI", "context": "Does it work on a macbook air?", "response": "As long as your version meets the minimum Requirements."}
{"product_id": "B0091A3AHA", "context": "And what is the hook up. Is it the red,white,yellow thing or what?", "response": "The screen is full HD and the HDMI cable is included with the box!  ;-)"}
{"product_id": "B000VRCNLG", "context": "Can this be played with just a mouse?", "response": "no you have to have a flight stick"}
{"product_id": "B002VBWIP6", "context": "Why is the game card cheaper than the online code? You would think when factoring in the cost of delivery and the materials it would be about the same", "response": "i need get code onlline now"}
{"product_id": "B004NRN5DU", "context": "What happens if your batteries die, or perhaps you remove the battery pack (by mistake of course).  Will this trick work to render a pause?", "response": "I have known every game I play that when the batteries die the game does not pause. Which, in Dark Souls case, is very inconvenient."}
{"product_id": "B00IIHU44E", "context": "Can I use my 360 controllers with the new system? Thanks!", "response": "Afraid not.  But the Xbox one controllers are a nice refinement of the 360 controllers."}
{"product_id": "B00ECOBFA4", "context": "Hi there dose this come in a case with the dic or is it emailed to you to download on the xbox 360 thanks", "response": "I bought the physical disc which was shipped in a case as shown in the image."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "Yes, it will work without a problem. I usually go in www.systemrequirementslab.com to check if my machine can run certain games. I recommend it to check if yours can! Hope it helps"}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "This edition is a single box, made to package the three disks. It's an ordinary gaming disk box. (No instructions included, by the way, but of course the online wikis cover it all anyway.)"}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "when you purchase the psn card online, immediately after the purchase is processed the code you will need to enter into your psn acct will generate. giving you immediate access to your psn card money."}
{"product_id": "B00IP0H4GA", "context": "so it definitely plays on us ps3's?", "response": "Yes. It's pretty good."}
{"product_id": "B002B9XB0E", "context": "Does it work with linux?", "response": "I run Ubuntu 12.04; it's been fine for ZSNES."}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "It sure does, that's what I bought it for. However, you need a Gamecube controller adapter for the Wii U to plug it into"}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "I am using it on 230 V (Qatar), no problem"}
{"product_id": "B00DRKJBC8", "context": "can you use a controller (xbox360) or do you have to use the computer keyboard?", "response": "Hi! You can use any pc available controller. I for one, use the 360 controller sometimes but my brother uses his ps3 controller and it works nice with both."}
{"product_id": "B00GHJ6X8G", "context": "I have a sealed copy of MLB 13 sitting next to me. Is it worth upgrading to MLB 14? I can't afford a PS4 now, so the PS3 version is my only option.", "response": "They sell a PS3 MLB14 version.  My grandson has the PS3 MLB14 version."}
{"product_id": "B00BT71S4K", "context": "the galaxy note 3 fit on the controler?", "response": "I own a Note 3 and this controller. It fits with more than a couple of centimeters of extra space. It'd fit even with a thick case on."}
{"product_id": "B008X73CE8", "context": "Where's the manual?  I purchased/downloaded the game, but no user's guide?", "response": "it is in the files that you downloaded. I printed mine up."}
{"product_id": "B00002SANH", "context": "I cannot get the game to work on my lap top operates windows 7 64 bit pc", "response": "Game's too old.  It works on my mom's 32-bit Win 7, but won't on my 64-bit Win 7.  No help for it...sorry."}
{"product_id": "B00IAVDQCK", "context": "Are there over-ear? And how do the build quality and sound quality stack up against a mid-range turtle beach headset?", "response": "Yes, they are over the ear and the build quality is good, doesn't feel cheap. I have not used any turtle beach headsets to compare to buy I do sound great! Hope that helps!"}
{"product_id": "B00030GSJY", "context": "How will this work with Elite Dangerous?", "response": "I use it for Elite Dangerous and it works great.I also use it for \"Star Citizen\"if you haven't heard it, it check it out on youtube."}
{"product_id": "B00BGGIWZM", "context": "Do you have any problems with the  Electronic Arts and Origin mix. Crashes, freezing or anything like that with this Sims game?", "response": "yes, theres always the problem of freezing and hanging while playing the Sims game."}
{"product_id": "B009ZDPYKO", "context": "Is this the large My Giant Tree Rex that sells indivdually at ToysRUs for $49.99?", "response": "No this is just the figurine that comes with the game"}
{"product_id": "B002I0HD9G", "context": "is it the same as the first one", "response": "I can't answer that because I did not buy the first one for my daughter but all I know is she plays it all of the time and I do mean ALL. She loves it. You can't go wrong."}
{"product_id": "B003YC4D9A", "context": "Can I use this to play Zelda Hyrule Warriors?", "response": "Honestly dont buy this third party controller, my wiiU doesn't recognize it at all"}
{"product_id": "B003ZSN600", "context": "Does this work with Windows 8.1 computers?", "response": "yeah i use it on my alienware"}
{"product_id": "B00DC9SWWE", "context": "The rating says it has \"strong language\" is there anyway to turn that off?", "response": "Not sure you can as the language is from the other players."}
{"product_id": "B003EUPCZG", "context": "Hello, Anybody have the actual dimensions of the mouse itself? I have larger hands/need larger mouse. Currently, have Logitech G500. Thx!", "response": "My hands are pudgy and massive and the deathadder is too big for me. I looked at your currnet mouse and the Razer Deathadder that I use is bigger. Just-in casey (haha get it?), it is 120mm end to end and 65mm wide at the front and back. 4Hope this helps,Fin Proebst"}
{"product_id": "B00GS1TYIO", "context": "Is the a Candy Bars Patch?I cannot install cd??Computer just wont open the disc????", "response": "I am like the others mine installed just fine. It must be the cd. I would write the seller and send it back. So sorry that you are having problems. It is a fun game."}
{"product_id": "B00D96BJSO", "context": "How Do I go about being able to hear the game play and the chat at the same time?  it seems like I'm only hearing one or the other?", "response": "Update controller. Make sure game chat is active. Sometimes its hard to hear chat over gameplay in loud gameplay situations. In that case turn game volume down in game options"}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "Its pretty short; I'd guess 4-5 feet."}
{"product_id": "B00DLDEKOK", "context": "is it compatable with xbox 360 slim?", "response": "Yess it plugs in thee controller"}
{"product_id": "B0097CUREG", "context": "do you have to leave the cd in while playing", "response": "Yes, and it is a bit of a pain...BUT ITS STILL FUN!!!"}
{"product_id": "B00D6PTMSW", "context": "Do I need to have a hard drive installed on my Xbox 360 to run this game?  I have a version of the Xbox without the hard drive.", "response": "I think you might need one"}
{"product_id": "B00BI83EVU", "context": "Will the single-player gameplay be significantly diminished if you don't have a reliable internet connection?", "response": "Your Internet should not effect the single player at all"}
{"product_id": "B00E1L786S", "context": "which polk audio sound bar is best for movies?", "response": "I would say this one we watch all kinds of movies!!"}
{"product_id": "B00CMQTUSS", "context": "I have some Micro USB's, so do I need to buy a charging pack for this?", "response": "Yes you do and you can't use your USB's it must be the USB that the charging pack comes with I just tried myself and it wasn't charging but I guess its kind of good because the one it comes with tells you when it's done charging"}
{"product_id": "B00BI9MDSO", "context": "How far back does the case open? Can it only open to the degrees shown in the picture or does it extends further?", "response": "One of my biggest gripes of this case is that it doesn't double as a display. So the answer is no"}
{"product_id": "B00DVEJA7G", "context": "So, can you listen to music you've downloaded but can you just listen to a radio station?", "response": "Musicjogger just can listen to music with bleutooth device, not included with TF/Micro card, and sorry that aslo can not listen to radio station itself unless by your mobile phone"}
{"product_id": "B00GS1TYIO", "context": "Is this compatible with Mac?", "response": "I checked the back of the package and it states:  Mac OS x 10.9, 10.8, 10.7, 10.62 GB free disk space,  DVD optical drive.    Hope this helps."}
{"product_id": "B000YMQGWU", "context": "it works for connecting a ps2 controller to a windows pc?", "response": "Yes works on vista 7 and 8. Don't know about xp because I don't have one but I'm sure it does"}
{"product_id": "B006JKARN0", "context": "does the game have 2 player offline mode?", "response": "Yes. It is a split screen (top bottom)."}
{"product_id": "B00EZKNSTQ", "context": "does it work with pc?", "response": "I don't know exactly because I have not played with it on the computer, but I know that wired controllers work with computers. It should just go right into the USB port and you can play away"}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "I never received a card just an instant email with the code to be input on Xbox"}
{"product_id": "B00EZAWV6W", "context": "I have an old Vista will this game work on my computer???? My son wants to play it.", "response": "I didn't run it on a Vista. I ran it on a windows 7 and it was super slow and glitchy. We finally gave up and bought an Xbox. Your Internet connection also matters. If it's slow, the game will be too."}
{"product_id": "B004S5TDUQ", "context": "What the diference this for 2014 edition?", "response": "New song list and some tweaks to the game play.  For some the changes will be superficial, but for some they are significant (like the ability to set the difficulty level).  see http://en.wikipedia.org/wiki/Rocksmith_2014"}
{"product_id": "B007VTVRFA", "context": "My 10 yr old wants to play this game, but he doesnt have an e-mail address... does he need one to play this game?", "response": "No you shouldn't need a email address. He may need a Origin account, but I doubt it since you should be able to download it directly to your PC. I hope that helps."}
{"product_id": "B008CP6MA2", "context": "I'm from Italy. Can i use every game without a US PSN account? (don't answer with just 'no' in case please)", "response": "Yes I believe you can as long as you have the disc."}
{"product_id": "B00CBQO930", "context": "Weight and Size. Is it light and cheap or does it have a nice weight? Is the size big enough to be comfortable for people with large hands?", "response": "It has a nice weight and it's a good mouse for the price. Comfortable but I don't know about if you have a large hands."}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "Yes, it still exists.  The patch that was offered on line does not work and Encore support is even worse.  Do not purchase it till you see information that a patch that works is available."}
{"product_id": "B006NU6HAS", "context": "is the aerosoft  pmdg 737 ngx the same as pmdg 737 ngx", "response": "yes,....they are the same."}
{"product_id": "B00HKCKA0G", "context": "What other headsets did you consider prior to buying these?", "response": "I didn't review other headsets as I borrowed a friends, liked them, and purchased a pair for myself with a gift card. Sorry I couldn't be of help."}
{"product_id": "B00C710AT6", "context": "is a controller needed?", "response": "I assume you can play with the mouse/keyboard, but you wouldn't want to. If you don't have a controller, I'd pass."}
{"product_id": "B00CQ9L1Z6", "context": "Does this allow to clone pokemon?", "response": "No it does not"}
{"product_id": "B0090ECASW", "context": "I saw in a video that someone had a different logo next to the keyboard instead of the red Mad Catz one. Is it possible to replace the Mad Catz one?", "response": "There are two models. That's it. The only way to replace it is if you physically remove the plate and scratch yhe logo off. I believe its just a paper interior. There are videos of people changing in this manner which is the only way. Its just for show."}
{"product_id": "B00EVWZHLK", "context": "Does this package include All DLC content for all 3 games?", "response": "No, only contains a Uplay card for a few characters on multiplayer game."}
{"product_id": "B007W8S2MG", "context": "Does this game offer the ability to play online with other psp vita persona 4 owners?", "response": "As far as I know, no. There are online features such as seeing what others are doing at your area of the game and news but there are no multiplayer features."}
{"product_id": "B00FQFFPZO", "context": "can you vary the number of laps in a race or does the game force you into 400 or 500 miles?", "response": "Yes you can set number of laps"}
{"product_id": "B00004XRBB", "context": "Can u fly the Junkers JU 87-B STUKA", "response": "No, I am unable to fly the STUKA.  I am using it in compatibility mode."}
{"product_id": "B00H8NS1K8", "context": "Anyone else's ear cup joints a little loose/wiggly?", "response": "Mine is not not loose"}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "It does look that way on the box, but the plug is a regular guitar one. Don't worry about that. I don't know if there are different sizes of guitar jacks, but it goes in mine perfectly fine, and mine is the same size as the headphone converters, so I think it's standard. Hope that helps."}
{"product_id": "B0044DJZ0A", "context": "Is this good for LoL? I want to get my friend something quality and that will work with LoL", "response": "No do not buy this key board the software is broken, get a G510"}
{"product_id": "B00562O8U0", "context": "my tv is a Samsung and infrared / shutter/ battery glasses. one of the first 3d tv. will they work ? I really want them for mulitplayer", "response": "i am not 100% sure it will but it claims to be universal 3d glasses and it worked on my television that is not sony brand tv. for $17, i would say it is worth the risk. i took a chance on it and was happy with the outcome."}
{"product_id": "B00006C2HA", "context": "Will this work on Windows 8", "response": "it works on windows 7 so I think it should work on windows 8"}
{"product_id": "B00EADTVL2", "context": "do the lights turn off when no controller is attached, or are they constantly on when the unit is plugged into the wall?", "response": "No lights when no controller are connected"}
{"product_id": "B001FBHT34", "context": "Does it work with ps3", "response": "It has 3.5 mm jacks for the mic and ear phones. I don't have a ps3 but I use it for PC"}
{"product_id": "B007W8S2MG", "context": "In terms of the story line, will everything still make sense if I haven't played Persona 1, 2, or 3?", "response": "Yes. The perspna 4 storyline is completely independent. I've read some of the history on the past and there are similarities, but you don't need to know that information to have a blast with Persona 4."}
{"product_id": "B00G6IJ5QK", "context": "Does the scroll wheel click when you scroll it or is it smooth?", "response": "it clicks, but isn't hard to scroll. I find it is a good amount of feedback."}
{"product_id": "B001PO2BJI", "context": "We have the \"Wii Remote Plus: Princess - Peach\" - will these work with that model of remote, please?", "response": "If it's the same size as the regular remote yea"}
{"product_id": "B00B5QLS4A", "context": "is it compatible with windows 8.1", "response": "The corsair website say's Win7, Win8, XP, Vista. So I would say it should work with 8.1http://www.corsair.com/us/gaming-peripherals/gaming-mice/vengeance-m95-performance-mmo-and-rts-laser-gaming-mouse-gunmetal-black.html"}
{"product_id": "B00BGA9YZK", "context": "Is this just another graphical showcase like Ryse was for the X1 or is there an actual game hidden in here?", "response": "I haven't played Ryse yet...I think it's supposed to be pretty good?  But anyway so far Shadowfall's pretty amazing.  IMO Gurilla (SP?) keeps getting better at storytelling and gameplay (besides graphics of course)."}
{"product_id": "B00JM3R6M6", "context": "Can you play the Tomodachi Life on a regular Nintendo DS?", "response": "It appears it's for 3ds and 2ds, according to Nintendo's site."}
{"product_id": "B00656HLGO", "context": "is this internal or external", "response": "external for original xbox 360 **NOT FOR SLIM**"}
{"product_id": "B004XGN8W4", "context": "will the white xbox 360 fit?", "response": "Yes it will but not as single as the black."}
{"product_id": "B00EIM3BV6", "context": "For use with Xbox One, how do you connect the 2.5mm chat cable from the new xbox headset adapter? Do you need to run the 2.5mm cable to the mix amp?", "response": "you'll need an xbox one adapter for the xbox one controller which can be bought from any retailer i.e amazon, walmart, or even gamestop."}
{"product_id": "B00EVWZHLK", "context": "includes subtitles in spanish ???", "response": "Assassins Creed Ezio Trilogy comes with three separate games: Assassins Creed II, Assassins Creed Brotherhood and Assassins Creed Revelations. All three have the option of Several spoken languages, including Spanish. However, Assassins Creed II only has subtitles in English. The others have many choices for subtitles, including Spanish, French, Italian, Dutch, Norwegian, etc."}
{"product_id": "B005T3GSBS", "context": "does this game have English subtitles or is it only in Japanese", "response": "The audio is in Japanese, but the text is in English."}
{"product_id": "B00EVWZHLK", "context": "Are the discs stacked on top of one another or do they have separate disk trays?  I'm a collector and stacked discs tend to get scratched.", "response": "The discs are in separate disc trays"}
{"product_id": "B000RT2868", "context": "does it work with xbox one controller to pc? also how long is the cable?", "response": "The adapter will work for any original XBox (released in 2001) controller (regular, mini, dance pad, or Steel Battalion); it does not work with Xbox360 or Xbox One controllers. It is less than 3 ft long."}
{"product_id": "B007JDMPOK", "context": "Is this collectors edition of Tera for the US-Server or the EU-Servers? Afaik, if it is the US-Version it will not work on the EU-Servers.", "response": "Yes, this is the one for the US server because it's published by En Masse.  The EU publisher is Gameforge."}
{"product_id": "B002I0IIPY", "context": "can this game be played on nintendo wii?", "response": "Yes, it plays on Wii."}
{"product_id": "B007MJSZDQ", "context": ". 1.Does this work for any Batter pack or is it just the 2 given to you?", "response": "I have charged other batteries in it but I don't know if any one will fit."}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "Yes, after confirm the payment"}
{"product_id": "B008KH7NZA", "context": "Is this headset durable?", "response": "Could not tell you exactly. I know people who have these headsets and they have lasted YEARS, and my lasted me less than two months. :/BUT the audio quality is amazing.(Sorry for my English)"}
{"product_id": "B00CHYOP80", "context": "does it say ps4 on the box", "response": "Yes, it is compatible with the PS4"}
{"product_id": "B002BSA20M", "context": "can this be played online with friends", "response": "yes, as long as you have xbox  live, yes you can :)"}
{"product_id": "B008MI7MWQ", "context": "why wont it download to my computer", "response": "I would be glad to answered, when I tried to download to my computer and zoom picture is not able to adjust...I had the help from online and they told me to tell the Amazon that it willl not work on Windows 7."}
{"product_id": "B002I0J4VQ", "context": "does it come with power cord to charge controller", "response": "Did not come with cord or controller"}
{"product_id": "B00D7UHT0E", "context": "What the system game, PAL or NTSC?", "response": "Regular wii gaming system, I am unfamiliar with what PAL or NTSC terms."}
{"product_id": "B0007U2CX6", "context": "Will this work on a PSP model 1001?", "response": "Yes, that is the model I bought it for. I had no issues at all with it."}
{"product_id": "B00FNKMVUO", "context": "How easy is it to switch profiles?  (And how quickly?)  I sometimes have to switch strategies quickly, meaning a whole new set of macros.  Thanks!", "response": "The scroll wheel light cannot change colors, outside of the 5 given profiles. The only colors for the scroll wheel are yellow, green, blue, red, and purple. The only fully customizable parts are the logo and side number bar. Please add the customizable feature UtechSmart."}
{"product_id": "B00EH5V1IO", "context": "Can anyone tell me how far the microphone extends? On the Siberia V2 it's 5\" (measuring from the bottom side), which is not long enough to work well.", "response": "It is 5 inches from the microphone extension outlet. In reality, it is about 4 1/2 inches (or less) depending on how you bend or shape it.That is not really long enough and I have volume issues since purchasing these to the point where I'd just be better off with a secondary mic."}
{"product_id": "B0000695GX", "context": "Is this game playable on Windows 7?", "response": "Yes. That is what I have on my system as well and have had no issues."}
{"product_id": "B00C2B2Y9A", "context": "What's the durability? I am very careful with my electronics. How long do these last?", "response": "Honestly mine only lasted around two months before the internal battery blew inside the headset."}
{"product_id": "B00D3TRMD8", "context": "Is this the actual game or some kind of cheat code?", "response": "This looks like it is a code that you enter into Steam. You would need to have a Steam account set up. Then when you enter this code on there it will unlock the game for you to download and play on steam."}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "Its not in the original package.  It was in excellent shape and appeared to be new."}
{"product_id": "B00CX9L30W", "context": "What does the PC Download Collector's Edition come with? I purchased it and I don't see any of the in-game exclusives, nor do I see anything sent .", "response": "It isn't in your inventory to start with, you have to talk with a Moogle and retrieve it from the mailing system in-game. If you still can't find it you should contact support."}
{"product_id": "B002I0J4VQ", "context": "does it come with cords", "response": "Yes it came with cords and 1 controller.  The controller's corded so thats a small downside."}
{"product_id": "B0094X28J0", "context": "do you need a nunchuc", "response": "Only for games that need it."}
{"product_id": "B002DUCF8A", "context": "Does this require a driver download for Windows 8.1?", "response": "With that one you are supposed to install off the disk first then plug it in when it tells you. When you download the new driver have it unplugged then after/during install when it tells you to plug it in."}
{"product_id": "B007CM0K86", "context": "Do it has scary zombies?", "response": "Yes it does.  Also the military gone bad as well as other thugs."}
{"product_id": "B00B5QLS4A", "context": "Does this mouse have any type of pinky rest? I can't tell by the pictures.", "response": "No, it has the buttons on the left, and there's a spot to grip it on the right but no pinky rest"}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "Not entirely sure about 8/8.1 but it runs just wonderfully on 7."}
{"product_id": "B007A7UJ4S", "context": "Do this game have English Voices?", "response": "can it be set to Japanese voices and English sub at the same time?"}
{"product_id": "B008GEH9HO", "context": "Can you turn the connectivity off, similar to putting a phone in \"airplane mode\"?", "response": "Yes. On the right side, near the yellow light, there is a switch you can flick. It will turn your connectivity off!"}
{"product_id": "B001AATQ0Y", "context": "Does this item work with 64bit system like Win7-64bit or Win8-64bit?", "response": "Yes, it works on win 8 64 bit, and win 7 64 bit."}
{"product_id": "B005BLAJRC", "context": "Can I download it to my computer or do I have to keep the cd in the computer to play?", "response": "You can download to the computer. To do your \"player face\" the cd must be in. Design your \"self\" and save it. Then you can put the cd away. Hope this helps. :-)  Enjoy all the games - I do."}
{"product_id": "B00GU8W5AE", "context": "Redragon Perdition VS the Razor Naga 2014 edition, if you have used both which do you prefer?", "response": "I have both of them, and I prefer the Naga 2014.  The buttons are easier to press which doesn't affect moving the mouse as much when pressing a key.   But I will admit that the Redragon software is a lot easier to use and doesn't have the added bloat to it like Razor has."}
{"product_id": "B00EI4V3X2", "context": "Is this headset surround sound for both PS3 and PS4? I would like a headset that has equal surround sound for both systems?", "response": "yes, the px4 headset has  surround sound for ps4 and ps3, it works good with both systems."}
{"product_id": "B00AIALGZK", "context": "Will it work on Windows 7?", "response": "Absolutely, I run it just fine on Win 7."}
{"product_id": "B00BRA9T5Y", "context": "Does it work with an Apple computer?", "response": "It didn't work with a PC so I'm guessin' it would work no better with an Apple."}
{"product_id": "B003O6N64Y", "context": "So if I plug the receiver in to my PS4, and then also plug the headset in to the controller will it play in game sound, and allow chat at the same tim", "response": "Yes, the PX5 is compatible for surround-sound game audio out-of-the-box, but will require a PS4 Chat Cable or PS4 Talkback Cable for chat compatibility.Compatibility and setup information for all our products can be found here: http://www.turtlebeach.com/connect"}
{"product_id": "B00166N6SA", "context": "How large is the case itself that it comes in?", "response": "The case is 5.25\" by 7.50\"."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "It didn't break. It feels like you can break it on your knee."}
{"product_id": "B00ACMM9BO", "context": "I lost my instructions.. Where can I get a digital copy?", "response": "I don't believe you can get a digtal one, but if you need one give me your email and I can type one out for you an send I your email."}
{"product_id": "B007W8S2MG", "context": "Does this game offer the ability to play online with other psp vita persona 4 owners?", "response": "The network function basically allows you to see other people's choices for a given day, and give/receive SOS during dungeons that can grant increase stats, give life etc. There is no multiplayer options, but that should not deter you from buying this game in any way."}
{"product_id": "B00B1N07QM", "context": "Does the razer software allow you to assign the buttons as \"direct input buttons (directx)\" so I can configure them using another profiling software?", "response": "I use it with a Mac so I can't help you sorry"}
{"product_id": "B00GBCLG0E", "context": "hello tell me the console includes control, hdmi cable, and the game you see in the box?", "response": "Yes. Everything you see you will get"}
{"product_id": "B009K7U6IK", "context": "What kind of keys are on the keyboard? (mechanical, rubber dome...)", "response": "Rubber dome/membrane, you'll never find a mechanical keyboard that is under $55-60"}
{"product_id": "B0053B5RGI", "context": "Pokémon rookie here. If it get one son X and one Y, can they battle each other?", "response": "Yes definitely. They just need to connect through their DS devices in the game to battle and trade."}
{"product_id": "B002I0K3PM", "context": "is this appropriate for 6 year olds", "response": "Absolutely!  It is a super fun, appropriate for all ages game."}
{"product_id": "B001AH8YSW", "context": "What is included in the box? Just DVDs? Thank you.", "response": "DVD'S and a guide"}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "Yes. For instance, I own the game on PS4 but am able to play with one friend who has it on PS3 and another who has it on PC."}
{"product_id": "B00F27JNGS", "context": "What is the difference between PSvitaTV and regular PlayStationTV?", "response": "Nothing. They simply changed the name when porting it over to western nations."}
{"product_id": "B00GY4OAM0", "context": "Can you play this game on a regular wii?", "response": "No, it will NOT work on the original Wii console. Although, Wii games will work on the Wii U console. Hope this helps you."}
{"product_id": "B00BQMGW4Y", "context": "Is this the official Xbox controller S (made by microsoft)?", "response": "No, they are not, but we have had no trouble so far.  At the price, the risk may be tolerable to you."}
{"product_id": "B00DC7O3K6", "context": "Is the Wii U game different than the original Wii one?", "response": "Yes. They are similar in terms of controls, but all courses are different. I would rate both versions about the same (with the wii u having updated graphics, of course)"}
{"product_id": "B00IVHQ0KI", "context": "Wheel will not steer, but the buttons and pedals work.. Help?", "response": "Did you make sure you connected your wheel before starting up the game?"}
{"product_id": "B0009WPZOA", "context": "is it two players?", "response": "There is a multiplayer mode but no, the game mode is not two players"}
{"product_id": "B00F27JE1C", "context": "can it play american games?", "response": "My American games work just fine on it. Pretty sure games from any region will work on it though."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "Yes, you can give the code to someone else"}
{"product_id": "B005DKZSVS", "context": "Has anyone ever had an issue with the amBX control panel not adding software automatically?", "response": "Yes mine dosnt, I have to manuelly add everything."}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "Yes, I play my copy on my 3ds"}
{"product_id": "B00EH5V1IO", "context": "Do the headphones have to plug into a usb port? or can the also plug into an iPhone? ps i don't know why we are called disappointed on here!", "response": "This two 3.5mm audio connectors one mic one speakers, and an adapter to work with the 3.5mm combined phone jack"}
{"product_id": "B003VH5Z2C", "context": "Can you use original NES controllers?", "response": "Sure can...and they work great!"}
{"product_id": "B008RA5DIY", "context": "We recently bought Quickbooks Pro 2013 3-user. Can we buy single user version and have all 4 people working in the same company file at the same time?", "response": "No, it is not possible for 4 people working at the same time. You would definitely need a multi-user version, and even then I'm not sure if 4 people would be able to use the company file at the same time."}
{"product_id": "B00EF1OGOG", "context": "When used to charge an Android (Nexus 5, in particular), does it show up as \"Charging (AC)\" or \"Charging (USB)\" in the Battery menu?", "response": "I only used it to charge a HTC 1S. It showed up as USB charging."}
{"product_id": "B00EZPCWWA", "context": "does it play the nintendo ds lite games?", "response": "What do you mean about DS LITE games?  This system plays both DS formats. But will not play game boy advance games. As the DS LITE is backwards compatible. This system basically is not backwards compatible. The box and Nintendo advertised is system, As the best of both worlds DS and 3DS. Truly the best of both worlds."}
{"product_id": "B005FMLZQQ", "context": "Can you set the volume button to control your surround sound? Also can this turn on/off your surround sound box?", "response": "No. It only controls the Xbox or the TV. No audio controls unless it is on the TV."}
{"product_id": "B00BMFIXZG", "context": "can you play the pc version with a 360 controller?", "response": "Yes you can, but you need either a wired xbox controller or a wireless controller with an adapter."}
{"product_id": "B00ENFVJJO", "context": "Does anyone feel it charges to fast causing the controller to NOT hold a charge as long as it may have before using this charger?", "response": "I haven't used any other chargers, so it is hard to compare, but this is my personal observations so far (2 months of use): I have not noticed any decrease in charge capacity after use. Typically mine will charge from 1/3 to full capacity of controler in 1.5 to 2 hours, this doesn't seem to be too fast."}
{"product_id": "B00ESN8YGW", "context": "Region locked?? Is this game region locked or not? There seems to be conflicting info", "response": "No it is not region locked."}
{"product_id": "B00HWMP0TU", "context": "Labeled as COMPLETE ED., but does't have EXT. PACKS & DLC as box describes. What do you recommend?", "response": "yes, this is everything about Civ 5. Mine showed Brave New World at the home page, but it got everything in it."}
{"product_id": "B0010WS20W", "context": "Do you need an internet connection to play this game?", "response": "No you do no need an internet connection to play Master Poker."}
{"product_id": "B00D6PTMSW", "context": "I have an xbox360 with only 4gb of hard drive. Can this game be played directly from the Disc without requiring game installation in the hard drive?", "response": "I think so.  You may need memory to save your work."}
{"product_id": "B00FATRKOK", "context": "Does this come with, or already have inside of it, a wireless adapter or will I need to buy a separate one?", "response": "Wait wait..  so really no one answered the question. Does it come with the wifi card or doesn't it?"}
{"product_id": "B00EADTVL2", "context": "I wonder how long it takes to load this device is the most important for me  and it takes 2 hours to charge your control on playstation ps4  the idea", "response": "Not sure, since it never charges like it is suppose to, the controllers slips off the charging base and don't charge.  This item is junk, stay away."}
{"product_id": "B000ND3XXA", "context": "does it support multiplayer?", "response": "If you have 2 of these and you're not playing a game outside the emulator, yes. Otherwise, good luck even getting it to work."}
{"product_id": "B00D4WTO1M", "context": "have this game a español version?", "response": "If your PS4 is set to espanol, then this game will be in espanol. It sets to whatever your PS4 is set as."}
{"product_id": "B0050SVMYA", "context": "Does this one come with AR Cards included?", "response": "Yes, my purchase had come with the cards."}
{"product_id": "B003N3HEU0", "context": "We have the older Wii.  Will this game work on it?", "response": "Yes it will work on the older white wii"}
{"product_id": "B009RHEBWA", "context": "Is there a limit on how many people can file their tax using it?", "response": "Five free federal e-files. Over five there is a cost. State e-files are charged for each e-file no matter how many. I think this is a very good value."}
{"product_id": "B0050SY77E", "context": "Is this the Hunter Edition like on the picture used?", "response": "Yes, the hunter edition looks and plays better than what you see."}
{"product_id": "B008L3UUPS", "context": "will it take a rumble pack?", "response": "No, the slot isn't an actual working slot. Its just added it to make it look like an actual N64 controller."}
{"product_id": "B005BLAJRC", "context": "Does it work on Mac os x maverick?", "response": "According to system requirements it works on Mac os x 10.4.10-10.6 G3, G4, G5.  I hope this information is helpful.KC"}
{"product_id": "B0090ECASW", "context": "Does this keyboard use mechanical switches or have n-key rollover?", "response": "I don't know about rollover, but this is a membrane keyboard: \"Replete with a specially engineered membrane which mimics the tactile feel generated by the mechanical keys often preferred by gamers - - without the resultant excessive noise.\" I'd assume (if this statement is correct) that it mimics cherry mx brown switches, except for a lower activation point."}
{"product_id": "B00BGGIWZM", "context": "I just downloaded sims 3 Island paradise but I cannot run it because it says I need to download Sims 3 first. Does any one know if this is the case?", "response": "Yes.  You have to have Sims3 first.  It is the basic game set-up.  After you set up Sims3 then you can install any Sims3 package."}
{"product_id": "B0050SX9I2", "context": "Does this work on ps4 consoles?", "response": "Unfortunately it does not."}
{"product_id": "B0050SZ0SY", "context": "Will this work with Win 7??", "response": "Yes, it works awesomely and on my 64bit system to boot!And the better the graphics card, the better and more graphics you will be allowed to view in game, i.e. you can download a special expansion graphics pack that makes things nearly real life. So, get it, and enjoy!"}
{"product_id": "B000RT2868", "context": "Will this work with the Street Fighter Anniversary Arcade Stick (Original Xbox) to Xbox 360?", "response": "To be honest I haven't tried it. I don't believe it will work. I will get back to you soon on this matter."}
{"product_id": "B0090ECASW", "context": "I know nothing about gaming-Except that my 22yr-old son plays.I was looking for gaming mouse then saw keypads-but is this better? Any recommendations?", "response": "This is an amazing keyboard! It's fast - much more faster than an regular keyboard, beautiful, pleasant to type and the extra screen is very functional. I reccomend!"}
{"product_id": "B00FATRKWM", "context": "What is the difference between the Xbox 360 and the Xbox one?  Also, what does the kinnect do?   My 8 year wants one, and I have no knowledge on this!", "response": "Xbox one is the next generation of Xbox, it has better processing power than xbox 360 and more expensive. Kinect is a sensor to detect body movement. Many games require kinect."}
{"product_id": "B006NU6F28", "context": "Does it come with English for the Nordic Version", "response": "i'm not sure, i have the english version"}
{"product_id": "B000ND3XXA", "context": "Will this work with Windows 8.1  ?", "response": "No idea I did use in in win 7 64 bit just fine not sure about 8 though."}
{"product_id": "B00009ECGK", "context": "Is Warcraft 3 and the expansion still alive and well online?", "response": "No sadly. I just got on the other night ."}
{"product_id": "B0050SX7BQ", "context": "Please, is this game translated to spanish?", "response": "No. The audio is in English and french, and the subs also. The spanish version is only sell in Spain."}
{"product_id": "B003ZSHN0O", "context": "can i play this gme on my laotop,with windows7", "response": "Yes, it installs and runs on XP, Vista and Windows 7, and is a really fun game, but it does have a few annoying glitches that you'll get used to and forget about. A great game for the price."}
{"product_id": "B00FENJVOE", "context": "I have completed the D3 game in PS3. How do I import my profile to PC?", "response": "Sadly you do not it sucks but different system profiles dont interchange"}
{"product_id": "B0088MVODO", "context": "Do you need to buy this game new for the downloads to work?", "response": "Yes, because the codes to download the games can be used just one time, and BEWARE, i had bougt this game and im not from united states and for that reasson i could'nt download the games with the codes so i spend my money for nothimg usefull..."}
{"product_id": "B009AFLXQQ", "context": "Will this game work with Wii games such as Super Smash Bros. Brawl on the Wii U?", "response": "I regret to inform you that it doesnt work at all after you boot the \"wii\" app on the wii u, I have both smash bros brawl and smash bros the first for N64, neither works"}
{"product_id": "B00H8NS1K8", "context": "How well does the microphone pick up noise from the keyboard? I use a blue switch mechanical keyboard.", "response": "I say it will pick up as it is very sensitive - buy boy they sound so nice - nothing like you have experienced before."}
{"product_id": "B00EPZ8POY", "context": "does this bring athena hades and poseidon", "response": "Yes it does and this game is great!"}
{"product_id": "B009K7U6IK", "context": "What kind of keys are on the keyboard? (mechanical, rubber dome...)", "response": "These are mechanical keys."}
{"product_id": "B00BHSTXV6", "context": "Is the space bar much louder than any other key?", "response": "The space bar does make a slightly different noise when typing from the other keys, guessing caused by it's size, but I wouldn't say it is much louder."}
{"product_id": "B009GZX49Y", "context": "este juego esta en ingles o en español?...o si se puede cambiar(this game is in english or in spanish?", "response": "English but if you want it in Spanish I bet you can change it to Spanish"}
{"product_id": "B0000A2TPE", "context": "If say my laptop eventually died, and I wanted to play this game on a different computer....is it possible for the game to be downloaded/played again?", "response": "Yes just re download  from the disk can be used over and over"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "I successfully played/completed the game on Windows 7, no problems."}
{"product_id": "B002RRLQIO", "context": "Is this made in China?", "response": "Yes it is made in China"}
{"product_id": "B0088MVQIM", "context": "Hi, I just purchased this item. i'm not sure if this game comes with the cable??", "response": "If this question has come to me because it's the same one I purchased, rest easy, it will include the cable. Get ready to rock!"}
