{"product_id": "B006W41W3M", "context": "Does it need batteries or is it rechargable?", "response": "It needs batteries, but you can buy rechargeable batteries."}
{"product_id": "B008X73CE8", "context": "Will this run on windows 8?", "response": "Yes it will run on Windows 8.  I recommend 8.1 at a minimum just due to the elimination of bugs."}
{"product_id": "B0098F1Y3K", "context": "Will this work with a plain old ds player?", "response": "No it will not. The 3DS games have a notch on them that prevents them from being inserted into a \"plain old ds player\". Hope this helps.."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "Mine came in as a qwertyuiop setup."}
{"product_id": "B00DYAQHTQ", "context": "Is the included artbook the same book as this? The Art of Watch Dogs", "response": "Similar but just as good."}
{"product_id": "B00EM5UFF4", "context": "If my friend has the Xbox 360 version and I have the Xbox One version, can we still play against each other online?", "response": "There is unfortunately no cross-platform/generation capabilities."}
{"product_id": "B000P46NMA", "context": "This game has subtitles in Spanish?", "response": "if you have a subtitle in Spanish, but also has audio in Spanish. I hope you liked my answer"}
{"product_id": "B000PS1TG6", "context": "Has anyone tried this on PC with success?", "response": "yes ,but I haven't pinpointed the driver you will need."}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "Its a rapid fire button by default but all the keys can be rebound. I love this mouse."}
{"product_id": "B002MRUROI", "context": "How can I fix it please?", "response": "muy buen aparato funciona de lo mejor"}
{"product_id": "B00A378L4C", "context": "How does the '00' key work in numpad mode? Is it a distinct key code, or does it just send '0' twice?", "response": "I really can't tell how it works, but i'd bet my money on latter one. It seemed like \"2x-3X\" click modes on mice to me."}
{"product_id": "B00FJWNSU8", "context": "good day. the game is completely in Latin Spanish.", "response": "Yes it should have full Latin Spanish but I wouldn't know because I use it in English but the game does have language settings."}
{"product_id": "B005QUQP80", "context": "k60 keycaps Does anyone know where I can buy textured keycaps like the ones seen on the k60? I'd like to replace the left half of my das keyboard.", "response": "Yes i would like to buy the keycaps"}
{"product_id": "B00GY4OAM0", "context": "Does this work on the original wii also?", "response": "yes, so do xbox games, atari cartridges, laser discs and mini frozen pizza's. hope that helps"}
{"product_id": "B00BI83EVU", "context": "is blue ray DVD? or to download the code for psn?", "response": "Blu Ray Disk. You can buy DLC for 20 dollars additionally it will be downloaded from PSN"}
{"product_id": "B0053BCML6", "context": "Does this game work with a 3ds xl?", "response": "Yes. The 3ds xl will play all 3ds games."}
{"product_id": "B0002L88HE", "context": "Do I need to purchase the game twice to do multiplayer with a second member of the family?", "response": "If you are talking about the LAN between people on the same network, you do require two copies of the same game so you can both play, one for each computer because the serial key is unique to each installation, and also because you both require a CD on each of the computers for the program to run."}
{"product_id": "B002XLR0JI", "context": "is this a quiet mouse? it's really important that is it cause i game at night mostly and i got roommates", "response": "The clicker click is kind of loud by mouse standards"}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "You can hear all audio played through your xbox one."}
{"product_id": "B005DKZSVS", "context": "What tricks did you use to get this to install on your computer? I had them running on windows 8 but had to wipe my comp. Now no luck.", "response": "go to Cyborg's websitesand download the drivers and softwareit will pop up in your taskbarthen you will have to reactivate it for Windows and all your games by checking the boxes"}
{"product_id": "B00B98HBTA", "context": "is it two player", "response": "Yes, it is two player, just like all the Lego games are."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "Yes, it is working well for me."}
{"product_id": "B00B67ZTUW", "context": "I've never played a Tales game before but i tend to adapt to games at a good pace so will i be ok starting with this one?", "response": "None of the tales games really go together, except for games like xillia+xillia 2. Any game would be fine."}
{"product_id": "B0095C0I4W", "context": "Does this work with Windows 8.1", "response": "I play Tiberian Dawn, Red Alert 1, and Tiberian Sun on it. You may need some patches, google them and it will work."}
{"product_id": "B00F27JDY0", "context": "Can it Play North American game cartridges?", "response": "Yes it can! :-)All PS Vita physical games are region free meaning they will play on any PS Vita!"}
{"product_id": "B00F27JDY0", "context": "Can you change it to American or is it only in japanese?", "response": "It can be set up for any location, not just Japanese."}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Yes. No problem. Running on 64 bit but should work on 32 bit just as well."}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "There's a panel that opens on the bottom - the HDD just slides in there and should plug right in.  easy peasy!"}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "Sure. It runs fine on Windows 7 machines."}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "I play it on windows 7."}
{"product_id": "B003O6EDSM", "context": "Is the online pass for Mass Effect 3 included, or do I have to pay extra, and is it worthwhile in 2014?", "response": "It is included just download the free add on and it is definitely worth it, my personal favorite trilogy in gaming history"}
{"product_id": "B007W8S2MG", "context": "Is everything from the PS2 version intact?", "response": "From what I remember yes. Furthermore, I'd like to share that some of the boss guides and the like, some are based on PS2 and gave me same result. From what I understand, main things that changed were some cutscenes and some more added some dialogue lines."}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "Klondike is the good old fashion solitaire."}
{"product_id": "B00FM5IY0Q", "context": "If you buy the hard copy of this game how much does it have to install to your xbox one?", "response": "It installs the same amount whether you get a hard copy or a digital. Only difference is you're pulling from a disk rather than downloading it using your Internet speed so it goes faster(unless you have blazing Internet speed). There may be a slight difference, but not enough to choose one or the other."}
{"product_id": "B00005NIMA", "context": "Can you use this with a laptop?", "response": "It's a USB connection so I don't see any reason why it wouldn't work as long as you had the driver."}
{"product_id": "B00EI4V3X2", "context": "Can you let ME know what kind of (Headset) I have by this Information here:**Model:TB300 3276-01(?) ;**FCC ID:X4B-TB2278(?) ;**S/N:G3276D3702106(?)", "response": "It sounds like you have some kind of turtle beach px series it should say it on the side of the headset the kind like mine says px4 on the side"}
{"product_id": "B004TTNTYW", "context": "When you say it's good for travel does that mean it is a car charger? I don't need that.", "response": "More as a backup in a hotel, or to keep at grandmas house kind of thing, my grand children are always forgetting theirs so, there is one here now, and I will get one for the cottage too  probably."}
{"product_id": "B00FEDP968", "context": "Does anyone know if this headset works with the ps4 either through Blutooth or by the cable?", "response": "It's unlikely to work with bluetooth (when paired to my phone, it only picks up calls, it doesn't stream music or game audio) Through the cable should work fine, assuming other USB headsets work. You obviously wouldn't have the drivers, but all PC's I've tested it on have worked plug-and-play."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "You do not need a 360. Redeem the code online, then search for the game on your Xbox One - it will be free."}
{"product_id": "B0040QCPYY", "context": "Does this product work with the PS4? I have one and can't figure out if it works.", "response": "Works property well if you configure it as the way 2 be Usually all Gioteck EX02s Bluetooth Headset for Playstation woks fineGo to setting and configurate Bluetooth  advice  your psp4 find it and follow all the instruction  do not skip steps if you want good quality sound and reception"}
{"product_id": "B00FM5IY0Q", "context": "I just bought an Xbox One.  Should I pick this game up or pass?  Is it anything like The Last of Us.  I really liked hat game.", "response": "Pass.... It's nothing like the last of us dead rising three is way too Repetitive for me was just kill zombies go kill zombies go if I were you I would get watchdogs."}
{"product_id": "B00EOUL7T0", "context": "Will this work with a Universal Afterglow headset", "response": "I don't have a sure answer, but After looking at the headset you mentioned, it looks like it would."}
{"product_id": "B0065NP6NC", "context": "how different is this from fallout 3? I never completed FO3 but enjoyed the atmosphere and the idea that it starts you as a child.", "response": "In this game you start out fully grown, it offers you the ability for actually using your iron sightswhen you zoom in instead of just using the HUD. It has a lot of side quest like 3 and the dlc is amazing. If you enjoyed fallout3 i think you'll like this one as well."}
{"product_id": "B00CMC6HCY", "context": "dose this game as a storymode like the other one's", "response": "Yes, it has the 30 yrs. of WrestleMania.Hope this helps;Dave"}
{"product_id": "B00FM5IY4W", "context": "Are all of the cars that you can buy be earned through playing the game, or are some only available through micro transactions alone ?", "response": "You start the game with a choice of 3 cars. Then as you race you earn credits. It takes a fair amount of races to earn enough to get another car. I bought the car pass and that helped me collect a considerable amount of cars to race with and get credits faster."}
{"product_id": "B00EI4V3FU", "context": "Can this work on ps3", "response": "No, sorry. It has an AUX cable, so something you plug into youre phone. If you have something like that for youre ps3 the yeah"}
{"product_id": "B00EADTVL2", "context": "Does this plug into the wall?", "response": "Yes. Plugs into the wall, not into the Playstation."}
{"product_id": "B005UI8V6C", "context": "So I've owned this game for a month and it was working fine until one day it just refused to finish loading and won't work anymore. Any Ideas?", "response": "We have not had any problems so far. I could only suggest to search the internet to see if anyone has also experienced your problem."}
{"product_id": "B007LQG9A6", "context": "is it compatable with pc games?", "response": "Its a usb so i would assume so... But i only used it on my xbox"}
{"product_id": "B002B9XB0E", "context": "Does this Buffalo Game controller have R and L buttons?  Pic doesn't show it.", "response": "Yes it does, and they feel just like the traditional SNES shoulder buttons."}
{"product_id": "B002672Z80", "context": "I bought two of these remote, pink and blue, as Easter gifts for my kids.  Any hints on how to get them to sync with the Wii system?", "response": "I have no idea. I had te same problem with mine. Sorry"}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "yes, and you'll find most all games have drm these days, sorry"}
{"product_id": "B00G0OYHCW", "context": "Are the games Physical or Digital?", "response": "Both games are on one disc.http://www.nintendo.com/whatsnew/detail/QzGKZgfv5oFkGY0J9CZ3hgnyOwH4KBqo"}
{"product_id": "B0095D1CM8", "context": "Is the red aiming button on the left side bothersome to some users?", "response": "Not at all! I love the precision aiming button. Plus, you can adjust the thumb rest so that button is right where you want it."}
{"product_id": "B0094X28J0", "context": "Does it come with the wrist strap?", "response": "Yes it did. It also came with a silicone case as well."}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "It because they didn't release them in us yet.  You pay extra because you can't get that color in the states."}
{"product_id": "B0088MVQIM", "context": "includes version for bass or should I download?", "response": "Mine included bass. That's what I bought it for. If you like it, I suggest later buying RS 2014. The format is much smoother, and if you have already purchased and loaded original Rocksmith, you can import those songs into RS 2014, and play those songs with improved game play."}
{"product_id": "B00GOOSORM", "context": "If I use a 60 Day Time Card, does it countdown based on my time played or just 60 consecutive calendar days?", "response": "60 consecutive calendar days unfortunately."}
{"product_id": "B000A2R54M", "context": "If I buy a used version of this game for my DSI can the progress be deleted? Thanks!", "response": "Yes. Click the \"Options\" tab at the bottom of the screen, and then you'll see an option to \"Erase Data.\" I'm pretty sure that will delete all of the progress."}
{"product_id": "B00EZKNSTQ", "context": "Does this controller have the same in hand feeling as a normal Xbox 360 controller?", "response": "Yes, but it quit lighting up after a week...just an FYI"}
{"product_id": "B00BI83EVU", "context": "Does this game come with one of those activation code papers inside? I'm considering a used copy.", "response": "No, it doesn't, only for the \"additional 60 minutes of gameplay\" thing."}
{"product_id": "B00DC7G0GG", "context": "is this game any fun for single players?", "response": "Hello, Yes.I enjoy the game a lot alone or playing with friends"}
{"product_id": "B006NU6F28", "context": "does it work on windows 8 at all?", "response": "Not sure, I haven't put it on my new computer yet"}
{"product_id": "B002I098JE", "context": "Are all the weapons in multiplayer already unlocked or do you have to unlock them?", "response": "You unlock everything by a point system that you gain slowly throughout the game. You have to save enough points to unlock each iteam that you want."}
{"product_id": "B0050SZBP6", "context": "I can buy the product and send me the cd key by mail and q live in Venezuela and the product It would take months to arrive?", "response": "not only would send anything internationally wonder if I buy the product you can send license only q is inside the box to my mail instead of physical box? that would be possible..."}
{"product_id": "B00DLRLDBO", "context": "does it work perfectly with xbox 360 controller do I have to do anything special and can I use it for a PS3 IPhone and PC??", "response": "Its alright I wouldn't get it again for its price."}
{"product_id": "B001AI7CF2", "context": "which wii has gamecube controller connections", "response": "The models that have the Wii logo below the eject button instead of between the eject button and the SD card door."}
{"product_id": "B00BQWTGIS", "context": "What are the bare minimum PC system requirements?", "response": "4I have quad processor+2gb of ram"}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "If you click on the \"view and share related images\" link under the product picture, an image has been uploaded which shows a chart of what is included with the deluxe version (and other versions to compare). This chart matches the chart on the back of the software box mailed to me from purchasing on this page."}
{"product_id": "B00EOPT5ZS", "context": "Does this support \"Repeat Hotkey while Pressed\"?", "response": "Yes...it has a \"pulse\" setting that can be used to repeatedly press a key rapidly and also has a adjusting rate to set how many times per second it will press."}
{"product_id": "B00FOHP8XI", "context": "What exactly comes with the System(aside from a controller) Do I get all the cables needed?(aside from HDMI) Anything to I need to buy separately?", "response": "With the systemI got everything HDMI cable and only one controller, if u need another controler u have to buy it, im happy it works really good , and it was brand new  , no flash memory card included !! Any question feel free to ask"}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "This is the super slim, or Ultraslim, whatever they call it.  The one that has the sliding disk tray door rather than a slot load optical drive.  If you zoom in on the picture you can see it in the lower left."}
{"product_id": "B008MI7MWQ", "context": "Has the Cleopatra slot machine game by Encore been fixed?", "response": "on one cpu it works ok, i bought another copy to put on a different cpu - it won't worktrying to figure it out.  i would ask encore about problem."}
{"product_id": "B0029LJIFG", "context": "What does this card do does it give the person on line game to play Id like to get this for my sons new xbox 1 thanks", "response": "Yeah it gives you access to Xbox LIVE, games, movies apps, music. It's a great gift to give someone who like on play online."}
{"product_id": "B00FLLFGO8", "context": "Works to place tablet 8.3 inch LG G PAD?", "response": "No, that's much too large.  It can take my Samsung Galaxy Note 2, but that's about it."}
{"product_id": "B00C2B355W", "context": "To chat with this on PS4 does it need to be plugged into the controller?", "response": "No its full wireless :D"}
{"product_id": "B00F27JDY0", "context": "How long is the warranty of product", "response": "It is used condition and no official warranty but I guarantee for 3 month.Thanks"}
{"product_id": "B000FQ9R4E", "context": "After playing about 3 games, the game seizes up and won't let you play anymore and you must shut the whole Wii off. Anyone else have this problem?", "response": "It sounds like a defect w/ the game itself, probably should contact the seller"}
{"product_id": "B00D6PTMHI", "context": "I am not a 'gamer' & a lot of the phrasing and language here is over my head, but I want to learn guitar. Is RS an option for someone over (ahem) 50?", "response": "yes, all you need is patience, free time and willing to learn. For this game, as well as for every game, is recommendable to be comfortable and rested."}
{"product_id": "B009K7U6IK", "context": "2 Questions: 1. Any problems with keys sticking on this keyboard? 2. Is the wrist support piece removable? Thanks.", "response": "Question1: Nope, but you can remove them and clean them if you like too with the key remember that it comes with and for question 2 yea it does remove. Have a nice one"}
{"product_id": "B001DNGCN2", "context": "I'm Not a Big Wiz-Kid on This Stuff, but My PS3 is a CECH-2001B Model. Will This Cooling Fan Fit My PS3, Properly? Will It Run Any Different?", "response": "Honestly I don't  really do serial numbers/models, but to answer your question, it will only fit the fat version (first generation) PS3. Hopefully this helps. Good luck!"}
{"product_id": "B004W1IX1G", "context": "is it good to buy used wii games or not?", "response": "You have an option to buy either new/ used or new never been opened on amazon...this is a great option because you dont have  to pay full price...so yes"}
{"product_id": "B008CXTW5G", "context": "If you put the Numpad on the left side, could someone measure the gap between the \"Enter\" key and the A/B Macro keys?", "response": "2\" between those key"}
{"product_id": "B00EPZ8POY", "context": "does this game works with any ps3 console(usa)?", "response": "Yes, all PS3 games are region free. The same goes for PSP, PSVita, PS4, Xbox One and all Nintendo DS except 3DS and 2DS. It's a helpful thing to know."}
{"product_id": "B002I0H2AG", "context": "Can I still enjoy it as a purely single player experience (for the price)?", "response": "Yep, you're in for a treat. GoW:Judgment campaign is great for those Gears of War fans who enjoy knowing more about the events and backstory of the characters and also a very satisfying action packed experience."}
{"product_id": "B007W8S2MG", "context": "What is the gameplay/cutscene ratio", "response": "Heavy game play with minimal but excellent crafted cut scenes"}
{"product_id": "B0009VXBAQ", "context": "does this wii model read gamecube games?", "response": "The Wii I purchased does play gamecube games and has a place on the top/side for 4 gamecube controllers."}
{"product_id": "B000PD0HQE", "context": "Does this come with a xbox live 1 month code and a standard xbox 360 headset?", "response": "It includes the headset, but the xbox live code is not included"}
{"product_id": "B0029M6VKA", "context": "Can you set an \"escape\" hot key that would disable the TrackIr input while it's held down, for use with fine aiming or menus?", "response": "The other option you have, which is what I use, is to customize the dead zone/sensitivity of the Trackir so that your head center dead zone is higher and thus will not actuate until head movement is greater than X amount of your choosing."}
{"product_id": "B0050SZ0SY", "context": "Will this work with Win 7??", "response": "yes i have a copy running now"}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "I got it to download and it worked for a few days.  I haven't been able to get it to work again.  It could be a glitch or it could be my laptop.  Haven't quite figured it out yet."}
{"product_id": "B005HN5LKY", "context": "does it come with all the cords?", "response": "Yes it does. All cords were intact and working."}
{"product_id": "B00BI83EVU", "context": "Does this game come with one of those activation code papers inside? I'm considering a used copy.", "response": "Yes, come with a code and you get a exlusive white coat and few more side missions. Nothing that you really really going to need."}
{"product_id": "B00BFOEY3Y", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "There is a button in the middle to switch the wheel to free or clickable"}
{"product_id": "B007W8S2MG", "context": "is it region free?", "response": "Yes，but the language is English only"}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Mario Kart 8? And Bayonetta?", "response": "It is compatible with Mario Kart 8, but don't know about Bayonetta."}
{"product_id": "B00KAI3KW2", "context": "If I get this without the Kinect, can I buy a Kinect and add it on later or am I stuck with the Kinectless version?", "response": "The pre-order price on MS is $199, to be released 7/15/2014"}
{"product_id": "B0000CNUUP", "context": "Does this come in a bog box?", "response": "Somewhat. If I remember the dimensions it was roughly 12\" long by 6\" wide by 2\" high."}
{"product_id": "B00IYWV852", "context": "How do you get theThree Guest Passes with seven days of play time that come with this edition?", "response": "They come with purchase and were sent to my email sometime after the official launch. If you purchased this and are expecting passes but haven't received them, I recommend contacting WildStar customer support."}
{"product_id": "B00562O78S", "context": "Resistance 3???? Does it still come with Resistance 3???", "response": "Other retailers such as Walmart said that they will be giving away Resistance 3 for free with the 3D Display, But I have no idea if Amazon will do that. They said they would though, but since they removed that posting im not sure. I would think so though."}
{"product_id": "B00FZLE9JW", "context": "does it work for titanfalls", "response": "It's for a system not a game"}
{"product_id": "B0094X28J0", "context": "do you need a nunchuc", "response": "Yep for a lot of the games it is required."}
{"product_id": "B008D7F47Q", "context": "can you play it without wifi?", "response": "Correct answer is no.  The game requires the program Origin in order to run.  If you don't have access to the internet, Origin and this FIFA cannot run.  You can disconnect the internet after the program is started though."}
{"product_id": "B00EWEHI5K", "context": "Is it compatible with mac ?", "response": "Yes. Since it is USB 2.0/3.0 compatible it is capable of being used on any OS that has USB driver support (generally UPnP)"}
{"product_id": "B002I0J5CO", "context": "Is this a wireless headset?", "response": "No. It does have a wire."}
{"product_id": "B0041RR0TW", "context": "How does this compare in physical size to the PS3 controller? I'm looking for a controller smaller than the 360 one, hopefully PS3 size.", "response": "Extremely close to ps3 size. Handle angles seem a tad different but no complaints. Good weight also"}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "Work fine on mine though you can't ult tab or minimize or you won't be able to open it back up."}
{"product_id": "B00DLRLDBO", "context": "so it works with the xbox 360 controller perfectly and i dont have to do anything special and does it work with anything else like PS3 IPhones PC", "response": "Yes it will work like headphones as well u can plug the AUX cord right into ur phone and yes it works for all PC,Xbox, and PS3"}
{"product_id": "B00GHJ6X8G", "context": "I'm from NY  so I'm very interested in what the Yankee roster is before i buy this.....do they have any of the new players like Tanaka, Ellsbury,etc?", "response": "Yes.  They update the roster weekly.  But keep in mind, even after the most recent update last week, as of RIGHT NOW, the online play is pure garbage."}
{"product_id": "B00DNGQQUQ", "context": "is this in english?", "response": "Yes it is in English."}
{"product_id": "B005S0KH7I", "context": "is this a mechanical keyboard ?", "response": "negative. Bur A GREAT BUY."}
{"product_id": "B00ENFVJJO", "context": "Does this charging stand require that you attach some type of receiver to the actual controller?", "response": "NO,,  Previous answer is correct"}
{"product_id": "B00CJD4HD2", "context": "Can the scroll wheel move left and right?", "response": "Hi, sorry I didn't get back to you before now but to answer your question yes scroll wheel does scroll left and right."}
{"product_id": "B002P35JMO", "context": "Does this adapter plug into the controller or the actual Xbox 360? The port in the photo looks different then the port on our wireless controller?", "response": "The actual Xbox 360"}
{"product_id": "B001B5U80K", "context": "Has anyone installed an played this in Windows 8?", "response": "yes fun little game but auto map does not track with player movement and quickly becomes tiring.  its basically a g rated rip off from diablo 1"}
{"product_id": "B009CL6LA6", "context": "do these work with xbox one", "response": "yup and they have about 30-40 feet before they lose signal."}
{"product_id": "B0087OZ5FG", "context": "A)  Does software work with PS4.  (Lower Mic Volume normally)  B) How comforable are they?", "response": "They should work perfectly for for PS4 since they are a Sony product. They are very comfortable but after about four hours of using, they do start to give pain to the top of my head. I am usually able to deal with this though."}
{"product_id": "B00008J7NZ", "context": "Will it work with out x box live?", "response": "Yes it will. The only requirement is that you must have an internal hard drive, it must be 250GB or higher."}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "Back in 1998 a lot of people didnt have internet. So, no. The beauty of old games.. this one is my personal favorite of all time due to a consistent story and good gameplay."}
{"product_id": "B00B67ZTUW", "context": "is it multi player", "response": "It is co-op but not online. So when you're in battle, you can have up to four players controlling each character. Its pretty fun."}
{"product_id": "B00DE2W4PK", "context": "Includes AC power cord?", "response": "power cord, HDMI cable, headset, usb cable, the game disk, box, the console and controller of course. the controller has a rubber protection pad. I honestly, would purchase the one that e75shop is selling, it has 2 games with it and the console is in great shape, free shipping within 2 days."}
{"product_id": "B0057WDBHA", "context": "Will this stick work with a Win8 PC?", "response": "Sorry, I can't say, as I only have windows 7"}
{"product_id": "B00EVWZHLK", "context": "Are they all on one disc or 3 separate discs?", "response": "They are 3 separate discs."}
{"product_id": "B00004VUFG", "context": "does this steering wheel work with farming simulator2013", "response": "It works fine with Euro Truck Simulator 2, made by the same company around the same time, so I would assume it does. Yes."}
{"product_id": "B00DTWES6I", "context": "Is this a digital key for uplay?", "response": "Yes, but you download it from Amazon servers. I bought this game because I wanted to play it online, but there is no body online... A very few players only."}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "yes, I use windows 7 and the game runs fine"}
{"product_id": "B009DYOPK0", "context": "I was wondering on a level 1-10 how loud the clicks are? odd question but gaming annoys the girl friend lol", "response": "It sounds alot like a keyboard click of a button. You feel it more than you hear it in my mind."}
{"product_id": "B000FQ9R4E", "context": "My son is 8 and wants this game for his birthday.  Is it inappropriate for an 8 year old?", "response": "It's pretty tame. Some female characters are good looking. But nothing dirty. I have this game and only have a problem with how difficult it is."}
{"product_id": "B000PD0HQE", "context": "will i need to buy a built in wifi device for this console?", "response": "Yes it requires a wireless internet connector to connect to a router. You could also buy an internet cable that plugs into your router and the Xbox"}
{"product_id": "B009AGXH64", "context": "how many people can play at once?", "response": "Four if you have enough controllers."}
{"product_id": "B0088MVPFQ", "context": "Does the game still work if you live in another country? Or does it only work on American 3DS consoles?", "response": "The game I bought didn't work in my console (2DS). I bought that one in Spain, I think it shouldn't be an American Console"}
{"product_id": "B00CXI0BPG", "context": "Is this a smaller mouse or is it the same size as a regular mouse?", "response": "This is a normal sized mouse, albeit a bit smaller than a regular mouse.  If you have larger hands, it will feel a bit tiny. It's a bit small for my hands, but still very comfortable, and perfect for my wife."}
{"product_id": "B00GU4F4OM", "context": "What does the \"power button\" activate? and can the \"power button\" be programmed specifically to certain tasks?", "response": "The Power Button by default is some kind of rapidfire left click, but it can be programmed specifically as other tasks."}
{"product_id": "B008NMPSEU", "context": "when 3 golden eggs appear to pick on why does in stay on screen and what are the crystal collections for?", "response": "Have not played in a while-will play some to respond better.  Sorry for the delay."}
{"product_id": "B002BRZ9G0", "context": "Does this use the classic controller?", "response": "Yes it does and I bought two extra random brand controller. All work very well."}
{"product_id": "B005G4CXPK", "context": "Will this run on windows 8.1?", "response": "Yes it will run fine on 8.1, 64 bit. It is a graphics hog for the time it was made. It can be run on triple monitor setups with the right tweaks. I run 3820x1920 w/Ultra settings and get 45-60 FPS."}
{"product_id": "B00F2ENJY8", "context": "So this is an actual video game console? Cause the price difference between the Wii Mini and U is about 200 bucks. Can someone specify ?", "response": "It is an actual game console you put WII game disc into and play.  The difference between the Mini and regular WII is you cannot connect to the internet on the mini, so you can't watch netflix, ect"}
{"product_id": "B00GHJ6X8G", "context": "I have a sealed copy of MLB 13 sitting next to me. Is it worth upgrading to MLB 14? I can't afford a PS4 now, so the PS3 version is my only option.", "response": "in my view, take mlb 13 back and put it towards mlb 14; you can play faster games; its great to me and i too have a ps3!"}
{"product_id": "B004RMK57U", "context": "if i purchase the digital code, do i log in on amazon with my email or the one for the playstation", "response": "I don't recieve code"}
{"product_id": "B007MJSZDQ", "context": "Does this also charge fully or is it like the charging cable where it says it is done charging and about 5 minutes later it dies on you?", "response": "It full charges it"}
{"product_id": "B00GU8W5AE", "context": "Is it possible to assign Shift, Ctrl, Tab or any other keyboard key to number buttons?", "response": "You can't exactly assign shift to the number buttons on the side, but you can to any of the buttons on top."}
{"product_id": "B00E8RVP0U", "context": "Do you need the Zumba fitness belt for Wii to use this?", "response": "No. Not at all."}
{"product_id": "B000B78F72", "context": "Does this cd have the ORIGINAL CLASSIC SOLITAIRE????    I already purchased a cd that had 100's but did NOT have the classic game I wanted.....", "response": "I'm guessing you mean the old solitaire that everyone played with cards, if so yes it's on this CD under Klondike. Also has double, triple & quad Klondikes as well"}
{"product_id": "B00FRESQYG", "context": "does it let you level boost a character automatically or do you have to grind to 90", "response": "With this one, you have to grind it."}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "Not necessarily. Depends on your mother board. If you 4 outlets for sound on your motherboard that's all you need. The sound card is built into the actual volume unit with the head set.best head set I've ever had and plainly beat my turtle beach px5 s."}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3?", "response": "Idk, I only used it with a ps4 and it sounds great."}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "I own this gane yes it works perfectly fine on a us playstation  its super fun"}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes, you can play against a friend."}
{"product_id": "B00G6IJ5QK", "context": "Can the button for the CPI toggle be remapped to be held down? Like as a PTT for Ventrilo?", "response": "Any button on the mouse can be remapped in the steelseries engine software. Just be sure to load the correct profile you have programmed for the software you wish to run."}
{"product_id": "B00DE2W5XG", "context": "If this is a launch day bundle, is the ps4 a first day ps4 which has problems?", "response": "no problems at all"}
{"product_id": "B00EV4O8VS", "context": "Does this bundle come with Nintendo Land?", "response": "I do not know.  My copy come with nitendo hd deluxe."}
{"product_id": "B00DC7O3K6", "context": "Does this game require the Wii Plus remote or can it be played without it?", "response": "Must be played with Wii Plus."}
{"product_id": "B0072A4JVW", "context": "I heard about the damage that give the ps vita shoulder trigger. Is that true? I really want to buy this hand grip but the review left me uncertain?", "response": "Use the grips all the time, never had a problem. Better with them than without."}
{"product_id": "B001H4NMNA", "context": "Does this come with multi-voltage support?", "response": "Yes, its support both voltage."}
{"product_id": "B00BI4VVGY", "context": "Will this work with the Cooler Master Jetflo 120mm fans? They are PWM fans", "response": "As long as it has 2 or 3 pin connectors, it should work fine. I have a cooler master  2x140mm radiator fans, 7x 10 mm cooler master fans attached and two smaller cooler master fans. I use adapters to attach more fans than the product states to control and everything works fine. Hope this helps."}
{"product_id": "B005LUUWL6", "context": "Does this work with DSi XL", "response": "I works on some of them, but not on my son's DSL XL. I don't know why that is so."}
{"product_id": "B004Q7CHCC", "context": "does this include the aulternat ending", "response": "There is an ending that is somewhat separate.  It takes place about a decade (?) later."}
{"product_id": "B009LGO88E", "context": "Will it works on the new 3ds xl?", "response": "Frankly no. It adds nothing to it. The new 3ds has the two extra zl and zr buttons, and a c stick. If you want it for the ergonomic feel you can simply get a handle case."}
{"product_id": "B006IOAHPK", "context": "Is the case red or white?", "response": "This is a question of whether my South Park inventory is original edition or red, Greatest Hits edition. I believe ours were white Original Editions."}
{"product_id": "B00D7UHT0E", "context": "are all the songs kid appropriate?", "response": "Hi Mandy,Unfortunately, I don't recall any curse words but they are the actual songs word for word. If you don't feel comfortable with purchasing this specific one, purchase \"Just Dance for Kids 2014\". I'm sure its just as good."}
{"product_id": "B00CX8VY4S", "context": "Is there anything included in the box that would discourage buying it used (Xbox One version)?", "response": "Not reallyBut the game itself was boring personally"}
{"product_id": "B001H4NMNA", "context": "Is there a risk of over charging the batteries and shortening their lifespan?", "response": "Not at all! I keep my controls at charge all the time and I haven't noticed lifespan shortening."}
{"product_id": "B00DOD0TZG", "context": "Does this come with DLC's?", "response": "Sadly, no, just the main games"}
{"product_id": "B009GWLSFY", "context": "Does this include the Arcade version of Smash TV?Not the rated G SNES version right?", "response": "Yes. If you are thinking about this game just get it. It's a blast! You can't go wrong with the price."}
{"product_id": "B004FS8LYK", "context": "How much gore and eschatology does it have? Can it be reduced/censored?", "response": "Can't be reduced or censored! Have a lot of gore!"}
{"product_id": "B00DBCAT3W", "context": "is this just the fist game converted to 360 or a completly new game that takes place after fable 3", "response": "It's re-mastered is all, they added new quests, a few other things, and upgraded the graphics, other than that it's the same Fable: TLC game."}
{"product_id": "B001IYR53W", "context": "DOES IT HAVE  CARD GAME MEMORY MATCH", "response": "Yes, my game does have the Memory Match game listed."}
{"product_id": "B00FXOP1MU", "context": "can you play regular ds games on this unit?", "response": "Yes sir, you can play ds/dsi games on the 3ds but you can't play 3ds games on any thing. If you set up an eshop (Nintendos version of digital game distribution) you can download older games, as well."}
{"product_id": "B000FRU1UM", "context": "what is different from this one and the other one bellow it?", "response": "I see someone else was confused as to what item you are referring too, however, I can say this particular item came with a gigantic foldout poster and full game manual that may not have come with every disc.  Other than that, I will need some more information to more thoughtfully answer you inquiry."}
{"product_id": "B008OQTUKS", "context": "Hi there, we are looking to purchase a copy of Battlefield 4. Does this come in a premium edition similar to Battlefield 3? thanks Connor.", "response": "I'm sorry, I don't know. I only bought this for my brother."}
{"product_id": "B006SVUQNQ", "context": "I bought this hard drive a year ago and it does not work. The xbox will not recognize this drive. Is there a warranty ?", "response": "The one I bought had a 30 day warrantee from the seller. Did you check with the seller you bought from to see if they had a warrantee? not all sellers do this."}
{"product_id": "B00B1MXGDO", "context": "can i use this for pc gaming?", "response": "Yes you can but you need the software to down low onto the computer"}
{"product_id": "B00E8JZILA", "context": "Any download codes included with this game or is the entire experience in the cartridge?", "response": "It's the entire experience. All 5 episodes plus 500 days. Main reason I got it. I use analog sticks to move and touchscreen for those quick time events."}
{"product_id": "B000R0SRNU", "context": "Does this game require an HD TV?", "response": "No. We play it on a regular TV."}
{"product_id": "B00BV72X1U", "context": "Will this work with windows 8.1?", "response": "The answer is a yes and a no, yes the RECEIVER works but no the CD doesn't work and the only thing you can use it for is a flying disk, but you to download some stuff for the receiver to work so search some tutorials for how to do it on YouTube"}
{"product_id": "B003O6CB6S", "context": "I personally loved this game on Xbone, but now I want it on PC. Is there anyone else still online? Spare the negitivity, I've already read the reviews", "response": "I have it for the pc.  I never had if for the XBOX so i can't compare As you will.  I love it and the price was perfect on Amazon much lower than Steam.  I hope this helps.   Aj"}
{"product_id": "B008TP1OKI", "context": "do you need to have the transfer cable for this hard drive?", "response": "Only if you are going to transfer from one Hard drive to another. You don't need the cable if all your going to do is plug it into a 4 gb xbox."}
{"product_id": "B008YRITPO", "context": "What key type is this? I'm guessing rubber dome?", "response": "It is more of a soft plastic but the keys are QUIET my BF used to sound so loud when typing but not anymore!"}
{"product_id": "B00F27JNGS", "context": "What is the difference between PSvitaTV and regular PlayStationTV?", "response": "PlayStationTV used to be called psv tv, they are same item."}
{"product_id": "B00CTKHXFO", "context": "I thought that older games, such as MGS2, were not backward compatible with the PS3. Will ALL these games work on the PS3 Super Slim?", "response": "You can play all these games on the PS3"}
{"product_id": "B000YQ639M", "context": "could it run on a mac?", "response": "If I remember correctly the game I bought was specifically for Windows. I would look at the game details just to make sure you can run it on a mac."}
{"product_id": "B00004VUFG", "context": "Does this wheel only turn 90 degrees left and right?", "response": "It is something like that, half a turn to the left and right, and that is more than enough to turn race cars.  I mainly use the wheel for formula cars which are steered with small turns."}
{"product_id": "B005EOOT90", "context": "can I use on mac?", "response": "I honestly don't know but I would imagine so"}
{"product_id": "B008SBZD9G", "context": "Hi, Does this product includes the CD-Key needed to register and play?", "response": "Yes it does after purchase you should receive an email with download link and cd-key"}
{"product_id": "B003VH5Z2C", "context": "I didnt realize my TV didnt have a Yellow in for video. Is there anythying I can buy that will convert the yellow and white plugs to HDMI?", "response": "This link is the cheapest one on Amazon.  There are others.  Just search Composite to HDMI.Tmvel mini RCACVS 3 RCA Composite Video AV to HDMI Converter for TV/PC/PS3/Blue-Ray DVD"}
{"product_id": "B00KAI3KW2", "context": "Are the Xbox One games online only?", "response": "So far I now is that Titanfall is the only online game all around even the story mode"}
{"product_id": "B00CD1FCAC", "context": "do the keys fade? I have bought several keyboards where the keys scratch easily and the letters fade off revealing a white plastic underneath.", "response": "Mine haven't and I've got weeks of total use out of it."}
{"product_id": "B0050SYDEQ", "context": "Is this better than the second one on Xbox 360?", "response": "My 9 year old loves this one. He has a few of them and this is his go to game, if that helps"}
{"product_id": "B00IAVDQCK", "context": "Can you use two of these at the same time with the same Xbox One console?", "response": "You can also use it as normal headphones as well. I use it on my ipod and my 3ds."}
