{"product_id": "B0050SYX8W", "context": "Can you jump into Halo 4 not having played the other games?", "response": "I started playing the campaign mode and i was a little lost, but then again I didn't get very far in campaign mode to really find out what was going on. Shouldn't be difficult to jump in and play online."}
{"product_id": "B009AFLXJS", "context": "How does the pro controller connect to the gamepad", "response": "It connects directly to the wii u to charge. It does not connect to the game pad."}
{"product_id": "B00E1L78N6", "context": "Does these include the boom mic?", "response": "If you did not receive the boom mic in the box contact Polk Audio customer service and they will send you one for free."}
{"product_id": "B00EZPCWWA", "context": "Can photos taken with the 2DS be downloaded to a computer?", "response": "Yes. You must use the SD Card in the 2DS. Set the 2DS configuration to save images in the SDCard and then insert the SDCard to the pc or laptop."}
{"product_id": "B00292OW1U", "context": "Is is compatible with Macs?", "response": "Sorry I don't own Mac, can't help you ~~~"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "I have Windows 7 and have had no problems."}
{"product_id": "B00GV0LR64", "context": "whats the difference b/w this and me using a red dry erase marker?", "response": "It is a led light witch pops out more then a dot on the screen. In reality there is no difference just appearance. I can focus on the dot more sense it lights up"}
{"product_id": "B00HNJ4DTA", "context": "Who manufactures this thing?  Where can I find warranty information?", "response": "Prestige Custom Controllers. I went through amazon customer service to get to them. I had to send two of their products back. I hope this helps."}
{"product_id": "B00C2B2Y9A", "context": "I have a PC and a PS3  on one TV. Can I connect this to the TV via optical and get full surround and mic capabilities, or must it go into the devices?", "response": "I had a similar set up it completely work. I have optics out of computer and out to a optical to analog speaker system"}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yes, the balance board is reverse compatible."}
{"product_id": "B00ATHFLZS", "context": "Is this mouse compatible with mac?", "response": "Yes, but the two thumb keys will not work. Everything else will"}
{"product_id": "B007OVHW90", "context": "Will it work for X42's?", "response": "Yes that's what I have works fine"}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "According to the Chess King web page; all software is compatible with the Windows systems - XP thru win8. (see Paul Edvalson's comment)"}
{"product_id": "B00005QEFD", "context": "I'm sorry, I've looked at all the questions and answers but I thought I should ask again: Does it come with all the necessary wires and one controller", "response": "Mine came with all of the necessary wires, no controller though."}
{"product_id": "B008VXCPRY", "context": "will play on windows 8.1", "response": "I don't know. I would assume it would, but have not tried it. It's a standard platform game."}
{"product_id": "B00DBDPOZ4", "context": "does it work for pc ?", "response": "It does not, sorry! But you plug it right into your Xbox and can play while charging"}
{"product_id": "B000OPOCFU", "context": "Since it's used can it be installed and play by someone else?", "response": "yes you can load and play the dvd. As long as the person selling it provides you with the cd key."}
{"product_id": "B000GP8448", "context": "Is it only compatible with ps3? Is it compatible with xbox 360? my son is planning to us with pc windows version 8.1 and farming simulator.", "response": "Unfortunately the Logitech G25 is only compatible with PC and the PS3. From what I know there is no XBOX support from any Logitech racing wheels."}
{"product_id": "B00FQFFPZO", "context": "do you need the steering wheel and foot controls to operate this game?", "response": "No, the force feedback on the wheel is terrible. And this game is terrible"}
{"product_id": "B001DPZE84", "context": "work with windows 8.1?", "response": "YES,THERE IS NO PROBLEM."}
{"product_id": "B0058GMO0A", "context": "will it work on vista?", "response": "I would think that's problematic at this stage of operating systems...   but only reading the \"system requirements\" on the package for the version you're considering can answer your question definitively...   some versions for later Windows are backward compatible- some are not!..."}
{"product_id": "B0083H4NG4", "context": "Does this mouse have \"free-scrolling\" capabilities like some of the Logitech line?", "response": "If you mean like the g500, then no.   It rolls with clicks like most regular wheels."}
{"product_id": "B002I0IIPY", "context": "What controllers the sonic colors use", "response": "The regular wii remote is fine, the classic remote works also and is more comfortable in your hands."}
{"product_id": "B004NRN5EO", "context": "will this work in europe? since i'm an european", "response": "I would say that it will play in Europe, I bought it from USA and am from Australia so an entirely different region. No Problems. Good luck."}
{"product_id": "B002AQNT96", "context": "it is on steam?", "response": "Nope.  Fun game."}
{"product_id": "B00EIM3BV6", "context": "Is there anything else I need to buy to go with these for them to work on the ps4?", "response": "Nothing else is required. Everything that you need for them to work on the PS4 will be included in the box."}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "It does have Bridge"}
{"product_id": "B00005B8G1", "context": "what is the difference between  the gba and the gba sp ?", "response": "*The Game Boy Advance SP is much smaller, and has a flip-up screen.*The screen on the Game Boy Advance SP is lit.*There is a rechargeable battery in the Game Boy Advance SP.http://www.nintendo.com/consumer/systems/gameboyadvance_sp/faq.jsp#difference"}
{"product_id": "B00AQ2BLI2", "context": "Does the disc version still require steam to play?", "response": "Yes, you'll have to create an account, or use a previous one. If you dint have stream downloaded, during installation of shogun 2 out will ask you to download it for you. Hope this helps."}
{"product_id": "B00IA2NYT4", "context": "which thing is included with this console?", "response": "The PS3 slim console, one black wireless controller with charging cable, and The Last of Us game. HDMI cable NOT included."}
{"product_id": "B003V4AK8E", "context": "I just bought this but it wont cut on does this need batteries?", "response": "No but you have to connect it to the usb and press the buttons to connect them the first time also make sure its charged with the usbcable and the flash drive looking link"}
{"product_id": "B0009WPZOA", "context": "is it two players?", "response": "Yea two players can play, but the main story is only available for one player."}
{"product_id": "B00DH1KRQQ", "context": "does it comes with its own gamepad software?", "response": "Yes, it came with a mini-CD."}
{"product_id": "B00CJD4HD2", "context": "Would this be a good mouse for playing League of Legends?  Looking to purchase it as a gift.", "response": "Yes.  I think it would be great for playing League of Legends!"}
{"product_id": "B00IRHE892", "context": "Can you change the color of the lights?", "response": "You could always modify the LED itself to a different color. At your own risk though."}
{"product_id": "B007LQG9A6", "context": "does it work on a xbox 360?", "response": "Mine did not work at all! It was plugged into an xbox 360.."}
{"product_id": "B00AWEMODK", "context": "Is this game downloadable content or would I actually be buying disks to download.", "response": "Downloadable. But I wouldn't recommend it. I wasn't able to even get to the character screen."}
{"product_id": "B00ATHFLZS", "context": "What color are the light on top? It looks different in every picture.", "response": "Mine just has red on the top, it looks like they added an amazing design to it.  Mine is just plain, but I still use it and haven't had any problems with it."}
{"product_id": "B008CXTW5G", "context": "does it have any warranty? I bought it several months ago, but my W is becoming more and more insensitive..so ..", "response": "I would assume there is some kind of limited warrenty, if you bought it new anyway. Check on Azio's site under this keyboard and see if there is any information about that"}
{"product_id": "B008NMPSEU", "context": "Can you please tell me all the games in this slot. Thank you.", "response": "Most of the games are new..But some of them are from other reel deal games with a little change..Enchanted reels is a very good game with great graphics and is fun to play."}
{"product_id": "B003BKWEHS", "context": "does it work on window 7?", "response": "Yes it works okay if the screen is smaller they look kind of squashed if it's a 15 inch screen but you can install it and it will work. I've been using it."}
{"product_id": "B00005B8G3", "context": "how good is it", "response": "The one I got was no good. I could barely see the screen"}
{"product_id": "B00CTKHXFO", "context": "If I buy this game today, will I be able to download the content or did the codes expire?", "response": "The codes are still very much useable assuming you buy the game new. If you buy a used copy, they most likely won't even have the codes unless you're really lucky"}
{"product_id": "B00EV4O7B4", "context": "Which game cartridges will play on this ds??  Will ds xl work?", "response": "Any DS cartridge will work.  Gameboy cartridges don't."}
{"product_id": "B000VLNXRU", "context": "Can it work with a mac and x-plane 10?", "response": "I have seen a Youtube video of them working with X-Plane 10.2, but don't know if it was through a Mac!"}
{"product_id": "B009GZX49Y", "context": "I own the Ezio trilogy and have downloaded the 2 online games. If I sell the disk, will the new player be able to download those 2 games?", "response": "As far as I know, yes. I bought this game used and I played all three games. Assassins creed 2 and brotherhood aren't actually downloads. They are on the disc but requires aa full install to play them."}
{"product_id": "B000FQ9R4E", "context": "My son is 8 and wants this game for his birthday.  Is it inappropriate for an 8 year old?", "response": "Kelli Mullaly, it is appropriate. The violence is cartoony and there are other things to do on the game besides fighting that has mini games etc. There is no nudity or bad language. I let my seven year old cousin play it and he has a fun time."}
{"product_id": "B00FBV6V56", "context": "The inline cable has broken for the headset I ordered in July (2.5 months ago).  Is it still covered by the one year limited warranty?", "response": "Yes it should be. Call customer support or even better if they have live chat support let them know. They'll probably have you send the broken cable to them and they will send you a replacement"}
{"product_id": "B00EZPCX1A", "context": "This system does play the regulards and 3ds games right?", "response": "I can't speak for regular but I know for a fact it does play 3DS games."}
{"product_id": "B008YA9BVC", "context": "Can you actually hear audio? From videos and even the game? or we can only use this to chat?", "response": "You can hear game and chat."}
{"product_id": "B00DE2W5XG", "context": "the ps plus code is about how many time?", "response": "If is the Battlefield 4 China Rising Expansion Pack edition, it's a 12 Month long subscription. Best Regards,"}
{"product_id": "B00BS520SG", "context": "I just got a game with a DANCE MAT, and I want to make sure I am able to connect it to my Wii U. Will this work as well?", "response": "No, it didn't work for me at all. I tried a multi console pad (wii/gc, xbox, psx/ps2) and it did not work at all. I also tried the DDR II dance pad from konami and it didn't work. I sent it back and got a refund."}
{"product_id": "B0011E4J7O", "context": "Will it work without the battery pack?", "response": "No. This  cord did not   fit  properly  in the  port"}
{"product_id": "B008VQ68C4", "context": "Is it possible to use with phones", "response": "i'd look for a headset designed for a phone. assume you mean cell phone. the senn's are a USB device and i have never seen a phone that has a full size USB. i like the senn's but not for this."}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "I am also wondering the same thing. I am saving one that I bought since January but I don't have the need to use it yet since i haven't play much... Does the online code from Amazon have an expiry date?"}
{"product_id": "B00IVJ1M7M", "context": "Is this completely safe to use? The 3DS specifically states that unauthorized use may cause the 3DS to become bricked. Has anyone had this happen?", "response": "That is secure... It's totally safe"}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "It's an exact replica! It's 100% legit."}
{"product_id": "B008NMPSEU", "context": "What games are on the disk?", "response": "There are a lot of really good games that I never heard of on this disc.  They are better then I expected with  more bonus excitment then just free spins."}
{"product_id": "B0050SY77E", "context": "Does this game have English subtitles?", "response": "Yes, for most of the game play it does."}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "But if you mean movies in US PSN store ? I am sorry to answer you its not available if you are out of USA"}
{"product_id": "B002I0K3CK", "context": "Can you play multiplayer (2 people) with 2 Wii U Pro Controllers?", "response": "yes you can,  the only combination isnt available is using two gampads"}
{"product_id": "B0038PBF1W", "context": "will this work on windows 7", "response": "I am using windows 7 for this PC Game.  Ensure the video card specifications shown on the game box is compatible with with the card installed in your computer for optimum performance"}
{"product_id": "B001BZ2F56", "context": "Do you need Internet access to play this game?", "response": "Don't need it to play the whole game, but to get some downloadable content (like the holiday stuff and black leopards) you do"}
{"product_id": "B002I0F5I2", "context": "Will this come in a video game case, or a video game envelope?", "response": "I am not a seller. I bought a used game from Amazon. It came with a plastic case."}
{"product_id": "B003NVMEVQ", "context": "Does this have good grip when your hand sweats? Or should I go for the original Razer Abyssus?", "response": "I have never lost my grip on the mouse, but the shape has a sharp edge at the top that can dig into the side of your finger during long sessions."}
{"product_id": "B001O3066U", "context": "Will this game work with Windows 8?", "response": "Yes it will work with Windows 8 but it took awhile to get it loaded."}
{"product_id": "B00CMQTUSS", "context": "I have some Micro USB's, so do I need to buy a charging pack for this?", "response": "I think the micro usb cable is only for linking the controller to console. It came with 2 AA duracell batteries, you'll have to buy rechargable ones or the Xbox One Controller Charge Kit."}
{"product_id": "B006W41X1S", "context": "Can I just play my games offline and hear game sound on headphones or do I need to play online?", "response": "you can do it either way"}
{"product_id": "B00CX7FQ4I", "context": "So I preordered this game but I never received a code or anything to unlock Bruce Lee. Any suggestions??", "response": "I pre-ordered my game the night before the release date, and I was looking for my code as well but didn't see it at first, then I checked my spam folder and there it was."}
{"product_id": "B00BDX1M00", "context": "what does recertified mean?", "response": "It means that turtle beach as a company, is certifying that this product is up to their standards for resale."}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "Yes. I think we need to get used to these on line platform's. I don't think they are going away any time soon. I have accounts at Steam, Origin, and U-play."}
{"product_id": "B002I0J5CO", "context": "Does it work well with the PS3?", "response": "Yes, it was designed for use with a PS3 and remains a popular PS3 headset."}
{"product_id": "B008M4BNQG", "context": "does this head set also work with a PC", "response": "yes it does I use it on skype I use it as head phones it should work for pc gaming too."}
{"product_id": "B00FM5IY38", "context": "does this game require the kinect", "response": "no it does not"}
{"product_id": "B000096L71", "context": "Does the instrument panel have Garmin G1000?", "response": "Garmin 500.  Easy to work with."}
{"product_id": "B00008J7NZ", "context": "Does this play on xbox 360?", "response": "Yes , from what I've heard. But my xnox 360 for a red ring before i tried it out."}
{"product_id": "B00D96BJSO", "context": "Will the headset work? Im using a monitor (HDMI-DVI) instead of a TV and I'm getting sound from pc speakers through S/PDIF rather than from a TV.", "response": "It should. The headset doesn't plug into the console/TV at all. It's a regular stereo headset, and it comes with an adapter for the Xbox One controller. The only cables plug into the controller, and there's a spare more suited to another device like a phone or laptop."}
{"product_id": "B00DJYTGYU", "context": "How long is the wire?", "response": "It's about 8-10 feet."}
{"product_id": "B000O5DY0E", "context": "Did you have any problems with the downloads?My old CD would stop downloading and will tell me to retry again because a specific file will this happen", "response": "Yes, i had the same problem with mine as well. I think the CD has a virus in it. I had to delete the game file. Now I have to get my computer chkd. for viruses."}
{"product_id": "B002I0HJG8", "context": "Does this one give me Founder Status with the 8 Character slots, 4 bank slots and all, or do I need the Collector's edition instead for those benefit?", "response": "You are correct in the first bit. The Standard edition gives the founders status with everything you said plus the 280 movement account mount, 30 trade broker slots, and the backwards code items [1 time claim 280 tiger mount, some gems, maybe some other junk]."}
{"product_id": "B004QRKWKQ", "context": "does it work with a mac", "response": "Yes, you need to download xbox 360 controller driver from http://tattiebogle.net/"}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "With the \"Reel 'em In\" game I can play without the DVD in the drive. I use a laptop. I also purchased the \"Zeus II\" game and I have to have the disc in the computer to run it."}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "this mouse does not have free-scrolling."}
{"product_id": "B006IOAHPK", "context": "Hello, is in the game German Subtitle available ?", "response": "The only subtitle option I have is English, which I can only turn on/off."}
{"product_id": "B003V4AK8E", "context": "Does it work on ps4?", "response": "No. As a owner if this not so great product. It doesn't charge fully and you can't disconnect it. The arrow buttons are disfunctioal. Sorry if I don't help by telling you this."}
{"product_id": "B0029LJIFG", "context": "What is the difference between this gold card and the newer version - besides price - wouldn't this one still provide 12 months of xbox live?  thanks!", "response": "Yes it will. I just bought it"}
{"product_id": "B007SRM5U6", "context": "I didn't receive a code to download the bonus content. How can I get this content?", "response": "You must purchase it separately in the playstation store."}
{"product_id": "B000056SPM", "context": "Does it use external power or just the usb? If it does use external power does it work on 240V?", "response": "Works on USB only.  There are no other inputs."}
{"product_id": "B00F2ENJY8", "context": "Does it come with everything you need to hook it up?", "response": "I dont know as yetq because i bought it as a christmas gift an my son has not open it as yet"}
{"product_id": "B0086UK7I6", "context": "Why is the white mouse $20 more than the black mouse?", "response": "CORRECTION: there is no difference between the black and the white, it is not a \"gimmick\" as Lee states; prices on Amazon are very often tied to the supply of a particular product, and the corresponding demand."}
{"product_id": "B00DGZDFO4", "context": "Can you gift the PC download version? If so how?", "response": "As Marcin said, just give the recipient the Steam key provided with the purchase.  Do NOT put in the Steam code on your Steam account and attempt to gift from there. That will not work and you will have burned the key."}
{"product_id": "B005LUUWL6", "context": "Does this work for 3DS games, or is it just a ARDS that works on the 3DS?", "response": "Works for 3ds games"}
{"product_id": "B0089OBLDO", "context": "I can't connect the 360-control (wired) and PS3-control (wired) to Xbox 360 simultaneously, any idea of why? after recognizing the PS3 control, the wired-360 is not recognized back.", "response": "Once you use the controller the sysgem recognizes the ps3 as that controller and u cant cinnect it again"}
{"product_id": "B000056SPM", "context": "My son has the Microsoft flight simulator X plane 10 and wants a yoke. Is this compatible?", "response": "I have CH Yoke and CH Pro Rudder Pedals.  I do not fly nothing but the Boeing 737, or Cessna 172.  I think he will like the Yoke.  I have had mine for 7 years.  It is a CH Products (Flight Simulator Yoke) Good luck to you."}
{"product_id": "B003JETPHS", "context": "does this work with lips on xbox 360? thanks.", "response": "We used it on american idol and Disney karaoke for the x box 360."}
{"product_id": "B003ZSHN0O", "context": "will this work on windows 8.1", "response": "yes, it works with Win 8.1"}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "Something around 3-4 feet."}
{"product_id": "B00CBQO930", "context": "Does the Scroll Wheel also act as a button when you click it?", "response": "Yes if ya push down on the wheel it acts a programmable button. I use it as mute but you can program it as you want. There is no side to side button on this mouse like expensive gaming mice."}
{"product_id": "B00A2WP4UC", "context": "Does this system play Game Cube games?Does this system have the Game Cube controller ports on the side?", "response": "No its only for Wii games, and no controller ports on side for game cube."}
{"product_id": "B00D6PTMB4", "context": "Is this a single player only game, or can two people plug in and play together?", "response": "Two people can play together but you'll need to have two wires to play and it local play not over the internet"}
{"product_id": "B00I9GZZGG", "context": "Is the Microphone flexible or does it just rotate?", "response": "It is not flexible."}
{"product_id": "B00E1L786S", "context": "26.5 pounds ? but other webside said it just 4kg,are you sure about this?", "response": "Deng, It feels about 10-15 lbs."}
{"product_id": "B00EZPCWWA", "context": "does come with a charger", "response": "Of course silly. But only a wall block and usb cable. No car charger. Amazon has a great $20 kit that comes with a car charger and nice carrying case."}
{"product_id": "B00BI4VVGY", "context": "are you able to switch fans off with this and is it possible to run 2 of these in the same build?", "response": "William, I returned this product as it failed twice. DOA both times. I wouldn't recommend this.BUT, to your question, yes you are able to switch off fans (0 RPM) and you are able to run two as long as you have enough power lines."}
{"product_id": "B00H8NS1K8", "context": "I have ATH-M50, is it okay to buy this or stay with M50? Thanks.", "response": "The ATH-M50 is a great headset.  However, the ATHADG1 has a built in microphone for chat and is in my opinion one of the most comfortable headsets available. The sound quality on the ATHADG1 is excellent, just keep in mind it is an open design so while your ears will stay cooler you will hear your surroundings."}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "You can pick the side"}
{"product_id": "B00IU3MSF4", "context": "are the games downloads or disks, and does it need internet to play the games", "response": "The downloads come from the internet, but the discs are personally purchased. No Internet is needed for the discs."}
{"product_id": "B00EZKNT18", "context": "anyone know what size LEDs are in this remote i kinda wanna play with mine and mod it up a bit", "response": "i don,t know, but you may wanna google it and find out."}
{"product_id": "B00004XRBB", "context": "Does it work on Windows XP?", "response": "Mine worked on my xp system but couldn't get it to load right on 7 - 64 bit"}
{"product_id": "B0098F1Y3K", "context": "Is there some way to alter the appearance of the devilish talking head & stop the remarks about my scores?", "response": "I don´t think there´s a way to alter the appearance of the devilish head. What do you mean about \"stop the remarks about the scores\"? You can try reseting them if that´s what you´re asking, but they will keep poping out every time you finish a training."}
{"product_id": "B003XNU1JQ", "context": "How do you play the two player mode? Do I have to get two of the classic controllers?", "response": "Yes indeed! I have got this generic ones that work very well Classic controller for Nintendo Wii"}
{"product_id": "B008FHL56S", "context": "Just a quick question. Does this work on the regular xbox 360? I bought Titanfall and didnt know I needed a harddrive for it, So would this work?", "response": "That's wht I tried an it didn't work"}
{"product_id": "B00FWWY1V0", "context": "can it be used for ps3", "response": "Yes. That's what I use mine for"}
{"product_id": "B0054JGGGY", "context": "Does this come with a bluetooth doggle or does the charging stand act as the receiver?", "response": "Stand is the receiver and the charger"}
{"product_id": "B002I0K3PM", "context": "Is the game worth the price?", "response": "Yes it is, to me. It is a very funny game and a unique experience. It is possible adults will enjoy the game more than children due to the many pop culture references."}
{"product_id": "B00111SFEU", "context": "can it work for the PS Vita", "response": "Sorri,  I haver no idea. But if PS Vita had a bluetooth connection i think it might work."}
{"product_id": "B00CX8VYM0", "context": "Should i buy this game? I honestly suck at games, I give up easily on timed stuff or too difficult, but this game looks interesting", "response": "It's a good game"}
{"product_id": "B00CD90R72", "context": "Im going to buy a fifa game, and dont want to pay a lot. I am an offline mode (franchise type mode) person, so is fifa 14,13, or 12 the best to get?", "response": "Hi. I personally don't buy the new FIFA every year. Last one I had was 11. So I will actually advise you to buy the 14 or 15 and stick with it for a while. That's my personal take on that subject at least."}
{"product_id": "B008CXTW5G", "context": "Do the A1 and D1 series keys just not have any default values? I press them and nothing happens.", "response": "No you have to program them on your own"}
{"product_id": "B008O7J1K6", "context": "Is this a Steam key?", "response": "Yes it is for steam"}
{"product_id": "B002I090AG", "context": "Is an SD card really necessary for the 3DS?", "response": "since it comes with one yes it kind of is, also it allows you to download more content and a place to save your pics and what not"}
{"product_id": "B00576U8CC", "context": "For players who prefer to fight solo rather than with a crew or clan, is this game still enjoyable?", "response": "oh definitely.  Its just like playing other MMOs.  You don't need a crew to help out. Most or the objectives have people around doing the same missions.  There are some dungeon (kind of) modes, but you are able to solo most of them or just skip them. they are not even necessary for story play."}
{"product_id": "B0095P5K8I", "context": "How long is the cord on the mouse?", "response": "i am 5'7\" and the cord reaches about 5 inches above my head including the plastic usb bit at the end so the cord is presumably 6 feet long."}
{"product_id": "B008BGXYBM", "context": "Why does my razer taipan has only one laser sensor(8200dpi) while other taipan has the 4G \"DUAL\" sensor (2 laser sensor) ?", "response": "So far as I know, you're talking about two different things. \"8200dpi\" is the mouse's resolution, and the 4G Dual Sensor System (a laser and an optical sensor, not two lasers) is the sensor package used to achieve that resolution. http://www.razerzone.com/gaming-mice/razer-taipan"}
{"product_id": "B00ENFVS5Y", "context": "Can you buy the power cable separately, as I've lost mine. Or is it a proprietary connector, which I need to buy one direct from thrustmasters", "response": "any 300 watt unit will do, i got a tortech one for 69.00"}
{"product_id": "B002FY0CM0", "context": "I have a late model 1 sega genesis.  Will this cable work?  The RF connector in the pic doesn't look as though it will fit my system.  Thanks!", "response": "It worked on our original Sega Genesis 1 model.  The old school big boy one.  Sonic is up and running again."}
{"product_id": "B00H7KDNBO", "context": "What does buying instant access get you? like a code for origin?", "response": "They give you a download key"}
{"product_id": "B003ZSN600", "context": "Does this work on a xbox 360", "response": "It was awesome. Still working and i like wired controller. Unfortunately, xbox one only provides wireless controller but I use this. Thanks."}
{"product_id": "B001IYR53W", "context": "does it have canfiedl and hearts", "response": "It has hearts but not the canfiedl"}
{"product_id": "B007TMFD7C", "context": "will it work on my old old mackbook from may 2006 or is it to old", "response": "I tried on my macbook from 2007 and it was very choppy. Would suggest against buying it for that computer"}
{"product_id": "B004W1IX1G", "context": "Is this the tall case version? I don't want the cardboard one.", "response": "Yes sports resort has the hard case. Wii sports has a cardboard sleeve."}
{"product_id": "B009RXUNZI", "context": "How's the overhead band size, and the size of the ear cups? Looking for headset that I can wear for hours and for gaming.", "response": "Super comfortable on my ears.  Only problem is the plastic on the headband is weak. Mine broke in 2 weeks and no help from skullcandy the get the part I needed to fix them"}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "Yes, I have played it on Win 7"}
{"product_id": "B003O6C0V4", "context": "So does it come with everything?", "response": "You need to have the Wii system and a remote. It comes with resistant bands, heart rate monitor for your arm, leg monitor for motion and the CD"}
{"product_id": "B00886XQNQ", "context": "does it work for xbox360", "response": "Yes, works in mine just fine"}
{"product_id": "B005EQE0YM", "context": "Are the cups on this headset circumaural (fit around the ears) or do they lay on the ears?", "response": "They are large cushioned cups that cover the ears entirely. Really nice."}
{"product_id": "B00DC7O77A", "context": "Is this a Gamepad only game or can a Wiimote be used with it?", "response": "You can use the Wii Pro Controller, Wii Remote and nunchuck as well."}
{"product_id": "B0089OBLDO", "context": "can I connect 2 controllers simultaneously? (for instance connect a PS2 and Xbox 360 controller to a PS3)", "response": "you can use 2 but the console will accept all inputs as 1 player"}
{"product_id": "B0094H8H78", "context": "can you save your games ?", "response": "I don't think so about that"}
{"product_id": "B006RJ373K", "context": "I just ordered X-Plane 10 Global Flight Simulator (PC & MAC).  Would you make sure that you send me the 64-bit version?  Thank you!!", "response": "What is the question?????????????????????????????????????"}
{"product_id": "B004774724", "context": "does this work on kindle fire", "response": "It's for a PC not a tablet"}
{"product_id": "B00005NIMA", "context": "Can you use this with a laptop?", "response": "As long as it has a USB port it should work fine.  Windows xp and windows 7 work fine, I'm sure windows 8 should work as well."}
{"product_id": "B00D3RBYM0", "context": "Does this game require the kinect to play?", "response": "It doesn't require kinect"}
{"product_id": "B00503EAG2", "context": "Does anyone still play this game? And does this include multiplayer with steam too?", "response": "My son plays it all the time. There is a very active online community on steam."}
{"product_id": "B0073J8BYS", "context": "Is it a big deal to have the Motion Controller without the Move Navigation Controller?", "response": "If you're gonna go, go all out. Get the Navi Controller. Most of the quality Move experiences are going to require it."}
{"product_id": "B004ASOLLM", "context": "I have one of these I got from a friend but no charger what kind of cable does it require to connect to headset?", "response": "To be honest you probably will never find one. Especially without having to buy a new headset"}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "No, it's a standard 6.3mm 1/4\" jack connector which works with all the guitar... It should be fine with yours too!"}
{"product_id": "B00726ARTE", "context": "Does it Work with Xbox 360", "response": "Cindy, the M5 was designed just for mobile devices. I would suggest one of our Xbox 360 headsets, we have many options to choose from.  I think the closest in price would be the Turtle Beach Ear Force XLa Gaming Headset which is also available on Amazon"}
{"product_id": "B000TLU67W", "context": "will this work with my PS1 games as well as my PS2?", "response": "The best that I can say is ask online,  all I can tell you personally is the early models are backwards compatible but not for all ps1 games, I don't know about the slimmer console or make the trip to a gaming store and ask."}
{"product_id": "B005EQE0YM", "context": "would I need to by an audio adapter for this headset or just plug in and its ready to go out of the box?", "response": "Ready to go out of the box"}
{"product_id": "B00030GSJY", "context": "What are the base dimensions for the two parts?  I need to fit in 6.5\" space.", "response": "Hello, both units are 6 inches x 6 inches"}
{"product_id": "B005OSFUZI", "context": "This may be a dumb question but is this is like a legitimate cable for recording guitar on a laptop? Not just for the game but fo recording software?", "response": "The drivers identify it as a microphone(the bulge in the cable is a tiny soundcard).  Any software that could accept a microphone can accept the rocksmith cable(the software names it the Rocksmith USB guitar adapter for the convenience of the game presumably)"}
{"product_id": "B00BRA9T5Y", "context": "How big is the USB dongle?", "response": "Very small. It sticks out about 1/4 to 1/3 of an inch from the USB slot and isn't wider than that either."}
{"product_id": "B005G4CXPK", "context": "Am I able to use a keyboard and mouse to play or do i specifically need an Xbox controller that plugs into the USB port", "response": "You can use the keyboard and mouse. I recommend it actually.  Makes it easier I think. I will say that you need a fast cpu and good graphics card or it will be more difficult as the pixels wont flow as well and it will b jerky."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "my laptop is windows 8 and it works just fine. have fun"}
{"product_id": "B007OVHW90", "context": "does this work for X1'S", "response": "If your asking if it works for xbox 1 yes but you still need the adapter also. If your talking about the X1 from turtle beach then you need to upgrade that is old and the cable doesnt disconect. Really old. They dont even sell those anymore. Did you mean x11 or something else?"}
{"product_id": "B005UI8V6C", "context": "Does it work on windows 8?", "response": "I honestly don't know.  It works great on Windows 7 x64 bit version."}
{"product_id": "B00BQZ5EWW", "context": "does this work on mac?", "response": "Probably not, Mac is a kinda odd is for pc games, and this says pc on the case, not Mac"}
{"product_id": "B002BRZ9G0", "context": "Myself and one other person I know purchased this game when it was first released. Now when we load it in Wii it won't work, says it's not readable(both games, no damage to them) ??", "response": "It's funny I bought 2 and neither of them work anymore...says unreadable."}
{"product_id": "B0053B66KE", "context": "does it play on a new 2ds?", "response": "no, only in nintendo 3ds , in this you can play en 2d and 3d"}
{"product_id": "B000H67DDY", "context": "i want to know real weight (without case).Thank`s", "response": "my scale said 5.4 lbs."}
{"product_id": "B000FN7K2S", "context": "will the game play on newer os...windows 7?", "response": "Yes, I can play it on Windows 8 with all the latest patches.  If I remember correctly, tho', you need the origin libraries/app installed as well, but I could be wrong about that."}
{"product_id": "B00JFPO7JG", "context": "do you need a graphics card to play the game and would my Toshiba satellite c55t-a work?", "response": "I use a site like 'can I play this' to check whether a game will run on my computer. I play on a toshiba satellite with integrated graphics card, with no problem"}
{"product_id": "B00CJD4HD2", "context": "Does this mouse work on Mac? I would assume so, but it only mentions Windows operating systems in the description.", "response": "Yes it does now. Logitech released drivers for Mac a little while ago. Works fringe for me on my MBP."}
{"product_id": "B00CBQO930", "context": "How long does this mouse last? (Micro switches, scroll wheel, wheel click etc) I'm an intensive computer user/gamer. How many clicks is it rated at?", "response": "It's rated at 5 million clicks for each of the three top buttons and 1 million clicks for the two on the side. Though I'm also a heavy user and it's lasted me well beyond the expected lifetime. As with any technology, it'll last depending on your good/bad luck and how well you treat it."}
{"product_id": "B007VPZR5U", "context": "Do the Naga drivers work with Windows 8.1", "response": "I didn't installed the naga specific drivers, but the plug'n'play one works fine, and simulates a number pressing on the side buttons."}
{"product_id": "B005UI8V6C", "context": "could it be used on multiple computers?", "response": "Yes. You can install it on as many computers as you want. :)These people actually know how to make a game that's nice to the user."}
{"product_id": "B007MM9E42", "context": "Does this game have parts that require reading? And can you die? If so, how easily? My 5 yr old has been playing Kirby's epic yarn for 2 yes now.", "response": "yes there are parts to read & characters do die, probably better for a 6 year old"}
{"product_id": "B00DOD0TZG", "context": "is this bundle a one key activation for all? or does it have 3 separate keys, just asking because i already have infinite", "response": "Three separate keys, all provided in an email."}
{"product_id": "B008RA5DIY", "context": "We recently bought Quickbooks Pro 2013 3-user. Can we buy single user version and have all 4 people working in the same company file at the same time?", "response": "I would call QuickBooks sales and ask them - I know that if you buy a 4th single user and install it on the network it should work like the 3 user."}
{"product_id": "B00FM5IY38", "context": "Can this game be played entirely with Kinect? I saw a trailer advertising it as a Kinect game but all gameplay video show the player using a remote.", "response": "This game is played via controller only though one has the ability to control legions with voice commands via Kinect."}
{"product_id": "B00E3667XQ", "context": "Is it worth it even IF I cannot use the streaming feature?", "response": "Yes! Absolutely! The NVidia Shield is a fine hand-held or table top console with fantastic support. I use it during my breaks at work, I plug it into my TV at home and sync a Bluetooth controller (Nyko or Mad Catz is what I use) and my 3 year old love to play Mario 64 like a home console."}
{"product_id": "B00AXI9WFS", "context": "If I buy the Lone Ranger figures, can I play the lone ranger story with this Starter Pack? If not, what else I need to buy?", "response": "You can play with Lone Ranger figures with that pack"}
{"product_id": "B00GV0LR64", "context": "So I'm guessing if the game is designed for higher accuracy WHEN aiming, this isn't going to help much. Is that right?", "response": "Agreed.  It's really meant for hip shooting for the quick draw.  Also, games like battlefield where you can add mods to the gun, you don't really need to add the in-game laser sight and can use something else instead"}
{"product_id": "B0058FAEAS", "context": "Can you trim the plane with this product or do you need the trim wheel and can you use a rutter function without buying the peddles", "response": "You can preset the trim to buttons on the yoke.  The rudders you can also set but, I believe, the pedals are esential."}
{"product_id": "B008NMPSEU", "context": "Can you please tell me all the games in this slot. Thank you.", "response": "Big Bad Spins, Goddess of the Sea, Red, Spiderweb, Wild Stallions"}
{"product_id": "B00F2ENJY8", "context": "Does it come with everything you need to hook it up?", "response": "Yes it does just like a regular wii"}
{"product_id": "B009RXUNZI", "context": "How do you set this up to work with a PS4? The PS4 has HDMI connection....", "response": "it goes into the controller......."}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "Your lucky - it isn't available in 220V - total junk"}
{"product_id": "B00H1FCUBE", "context": "If I use these headphones with ps3, would I hear the game sound in them also?", "response": "I don't know, I am not a gamer."}
{"product_id": "B00BGA9X9W", "context": "CAN BE THE PS4 CONTROLLER USED FOR PS3?", "response": "Hello:  Yes the PS4 controller may be used with the PS3 unit...please follow the link...have fun...  http://www.gamesradar.com/how-do-you-use-ps4-controller-ps3/"}
{"product_id": "B001CXYMFS", "context": "Does this have yaw control? As in, can you twist the stick clockwise/counterclockwise?", "response": "Yes it does, and yes you can."}
{"product_id": "B005HN5LKY", "context": "will this work for  a360 xbox 4g", "response": "I have the 4 GB  I bought this and it didn't work out of the package so i had to send it back there is another one sold by the same person its 4star rated but its like 10 bucks more way better choice for the 4 gb http://www.amazon.com/gp/aw/d/B00HVOOB6M?cache=8379261eb8a9797955fe2b1f3d97bfa3π=SY200_QL40&qid;=1414032888&sr;=8-2#ref=mp_s_a_1_2"}
{"product_id": "B001EYU1WS", "context": "Does it work with X-Plane 10?", "response": "This switch panel now works in X-Plane 10, all versions of FSX, and in Prepar3d V2.x.The Saitek drivers are DEFINITELY NOT THE BEST.There are specific alternate drivers for X-Plane 10.For FSX and Prepar3d V2.x, use SPAD & FSUIPC to control them."}
{"product_id": "B00JF2FFR2", "context": "What type of Grip? Palm, Fingertip, or Claw?", "response": "I am left-handed and use a palm grip."}
{"product_id": "B00012YI14", "context": "Will this adapter allow the use of Gamecube and xBox controllers on the PS2?", "response": "Not sure. Never used it on my ps2."}
{"product_id": "B000BU0F5Y", "context": "does it have onboard memory? so i can program a macro, and take it to the ps4?", "response": "I doubt it...I personally dont own a PS4 but I know this thing has software that needs to be installed before you can program macros"}
{"product_id": "B002DOC93C", "context": "i have bought my first Nintendo, it is DSi XL. This classic games work in DSi XL??", "response": "WOW. I purchased this game for my nephew a while back.  I believe this was for the regular DS game.  It worked fine.  I don't see a reason why it shouldn't work on yours.  You can also ask the seller if it will work on your DSi XL.  Hope I've been of some help."}
{"product_id": "B0083H4NG4", "context": "I don't have a disk drive in my computer (iMac) would windows 7 find the drivers automatically? I already bought, it's in the mail.", "response": "Your iMac is running Windows 7? I believe you can get the drivers off the internet if you search for the mouse. Windows 7 won't automatically install the necessary drivers."}
{"product_id": "B003VAM392", "context": "Will this work on a PS3 and Mac version 10.8.5?", "response": "I have no experience with either."}
