{"product_id": "B00006C2HA", "context": "Will this work on Windows 8", "response": "I dont know. It´s an old game. Please, do this questione to the factory game. But I think yes!"}
{"product_id": "B003O6CB6S", "context": "hi, i would like to know if it comes with subtitles in Spanish, thanks for your help.", "response": "I didn't see any subtitles.. but I haven't looked. That being said, The \"bad guys\" in the story are south americans and talk that Puerto Rican jive."}
{"product_id": "B001BYMZ5W", "context": "Is this headset worth the money ? as all the reviews i been seeing is it the best headset ? ill be using it for PC with ASUS Xonar Essence Stx?", "response": "For flat and accurate sound it's up with the best. It's not the most ideal for bassy music but it will hit all the notes. The Xonar is good, these are only 32 ohm and can be powered by most sources."}
{"product_id": "B000TLU67W", "context": "How long has your ps2 lasted?", "response": "I've had my first PS2 for about 8yrs. compaired to my son's PS3 which only lasted for 3yrs."}
{"product_id": "B00H8NS1K8", "context": "with the open back, I'm concerned about audio bleed into the mic. can anyone comment?", "response": "Have not experienced any audio bleed this far."}
{"product_id": "B001IYR53W", "context": "DOES IT HAVE  CARD GAME MEMORY MATCH", "response": "yes it does. I'm sure you'll enjoy it."}
{"product_id": "B0045ZB66I", "context": "Does this game run on windows 7?", "response": "yes, it runs on windows 7"}
{"product_id": "B002I090AG", "context": "Does it come with a charging cradle?", "response": "Yes it does its really nice"}
{"product_id": "B005UI8V6C", "context": "Does this work with an Xbox 360 controller?  Or is it strictly Keyboard and Mouse?", "response": "This particular one is for PC only. It has to specify for Xbox 360. Hope this helps!"}
{"product_id": "B00GQTZ8TM", "context": "Is this the NTSC version? I want to buy one region locked to the states.", "response": "I believe mine is region locked yes."}
{"product_id": "B005M0KSIM", "context": "I'm worried about disk space. Does it make sense to buy the physical copy, or does all the required software (steam, directx, etc) dismiss this idea?", "response": "I am Not sure if I understand the question but I'll try to answer. I use the hard copy to load the game and it also loaded esteem function that allows me to save to the cloud. Once the game was loaded I didn't use the disc anymore."}
{"product_id": "B00FOHP8XI", "context": "can I play my ps2 games on it?", "response": "This ps3 unfortunately does not have backwards compatibility for ps2. Ps1 games however work great still."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "1 vs 1 with computer players as teammates."}
{"product_id": "B00292OW1U", "context": "Does the keyboard blue led so you can see it at night?", "response": "Yes. & you can toggle through all 4 colors with a shortcut button on the keyboard."}
{"product_id": "B00DJYK9L4", "context": "How much room do I need to move around in? I have a tiny living room area :-) Thx!", "response": "Two square meters will be fine."}
{"product_id": "B0053B5RGI", "context": "Can it be played on the dsi xl 2d?", "response": "It can be played on the 3DS, 3DS XL, and 2DS. It can not be played on any earlier systems, including any DS or DSi."}
{"product_id": "B00CX9L30W", "context": "What does the PC Download Collector's Edition come with? I purchased it and I don't see any of the in-game exclusives, nor do I see anything sent .", "response": "After you create your character in game, and have completed the tutrial, it will be with in your mailbox. Find a delivery moogle and you will have a set of messages with the promo items attached"}
{"product_id": "B003OZOAKY", "context": "can you play this game solo?", "response": "The game is really set up to be played solo so absolutely. It's a great game and I'm sure you'll enjoy it."}
{"product_id": "B004QRKWLA", "context": "Has anyone used this with old-school console emulators, and if so, does it feel okay playing older games?", "response": "I use it for SNES, NES and Genesis emulators with no issues.  I actually prefer the keyboard sometimes, depending on what game I am playing."}
{"product_id": "B00BZOBE78", "context": "my laptop doesn't have a cd drive. Does it have a code inside", "response": "You could choose PC Download or the Mac Download (depends on which you have), if you cannot use the disc, it has a online game code."}
{"product_id": "B00EZPCX1A", "context": "is the 2ds screen the same size as the 3ds xl", "response": "Nope, any nintendo system with XL is going to have the bigger screen. I'm not sure if they make a 2DS XL, but the 2DS I purchased (Nintendo 2DS - Electric Blue) has a standard size screen, quite noticeably smaller than any of the XL game systems."}
{"product_id": "B00FBV6V56", "context": "Soooo does the xbox one have Dolby Digital 5.1 yet for thees to have surround sound ?", "response": "The mixamp that comes with the headset provides Dolby digital 5.1. I have these and an Xbox one and can attest to this"}
{"product_id": "B0050SYX8W", "context": "Is it 2 player?", "response": "Yup, looking at it now. It states 1-4 players."}
{"product_id": "B008VQ68C4", "context": "Is it Xbox One compatible?", "response": "You would also need a Xbox One Stereo Headset Adapter: http://www.xbox.com/en-US/xbox-one/accessories/headsets/stereo-headset-adapter"}
{"product_id": "B00FATRKLI", "context": "I want to purchase that Xbox from Republic of Georgia and Do i need something else to turn on that device? like converter or something? for Europe use", "response": "We live in the US, our unit plugs into and runs from a US 110 electrical outlet if this helps.  And just wanted to let you know we love our X-box 360!!!"}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "It is recharges like any of the PS3 controllers"}
{"product_id": "B005DKZSVS", "context": "What tricks did you use to get this to install on your computer? I had them running on windows 8 but had to wipe my comp. Now no luck.", "response": "Go to the mad catz web site and try downloading the drivers from there."}
{"product_id": "B000B6MLTG", "context": "Will this work for a Mac?", "response": "It will as long as your mac has a vga hook up on it."}
{"product_id": "B00IA2NYT4", "context": "250 gb o 500gb?", "response": "500gb, but there is the option of 250, for just a tiny bit less $$"}
{"product_id": "B00IURGGA8", "context": "What does \"Online Game Code\" mean? Is the complete version download to my MAC or must I be connected to the Internet to play the game?", "response": "You can play while your are offline but to gain achievements for game play you must by logged on to steam and play online. If your are offline though, you can still play the complete game."}
{"product_id": "B00F27JDY0", "context": "What is the difference between the JAPAN version and the ASIA version?", "response": "Nothing but where it is sold. Every version of the Vita is region unlocked so it doesn't matter which you buy."}
{"product_id": "B0053BCML6", "context": "Can more then one person have a house in New Leaf just like in Animal Crossing City Folks?", "response": "The first person that gets a house will be Mayor and can have 3 more people move in."}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "I bought the controller for my 10 yr.old grandson and he loves it.he likes playing in the dark for the illusion of the light. It was a Christmas gift. I compared it at other stores and it was the same thing but cost more. I recommend the item."}
{"product_id": "B00GY4OAM0", "context": "is there free roam", "response": "Yes, after you complete all the levels, you have \"Free Play\" where you roam around and complete other quests to get more characters."}
{"product_id": "B0047ERZ7Q", "context": "Can you please tell the dimensions of the shipping packet or box of this item.", "response": "I don't know because I don't know where the box/shipping packet is as I probably threw it away or I just stored it away somewhere. It was probably roughly 8x4x0.5 inches. I hope this sort of helped. :/"}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "No. This keyboard is wired. However it's extremely well protected with what looks like sewn covers instead of the rubber covering.  Really nice. and easy to store since they stick to velcro."}
{"product_id": "B00FBV6V56", "context": "Is this the 2013 version with MixAmp Pro as pictured?", "response": "That is exactly how mine looks."}
{"product_id": "B004S5TDUQ", "context": "The description says it comes with the cable, but does it?  I already got burned by another seller where the description said it came with the cable.", "response": "Yes it comes with the cable. Go with the newer version if you can."}
{"product_id": "B00FB4BUMW", "context": "does this come as a usa keyboard layout if i order from the us?", "response": "Ours just arrived. The box still shows the German layout, but the top right corner says 'US layout' and I peeked (its a gift) to confirm it is in fact US!"}
{"product_id": "B000O5DY0E", "context": "Will this game work with the new Windows 8 computer?", "response": "Yes. I have the Sims 2 and 3 both installed on my computer (Windows 8). Works fine!"}
{"product_id": "B009LWQ0H0", "context": "Mouse driven or WASD?", "response": "It gives you an option at the beginning to use either the mouse or keyboard. I prefer my wireless controller. http://www.amazon.com/gp/aw/d/B0041RR0TW/ref=ya_aw_oh_pit"}
{"product_id": "B00GU8W5AE", "context": "Just got this mouse and reprogrammed the side keys in the mouse utility, but for some reason they're not working when i try to use them in WoW. Help?", "response": "I know this may sound weird but make sure your number lock is on sometimes the utility binds to the accountant keypad on the right instead of the numeric keys at the top if that doesnt work try binding to your f keys on WoW and utility instead of numeric keys"}
{"product_id": "B000WCCURW", "context": "I have windows 7 can I install it? I just bought it", "response": "yes it runs on windows  7"}
{"product_id": "B00009TW6R", "context": "Does this game still have online support post-GameSpy shutdown?", "response": "if your asking if the servers are still up then i belive they are but i havent played in a few months so if they shut downwithin then then idk"}
{"product_id": "B00D3RBZHY", "context": "Does this game have a online code inside required for online play?", "response": "No codes. You do have to have the PlayStation plus account and you need to make an account at EA Server to access all the game options but you don't pay for that."}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "como hago para abrir la cuenta en EE.UU."}
{"product_id": "B00EWEHI5K", "context": "Does anyone know if it comes in the hard-shell briefcase if I purchase it directly from Amazon?", "response": "G. flores is correct, it does not come with a hard shell case."}
{"product_id": "B003O6EDSM", "context": "Is this game like Dragon Age (RPG) but with guns instead of swords and magic?", "response": "Its more like a linear ish fps rpg. The only connection to Dragon age is the rpg and branching dialogue and romance. In my opinion as a whole its better than Dragon age. I loved the story and characters."}
{"product_id": "B001DPZE84", "context": "will this work on windows 8.1?", "response": "Sometimes it works, other times it doesn't.  Can usually fly small planes, but won't load larger ones.  Also, difficult to close it out."}
{"product_id": "B00A8HIGSS", "context": "Does this also have english subtitles like the Japanese version?", "response": "Yep, it has English subtitles."}
{"product_id": "B004RMK4BC", "context": "when you put in the credit card is it taking off your credit card or your amazon credit", "response": "If you have enough money on the Amazon card,  it will take from that otherwise you use your credit card information,  and it will take from that."}
{"product_id": "B00BT71S4K", "context": "can the galaxy s5 fit in this gamepad?", "response": "I would like to say yes because the gs5 is only marginally wider than the lg g2 (which i use) and i know for a fact that the clamp stretches further than my phones width."}
{"product_id": "B00HWMP0OU", "context": "Could a child who cannot read yet play this game? Or would it just be frustrating?", "response": "The game is to advaced for a child that can not read. The game would require a lot of help from the parent."}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes, the keyboard ships without it attached, it attaches with sturdy thumbscrews."}
{"product_id": "B00292OW1U", "context": "What are the overall dimensions ?", "response": "You can find that information in the techical information: Width: 9.30 inches Weight: 4.25 pounds"}
{"product_id": "B005CELN8W", "context": "How well does it play on windows 7?", "response": "No problems at all"}
{"product_id": "B007VPZR5U", "context": "can this mouse make macros for GW2?", "response": "Sorry I do not know the answer for this question if u may be more specific or ask somebody else would be most helpful for you thanks for asking :)"}
{"product_id": "B00E0H5J8M", "context": "Does the mouse make noise when clicking or is it silent?", "response": "The mouse will make the clicking sound on all buttons."}
{"product_id": "B00DNHLFQA", "context": "What is the file size of this download?", "response": "There are 17 different titles to download. Each ranges between 650mb to 4gb depending on the title i think. I have not downloaded all of them at once... i hope that helps"}
{"product_id": "B0054JGGGY", "context": "Does it work with a MAC computer", "response": "Yes it works on any operating system. I've used it on Mac osx, windows AND Linux."}
{"product_id": "B00CJD4HD2", "context": "Any weight balance issue? The G500 had a \"floating center weight\" that shifts and tug the mouse as you glide it, does the G500s suffers this? Thanks.", "response": "The floating center weight threw me for a loop when i first picked up the mouse as i could feel it moving as i moved the mouse in my hand. While sitting down i have issues telling that the weight has any impact on my movements. No issues here."}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "It technically is wireless. It doesn't plug into the console but there is a single wire that goes to the controller."}
{"product_id": "B00ARD5410", "context": "Does the scroll wheel scroll left & right?", "response": "Nope just up and down like normal."}
{"product_id": "B00B1VJZO4", "context": "it says that i must download sims 3 do i have to?", "response": "yes ,university is a expansion to sims 3. it wont work without it."}
{"product_id": "B000YQ639M", "context": "do i need steam to install Medieval Total War II Gold Edition?", "response": "No, if you purchase this through amazon you do not need Steam."}
{"product_id": "B0054JGGGY", "context": "Want to be sure I'm getting the latest product. Can someone confirm this has 6400dpi?", "response": "I bought that same mouse and I really like it. I'm not a mouse expert, but I game with it and haven't been disappointed with it at all. I've had mine for about 7 months or so."}
{"product_id": "B0017HLYNC", "context": "is this the orginal syberia or a cut up version", "response": "mine looks different but mine is old so they may have changed the cover. it looks good to me. this is like my favorit game ive plyed it twice but dont let that fool you, it is a really long game."}
{"product_id": "B00B98HDNO", "context": "Does this work with windows 7", "response": "Yes it does.  I am currently running it under Windows 7 32-bit."}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "Yes，it is the same mouse， just named \"CALL OF DUTY\""}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "It works with any xbox 360 rechargeable batteries.  I got two of the 2 packs sold by amazon.  The charger and the batteries work beautifully!  We were spending a fortune on AA batteries."}
{"product_id": "B00B98HF1O", "context": "Is this just for kids or can adults enjoy the game?", "response": "I am an adult and I really liked it but then I liked all the Lego games. My husband also likes them."}
{"product_id": "B00635N6YI", "context": "Does the mouse work on a Mac?", "response": "I only have a pc so I am unable to tell you with 100% certainty."}
{"product_id": "B005BLAJ68", "context": "does it play pitch?", "response": "Yes pitch is one of the games included, lots of solitare games also, I usually play hearts, spades, pinocle, buy it and enjoy"}
{"product_id": "B0088MVPFQ", "context": "Will this game play on a Nintendo 2DS.", "response": "I was so glad when I found out that the koopalings would be on a ds game."}
{"product_id": "B0009VXBAQ", "context": "does this play gamecube games?", "response": "Mine does because is the first model. If is important to you, be sure to buy the fist model (to me is the best one).Some sellers describe it as \"gamecube compatible\" or \"first model\""}
{"product_id": "B00B1OK3TC", "context": "Does it works for wii", "response": "Didn't work at all. Total waste of money"}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "Actually your right. One is louder."}
{"product_id": "B00B3PDHBU", "context": "Was the packaging already opened upon arrival?", "response": "It is brand new.  The packages are sealed inside the box."}
{"product_id": "B0098F1Y3K", "context": "How many save files are there? My girlfriend wants to play as well, can it track multiple people?", "response": "They are 4 slots for 4 diferet mii characters, now about tracking, unlike the previous ones, this doesn't focus on compare between files, it just displays a global grade for each file"}
{"product_id": "B0057WDBHA", "context": "Will this stick work with a Win8 PC?", "response": "I could not get it to be recognized on a Win8 64bit machine."}
{"product_id": "B0079V29EI", "context": "is it possible to change the battery of the nyko?", "response": "I don't know if you can or not . Mine stopped working after about 4 charges !!"}
{"product_id": "B003ZJ1VD8", "context": "what color is the switches?", "response": "On the previous models, they were CHERRY MX BLUES. The new 2014's are Razer's proprietary switches that come in their modified blues or modified browns."}
{"product_id": "B00J128FPA", "context": "Is Heavenward an expansion to this or is it a completely different game that I'd have to have a subscription for?", "response": "Let me explain more in detail have you ever played a game that comes with two disks inside? The game and the other the installation for the game? It's the same thing. But this one you have you pay xD just put the disk inside your ps4,pc,or PS3,install the content,and play the game ^^"}
{"product_id": "B00HPU96FI", "context": "Does the Dreamcast main menu look yellowish?  I just unhooked from a CRT screen (S-video) and hooked my DC up to my HDTV w/ this cable.  Looks yellow?", "response": "check your settings on the TV. Hooking my DC up to my Sony reset the \"scene\" settings for PC input and I have to manually set the colors back"}
{"product_id": "B00004VUFG", "context": "does this have a d pad and the X,Y,A,B buttons?  I don't see any in the pic. Thanks!", "response": "No, but it does have programmable buttons."}
{"product_id": "B0050SZBP6", "context": "does the game only last for 30 days and then you have to pay like 10$ dollers every month or is it permanent?", "response": "i know we got the game from you,but then my son has to pay some kind of fee to play it on line.i dont quit under stand it,but i do know he pays something.as i said i belive its cheaper to pay the fee every 3 months."}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "Got it installed once but it stopped working after a year. Couldn't get it installed again."}
{"product_id": "B00D9FQAM0", "context": "if i buy this used does it come with cords?", "response": "Depends on the seller.  If it's used...  But it should."}
{"product_id": "B00HEX8TA4", "context": "Does your scroll wheel wobble? Mine wobbles significantly. Makes a jittering noise if I shake the mouse.", "response": "No wobble at all."}
{"product_id": "B00562O8U0", "context": "where can i get a charger for these glasses?????", "response": "These PlayStation glasses charge from a USB outlet, so a computer, TV or other device with a USB outlet will serve. A variety of small portable USB chargers are available through amazon.com as well."}
{"product_id": "B00F27JNGS", "context": "Yeah I have a question lol. When is it gonna be released in the US? Seriously. I WANT ONE! no japanese version!", "response": "I think it's only available in Japan"}
{"product_id": "B0050SZBP6", "context": "Do you get 30 days access to the game with this expansion?", "response": "nope. blizzard takes a dump on their subscribers again"}
{"product_id": "B003NSLGW2", "context": "If the ps4 controller stock grips are completely torn off, will these fit snug and not slip off?", "response": "I didn't wait until my controller got so bad, but you could try using some Crazy Glue to make it stick."}
{"product_id": "B008BGXYBM", "context": "Why does my razer taipan has only one laser sensor(8200dpi) while other taipan has the 4G \"DUAL\" sensor (2 laser sensor) ?", "response": "i think is the best mouse on the world"}
{"product_id": "B004C4U1VI", "context": "It seems like the other 1 in 1 PS2 component cables don't play PS1 games if hooked up to a HDTV.  So does this one do the job?", "response": "My adult son is the gamer not me but he has been using it with no issues. He has tried other ones and I ordered this on the off chance it might work. He has no complaints. He lives a distance away but to the best of my knowledge it is still performing well."}
{"product_id": "B00D4WTO1M", "context": "It has language chinese?", "response": "No I do not believe so"}
{"product_id": "B00HHAIY72", "context": "My question is about the 'stick twist' and the 'throttle' axii. I have been told by Saitek they are \"high quality pots\". How many bits resolution?", "response": "It's listed as 16bit enhanced, I got this from the saitek site as well"}
{"product_id": "B004QRKWLA", "context": "Does this work with Windows 8?", "response": "Worked fine with Windows 8 & 8.1. Didn't ask for any drivers"}
{"product_id": "B006IR6NH8", "context": "Is the item durable?", "response": "Yes, it is built well and all the buttons, and levers still function as they were designed to do.I am happy with my purchase"}
{"product_id": "B00GOOSORM", "context": "if i baught this for friend in Canada(BC) would it work? i tried a psn points card once didnt work cuz of currency issues", "response": "try it, if you had the game then i think it would"}
{"product_id": "B0083H4NG4", "context": "I'm very interested but What does [Driver Update] mean? Is this just a driver update purchase? Won't I get the actual Hardware?", "response": "Hey I don't know why these reviews are titled \"driver update\" because we all got the Perixx MX-2000 Mouse.  It works great!  The mouse comes with the small CD - which is ver 1.0 software and if you go to Perixx.com you can download the MX2000 software there.  The software is only 25 Mb."}
{"product_id": "B00DB9JYFY", "context": "do titanfall has a competitive/ranked gametype  ?? like halo arenas, csgo competitive mode or CoD ranked games ? or is it just normal games like BF4 ?", "response": "Ya u gotta unlock stuff n rank up idk bout halo or bf4 I only play cod n titianfall"}
{"product_id": "B00HEX8TA4", "context": "The lights come on, but the mouse and buttons won't move or work?", "response": "If you have tried re-installing the drivers or tried another USB drive in the computer and the mouse is still malfunctioning, please contact Sharkk and a representative will assist you in replacing the product given that you provide them with necessary documentation needed to proceed."}
{"product_id": "B0080RAT42", "context": "I know this is for Genesis, but would it also work with Sega Master System controllers as well? don't both the controllers have the same plug-in type?", "response": "It should. The SMS controllers have a similar and compatible pinout to the Genesis controller.Any controller that works on the old Atari Standard pinout should work.Ive only run into a few controllers this didn't work with 100%, and they were all 3rd party turbo controllers."}
{"product_id": "B00HPU96FI", "context": "My VGA cable doesn't show anything. I can't hear it or see it.", "response": "Like other third-party Dreamcast cables, I had to press the cable into the socket fairly firmly to get a signal, but the signal is pretty clear. It doesn't work with Soul Caliber though. :("}
{"product_id": "B000WCCURW", "context": "Does this game play on windows 8?", "response": "Yes, I also used it in Windows XP Service Pack 3 compatability mode, no issues at all.  Only problem with the game is it is too darn addicting!  Hubby and I play for hours together in party mode, so much fun!"}
{"product_id": "B00FJWNSU8", "context": "Is this actually how the casing looks with the white sides instead of blue?", "response": "Yes. It's weird. Not sure why it's like that. It's the only title packages like this for the PS4."}
{"product_id": "B0089NVTDM", "context": "Does this have Steam support? Like, would I be able to play most games with this?", "response": "On windows it acts as a normal game controller, so it should work with any game on PC that can use a controller."}
{"product_id": "B00CX8VY4S", "context": "Does this game require a xbox gold membership or can I still play the game fully with out the membership?", "response": "Hello. Yes you can play the disk game without Gold. You only need Gold to play multiplayer,  or the extra content downloads."}
{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "No. The game exists solely as multiplayer. There are two game mode \"sets.\" One that follows the plot of the store, the other allows you to just play the particular game modes you like.It works really well despite it sounding weird at first."}
{"product_id": "B00562O78S", "context": "Why is the Playstation 3DTV only have 5000 for contrast ratio? Shouldn't LED be in the \"millions\" contrast ratio?", "response": "good question I was wondering the same thing"}
{"product_id": "B003Y5AHPG", "context": "Do you have to buy the controllers for all 3 platforms or will the SNES old controllers work for all three platforms (nes/snes/genesis)?", "response": "If you have an old SNES controler, then that will only work with the SNES setup."}
{"product_id": "B00D3RBYM0", "context": "Are there more bugs with the Xbox One version Vs PS4 for the price to be cheaper? If nothing is wrong I will of course get the Xbox One version.", "response": "I haven't experienced any bugs with this game. To which are you referring?"}
{"product_id": "B00D96BPL0", "context": "Anyone knows if it works on a wii u?", "response": "I was able to connect it to the game pad using one of the included adapters."}
{"product_id": "B009DYCTY4", "context": "Does the product come in it's original packaging?", "response": "This product comes in the special edition box you see and the games come in small sleeves"}
{"product_id": "B00IPTUJ8G", "context": "can you play this game on the vita and invite/join people playing this on the pc?", "response": "Nope, just other vita players."}
{"product_id": "B00D84DRNC", "context": "is this a belt pouch?", "response": "No it can be attached to a belt using a carabineer but on its own only has a small metal hoop attaches to the back of the pouch"}
{"product_id": "B00FJWNSU8", "context": "Does this have the TV show Green Arrow skin?", "response": "And yes it does"}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "Yes I bought it just for that remember to use the Saitek website for the drivers."}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yep. Holds my 3DS XL, two games and the AC adapter."}
{"product_id": "B002I0GF72", "context": "How long is this game?", "response": "Well if you havent played the game and you are a completionist at least 40 hours, if you are new to the game and you are just want to play it to finish from 16 to 20 hours."}
{"product_id": "B00F27JN8Q", "context": "Does Conception 2 work with PS Vita TV?", "response": "I think yes!http://www.siliconera.com/2013/09/10/playstation-vita-tv-will-play-persona-4-golden-lumines-and-these-other-games/check here"}
{"product_id": "B004N7IIQ4", "context": "Compatible with Playstation 4??", "response": "Yep. It works with everything!"}
{"product_id": "B00I5LMSE2", "context": "Is this kirby in Chinese or in English", "response": "It is in english"}
{"product_id": "B00D6PTMSW", "context": "Can I use the front USB ports for the cables?", "response": "Yes and the cable is nice and long so you can play without being too close."}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "This particular one works for the original Vita, not the Vita slim."}
{"product_id": "B00D2EGWDA", "context": "Unlike the launch version, does this version include a separate code for the 1st DLC or is it included the PS3 disc?  Expiration date for code?", "response": "Yea there's actually a paper and on the back comes a code for the first DLC Map pack"}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "It is not wireless. It does not require batteries or need to be recharged. I thought the wire would bother me but I forget about it when I start playing, though I know some people prefer wireless."}
{"product_id": "B00DJYK8XS", "context": "Does it come with a Zumba fitness belt?", "response": "No, mine didn't anyway."}
{"product_id": "B00A378L4C", "context": "CM Storm QuickFire TK or Corsair Vengeance K70", "response": "I've never tried the K70 but I don't really have any reason to buy another keyboard. The Quickfire TK is doing just fine for me and i haven't encountered any problems with it. I'm sure either one would be a great buy for you."}
{"product_id": "B000ND3XXA", "context": "does it support multiplayer?", "response": "I'm going to assume you mean can multiple people use this at once. No, you cannot."}
{"product_id": "B001H4NMNA", "context": "Dear All... I will love to buy this product, but I have a question, Could I use this product with the silicon protector placed on the controller?", "response": "I wouldn't recommend it. Because it could be fire-hazard, or treat it as one , just to be on the safe side. �"}
{"product_id": "B002I0H2AG", "context": "I played Gears of War 3 and liked the campaign.  Should I give this game a try?  Is it a must play for 360 owners?  I am only interested in single player.", "response": "It is a must for 360 owners, I play this game and I can't put it down you would love this game. =)"}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "Great question, and yes!  I've watched TV, Netflix, and Hulu Plus; as long as you're using these apps/TV through your XBox, it'll work."}
{"product_id": "B00FFL0T46", "context": "\" This installation package could not be opened. Contact the application vendor to verify that this is a valid Windows installer package.\" How to fix?", "response": "Easy...you need to first load the Demo....at the end of the Demo it will unlock the other episodes. the DEMO confirms your purchase after it ends"}
{"product_id": "B004C4U1VI", "context": "It seems like the other 1 in 1 PS2 component cables don't play PS1 games if hooked up to a HDTV.  So does this one do the job?", "response": "Sadly it doesn't work if you try to play a PS1 game, this I have found is the cables only downside."}
{"product_id": "B000035Y6D", "context": "Does this include the original box?", "response": "No. The console and accessories come wrapped in plastic bags"}
{"product_id": "B00D6NPFDK", "context": "What language is this game in? I recently purchased a differnt one in Spanish accidentally and I need an English version.", "response": "Mine was in English."}
{"product_id": "B006W41W3M", "context": "My Xbox 360 E has no digital optical port. Will these work?", "response": "You can route the audio through your TV \"if\" your TV has an optical output. You would want to check and make sure."}
{"product_id": "B009M72E5Q", "context": "Could someone tell me hat is the difference between wii sport and Wii Sports Resort? Can i buy wireless controller separately to play the cubegame?", "response": "The wii sport resort has a lot of outside games skiing, flying and more options. It's a must when buying a wii and a plus when it's added with the regular wii sports"}
{"product_id": "B008RA5AWS", "context": "I will run payroll on office computer and do all other accounting, invoicing, reports, etc on my home lap top. how to sync the payroll info to home?", "response": "I believe you will have to backup QB to zip drive at the office and bring the zip drive home to update QB there."}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "it was when it was new years ago. if you like missions and want to learn about the game story line. the Starcraft II that just recently came out will most likely have people playing"}
{"product_id": "B002NILRUY", "context": "I wonder if the black one is just like the pink one ?", "response": "I bought the blue/teal one. It does look like the black one but I do not know if it is like the pink one or not."}
{"product_id": "B00B15EXJC", "context": "Is this rechargeable or does it use batteries?  If batteries, what size and how many? Thanks!", "response": "Rechargeable. Comes with a USB cord too"}
{"product_id": "B007R9PWLY", "context": "I am buying a laptop with a 1 tb hard drive and 8gb solid state. In this configuration is the OS put on the HDD or SSD?", "response": "Sorry, I don't have the expertise to answer your question."}
{"product_id": "B00I14395A", "context": "This item as a combo is $157.99. They are separately (Mouse MX for $67.39 and K800 $64.99) $132.38. Why?", "response": "I made the same comment in my review, but people railed me since I rated it one star as you could buy both excellent products for much less.  It seems now Amazon has updated the pricing so it is the same price to buy separately or together."}
{"product_id": "B00J128FPA", "context": "If someone has already been playing the game as standard on ps3, will they get the collectors' edition bonuses if they upgrade to it on ps4?", "response": "Ye, but you just need a standard PS4 version not a collector. Final Fantatsy xiv accounts can only register one collector edition code. I am PC collector edition + PS4 standard edition and i got every bonus and exclusive items on both platforms."}
{"product_id": "B004N7IIQ4", "context": "Is the mixamp compatible with PC ?", "response": "Yes it is, use it with my pc every day!"}
{"product_id": "B0079V29EI", "context": "I have the PS Vita Model 1001 that was part of the Assassins Creed Liberation bundle. Will this work with that model?", "response": "Yes it should definitely work."}
{"product_id": "B002BXKJA0", "context": "is this game compatable for windows 8", "response": "Originally I had problems with compatibility, because I noticed the game crashed everytime I started it, but after googling how to make it compatible, I had to tweak some of the games settings and scripts. Changed some values and numbers and walla works fine, never crashed since I fixed the values."}
{"product_id": "B00DHUUTEM", "context": "Is the clicking on the keyboard quiet?", "response": "It is pretty quiet"}
{"product_id": "B008YRITPO", "context": "What key type is this? I'm guessing rubber dome?", "response": "No, it's standard hard plastic (at least mine is).  Feels good!  Fast!!"}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "don't know, works fine on win 7"}
{"product_id": "B00EZAWV6W", "context": "Does it work on Mac?", "response": "No. I made the mistake by assuming i would but it didnt. You can't download any games of of Origin on Mac. I found it put firsthandedly."}
{"product_id": "B00CPKUV9I", "context": "This game work in windows xp 32 bits system?", "response": "The game NEVER did work and them folks at steam are worthless. they never respond to help their customer. never again will I order a steam game."}
{"product_id": "B00G6IJ5QK", "context": "Does the mouse come with warranty?", "response": "Not sure -- I never checked. My son loves it though. No issues yet."}
{"product_id": "B00I9UVY7G", "context": "Is  this game going to be in English?", "response": "Its already in English"}
{"product_id": "B00AJZNUUI", "context": "Can you play wii fit with this?", "response": "You can play any game that you can play on a regular wii.  The only difference is that you can not connect to the Internet."}
{"product_id": "B00DC7O3K6", "context": "Does this game require the Wii Plus remote or can it be played without it?", "response": "Hi there...it can be played with either remote..i have used both of them..i find the smaller remote easier to handle when playing the game though."}
{"product_id": "B0009PRCNO", "context": "Is it backwards compatible?", "response": "yes as long as the model number is CECHA01"}
{"product_id": "B00H8NS1K8", "context": "What systems do these work with? or just PC?", "response": "Works with ps4 and Xbox one (with headset adapter)"}
{"product_id": "B00IYWV5HS", "context": "Does this version come with the new pre-order rewards?", "response": "How about guest passes?"}
{"product_id": "B00HG0B8NA", "context": "There is a statement that you can see others \"high\" scores to compare, is this an online game?", "response": "You don't need to be online to play; but to see others \"high\" scores you need to be connected to online."}
{"product_id": "B000J18SR2", "context": "Can you play 2 player (LAN) with 1 DVD or does each player need a DVD?", "response": "Ben, I'm sorry but I don't know.  I have only played 1 player.  However, I believe you can play 2 player on 1 DVD."}
{"product_id": "B006NU6HAS", "context": "is the aerosoft  pmdg 737 ngx the same as pmdg 737 ngx", "response": "yes it is pmdg build the program and aerosoft market it, when purchased always go the pmdg.com website for support and aircraft liveries."}
{"product_id": "B009RXUOD4", "context": "Will this headset's game and chat audio work with both next gen consoles? (Xbox One and PS4)", "response": "Yes I believe so, my good friend has the xbox one and the skull candy slyr headset and he said they do and he loves them to"}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "Nope cord doesn't even fit. And 360 mics won't work with this specific mic input. The thing that goes in the controller allows this turtle beach but no 360 mics."}
{"product_id": "B00FLLFGO8", "context": "Works to place tablet 8.3 inch LG G PAD?", "response": "I've got room to spare on my Dell Venue 8 Pro, it allows up to 6\" I believe. It should work."}
{"product_id": "B008OQTUKS", "context": "Hi there, we are looking to purchase a copy of Battlefield 4. Does this come in a premium edition similar to Battlefield 3? thanks Connor.", "response": "As of right now, there is no prebundled BF4 that has premium access. The premium still needs to be purchesd separately from the game. Im sure as more time passes, EA will release a premium edition game"}
{"product_id": "B00BI83EVU", "context": "Does this game come with one of those activation code papers inside? I'm considering a used copy.", "response": "No there's no activation code inside and I think it would be a good idea to get a used one just hope it is in good condition"}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "None of those, and the 72+ Digistruct Peak. Just the 4 DLC, mechro and psycho.Don't forget orcz.com for the golden keys and other prizes."}
{"product_id": "B00FATRKOK", "context": "Does it come with game codes or disks?", "response": "Mine came with one game halo four, headset, one free month of Xbox live a controller and the system"}
{"product_id": "B009AFLXQQ", "context": "i am buying the deluxe set wiiu do i need a pro controller", "response": "Well i would suggest getting one, it's really awesome and light. However if you don't want one, you don't really need it. Though it would be best to have one."}
{"product_id": "B0081Q58AW", "context": "Is it all strictly PvP or is there some PvE as well?", "response": "There is tons of PvE, in fact I don't care for the PvP part of the game, it is too difficult unless you are with a large group of players."}
{"product_id": "B009RHEBWA", "context": "How do I know that the Federal fom did get e-mailed? Didn't see anything in my \"sent\" e-mail box.", "response": "I haven't filed yet so I can't speak for this year but in past years, when you e-filed it was sent it via the  H&R; connection not thru your email client.  You should rcv a screen confirmation that you can print out.  Also, you should be able to check status thru H&R.;"}
{"product_id": "B001MGNWDI", "context": "Will this joy stick work with Microsoft flight sim. X  ?", "response": "Yes it does, I used it with it."}
{"product_id": "B0094H8H78", "context": "Can it play all Game Gear games?", "response": "No. It only has the preloaded games. It has no place for game cartridges. There are about half Sega games and half random games that were never on Sega and basically fillers, like card games."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "yes, it works. I have windows 8.1 installed on my PC, it runs smoothly, fully compatible. I played FIFA 13, NFS Run, Hot Pursuit and it works great."}
{"product_id": "B00EPZ8POY", "context": "does this game is in english version and the characters speak english too???", "response": "The game comes in English (instructions etc), but the characters speak Japanese with English subtitles."}
{"product_id": "B00BHSTXV6", "context": "I hit the space bar and it double space. Any fix for this? Thanks", "response": "Contact steelseries.com customer support, sorry but other than that I don't have an answer."}
{"product_id": "B007JM8ULS", "context": "I been using this hard drive for a couple of days, however the Xbox now freezes I pull the hard drive out notice it runs very hot, it is temp problem?", "response": "My son said that other than the once in a while \"regular\" freeze of the x-box that he has noticed no abnormal freezing since the install of the hard drive."}
{"product_id": "B00GS1TYIO", "context": "Is the a Candy Bars Patch?I cannot install cd??Computer just wont open the disc????", "response": "I installed the CD that I got with the game and had no problems.The only problem I have with the CD is that it hesitates every once in a while.Maybe you could contact IGT slots and see if there is a record of others having problems."}
{"product_id": "B003ZSN600", "context": "Is the end cable USB or do i need a USB dongle for PC use?", "response": "The end is a USB so it will plug directly into your computer as well as the Xbox, mine works great!"}
{"product_id": "B00CTKHXFO", "context": "Which region is this game in? R1?", "response": "Yes, it is. As most games sold for North America."}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "I'm sorry, Becky - no. Yoshi's New Island is only for 3DS and 2DS."}
{"product_id": "B00CBQO930", "context": "Is this mouse good for League of Legends?", "response": "I have never played it, but for a traditional style mouse I love how it feels. It's pretty big but the buttons feel great. I have yet to play anything that I need to use more than 2 buttons for."}
{"product_id": "B003NSLGW2", "context": "do these provide a snug fit on the xbox 360?", "response": "Not sure as I don't have a Xbox 360 if the dimension of the analog is just like the ps4 joystick then yeah it should... I hope this helps"}
{"product_id": "B00DCBDNW6", "context": "How much is the monthly fee", "response": "The subscription is $12.99 a month for one character per server, $14.99 for 8 characters per server. You can play as every class on one character, so unless you want an alt for something such a roleplaying or more inventory space, one character is really all you need."}
