{"product_id": "B001DPZE84", "context": "I have never played a flight simulator game before, and i am not a pilot. Could i still learn to play this game?", "response": "Yes of course you could there is a full tutorial all the way up an airline pilot. To get the best out of the sim take time to read the 'how to ' e.g. GPS and auto pilot etc. it's well worth it."}
{"product_id": "B00GU8W5AE", "context": "Just got this mouse and reprogrammed the side keys in the mouse utility, but for some reason they're not working when i try to use them in WoW. Help?", "response": "What did you reprogram them to in the mouse utility? I did mine to my number pad and it works fine in WoW."}
{"product_id": "B00005B8G3", "context": "how good is it", "response": "The gameboy is pretty good and mine still works just fine after all this time."}
{"product_id": "B00IP0H4GA", "context": "Will this versions menu screen be able to format to English lettering or is it all Japanese?", "response": "Its all Japanese. Fortunately they are remastering it for PS4 and that version will be in English"}
{"product_id": "B00GS6A6V8", "context": "I am in Australia and have purchased the base game here (in Aus), will this DLC bundle work on my PS3 with my game?", "response": "In my experience, this DOES NOT work on Australian-bought PS3 Skyrim. Just ordered it and it does not work."}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "Hi. Yes English or in German. You can choose when you install the game. So to answer your question is has both."}
{"product_id": "B00005NIMA", "context": "Is this a USB stick?", "response": "Yes Just pug it in, your computer should recognize it as a new piece of hardware"}
{"product_id": "B002Q4U5DK", "context": "is the mouse small?", "response": "WARNING: This mouse is a counterfeit reproduction of the Razer Deathadder! This product is not legitimate and cannot be officially registered with Razer Support."}
{"product_id": "B002BSA20M", "context": "Does the Halo Reach come with the code for the Flaming Helmet?", "response": "I do not believe so. that is something you have to unlock."}
{"product_id": "B00BCEK2LU", "context": "My kb sets on s slide out tray so over all length is a factor. What's the side to side length of the G510S?", "response": "It is 20 inches."}
{"product_id": "B009GWLSFY", "context": "There is no list of the games in the product details. Can you list them please?", "response": "Joust, Defender, Rampage , Total Carnage, Gauntlet, 720, A.P.B., Arch Rivals, Bubbles, Championship Sprint, Tournament Cyberball 2072, Defender 2, Gauntlet 2, Joust 2, Marble Madness, Pit-Fighter, Rampart, Robotron 2084, Root Beer Tapper, Satan's Hollow,  Sinistar, Smash TV, Spy Hunter, Spy Hunter 2, Super Off Road, Super Sprint, Toobin', Vindicators Part 2, Wizard of War, Xenophobe, Xybots"}
{"product_id": "B002BSA298", "context": "will this work with the old console and will I need another cable to connect it?", "response": "You will need another cable to connect it. I had to buy another one too!"}
{"product_id": "B004H7P0B6", "context": "Is this just one piece or is there a rubber attached to each piece that is removable?", "response": "These are all one piece items. Nothing is removable."}
{"product_id": "B00C710AT6", "context": "I can't even open the game. Each time I click on the shortcut on my desktop or try opening it through steam it just goes to a black window than closes", "response": "Could be that you need to update your drivers. Or try reinstalling the game."}
{"product_id": "B009D3HSTG", "context": "Does this have a \"rumble pak\" built into it?", "response": "No it does not. It feels lighter than the Nintendo 64 controller as well. Basically it is the Nintendo 64 controller shell and a circuitboard in the middle. I bought both the grey and black. Great purchase in my opinion."}
{"product_id": "B00D96BNGM", "context": "can this unit be substituted for comuter headset", "response": "What the heck is a comuter ?"}
{"product_id": "B001IYR53W", "context": "I have the 2005 version but it does not have SPIDER,a  solitaire game..does this version have it.  Thanks", "response": "I did not see it on the menu. However, there a lot of good games. This disk is well worth the money."}
{"product_id": "B002I0J5CO", "context": "is it good for hearing the steps in black ops? please be honest", "response": "you can hear everything. steps, guns reloading (like other people have said), you can even hear things off in the distance. the headset is amazing. it's definitely worth the money."}
{"product_id": "B000LQ4HTS", "context": "Is there preset button mapping for Elite Dangerous available? Has anyone used this particular HOTAS in Elite Dangerous, and how well does it function?", "response": "yes in elite dangerous you can select a saitek pro setting that will map all buttons you need. some will still need to be configured to your liking, and as far as I can remember, if you also have pedals, you have to set those manually as well."}
{"product_id": "B0038MVFYC", "context": "does it include the code for Nintendo Club ? so that we can register it as a game we own ? if yes, do you also sell Soul silver ?", "response": "I believe so, I bought both Pokemon Hearr Gold/Soul Silver on Amazon, both brand new, and I do believe I saw the code in it. If the game is brand new I see no reason for there not being a code. Either way owning this game is a great choice."}
{"product_id": "B009AFLXQQ", "context": "i am buying the deluxe set wiiu do i need a pro controller", "response": "You actually don't, most games have plenty of compatible controllers. I would recommend buying the pro controller if you find yourself uncomfortable with the wiipad."}
{"product_id": "B0017HLYNC", "context": "is this the orginal syberia or a cut up version", "response": "It's the original version. Just played it again. Great story. Great adventure game."}
{"product_id": "B008GEH9HO", "context": "What games does it come with?", "response": "none. its the system only."}
{"product_id": "B0000512IE", "context": "Could this be adapted to be used in racing games also?", "response": "I've always been under the impression you could use the pedals for racing games, but I only use them for flying."}
{"product_id": "B00EWEHI5K", "context": "Is it compatible with mac ?", "response": "Yes, Razer synapse works on Mac so all their devices do as well."}
{"product_id": "B000K9Q5NW", "context": "does it come with g 27 gear shift holder", "response": "When I got mine it was sold seperaley"}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "One in, one out, and one 3.5mm aux in."}
{"product_id": "B003RS1A7Y", "context": "Is this guitar compatible with Band Hero featuring Taylor Swift?", "response": "Highly unlikely.  As far as I know, the Mustang PRO guitar is only compatible with Rock Band 3.  It isn't even compatible with earlier versions of Rock Band, let alone games from a different series."}
{"product_id": "B00EHBKUTE", "context": "The \"Synapse 2.0\" feature implys that keypad won't work if my Internet is down. Is this true?", "response": "I have used my Tartarus with no internet connection. You just wont be able to update the Synapse 2.0 until you connect to the internet."}
{"product_id": "B00CTKHXFO", "context": "Would this game work on my PS3 (I live in the UK)? Not sure if it would be region locked or not.", "response": "All PS3 games are region free except Persona 4 Arena."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "I have played it in Vista and it plays OK.  I didn't care  for it because of the update.  I am more used to the classic version."}
{"product_id": "B00CBNV7UQ", "context": "Is it 2 player", "response": "yes you can have 2 players - make sure you get a bigger screen though"}
{"product_id": "B00FE8WKMO", "context": "does this include the balance board?", "response": "No, it does not include a balance board."}
{"product_id": "B00HG0B8NA", "context": "There is a statement that you can see others \"high\" scores to compare, is this an online game?", "response": "No its not  online, but you can  choose to  post  your  score & then you can see  how  you  rank"}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "I never had that problem though it could be your controller or game could be experiencing input lag"}
{"product_id": "B00FENJVOE", "context": "can we have more than one account or username", "response": "You get only one account and user name per game purchased. I hope this information helps. You can create up to 1o separate characters on your account though. =o)"}
{"product_id": "B0095P5K8I", "context": "does we need to have a mouse pad or we can us it with out the pad?", "response": "Great question. Ironically today I got back home and didn't have the mousepad out under it yet since I was lazy and it worked on my desk. So it should work unless the surface doesn't allow for it."}
{"product_id": "B009LGO88E", "context": "Will it works on the new 3ds xl?", "response": "It only works with 3DS XL."}
{"product_id": "B001H4NMNA", "context": "Do you have to plug this into the PS3 or can you use a wall outlet to charge the remotes with this?", "response": "Yes I would think so. Thanks"}
{"product_id": "B00BT9B2LC", "context": "Is the Japanese 3DS compatible with an American 3DS charger?", "response": "I don't know because I had the spanish version and it is compatible with it."}
{"product_id": "B0095P5K8I", "context": "is this mouse official e-blue or is it a cheap rip-off?", "response": "I dont know... but is a very good mouse! assembled with high quality components"}
{"product_id": "B001GROEEO", "context": "Is there any difference between \"Playstation Network Prepaid Game Card\" versus a \"PlayStation Store Gift Card\"? Is the PSN card just the old version?", "response": "No there is not, both give you credit in the PSN store."}
{"product_id": "B00GJ2HZ7E", "context": "Will Sonic & All Stars Racing Transformed key work on a Mac or do I need to buy a Mac version of the game?", "response": "You use it on steam, which is for Mac and Windows"}
{"product_id": "B000266786", "context": "I have windows 7 will this game work with that?", "response": "yes it will but not mac computers and I cant use the one I bought ."}
{"product_id": "B008KH7NZA", "context": "Is this headset PC compatible? Why doesn't it specify?", "response": "It works perfectly with PC, I have no idea why they don't specify"}
{"product_id": "B0087ZMAUS", "context": "Do they feel cheap with them being like all plastic and can people around you hear what you are listening to?", "response": "No, they do not feel cheap. They feel very well made. People around you can hear your music if it is turned up loud. But the sound is amazing. :)"}
{"product_id": "B0095P5K8I", "context": "Has anyone had any trouble with it randomly double clicking and selecting stuff behine open windows or drop down tabs?  I have had mine for 1yr.", "response": "i haven`t tried it yet I bought it as a back up I use a track ball mouse but that one sounded good because of the speed"}
{"product_id": "B00DJYK8XS", "context": "If you don't want to play the game, but just use it as a Zumba video, will it still play?  (For example, no one is holding a remote.)", "response": "You don't really have to hold the remote, the video comes with a belt for you to put the remote in while working out."}
{"product_id": "B006NU6F28", "context": "does it work on windows 8 at all?", "response": "Yes, we use it on windows 8."}
{"product_id": "B000RA778G", "context": "I love this game but now Im not able to play it and Im not sure why please help I miss my game", "response": "did u go to add and remove programs uninstall it once thats done reinstall it"}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "This doesn't work on a Nintendo 64 game system."}
{"product_id": "B00BDS415I", "context": "Can these be used with the PS4 right out of the box? no adapters or anything?", "response": "Don't let the employees of the manufacturer fool you. It is only minimally compatible with the PS4 out of the box. Most of the advertised features, most notably the separate volume controls for the game and chat, require a $35 adapter. Without said adapter, this is a discount headset at a premium headset price."}
{"product_id": "B00FXOP1JI", "context": "does it include a download code for pokemon X or Y as the second picture shows?", "response": "I don't know about all of them, but I do know that mine did NOT. Was a little disappointed by that, as I assumed by the photo your talking about that it would come with that download. My didn't though!"}
{"product_id": "B0012N94WO", "context": "what about the language? spanish is available?", "response": "Hola , si el juego trae sub-titutos al españo, bueno el que me enviaron si"}
{"product_id": "B006W41W3M", "context": "it is compatible with ps4 and pc?", "response": "No, the set I bought is for Xbox 360.  You should be able to check system compatibility in the product details description.  If not, you can always contact the seller through Amazon."}
{"product_id": "B0002L88HE", "context": "When I click on the Desktop icon to play The Titans Expansion it says \"please enter The Titans Expansion CD ROM. Any advice on what to do?", "response": "If the CD is already in the computer then take it out and reinsert it, or reinstall the titans expansion and it should work. Windows 7 problems are also compatibility related and may require you turn of UAC."}
{"product_id": "B005LUUWL6", "context": "So it will work on any ds game that you have or does it just work on top of the Line games?", "response": "as long as they are ds games and not 3ds games they will work fine, but dont forget to update it once in a while too. on its website."}
{"product_id": "B008J16AP6", "context": "Is it a region free media? I have bought my Xbox 360 in Europe and, in order not to have compatibilty problems, I buy only region free games.", "response": "I'm not sure where to find if it is or is not.I looked over case, instructions and disc.If you can help me with that, I would be glad to help you."}
{"product_id": "B008CP6MA2", "context": "Is this a multplayer game?", "response": "Noup! But, 100% recommended, very funny!"}
{"product_id": "B005G4CXPK", "context": "Is this the Director's cut and Deluxe Editions?", "response": "It doesn't say either anywhere on the box or the disks, so its probably not director's cut or deluxe. Its the standard games in a double pack which the advertisers have cleverly called, The ultimate collection\" for sales appeal. Ultimate doesn't imply anything."}
{"product_id": "B000OPOCFU", "context": "is this compatible with windows 7 64 bit", "response": "I've played Tiger Woods 08 on my Windows 7. Good luck."}
{"product_id": "B00IRHE892", "context": "why does it say \"Batteries 2 AA batteries required.\"? never seen a wired mouse that needs batteries, could that be a mistake?", "response": "It is a mistake.  The model G602 wireless mouse requires 2 AA batteries, not the G502 wired mouse."}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "It has both Metro Games!  Your given steam codes for Metro 2033, and for last light."}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "This is for the one the original ps vita 1000 series"}
{"product_id": "B00DNGQQUQ", "context": "is this in english?", "response": "yes it is in english"}
{"product_id": "B006NU6F28", "context": "does it work with logitech driving force pro?", "response": "Yes it work perfectly"}
{"product_id": "B0047ERZ7Q", "context": "Can you please tell the dimensions of the shipping packet or box of this item.", "response": "9-1/4\" x 6-1/4\" x 2\""}
{"product_id": "B00GV0LR64", "context": "can this be used with the xbox one", "response": "it can be used with any first person shooter game, just plug the usb to provide power for the red dot and put it on the lcd display your using."}
{"product_id": "B00E88G054", "context": "how is this mouse compared to the mazer 1 type r? better? worse? improvements?", "response": "Improvement, especially on the looking"}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "You do not charge it. Its USB powered wired headphone. Its not wireless and that's the key point that it conects to every audio-enabled device (mobile, ps3, PC, Xbox)"}
{"product_id": "B001ELWMHI", "context": "I need a new power brick for my original XBOX.  Does ANYONE know where I can buy one?  I've been looking for days.", "response": "The original Xbox doesn't have a power brick like the 360 or One. The \"power supply unit\" is inside the console and would be found under that title but you would also need to know if it's a one or two row connector."}
{"product_id": "B00FQPQO4A", "context": "How big is the real download? I assume I'm downloading an installer, then the real deal. Also, do I need Steam?", "response": "I don't lnow.I had nothing but trouble with this game.  Could not get any help. I hope you have better luck."}
{"product_id": "B00DUARBTA", "context": "Can this game handle 1 - 4 players using 4 shock controllers?", "response": "It handles two player very well, beyond that I haven't had the opportunity to explore the game as much as originally intended, however from what i have played with both two players and single it is really addictive and fun game!"}
{"product_id": "B00AAS88K6", "context": "Anyone know the difference between the 2013 and the standard edition?", "response": "Increased DPI, color changed to green, battery life doubled with the use of the newer bluetooth standard."}
{"product_id": "B00EFFVZP0", "context": "This game is in language or subtitles in Spanish?", "response": "IT IS AN OPTION"}
{"product_id": "B00FB4BXGA", "context": "Does it have media keys? Like Volume control, FFW?", "response": "The icons on the function keys are three volume controls, the calculator, pause/play, stop, last track, next track, what look like screen controls, www, and record.  So, definitely yes."}
{"product_id": "B00ATF5YZM", "context": "Do you redeem this on Steam?", "response": "I cannot swear to it but i am almost certain that you do because it is on my steam library!"}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "In this bundle, the DLC is only included. You have to buy the game.if you don't have skyrim already, you can buy the Legendary edition, which is 40$ and includes all DLC and the game. I would highly recommend getting skyrim though, It Is an amazing game with endless features and fun :)"}
{"product_id": "B00576U8CC", "context": "For players who prefer to fight solo rather than with a crew or clan, is this game still enjoyable?", "response": "Absolutely.  In fact, while it's online,  I would say it's pretty much a solo game.  There are times when you're working with others,  but it's not a communication/coordination thing.It's a great way to just sit back and play solo for an hour or two, and the addiction is good for a month or maybe two"}
{"product_id": "B006PP4136", "context": "Does the screen protector also fit on the ps vita 2000/slim?", "response": "I don't know for sure, but it would probably work. I would think it would be harder to overlay on the screen though, since you use the buttons on the right to line up the film before you place it."}
{"product_id": "B004XGN8W4", "context": "Do I need the Dual Split power cord that is says in buy all three?", "response": "You would only need that if you had only 1 outlet available. But if you're able to use 2 then you don't need it"}
{"product_id": "B002I0HJG8", "context": "DRM type, no internet required?", "response": "I don't know what the DRM type is but I think you can install it on multiple computers. I know you don't need the disc to play. BUT IM NOT SURE. Yes, Internet required."}
{"product_id": "B00FJWNSU8", "context": "good day. the game is completely in Latin Spanish.", "response": "Yes it is in Latin American Spanish (neutral)... I didn't hear any accent."}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "No. It only plays on the Nintendo 3DS, or 3DS XL."}
{"product_id": "B00D6PTMSW", "context": "Do you have to have kinect on your xbox to use this lesson game?", "response": "No you do not need the kinect to use rock smith"}
{"product_id": "B00503EAG2", "context": "Does it work flawlessly on Window 8.1, 64 Bit ?", "response": "Depends on your graphics card and cpu, yet i would not recommend windows 8 for gaming purposes"}
{"product_id": "B001E27DLM", "context": "Does this port have all 15 alternate endings from SNES?", "response": "It is a port of the PS1 version, which should have all the endings, as well cinematic and some bonus features."}
{"product_id": "B00D96BJSO", "context": "I recently got the XO Four Turtle Beach and the only major issue I have is how it's very uncomfortable on my head. Is this one better?", "response": "this is what people say the more you pay the better you get...please check out this video https://www.youtube.com/watch?v=T8r9vgJhM0U....yes the xo 7 is very comfortable and better"}
{"product_id": "B0090ECASW", "context": "do you get the mad catz or cyborg version? Also, do the keys light up and (if so) are you able to choose the color?", "response": "Yes I got the Madcatz version and you can change the lights to what ever colour and how bright you want them."}
{"product_id": "B002FY0CM0", "context": "How many pins are on the end of this cable that connects to the game console?", "response": "5 pins total (around only a portion of the internal circumference)"}
{"product_id": "B00DC9SWWE", "context": "Is there an online game code that comes with the game? I ask because there are some great used game deals for TitanFall.  Thanks.", "response": "No, there isn't a game code.  A used copy should be fine."}
{"product_id": "B00030GSJY", "context": "I'm interested in a career as a professional Helicopter pilot, is the X52 a good choice for someone who wants to practice Helicopter flight without pedals?", "response": "If you are looking into becoming a professional Helicopter pilot, then I would spend the extra cash for the pedals. You will want to get the full experience not having to rely on other key bindings"}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 8", "response": "We do not have Win 8 thus far - sorry"}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "I use it with amazon prime. Seem to work ok."}
{"product_id": "B00BMFIXKQ", "context": "My son is 12 years old and really wants to get this game. Is this game appropriate for his age? Should I wait a year or two? What say you???", "response": "There is a decent amount of blood in this game, and some of the kill animations can be fairly elaborate and graphic.  Add that to the language and sexual content, and it's probably not appropriate for someone so young."}
{"product_id": "B0071NH8B8", "context": "How many hour's of gameplay will it last before the battery needs to be re-charged?", "response": "Depends on if you have the Wi-Fi on or off, if you have it on it's going to drain the battery. Say 3 hours or so? Without it 4 hours, but I believe you can shut off the system without powering it off completely to conserve power."}
{"product_id": "B0050SY77E", "context": "does this game have a multi player mode", "response": "I dont play it but my son does and he said yes it does."}
{"product_id": "B00EM5UFF4", "context": "What kind of game is this?  Is it just for kids?  I'm a 37 year-old male?", "response": "I'm 47 and I play.  Sometimes even when my 12 year old son isn't even around."}
{"product_id": "B008CP6MA2", "context": "I'm new with the PS3, do I need a PSN account to download Ghost of Sparta and Chains of Olympus?", "response": "Yes you do.Without PSN account you cant play them."}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "When I plugged in mine it had a low red glow with no numbers lit until I started flight simulator. Ocasionally all the numbers will stay lit as well after I shut down flight simulator as well. Double check the forums on avsim.com or the saitek website if it keeps acting up."}
{"product_id": "B00A378L10", "context": "Will this keyboard work with a Mac?", "response": "Can anyone else comment on whether the media keys work? It looks like the volume up and play pause buttons are off by one. So they might not do what they are supposed to on a mac."}
{"product_id": "B007TFOO6K", "context": "is this keyboard audible? like, can i hear the key when i type? (getting the cherry mx blue)", "response": "I recommend do not buy this model.  CM has discontinues this version.  A new Trigger will be released shortly...that's what they've told me.  My Storm Trigger failed within a few months of purchase.  Sent it to CM.  They stated that I would get a new Trigger as soon as it is released."}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "YeahMetro 2033 is a steam keyYou don't care about that"}
{"product_id": "B00CJ7IUGS", "context": "How much space do the DLCs take up on the hard drive once they've been installed?", "response": "In all it took 1.5 gigs, so nothing to really worry about taking up space."}
{"product_id": "B008RA5AWS", "context": "Once i purchase the Quickbooks Pro 2013 with Enhanced Payroll, will i still need to purchase a year subscription ??", "response": "No, a one year subscription is included."}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Fortunately, it does. Unfortunately, remembering to turn it off every time is another issue that isn't Logitech's fault."}
{"product_id": "B00DB9JYFY", "context": "Is this and Dead Rising 3 worth an xbox one?", "response": "I honestly  think so, but I use my Xbox for all the apps and watch my TV thru it as well.   I also heard that titanfall 2 will be available for ps4"}
{"product_id": "B005HN5LKY", "context": "Will this work for european plugs?", "response": "I dont believe so but u can get an adapter for pretty cheap."}
{"product_id": "B00EWEHI5K", "context": "Should I get this or the Logitech G502 Proteus Core?", "response": "I would get the LOGTECH G502. I bought the RAZER OUROBOROS and ended up returning it, here is my review: http://www.amazon.com/review/RSHWKQ6WWOSH1/ref=cm_cr_pr_perm/?ie=UTF8&ASIN;=B00EWEHI5K"}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "It does not.  It has online co-op but no local co-op or \"couch co-op\"."}
{"product_id": "B00AK4QB22", "context": "So are there small villages, towns or cities in this game that you can trade, buy potions, etc.? Ex: Oblivion, Skyrim", "response": "Not exactly, but there are merchants scattered around in the game that you can buy stuff from"}
{"product_id": "B00D3RBYM0", "context": "Have the bugs been fixed yet?", "response": "Not yet , it looks like all EA games are having the same problem"}
{"product_id": "B007TYC8MI", "context": "Is this a digital version? or a hard copy?", "response": "This item is a Hard Copy"}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "It's usb headset, it does not require a soundcard audio drivers are on the install CD that it comes with."}
{"product_id": "B0000A2TPE", "context": "Can this work on Windows 7?", "response": "I use it on Windows Vista and Windows 8.1"}
{"product_id": "B0044DJZ0A", "context": "is there any backlight? and how does it do compared with the Mad Catz Strike 3. good for BF4? Thank, oh and can i set the color of the light?", "response": "No backlighting besides the steel series name on top, can't tell u how it is compared to the mad catz never owned it, but FYI this isn't a mechanical key keyboard the benefit of the keyboard is the switchable key sets"}
{"product_id": "B000056SPM", "context": "Is this only for flight sims, or can this be used for all driving games as well?", "response": "I would not reccomend this for driver Sims limited turning radius.about 45 degrees each way."}
{"product_id": "B00ATHFLZS", "context": "Is this mouse compatible with mac?", "response": "It's USB mouse.. So unless your Mac has no USB ports, yes."}
{"product_id": "B004CFASL0", "context": "will they play on Windows 7?", "response": "Yes. I have had no problems with my HP TouchSmart running Windows 7 Home Premium playing this bundle."}
{"product_id": "B003RS1A7Y", "context": "does this include the dongle", "response": "i am not sure what is a dongle, but it includes what you can see in the pic and the USB wireless conector"}
{"product_id": "B008XHCLFO", "context": "Does this case also fit the Nintendo DSi XL? (not 3DSi)....for which there is no available case at the moment?", "response": "I do not have access to a DSi XL, so I cannot test it. However, I am aware that the DSi XL is shaped a little differently than the 3DS, so, I would imagine that IF the case fits at all, then it would be stretched quite a bit.I do not recommend getting it for the DSi :P"}
{"product_id": "B0081Q58AW", "context": "Is there a,way to play offline", "response": "No this is an online MMO game"}
{"product_id": "B007OVHW90", "context": "will it work with the px5", "response": "According to turtle beach, it's compatible"}
{"product_id": "B00B98HBTA", "context": "is it two player", "response": "Yeah it is. there is dynamic split screen and standard spit with multiple players"}
{"product_id": "B000AOJ7FK", "context": "Is this game legit, like when you buy it you can download it and play? this is not a scam right?", "response": "U download it then u buy the game online for like $7"}
{"product_id": "B00562O8U0", "context": "I have a Sony BRAVIA XBRHX929 TV and wondering if I need a 3d Synch xmitter along w/ these glasses or will it synch/work directly with the TV ?", "response": "The XBRHX929 already has a compatible 3-D emitter so the Playstation glasses should work directly with the TV. Check the price on Amazon - the glasses were much more expensive in the Sony store."}
{"product_id": "B002I0GF72", "context": "How bad is the violence and \"Blood\"? I have a 6 yr old dying to get this game, but I want to make sure it's appropriate. Please help.", "response": "The violence is very cartoonish and there is no blood. Zelda games are about adventure and are full of puzzles. They are perfect for critical thinking and problem solving, which are great skills for a 6 year old to start working on. You should definitely get this game for your child."}
{"product_id": "B00EZKNT18", "context": "Will this work on a Windows PC or not?", "response": "Yes it will work for any windows platform."}
{"product_id": "B009SJR278", "context": "Do I need to buy a splitter for pc gaming?", "response": "No. It comes with a Aux to Audio/ Mic cable. So you can plug it into a laptop ( Build in AUX cable) and use it or plug it into your desktop ( Splitter, AUX to Audio/mic cable)."}
{"product_id": "B001E27DLM", "context": "Does this game have multiplayer mode?", "response": "The Arena of the Ages minigame where you train a monster and fight against other monsters has wireless multiplayer where you can battle your monster against a friend's monster.  As far as the main gameplay goes, it's all singleplayer."}
{"product_id": "B008YRITPO", "context": "Can the backlight led's change to red?", "response": "I ain't found this function... So I don't think so..."}
{"product_id": "B005LUUWL6", "context": "i have an older ds and just wanna make sure it would work if seems that it would but just wanna double check before i do", "response": "It works. I have the oldest DS and it does. Just make sure you go to the website listed, then plug in the Action Replay into the computer. When the download is done, you can then unplug it and put it into the DS. The game will boot off the Action Replay."}
{"product_id": "B005OSFUZI", "context": "This may be a dumb question but is this is like a legitimate cable for recording guitar on a laptop? Not just for the game but fo recording software?", "response": "I dont know but I saw some people who say it works with recording softwares"}
{"product_id": "B00BMFIXT2", "context": "How much storage space does it require on xbox?", "response": "I'm just playing the stout mode and I haven't needed extra storage for it..."}
{"product_id": "B006QRMR4S", "context": "Can you play regular ds games on the 3ds?", "response": "Yes you can, like a normal DS."}
{"product_id": "B002I0K3CK", "context": "Why is this game $67.99?? This game is 2.5 years old and all new games are based at $60....", "response": "The market fluctuates and as demand for items increase and supply decreases, prices go up."}
{"product_id": "B00005B8G1", "context": "I have seen a device called the GBA Worm Light (Screen Light for Gameboy Advance) does that mean you need light on the screen to see the game?", "response": "No, the device is to allow you to play in the dark. The older game boy consoles are not \"back-lit\" this means that if there is no light around you won't be able to see the game. Like the screen on a TI-83 or most other older calculators."}
{"product_id": "B00CMQTVK0", "context": "does it come with warranty? and can you play minecraft the reason im asking is because i saw  a message somewhere , someone said that you cannot", "response": "Yes, it comes with a one year warranty on the console itself and the accessories for 3 months. You have the option of purchasing o longer warranty. You can play Minecraft on Xbox One. I believe its $4.99 in the Xbox marketplace."}
{"product_id": "B001DPZE84", "context": "Can you make your own missions?  Can you get unlimited fuel?", "response": "Hi Phillip  Yes to both questions. You can go into the feature named Plan a Flight to set up a mission. Unlimited fuel is is the default setting. If you want to restrict the amount of fuel on board it can be done in the \"Settings\" feature.  Gary"}
{"product_id": "B00GGUMV46", "context": "What is a Season Pass?", "response": "Depending on the game, it can be added content on top of the regular game. There called DLC's or downloadable content. New missions, maps etc."}
{"product_id": "B004QRKWKQ", "context": "This product comes with the Wireless Gaming Receiver Xbox? este producto viene con el Receptor de juegos inalámbrico Xbox 360?", "response": "Yes, it includes the receiver also."}
{"product_id": "B000096L71", "context": "Does the instrument panel have Garmin G1000?", "response": "The GPS is not the G1000 although some modern Airliners, 747 and others, have the MFDs.  You can download for free the G1000 from Sim sites like FlightSim, AVsim, or Simviation. There are 2 different GPS versions, a G249 looks like a Handheld, and the G500, depending on the aircraft you select.."}
{"product_id": "B00CERXJNW", "context": "Hey, I'm a programmer and the one thong that really matters to me is: Can you adjust the G-Keys to type text? It would be very cool!", "response": "Yep! You can program the G keys do do virtually anything you want, including relatively long snippets of text. I believe there's an upper limit but I don't know what it is."}
{"product_id": "B0045ZB66I", "context": "Does this game run on windows 7?", "response": "Yes it does so flawlessly."}
{"product_id": "B007YLUCME", "context": "The controller won't turn on itself if I unplug the usb cord.  Is there a possibility of having a battery problem?", "response": "I never could get mine to work finally threw it away  it was a total waste of money"}
{"product_id": "B001WAKR3W", "context": "Can this mouse scroll right and left?", "response": "It scrolls up and down only. On Windows 8, if you can't go up or down, scrolling will automatically default to left and right.  If you are using Windows 8, you should checkout the Logitech Windows 8 mouse which does scroll left and right by swiping the mouse across the top surface."}
{"product_id": "B0096PLB9O", "context": "Is this unit compatible with 64-bit Operating Systems? I have seen some that are not, and I want to be certain before purchase. Using Win7x64..", "response": "I am using Windows 7 Ultimate 64-bit and it works great once it is installed"}
{"product_id": "B003YC4D9A", "context": "I just got mine in the mail and I'm wondering how do I connect it to the Wii U?", "response": "through a wii remote"}
{"product_id": "B0053B5RGI", "context": "Can it be played on the dsi xl 2d?", "response": "It can't be placed on a dsi of any sort if that's what your asking because they took precautions and put an overhang to keep it from going in the system(trust me I tried)"}
{"product_id": "B00GHTP7SS", "context": "This is only the code? Where do i download the game from after buying the code?", "response": "You have to have a steam account and you download it from steam."}
{"product_id": "B00BGA9YZK", "context": "Is this just another graphical showcase like Ryse was for the X1 or is there an actual game hidden in here?", "response": "Emmm, I'm not really sure but it does have an actual game in it, not just something like \"BEST VERSION\". I hope my answer might help u OwO"}
{"product_id": "B007SO6USW", "context": "Can I leave my controllers in the charging dock after they are done charging?", "response": "Yes..... When they are charging it lights up red. Once they are fully charged it lights up blue."}
{"product_id": "B00111SFEU", "context": "does this play the game sound or just chat", "response": "game sound and chat.   I am so totally satisfied with it.    You can even turn it up loud enough, if you want, that you can set it down somewhere in the room and everyone in the room can be heard.   We chat with my son that way."}
{"product_id": "B00F27JNGS", "context": "What is the difference between PSvitaTV and regular PlayStationTV?", "response": "Nothing, the PlaystationTV is just another name for the vita tv an alias if you want to call it that. I think PlaystationTV is what it's referred to in America where as Japan simply calls it the PSVita TV."}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes.  It attaches with screws, but it is shipped detached."}
{"product_id": "B0086UK7I6", "context": "I'm curious about the buttons behind the scroll wheel. In some images one of them is raised and in others they're not. Are they normal buttons?", "response": "Well the one on the top is to mode switch and the one that is raised up is an extra button. the mouse is awesome trust me."}
{"product_id": "B009K7QB8O", "context": "Is it compatible with Mac? or Windows 8?", "response": "Well I had windows 7 so most likely windows8 will work and not sure for Mac"}
{"product_id": "B00EZAWV6W", "context": "Does this work on iMac?", "response": "Hi. I don´t know. I buy this game and run it in my Hp laptop with 12Ghz"}
{"product_id": "B00EEMLRTS", "context": "If I bought this and bought a xbox one later, can it be transferred later? I had read somewhere that it was possible.", "response": "All of your downloadable content will"}
{"product_id": "B002JVX5V4", "context": "Does this work with Windows 8? We have a not-so powerful desktop running on Windows 8 and have concerns about it working. Any advice?", "response": "Works for me on Windows XP & 7.  I don't know if it will work on Windows 8."}
{"product_id": "B002BRZ79E", "context": "When you buy the PS3 version on Amazon, do you get a code when it ships? or do you have to wait for your physical copy to ship through mail?", "response": "I had to wait for my copy"}
{"product_id": "B00J6DLPLK", "context": "Is this a disk, or just a code?", "response": "it is a disk"}
{"product_id": "B00IIHU44E", "context": "How large is the internal hard drive?", "response": "500 gigabytes, but only 380 gigbs usable. so far thats the standard size for xbox one. With normal installs around 15 - 40 gigs it should fit somewhere between 10 to 20 full games"}
{"product_id": "B00I9UVY7G", "context": "This game include also clubs or just national teams?", "response": "Just national teams.  But far far more than in regular fifa."}
{"product_id": "B004774724", "context": "When I hit buy/download I see it says it is for vista/xp.  I have windows 7- will it work on that?", "response": "Yes. What you need to do first is download and install origin. After that, you put in your license code and it won't matter what version you are using it will download the appropriate software for your computer. I currently have ambitions installed on Windows 8."}
{"product_id": "B00FZ12F34", "context": "this Exclusive Amazon DISNEY INFINITY Infinite Bundle, with Sorcerer's Apprentice Mickey Figure is for PS3?", "response": "Yes,  the figures will work for most major game systems."}
{"product_id": "B007WWW2C8", "context": "Does this game require internet connection to play?", "response": "Yes it does.  You have to connect to the Steam server before you can play."}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the -box 360?", "response": "Yes, any skylander that says giants can e used for either xbox 360 or xbox 1 which is my console, email me at alex.carmichael2001@gmail.com for further help."}
{"product_id": "B00G6MW5CC", "context": "can single person play game", "response": "YES YOU CAN ,IT PLAYS SINGLE & MULTIPLAYER."}
{"product_id": "B005THAX5Q", "context": "this game is the spanish ?", "response": "This game is TRASH do not waste your money!"}
{"product_id": "B00E9I1FPI", "context": "Does it works in w8.1?", "response": "There would be no reason why it wouldnt. Things like driver issues with your computers hardware would be the only problem with 8.1"}
{"product_id": "B007Y7OP8K", "context": "Does this work on American Windows 7?", "response": "it fully english-translated...no issues there..."}
{"product_id": "B00DC9SWWE", "context": "Is there an online game code that comes with the game? I ask because there are some great used game deals for TitanFall.  Thanks.", "response": "No it does not have the code that makes it unplayable without it. I think that is your question? If so I hope this helps."}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "I did not receive an official controller.  It's a pretty good knockoff.  Only came in bubble wrap.  Doesn't have ANY logos or text on it, whatsoever.  I will likely be sending this back."}
{"product_id": "B00BMFIXZG", "context": "i just got this for my windows 8 toshiba and it is lagging so bad that i cant even get through the tutorial. how can i fix it?", "response": "Try setting the graphics to low. How many ghz is your processor, and how much ram do you have?"}
{"product_id": "B00166N6SA", "context": "Is this the original base game for the sims 3? I can't download it I need to buy a dvd. Thanks!", "response": "not sure because it has the \"Showtime\" extension included. At least the one I purchased even though it advertised as Sims 3 so...."}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "Did you follow the instructions on setting it up? There are some helpful videos on Youtube about it."}
{"product_id": "B00DE2W4PK", "context": "The playstation plus comes in the box?", "response": "buenos dias , yo compre este articulo y no me enviaron  en la caja la tarjeta para jugar en internet por 1 año la cual venia incluida en la oferta me gustaria saver que paso? o como hago para obtenerla? mi correo es pasyr25@hotmail.com"}
{"product_id": "B0050SYR74", "context": "Does it interfere with wi-fi?", "response": "Not that we ever experienced at all."}
{"product_id": "B009SJR28W", "context": "How big are the keys? The keys on my current keyboard (regular letter keys) are 1/2 an inch across measuring from left to right on the top surface of the key. Does this at least have 1/2 an inch keys?", "response": "They keys measure 1/2 inch"}
{"product_id": "B00CJ7IUI6", "context": "If I already have Skyrim and just wanted to add the expansions, would I be able to continue with my game if I got this or have to start over?", "response": "You'll be fine.. You'll just have to start fighting Vampires.. If you get infected by one and you don't want to be one.. Just go to Whiterun and use the Talos health shrine.. it will clear you up. Have fun.. it will be an interesting addition to your game."}
{"product_id": "B00BS520SG", "context": "will this work on wii mini for outdoor challenge?", "response": "No it doesn't. At least I couldn't figure out how to get it to work. I bought this for that particular game and ended up disappointed."}
{"product_id": "B001TOQ8X4", "context": "does anyone know how the gameplay is in this game, my son played the first one to come out and he likes it so im wondering if this game is like it?", "response": "Yes, better graphics, but gameplay is similar."}
{"product_id": "B005EQE0YM", "context": "Are these headphones wireless?", "response": "Yes, but they stopped working shortly after we got them"}
{"product_id": "B00286BZ4Y", "context": "Can you play multiple live players at home or just computerized players?", "response": "You can play with up to 3 live players at home."}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 7? I might as well ask if it works with Windows 8 although I am not a user of that operating system.", "response": "Yes, works with win7, I haven't tested it with win8. But i would think it works fine. Its plug and play."}
{"product_id": "B00B1N07QM", "context": "Wife tried Nostromo and her small hand felt slightly strained to hold  in the WASD position. Is this better for smaller hands?", "response": "I say its not for me at its shortest length its hard for me to reach the highest keys and it only gets even bigger can't imagine whose hands are that big everyone in my family has small hands ??"}
{"product_id": "B00CD1FC6G", "context": "Are the keys raised? I'm asking because it looks like it's very easy to clean if the keys aren't inside something.", "response": "Comes with key removal tool which very easy to use.  You won't be disappointed."}
{"product_id": "B00FLLFJ68", "context": "Is there a way to hang it or attach it to the wall?", "response": "No, there are no holes in the back for mounting."}
{"product_id": "B000B9RI00", "context": "Are the codes used for the xbox live or will we be able to use the codes after we purchase it", "response": "It was a physical card that arrived in a padded envelope. Code was valid, we've been enjoying XBoxlive for about 4 months now."}
