{"product_id": "B002AQNT96", "context": "will this game operate on windows 8, also does the pc version support LAN?", "response": "I know it works on a LAN, but I have not tried it on Windows 8."}
{"product_id": "B008XHCLFO", "context": "Can the top part be taken off? I simply want the grips not the whole protection part (though that isn't bad, but i think it's ugly)", "response": "It serves the purpose of comfort and ergonomics with just the bottom part. I leave off the worthless top part. I'm really happy they don't force you to do the top part actually."}
{"product_id": "B00HS5FETM", "context": "Can I use this as a connection between my Xbox One controller (with Adapter) and an Xbox 360 stock headset?", "response": "A stock 360 headset if its the one that came with it no sir it will not work. But if you buy the turtle beach headset adapter and this cord and a  cheap 360 turtle beach headset you can."}
{"product_id": "B004RMK4BC", "context": "does it work for Mexican accounts?", "response": "it doesnt, its only for the USA Store"}
{"product_id": "B006W3ZXEW", "context": "Is that a 7th button in the middle of the 6 side buttons or is it just a nub for resting your thumb.", "response": "It's a plastic nub that pops in. Has different sizes."}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "The game can be played offline, but the game does have a multiplayer feature."}
{"product_id": "B007TFOO6K", "context": "Compatibility chart does not list Windows 8, is this compatible?", "response": "I use this keyboard with Windows 8, and it works fine, software and all."}
{"product_id": "B00EZKNSTQ", "context": "how long is the cord on the Microsoft Xbox 360 Wired Controller", "response": "About 10 feet, longer than average."}
{"product_id": "B00D96BPL0", "context": "What adaptor do I need to purchase to be able to use these on an xBox one?", "response": "I second David L.'s comment. They sound great, too."}
{"product_id": "B0050SXKU4", "context": "do it comes with art work and map", "response": "It comes with the map"}
{"product_id": "B005J37I4Y", "context": "Can this work on px4", "response": "The right answer here is that you don't need this part for the PS4. You need to download an update to your bluetooth enabled turtle beach headset to be able to sync to playstation, but you don't need to plug anything into the controller, as playstation has native bluetooth."}
{"product_id": "B002JVX5V4", "context": "will this scrabble work on windows 8.1?", "response": "yes but I would not recommend it, I would look for another make, there are several out therethis one was disappointing and I wish I had not bought it"}
{"product_id": "B0050SVMYA", "context": "can we play gameboy advance games on the 3ds and 3ds xl?", "response": "No, the feature in the bottom of the system was taken away as the DSi was Relased, and wasn't added onto the 3DS"}
{"product_id": "B000WCCURW", "context": "Does this game have multiplayer mode?", "response": "Yes but I have never played it."}
{"product_id": "B00D84DRNC", "context": "Which section of the case is best suited to carry the 3DS XL, the large middle pouch or the more snug fitting inner pouch?", "response": "the front more open part better fits the xl."}
{"product_id": "B00HLT0YT0", "context": "Is this the WiFi or 3G model?", "response": "No it is WIFI only"}
{"product_id": "B000OYMYZQ", "context": "Will this work with the wireless version for windows?", "response": "I never heard of it working on a wireless pc, but order it and if it doesn't work you can always send it back; but it would be worth the try."}
{"product_id": "B00BI83EVU", "context": "I was under the impression that games would be able to be delivered to arrive by the release date.  Is this correct?", "response": "Pro-ordered with a delivery date of the 27th, and it's still showing In Transit with a delivery date of the 29th. Hardly as promised."}
{"product_id": "B0091A3AHA", "context": "does it have a battery", "response": "No this needs to be plugged in to an electrical outlet."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "All versions are on same servers. PS3, PS4, and PC players all occupy the same servers together without restriction"}
{"product_id": "B00B1N07QM", "context": "DOES A GAMING KEYPAD REPLACE A GAMING KEY BOARD?", "response": "It depends. Some games can be programed to the keypad in such a way you do not need the keyboard. Others it is much more difficult. I play a lot of RPG games that I find work better using both."}
{"product_id": "B00GHTP4ZY", "context": "does this include the main game plus the expansion or just the expansion???", "response": "This includes both the main game and the expansion."}
{"product_id": "B00CPKUV7K", "context": "Which disc do I load first or all 4", "response": "the first one and then it will prompt you from there as to the rest of the discs..."}
{"product_id": "B003JETPHS", "context": "Can you use the microphone and the drums at the same time?  I ask because I don't know that there are enough USB ports.", "response": "Yeah that's not a problem, or at least not for me"}
{"product_id": "B006W41X36", "context": "does it work with ps3", "response": "Yes ps3 xbox and pc"}
{"product_id": "B00DCDZM2I", "context": "are the characters compatible with the old Wii?", "response": "characters are usable on any system, just depends on the game, newer games support all while older games support up to the games' release."}
{"product_id": "B00C710AT6", "context": "Does this game work on a Windows 7 computer?", "response": "I can tell you it doesn't work on a Windows 8 computer.  Crashes halfway through every game.  Good luck on Windows 7 though."}
{"product_id": "B00CD1FCAC", "context": "A key's light already went out after a month. Is this a normal problem or i there a way to get a new one from the warranty?", "response": "I have had my keyboard for about a month and a half now and all the key lights still work, I hope this doesn't happen to me. And I am sure the warranty covers that."}
{"product_id": "B00G6YJ60E", "context": "Can I play this game Offline?", "response": "Yes you can play if offline"}
{"product_id": "B00BI9MDSO", "context": "is this water proof", "response": "Only from spills, but not submersion."}
{"product_id": "B0053B66KE", "context": "is it playable on ds or dsi", "response": "No, the Pokémon X and Y games are exclusively for the Nintendo 3DS family (3DS, 3DS XL and 2DS)."}
{"product_id": "B00AIALGZK", "context": "Does this game support windows 8?", "response": "yes, this works very well with windows 8"}
{"product_id": "B00E88G054", "context": "What is the weight like, compared to the Mazer Type R?", "response": "It's the exact same weight. One is wired the other is wireless not much weight difference exactly the same. My brother got the wired one I preferred the wireless"}
{"product_id": "B003O6N64Y", "context": "This headset powers off every five min due to \"lack of audio.\" Yet my Son is clearly talking.  Can someone tell me what's going on & how to fix them?", "response": "I haven't experienced that but like you said if there is no audio they do turn off  sorry I couldn't answer your question"}
{"product_id": "B00IVJ1M7M", "context": "I saw one review saying that this may only work for UK versions of games, is that true?", "response": "Well, the one i got probably only works 4 North American versions of 3ds games."}
{"product_id": "B0091WIOJ2", "context": "these headphones work with ps3", "response": "Yes.  360, PS3, PC, PS4, and Xbox One with Xbone headset adapter."}
{"product_id": "B0002XJBGE", "context": "Does this work on MacBook Pro?", "response": "Here is a list of Mac compatible Logitech Gamepads: Cordless Rumblepad (G-RA4A)Cordless Rumblepad 2(G-RC14)Dual Action (G-UF13A, G-UD8)Precision USB (G-UG15)Wingman Precision (USB) (G-UC3B)check this link http://forums.logitech.com/t5/Logitech-G-Controllers/Gamepad-f310-Mac-Compatibility-how-to-install-on-a-Mac/td-p/529274/page/2"}
{"product_id": "B00G21VQ2M", "context": "Will this work on a US vita? Or does it have to be a Japan vita?", "response": "All import vita/ps3 games will work with US machines. Menus are in japanese but here is a link to an english translation to use as reference when you are playing http://www.saiyanisland.com/2014/03/j-stars-victory-vs-english-menus"}
{"product_id": "B00D9FQ9CQ", "context": "if you have an xbox and use  it only for games on a disc... do you have to pay the monthly fee for the xbox LIVE?", "response": "No- that what I do. I don't pay anything"}
{"product_id": "B00CX8VYM0", "context": "Hello, I own both systems xb1&ps4 does anyone have a suggestion what system looks better or runs smoothly or are they both the same ? Please", "response": "Negligible graphics differences. Xbox has friendlier controls for assassin creed in my opinion, the Playstation controller isn't as ergonomic from the game play point of view."}
{"product_id": "B0050SYK44", "context": "Is the game brings the voices or subtitle in Spanish?", "response": "Not this version. There may be a spanish version available though."}
{"product_id": "B0018YXM3Y", "context": "does this this game run on windows 8?", "response": "Im afraid not, buddy. sorry"}
{"product_id": "B003ZSP0WW", "context": "Will this work on Amazon fire TV games", "response": "It conly works for 360 console."}
{"product_id": "B00D84DRNC", "context": "Does this fit New 3ds xl?", "response": "Yes. The New 3ds XL is the about the same size (may be very SLIGHTLY larger) as the current 3DS XL, and will have plenty of room."}
{"product_id": "B00886XQNQ", "context": "can i hear the game and the people in a xbox party?", "response": "No, I would not recommend these particular TB's..."}
{"product_id": "B0000A2TPE", "context": "Does it work on Mac? Is there a version of Zoo Tycoon that works on Mac?", "response": "It does. Just do a search on amazon for zoo tycoon complete collection for mac."}
{"product_id": "B009CL6LA6", "context": "how is this set chargered?", "response": "It comes with a cord that can be attached to any USB outlet (like your computer, PS3, etc.) and can be detached from the headset when fully charged."}
{"product_id": "B00CJD4HD2", "context": "Odd question but how loud are the button clicks for this mouse? I.e. would it annoy anyone sleeping in the same room as you? Or one room over?", "response": "about the same as any mouse i guess their not loud by any means but it does click."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 8", "response": "I don't have Windows 8 so I cannot respond to this question.  Sorry."}
{"product_id": "B000AOJ7FK", "context": "Is this game legit, like when you buy it you can download it and play? this is not a scam right?", "response": "The only ones i trust are those that are brand new in package cause you need the STEAM CODE to be unused. I bought 2 and didn't have any problems"}
{"product_id": "B00CJ7IUI6", "context": "What is the biggest difference between this legendary edition and the greatest hits version? if I just want to play the game, which version is best?", "response": "I don't know what the difference is. You'll have to google that."}
{"product_id": "B0050SZ0SY", "context": "Will it run on Windows 8.1?", "response": "i believe so, i ran it on 7, but have heard that all the 8 & 8.1 versions can run in an emulator mode for older versions if you need...it may run fine as is. have fun, it was a good game."}
{"product_id": "B008HPAXZ2", "context": "Is this compatible with the New 3DS XL that is coming out?", "response": "According to Nintendo the Screen Sizes are exactly the same so you should be fine! http://www.nintendo.com/3ds/features/compare#/compare-3ds"}
{"product_id": "B00FATRKLI", "context": "Can I play games purchased in Colombia, South America?", "response": "Yes if it is for Xbox 360"}
{"product_id": "B00ENFVJJO", "context": "Will it charge the Gold Wireless Headset ?", "response": "I don't think so, cause this charger have the specific space for the joysticks"}
{"product_id": "B00FZ12F34", "context": "Will this Infinity Bundle work with the Infinity 2.0 that comes w/ the super heros?", "response": "Yes, Just the Characters."}
{"product_id": "B00CBQO930", "context": "Does the scroll wheel click to intervals, or is it completely smooth?", "response": "It clicks to intervals."}
{"product_id": "B00IVJ1M7M", "context": "Does this work with the New 3DS XL?", "response": "Yes, but not on the new Pokémon x and y"}
{"product_id": "B0083H4NG4", "context": "Does this mouse have a \"Sniper\" Function?  IE..can you lower the DPI by pressing a button, then release it and go back to your normal DPI?", "response": "Yes it does.  Right on top, able to access with your finger, without taking your hand off of the mouse."}
{"product_id": "B005YR308S", "context": "the game is in Spanish language?", "response": "Hi, yes this game has option for audio in: English, French, Portuguese and Spanish, as well as the subtitles."}
{"product_id": "B004RMK5QG", "context": "I am located in Egypt. I tried to purchase the membership on the PS4 but Egypt isn't listed in the country list. Is it gonna work if I purchase this?", "response": "It's easy, Just create a new USA PSN account."}
{"product_id": "B00EZPCWWA", "context": "Can photos taken with the 2DS be downloaded to a computer?", "response": "Yes, Pictures that are taken are saved to the SD card that comes with the 2DS. You can then plug the SD card into your computer and get the 2D image that you want. If you take a 3D photo a 2D copy will be made. The 2D file is a JPG and the 3D file is an MPO."}
{"product_id": "B006W41X1S", "context": "Can I just play my games offline and hear game sound on headphones or do I need to play online?", "response": "You can play your games offline.  It hooks up directly to your TV and your Xbox."}
{"product_id": "B005BLAJRC", "context": "is this compatable with windows 8?", "response": "I would say 'yes' based on my experience with other Hoyle games. I installed Hoyle Puzzle and Board games 2012 on win 8.1 and it was fine."}
{"product_id": "B00519C7JC", "context": "Can I still play this game online as of July 2014?", "response": "i can play multiplayer till now"}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "Yes, i think...il play with my sony vita"}
{"product_id": "B004EJ0L8E", "context": "how long is the cord?", "response": "Cant give you a specific answer but its pretty damn long, (Btw, the only thing i dont like about this headset, is when i first got them the top cushion thing was really uncomfortable, but it's good now :P"}
{"product_id": "B00HPU96FI", "context": "Just got this cable from Amazon. Fits my 42\" vizio nicely. However, the screen colors are skewed and oddly green. Anyone else experiencing this?", "response": "I have a Sony Bravia KDL 46\" LCD I have not experienced the same problem you are I recommend reseating the plug in the back of the Dreamcast again very firmly you may have those pens are such I would do the same thing in the back of your TV as well"}
{"product_id": "B00CJ7IUGS", "context": "Do I have to start a fresh game to play the DLC? I have a level 12 character and I don't want to start from scratch.", "response": "You do not mister sir, although it doesn't really matter if ya do or not, but I have before and not much of a difference in the beginning so it's up to you, not mandatory"}
{"product_id": "B008HPAXZ2", "context": "It's only one screed protector filter?", "response": "No there are 2, top and bottom part"}
{"product_id": "B0050SZBP6", "context": "Will this work on Windows 8?", "response": "Yep, it sure does.  Even though Windows 8 is terrible..  You'll need the product key (inside your game box) when it prompts you to enter it.  Try going to us.battle.net/wow and look at the forums for help there if you have any further issues.  Good luck!"}
{"product_id": "B00BMFIXKQ", "context": "The game is in English or multi language? has any subtitles at least? Which?El juego esta en inglés o tiene múltiples idiomas o subtitulos ? Cuales?", "response": "Como ya te respondieron se puede cambiar el lenguaje en el menu"}
{"product_id": "B00GOOSORM", "context": "do u need it if u buy the ps3game", "response": "Moghouse is where you pay for your subscription fee so it will and should work for PS4/PS3/PC. Its like having a gift card for the game and not having to use a Credit Card."}
{"product_id": "B004RMK4P8", "context": "hello, the code they send me to my mail? live outside the US, but my account is USA", "response": "Hi you can buy any code gift you want any time simply add to your card by Amazon payments but must your account be a USA"}
{"product_id": "B00BMFIXT2", "context": "does it have any downloadable content?", "response": "No it had no downloadable content the first disk is the game and the second disk it to show you how to play it's a great game"}
{"product_id": "B00A0EPNPI", "context": "Does it have a mic?", "response": "It has a mic port, but no built in mic."}
{"product_id": "B007FTE2VW", "context": "Do you have to install with origin", "response": "Yes because Sim city connects and is run by EA though u can go offline EA requires u to have and enter a key through origin"}
{"product_id": "B00286BZ4Y", "context": "Is this multiple choice?", "response": "Yes. But the game doesn't function well in a multiplayer mode. There are a few glitches that don't allow the other players to anser the questions before the time runs out. I wouldn't recommend this game. I actually uninstalled it from my PC."}
{"product_id": "B00B67ZTUW", "context": "How does this series compare to final fantasy?", "response": "The only similarity there is that almost each game is a completely different story not related to precious games. Battle is not turn based, gameplay and graphics style are original on the series."}
{"product_id": "B009DL2TBA", "context": "does it play Japanese games", "response": "Yes. The PS3 is \"region free\", however if you plan on buying any downloads for those games, you would have to buy them from the Japanese Playstation Store."}
{"product_id": "B00ECOBFA4", "context": "is there a free play mode", "response": "Yes after completing the level it opens free play"}
{"product_id": "B00D96BJSO", "context": "Does this headset have mic monitoring?", "response": "No it does not"}
{"product_id": "B00BGGIWZM", "context": "When you 1st get into town do they show how to play it, or you have to know it from the other games?", "response": "its got a tutorial which will assist in playing the game but its very easy to play even without the tutorials."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "PSN only license the game to play on one Platform.  Unfortunately if you want to play it on PS3 you would have to buy the PS3 version of the game.  The game will only play on PS4 only. I hope this answers your question!  =)"}
{"product_id": "B00DC7O3K6", "context": "for how many players?", "response": "Up to 4 players in some games"}
{"product_id": "B00F27JDUY", "context": "can i change the full internal language to english?", "response": "Yes. When you first start the system up it asks in English what language you would like the system to be in"}
{"product_id": "B003ZJ1VD8", "context": "What colour is the back light?", "response": "It should be the Grazer Blackwidow Ultimate that has backlit."}
{"product_id": "B00H7KDNBO", "context": "Can I play when I'm offline.", "response": "No since its a multiplayer only game. There is no \"real\" single player."}
{"product_id": "B0098F1Y3K", "context": "Is Brainage suitable for a 12 year old?", "response": "A patient 12 year old"}
{"product_id": "B00004XRBB", "context": "does it work on Windows 7?", "response": "on a 64bi windows 7t, it works like it's running on 98"}
{"product_id": "B00G0OYHCW", "context": "Does it come with a hard copy of the games or download codes? I was looking to get the used version but do not want to risk getting a used code", "response": "hard copy, one disk of both games."}
{"product_id": "B0050SZBP6", "context": "Will this work on Windows 8?", "response": "I personally run Windows 7 but another user on Amazon.com claims the product works on Windows 8.  I apologize for not being more helpful."}
{"product_id": "B00E369SDM", "context": "What comes with the PS3? Cords? Controllers? Or just console only?", "response": "Power cord, S-video cable and usb charge cable for the controller. No HDMI cable though :("}
{"product_id": "B00J6DLPLK", "context": "For a big fan of Nier, who deeply love the narrative and characters. Would you recommend this game? (Really don't mind the gameplay)", "response": "Great character development, very distinct personalities and an awesome reward system will keep you wanting more! MORE!!!!!!!!÷÷"}
{"product_id": "B001V9PTVE", "context": "will it work with windows 8.1?", "response": "I bought this off of here. I have windows 8.1, Fallout tactics won't work but Fallout 1 and 2 will."}
{"product_id": "B00EEMLPR2", "context": "Is the camera for the game or can you use it for anything?", "response": "The camera can be used for anything. It takes good video as well"}
{"product_id": "B00965WK8K", "context": "Is the scroll wheel smooth or regular (tiny or normal rotation for each scroll increment)?", "response": "The scroll wheel isn't smooth. So it doesn't keep rolling after you have spun it. I'm pretty sure it's regular."}
{"product_id": "B00IVJ1M7M", "context": "does the 3ds action replay work on games downloaded onto the system? or do you have to have the game card for the game?", "response": "No you need the game card"}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "I'm not sure if wifi is required (as it is on disk you wouldn't need it) but it does take a long time to download, around one to two hours."}
{"product_id": "B005HN5LKY", "context": "What if the adapter break.", "response": "Then you should probably buy a new adapter."}
{"product_id": "B00DWXUYN0", "context": "Is this case compatible with the New 3DS XL?", "response": "Yes, that's what I got it for and it is a perfect fit."}
{"product_id": "B002TLTBN0", "context": "Does this work for Wii games if playing on a Wii U?(for example Xenoblade Chronicles)", "response": "I don't know if work for wii u, but you can play xenoblade with the classic control. By the way the best RPG of the wii generation."}
{"product_id": "B00CD1FC6G", "context": "Anyone using it on Linux (specifically, ubuntu)? If so, maybe you can mention how compatible it is", "response": "Volume up down and mute work out of the box. I'm not sure what the other key up to is as I have no need for more keys that the normal ones and volume. (I run arch and volume icon for the controlling of it.)"}
{"product_id": "B008GEH9HO", "context": "can you use old games that were purchased for a DS and a DSi?", "response": "Any DS game should work with the Nintendo 3DS."}
{"product_id": "B00503EAG2", "context": "Can you play this game offline?", "response": "Yeah! You can play the campaign without an internet connection! :D"}
{"product_id": "B00AJZNUUI", "context": "do the regular wii controllers work with the mini?", "response": "This is a christmas gift have used yet."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay for online multiplayer or is it free?", "response": "if you have xbox you have to have xbox live to play online same as any xbox gameI believe ps4 requires PSN but im not surePC is free"}
{"product_id": "B008SBZD9G", "context": "Which is better the steam version or the FF14 client? (I mean the steam version uses the FF14 client anyways right?)", "response": "They're the same clients ... one you login through steam the other is a stand alone client."}
{"product_id": "B00HK74G2E", "context": "Blue 250gb PS3 font is 120/240v?", "response": "120V....also get a vertical stand looks even cooler"}
{"product_id": "B002Q4U5DK", "context": "Can this mouse be used as an ambidextrous mouse? I use my left hand to surf the internet and control my computer and use my right hand for gaming.", "response": "Well its possible but i wouldnt recommend it since it has a right handed grip. If you want a good ambidextrous mouse i recommend the razer taipan. Heres the link to its amazon page. http://www.amazon.com/gp/aw/d/B008BGXYBM/ref=mp_s_a_1_1/182-9838383-2767566?qid=1408807574&sr;=8-1π=SY200_QL40"}
{"product_id": "B002CJ8Z04", "context": "how do you know if it is a fake or real game, thanks.", "response": "Because I used to own the game and know how it looks and every time I'm in the middle of the game it restarts."}
{"product_id": "B00BGA9YZK", "context": "Does it come with a redeemable code that I need, or need to play online?", "response": "No, just ps plus."}
{"product_id": "B00DTWES6I", "context": "does this code work on steam   or will splinter cell be stored in a separate game library on amazon.", "response": "It will roll over to UPlay....much like Steam but not.  At least that was what happened with mine."}
{"product_id": "B004RMK4BC", "context": "when you put in the credit card is it taking off your credit card or your amazon credit", "response": "I used my credit card"}
{"product_id": "B007TFOO6K", "context": "is this keyboard audible? like, can i hear the key when i type? (getting the cherry mx blue)", "response": "yup it does with the brown one. :)"}
{"product_id": "B000H1V56U", "context": "Does this work with the XBOX 360 core? And does it actually improve performance?", "response": "Yes it does work with xbox 360 but not the slime version.  no it does not improve performance it looks cool"}
{"product_id": "B00DC9SWWE", "context": "This game has to be used with a XBOX hard drive.  I got some advice that it needs an 'internal' hard drive that costs $100+.  What is the correct product to use?", "response": "You need one of the internal Xbox 360 hard drives. Get the official Xbox branded drives from Microsoft themselves. The 3rd party HDDS are lower quality and can get your console banned. USB devices will NOT work, not even external USB hard drives."}
{"product_id": "B00BI9MDSO", "context": "It's been about 2 years since it was released. Can it now fit the PS Vita Slim comfortably or do you still have to push on it hard?", "response": "Hi, I own both vita systems and they fit perfectly fine. I bought two to protect them. You can buy it without worrying"}
{"product_id": "B0029M6VKA", "context": "Can the device be fitted to the side of the monitor? Or does it have to be the top?", "response": "I'm sure that with a little creativity you could figure something out for that. But why would you want to? It's designed to mount on top center of the monitor and works quite well from there. As you move from center, it will work, but you will get progressively decreasing performance particularly when looking to the opposite side."}
{"product_id": "B00EFFVZP0", "context": "does the ps3 version comes with free dlc?", "response": "My son said no it doesn't; you have to buy it."}
{"product_id": "B00503EAG2", "context": "How long does this take to install complete?", "response": "10 min might have been"}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "Yes, this game is for the Playstation 4 video game entertainment system. There is very little to no violence in this game, if you enjoy training dogs, then this is the game for you my friend.*Featuring 50+ breeds of dogs*Next-generation dog AI"}
{"product_id": "B00DRKJBC8", "context": "I'm currently hospitalized and on a netbook. If i buy this will I be able to transfer this to my home computer?", "response": "Once you have it on steam it carries over to any PC you have."}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "Yes it does work. If it is extremely laggy(which it shouldn't be) then you have to enable compatibility but you should be good."}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "It is one of the most intuitive methods for play Elite: Dangerous, that I can think of. There are more than enough switches and buttons to be able to map all of the commonly used commands that it is just a pure joy to fly with it."}
{"product_id": "B002W8D0EQ", "context": "what is the difference for play station network card and the play station store card", "response": "there is no difference they can both be used for the same purpose"}
{"product_id": "B008X73CE8", "context": "Will this run on windows 8?", "response": "Yes I have windows 8 and it runs excellent."}
{"product_id": "B003O6G5TW", "context": "Does it come with multiplayer or?", "response": "EA has recently made it so there is no more online passes, online should work for you if you have Xbox live"}
{"product_id": "B00IU3MSF4", "context": "can this play original xbox games", "response": "Yes .and u can see youtube"}
{"product_id": "B006JSY3MI", "context": "Can it run on windows 8?", "response": "I run it on Windows 8.1 pro with no issues!"}
{"product_id": "B00BT9B2LC", "context": "Hi, what is the system version of this 3DS?", "response": "This system version is automatically updated on the internet.The display size of 3DS LL is 1.9 times bigger than basic 3DS. If you have any question, Please let me know.Best RegadEri Okamo"}
{"product_id": "B0096L2SJ0", "context": "Can I use a an rechargable batteries and does it fit an Galaxy Note II? Because its near 3.2 inch (81 mm) limit?", "response": "Rechargeable NiMH batteries work fine.  As for large smartphones, you don't have to snap it in.  You can get a separate stand (I recommend the Anker Multi-Angle Portable stand from Amazon) and hold the controller in your hands. This controller also works great with VR apps using the Google Cardboard viewer (which give an incredible experience!)"}
{"product_id": "B005G4CXPK", "context": "Am I able to use a keyboard and mouse to play or do i specifically need an Xbox controller that plugs into the USB port", "response": "You can use the keyboard and mouse, definitely. No need for a controller."}
{"product_id": "B00J128FPA", "context": "Do you have to be logged into PSN and what about the game patches issued every two months or so?  Will you get those?", "response": "I think you must logged to play patches will automatically download on your console. ..I think"}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "No nudity, but there is language the \"F-word\" is used maybe one time. He beats the man and says \"You God da** f***ing nave!\" I think that is the only time where it is really bad."}
{"product_id": "B002I096AA", "context": "can i play older gameboy games on this such as pokemon yellow?", "response": "No. But you can download the older games such as pokemon yellow through the Nintendo store."}
{"product_id": "B00F2ENJY8", "context": "HD Possible?  Or at least widescreen?  or does it lock you into 480i?", "response": "It is not capable of any form of HD as it only ouputs 480i via a RCA cable."}
{"product_id": "B009WI7V9E", "context": "i already have B1 on steam and beat it on hard, is being stuck with a controller worth buying this?", "response": "I thought it was well worth it. It had both games and all the dlcs for very cheap"}
{"product_id": "B000LQ4HTS", "context": "Is this available for windows 7 ???", "response": "Yes, works with xp, vista, 7 and 8 - may have to download the proper version from their website, http://saitek.com/"}
{"product_id": "B008XHCLFO", "context": "Does this game help alleviate hand cramps playing Mario Kart 7?  I am getting lots of cramps in my index fingers keeping them on the shoulder buttons.", "response": "My son is the one that uses the 3DS XL but from the times that I've played it I do feel a difference on the way your hands grip around the handles.  It is more a more natural feeling which of course helps you play for longer periods of time.  I hope my answer helps."}
{"product_id": "B008YA9BVC", "context": "How do I test the Mic? What games are headphones good for on the Wii U?", "response": "wii u to wii u calling program.black ops 2ghostssuper smash bros (only for multiplayer with friends)also probably works in a computer with mic test,"}
{"product_id": "B007TYC8MI", "context": "Was this new copy supposed to include an online pass voucher?", "response": "If you bought it brand new then yes...idk about pre owned......but my did come with an online pass"}
{"product_id": "B00BT9B2LC", "context": "Is the Japanese 3DS compatible with an American 3DS charger?", "response": "Yes! I use the original charger that came with my NA 3DS to charge my JP 3DS."}
{"product_id": "B00E6OLJ88", "context": "Can i have a list of all the mods in the order of when you press the button on the back", "response": "If I order it December 24 when will I get it?"}
{"product_id": "B00D3TRMD8", "context": "is this the full version game or is this just the online code that I need to play this game.", "response": "This is the online code needed to activate the game on Steam."}
{"product_id": "B005HN5LKY", "context": "did it take a long time for it to get here?", "response": "Heavens no. 3-5 days. Or, 1-2 days. Depending the shipping rate you choose."}
{"product_id": "B008J16AP6", "context": "Is it a region free media? I have bought my Xbox 360 in Europe and, in order not to have compatibilty problems, I buy only region free games.", "response": "I did some research online and I believe it is. This game works on all 3 Xbox 360 regional consoles according to list I found."}
{"product_id": "B00AAQRNQ8", "context": "How does this feel in the hand? Cheap? Sturdy?", "response": "It feels somewhere in the middle. I loaded mine with most of the weights and it feels a lot better. My problem is that the shape and feel of it in my hand is wrong, its shaped more for the left hand than the right. It's sort of awkward."}
{"product_id": "B001GIOGBY", "context": "Do the mixture and prop controls work properly?", "response": "Yes.  Both work on an axis just like the throttle.  If you watch the lower cockpit, you can see the aircraft controls move in response."}
{"product_id": "B0029M6VKA", "context": "What is the shipping weight and size?", "response": "The package is probably the size of an average set of headphones bundle. The TrackIR 5 device is actually really tiny. Probably half the size of a credit card, and half an inch thick. Package weight is maybe a pound, but that's because of all the plastic and such for protection.Hope this helps!"}
{"product_id": "B008U5ZNIG", "context": "I have a razer black widow (mx blue) and some keys feel different. They make a weaker click sound and tactile feel when pressed. Is this normal?", "response": "Yeah I am pretty sure that's normal. But if its something that you feel messes with performance then you should contact Razer and they will swap yours out for a new one. They have really good support."}
{"product_id": "B00E9I1FPI", "context": "i already downloaded the base game of Skyrim off steam. will your disk allow me to have all the expansions added to my existing game? or a new game?", "response": "it added them to my existing game.  dawnguard, hearthfire, and dragonborn."}
{"product_id": "B002BRZ852", "context": "Are explicit sexual acts done in this game? I was told very detailed sex acts were shown.", "response": "NO its a zombie game not a sexual game, for ex.   G.T.A.V."}
{"product_id": "B00HHUSNPU", "context": "If the silicone affects the movement can it be worn down to the point where the movement is not affected by the case?", "response": "Not sure It was affecting my stick movement I just took them off and through them out."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "I am sorry to say that I don't know, but please notice that there are two different versions out -- one is for Vista Home Premium and Windows 7 --- the other is for Windows 98/Me/95."}
{"product_id": "B002DUCF7Q", "context": "Does it work with DCS?", "response": "Hello, Currently there are no official plugins from or for DCS, as you may need a third party plugin to get the panel to operate."}
{"product_id": "B000056SPM", "context": "Is this only for flight sims, or can this be used for all driving games as well?", "response": "It can; absolutely. The driving wheel has a more natural feel, but you can definitely use this for driving simulator's too."}
{"product_id": "B008MI7MWQ", "context": "Has the Cleopatra slot machine game by Encore been fixed?", "response": "no. I returned it"}
{"product_id": "B002RYLG4Q", "context": "how well would it work on a samsung flat screen tv?", "response": "It works fine on my 32\" Samsung HD LCD tv. But don't expect HD quality."}
{"product_id": "B008SBZF2Q", "context": "will this work with PS2?", "response": "I really can't say for sure. This was an item on my grandson's Amazon Wish List and I had it shipped to him out of state. Sorry!"}
{"product_id": "B009GZX49Y", "context": "is this a 3 games full disc set??  or  the games are for download?", "response": "You have to download AC2 and Brotherhood. And to play Revelations you have to have the disc in."}
{"product_id": "B001GROEEO", "context": "may  iuse it in costarica", "response": "Yes, is the better (almost the only) way!"}
{"product_id": "B00CD90R4K", "context": "I ordered this item, and received the Central/South America version (with Messi, Vidal and Falcao on the cover). Will this work on PAL?", "response": "If it's new, u have no problem... U certainly enjoy it... But used u wil regret as I used  a used one, which looked like new just for a week"}
{"product_id": "B00166N6SA", "context": "Can it work with Windows 8.1?", "response": "It works with xp.  I assume it is forward compatible"}
{"product_id": "B00EZKNT18", "context": "Can you turn the rumble feature off?", "response": "Depends on the game but I go in settings and turn it off."}
{"product_id": "B001CXYMFS", "context": "Can you detach the throttle but still use it?  Say if I wanted to mount the throttle on the left arm of my chair, and the flight stick on the right?", "response": "The two detach, and the throttle can still be used, but I don't think the connective wire is long enough to span between two arms of a chair. Maybe a foot, foot and a half tops."}
{"product_id": "B008SBZD9G", "context": "Is it a Steam version or can I directly punch in activation code in FF14 client? I would prefer a direct activation code that can be used in 14 client", "response": "No matter where you buy it from, you get a code to use through the account. But if you want to use the game through Steam, you have to buy it through Steam."}
{"product_id": "B009IR1SR0", "context": "will it work for mac?", "response": "No it's Windows only and requires the software from origin.com, runs in a boot camp partition though!"}
{"product_id": "B00IYWV5HS", "context": "So in order to gift this, I just email the person the code? That's it?", "response": "Yes. as long as the gifted has access to broadband..."}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "Yeah, you can put the shift knob anywhere you want(: on a banana or the left side. Where ever you want. There are 3 totally separated parts. The pedals, steering wheel, and the shifter knob. Have a fantastic day bro(:"}
{"product_id": "B00DGZDFO4", "context": "The download includes the game or just the code to play online?", "response": "It is a code but you own the game,  which means that you do not have to be online to play.  Some features may not work without being connected to the Internet."}
{"product_id": "B00562O8U0", "context": "my tv is a Samsung and infrared / shutter/ battery glasses. one of the first 3d tv. will they work ? I really want them for mulitplayer", "response": "As far as I know, they should work perfectly. My 2010 Samsung TV also uses infrared and shutter glasses. I believe Samsung switched to bluetooth in 2011. I haven't played any 3D games with the system, but 3D movies work fine."}
{"product_id": "B00DBCAT3W", "context": "Is Fable Anniversary like the original Fable or is it more like Fable: The Lost Chapters?", "response": "It has all the upgrades, plus extra content."}
{"product_id": "B00H45K6KS", "context": "Is the language uesd in the game Japnese or English? I am looking for the Japanese version.", "response": "English for this one. Here is a link to the Japanese version: Atelier Escha & Logy: Tasogare no Sora no Renkin Jutsushi [Regular Edition] [Japan Import]"}
{"product_id": "B00BMFIXEW", "context": "is the sexual content strong in this game or mild,", "response": "After playing with this game for a while I don't think it has any sexual content. It may have scenes but it doesn't involve any nudity."}
{"product_id": "B006W3ZXEW", "context": "This could potentially be a stupid question, but: Is this mouse good to play League of Legends with? :]", "response": "It is good since one of the mouse theme is league of legends. I have tried all three of them pretty much the same"}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "Yes.  No problems that I've seen after several weeks."}
{"product_id": "B00IRHE892", "context": "Can the Back and Forward buttons be customized to do in-game actions like throwing a grenade?", "response": "Yes all the buttons can be remapped using the software"}
{"product_id": "B0018YXM3Y", "context": "Does this game run on windows 7 ?", "response": "Unsure as I have never tried it on W7.  Sorry"}
{"product_id": "B009AFLXZM", "context": "does it work with just dance2015", "response": "it is supposed to but mine does not."}
{"product_id": "B0076HD2W8", "context": "Will this still work without a CD Drive?", "response": "Mine did but not on all computers. Tried it on a friends and would not work without a download. Google downloads and that should do it."}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "The gears nob is separate and can be moved anyplace you can mount it. I used The edge of some scrap plywood."}
{"product_id": "B0017Q4DGI", "context": "can you use this game on a mini Wii?", "response": "not sure, I don't know that much about the mini Will"}
{"product_id": "B0000695GX", "context": "What about Windows 8?", "response": "It Should Work In Compatibility Mode"}
{"product_id": "B003S9WJ9A", "context": "Do you need 2 xbox's to transfer? I want to move my games from my 120G HD to a new 320G", "response": "No.  That's the exact reason I bought mine."}
{"product_id": "B00CTKHXFO", "context": "If I buy this game today, will I be able to download the content or did the codes expire?", "response": "I would say your safe, I just looked at my code insert and there is no expiration date that I can find."}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "No you need to updated model. This only works on the original vita."}
{"product_id": "B00DC9SWWE", "context": "My son is about to be 11 and is dying for this game.  I've never bought him an M rated game.  How is the violence and language in this game?", "response": "It's fine. No blood just mechs shooting each other. Even knifing had been replaced by kicking. The only thing is you cn break people's necks from behind. I'd let my daughter play if she liked gaming."}
{"product_id": "B008J16AH4", "context": "does this game have multiplayer mode?", "response": "No, it does not. It is single player only. But my kid and I go back and forth until one of us gets 3 stars."}
