{"product_id": "B0011E4J7O", "context": "can you use it on a black xbox 360", "response": "My son believes it will work on a black x box 360 but he isn't 100% positive."}
{"product_id": "B0050SVHZO", "context": "Is the Wii U backwards compatible with Gamecube Games and the Wavebird Wireless Gamecube controller?", "response": "It is not backwards compatible with gamecube games, only Wii games.  A GameCube game would probably break your Wii u.  Most of the original wiis are GameCube backwards compatible with GameCube controller ports.  The controller, not unless you have the GameCube controller adapter"}
{"product_id": "B00B70WKUK", "context": "So is this like a steam key? Or a physical disc?", "response": "You can get either one...I ordered a physical disk"}
{"product_id": "B000ZKA0J6", "context": "does this version work on a mac? it seems like you can only shop for this version of the game.  I have mavericks, will this work on my macbook pro", "response": "Im sorry but I cannot answer that question.  This was purchased for my grandson."}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "I'm happy to say that the headset will work with Netflix, YouTube, and any other app that is on the Xbox One. If its on the Xbox One you'll get sound from it. This also works with your 360 if you have that piggyback through your One as well."}
{"product_id": "B004FS8LYK", "context": "This game is Spanish or subtitled in Spanish?", "response": "my game is in engish,no spanish  subtitle."}
{"product_id": "B000IBQLOU", "context": "How does this stand up to jumping? I tend to be a jumper when I'm playing, and i was wondering if this is going to slip?", "response": "It slides on hardwood, but slightly less on carpet."}
{"product_id": "B00E88G054", "context": "Is there any way to turn the lights off? The lights stay on, even when my computer is off.", "response": "The lights turn off when you shut your computer off completely. Putting your pc on sleep does not turn off the lights."}
{"product_id": "B00I5LMSE2", "context": "Are the controls easy to learn?", "response": "for my 10 year grandson they were."}
{"product_id": "B00ARD5410", "context": "What are the dimensions of this mouse?  In the product description the dimensions listed make this mouse bigger than my keyboard.", "response": "It is roughly hand sized. Average hand though none of that tiny hand stuff."}
{"product_id": "B002JTWODG", "context": "is the backlight blue or green?", "response": "Thanks for getting back to me so quickly!"}
{"product_id": "B00CMC6HCY", "context": "Will there be a Game of the Year edition released with all DLC included on the disc?", "response": "This is the older game. The only way to obtain the dlc is by purchasing unfortunately. The new version of this game has been released. Search wwe 2k15"}
{"product_id": "B008TP1OKI", "context": "I have the red ring of death now ever since inserting the hard drive. It fits perfectly and I hear the click it makes when I insert it.", "response": "Does it work when you pull out the hdd?  Even though it isn't a Microsoft certified it should still work 100%"}
{"product_id": "B00BMFIXEW", "context": "can i play with the wii plus control like a sword?? i mean if i have to move  like if i were figthing??", "response": "The game pad is an option and the wii u pro controller is an option but there is no remote support."}
{"product_id": "B0033WFJFS", "context": "how do I get the instructions to use this control", "response": "just plug it in. Each game should have an option to program the keys. Or you can go under computer, after hitting the start button, then right click and go to  properties. hope this is helpful."}
{"product_id": "B00ATF5YYI", "context": "Is this the complete version (just like the one on Steam) that has all DLC? I'm pretty sure the DLC isn't even sold separately anymore for downloads.", "response": "Yes the DLC are free this is the last Cod that have new maps  with the patchs."}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "Saitek now shows compatibility with Windows 8    http://www.saitek.com/uk/prod/pedals.html"}
{"product_id": "B004L6C6BK", "context": "Will this work with my astros A-50??", "response": "No, wtf? Astro A 50 already has a mixamp built-in. A Mix-Amp Pro will not work with the A50. But you probably already bought it and found out about it the hard way."}
{"product_id": "B00656HLGO", "context": "Just to confirm, will this work with the Xbox 360 Arcade console?", "response": "Nope comes up unable to read. Save your self some time and go only with licensed Xbox gear"}
{"product_id": "B00DCDZM2I", "context": "My grandsons have the trap team portal. Do they need this portal and disk to play the swap team characters?", "response": "I believe so, yes. This is my first purchase, but my nephew has the trap team and those characters do not work with this."}
{"product_id": "B00BZOBE78", "context": "my laptop doesn't have a cd drive. Does it have a code inside", "response": "Buy the digital download version, not the physical copy. Also Brave New World is an expansion pack that requires the original Civilization 5. Double check that as well."}
{"product_id": "B00CRL9TU2", "context": "If I install GT6, can I still play GT5 on the same machine? I'd still like to race the awesome cars I earned in GT5 even if only in GT5.", "response": "Yes, the are independent games."}
{"product_id": "B003OZOAKY", "context": "Will Rome Gold Edition work with Windows 8 ?", "response": "Yes. In fact it will work on windows 8.1 even."}
{"product_id": "B001E27DLM", "context": "it works on Nintendo 3ds?", "response": "It does. 3DS is backwards-compatible, and plays all Nintendo DS games."}
{"product_id": "B00A378L4C", "context": "are the leds very bright?", "response": "Acutally it has 5 levels of brightness. You can adjust it by yourself. Well, of course level 5 is very bright. I use level 1. That's perfect for me."}
{"product_id": "B002I0IIPY", "context": "Can you skip through the cut-scenes or are you forced to watch them? I hated them on Sonic unleashed.", "response": "You can skip them."}
{"product_id": "B002I0K3PM", "context": "Is the game worth the price?", "response": "It's worth the price, but not the Amazon price where they are scalping the game from 70 bucks to over 80.  Go digital and get it from the eShop at $59.99"}
{"product_id": "B00H3VJYD8", "context": "will this work on windows XP? i am wanting a contorller for astronat simulatior.", "response": "Yes.You have to install the driver. Plug it into your USB. Then go to Windows update."}
{"product_id": "B00D6NPFDK", "context": "What language is this game in? I recently purchased a differnt one in Spanish accidentally and I need an English version.", "response": "This one came to us as the English version. Our kids love this."}
{"product_id": "B006NU6HAS", "context": "Will this PMDG 737NGX software work with Microsoft Flight Simulator 2004?", "response": "No, it only works with FSX and must upgrade to service pack 2 (this is downloaded online)"}
{"product_id": "B0071NH8B8", "context": "Can you use this with regular WiFi, or do you have to buy the AT&T thing?", "response": "Yes you can use it with regular wifi, I use it every day without any 3g chip in it."}
{"product_id": "B00FXOP1JI", "context": "Hello and place the order for my product, I wanted to ask, please wish my product is in its original box, I do not want another box for my other packa", "response": "mine came in original packaging it looked as if it was never even opened!"}
{"product_id": "B003VUNWG0", "context": "Loads great, but will not play. What do i need to do to correct?", "response": "You are not missing much as the game is a let down being from Hoyle"}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "It CAN be programmed, and by default, its behavior is different in different settings... ie in the browser, it selects text, sorta like double right clicking a block of text.  I just reprogram mine so I'm not sure exactly what the behavior is elsewhere..  Their software is easy to use, though, so it's all good."}
{"product_id": "B00IIHU44E", "context": "How large is the internal hard drive?", "response": "500 gigs I believe, I'm not at home or else I would look at the box."}
{"product_id": "B00GHTP4ZY", "context": "We have a Windows 8 machine-will this work on it?", "response": "Yes it works onnours"}
{"product_id": "B00EFFW0HC", "context": "Can I use a memory unit", "response": "You will have to have a hard drive in the XBox with at the least 4gbs. You can buy a hard drive off amazon or GameStop, the Xbox Slim uses laptop hard drives"}
{"product_id": "B0081GA50U", "context": "Does this fit the 2000 series?", "response": "I'm not sure I got it for my ps vita the very first one that came out"}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 7? I might as well ask if it works with Windows 8 although I am not a user of that operating system.", "response": "It says Compatible with Windows 98/ME/2000/XP/Vista with Direct X 7.0a or above but it does work on my laptop win 7 and pc win 8."}
{"product_id": "B00CJD4HD2", "context": "Does this mouse have the same clicking issue as the G500. i.e Sometimes it doesn't register a click, sometimes it double or triple clicks.", "response": "I haven't noticed it missing clicks or double/triple clicks. The only thing I noticed is that it will sometimes go to \"sleep\" when not in use, however, moving the mouse will bring it back."}
{"product_id": "B00008J7NZ", "context": "does this game work on Xbox 360", "response": "Yes, just like any other great Xbox game, Halo 2 is compatible with Xbox 360, for any other games you wish to know is compatible or not, there is a complete list on Xbox's website."}
{"product_id": "B00JM3R6M6", "context": "Can you play the Tomodachi Life on a regular Nintendo DS?", "response": "You can't unfortunately. The 3DS cartridge has a little notch that prevents it from fitting into older systems"}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "Nope, just an HD TV, the higher quality the better but you don't need it"}
{"product_id": "B005BLAJ68", "context": "i just bought a new computer think it was windows 8.1 will this work for my system", "response": "Yes.  Our system is 8.1 and it loaded and runs without any problem."}
{"product_id": "B007A7UJ4S", "context": "does the game come with the spell book, like in japan", "response": "No its just the game and the manual booklet"}
{"product_id": "B00H72EMP8", "context": "can you hear your own voice with this headset?", "response": "I am sorry this response took so long.  You can not hear your voice through these."}
{"product_id": "B00EOI2MRS", "context": "does this controller work on pc?", "response": "Yes. But the D-pad and the make are terrible."}
{"product_id": "B00CD90R72", "context": "What about the teams from Argentina, Colombia or Brazil, are there in this game ???", "response": "This game has all these teams. Greetings."}
{"product_id": "B00FLLFJE0", "context": "Is it worth it", "response": "Yes but, if you play online a lot your better off getting a cord. The batteries last for days weeks even depending on gaming addiction."}
{"product_id": "B000VTQ3LU", "context": "So it can be used as a regular webcam on a Windows 7 laptop with some free driver downloads,  Will work immediately as a webcam/cam on ps3?", "response": "Did you check out the YouTube link I sent you previously.  If not just google drivers for ps eye for w7"}
{"product_id": "B00E447L8C", "context": "will this charge a iphone4?", "response": "yes ,it comes with blackberry input, but you can use it with any USB cable"}
{"product_id": "B000B78F72", "context": "I'm looking for simple games such as Number 10, Coppermine, Buffalo Bill.Does this or any other software have these?", "response": "Found Number 10 and Buffalo Bill.  Pretty good solitaire is terrific, has simple games and games that require a calculus degree.  There are hundreds and hundreds of games and you can get new ones if you own the software.  Enjoy!  The perfect solitaire CD for any solitaire fan."}
{"product_id": "B00B1MXGDO", "context": "Does it come with the carrying case?", "response": "Hi, yes it comes with a fairly good semi hard type carry case, which holds everything you need together securely and offers good travel/ storage protection for everything inside."}
{"product_id": "B0086UK7I6", "context": "I'm curious about the buttons behind the scroll wheel. In some images one of them is raised and in others they're not. Are they normal buttons?", "response": "one of the buttons (the back one) is slightly higher then the other, they are both fully programmable, the raised one in question is set to alt-tab for me, and i have the other of the two set to swap between profiles of the games i play. you can really change things around with the software."}
{"product_id": "B00GHJ6X8G", "context": "I'm from NY  so I'm very interested in what the Yankee roster is before i buy this.....do they have any of the new players like Tanaka, Ellsbury,etc?", "response": "Yes, the roster it's updated every week"}
{"product_id": "B002DUCF7Q", "context": "What Does This Do?", "response": "This panel will display \"real time\" radio information when your system is logged in (purchased software program, flightsim) and operating with the flight simulator software.  Radio communication (two way) is generated as your flight progresses."}
{"product_id": "B00KGGJPYA", "context": "will this charge samsung galaxy tablet?", "response": "I believe so. Has charged every single device I have used."}
{"product_id": "B00BM7NXMW", "context": "do the colors cycle through -or fade into each diff color automaticly with a setting", "response": "The colors unfortunately do not cycle automatically, the closest thing to changing colors quickly is you have to assign a button in the configurator to LED color switch (default button for LED color switch is middle side button) and can cycle through green, red and blue."}
{"product_id": "B001AATQ0Y", "context": "Does this item work with 64bit system like Win7-64bit or Win8-64bit?", "response": "Yes, this worked perfectly with Win7-64 bit for emulators (snes, gba, nes, genesis, mame) and some fanmade games like streetfighter vs megaman, super mario bros x, and castlevania fighter.  I did not get it to work perfectly with steam, but I'm sure with some troubleshooting it would work for that."}
{"product_id": "B00IYWV852", "context": "If you buy this before the game comes out, does it count as a pre-order, so you can get the bonuses?", "response": "Yes, you get the full pre-order bonuses."}
{"product_id": "B00FOGFP0A", "context": "I have heard that PS3 games are not region locked? This game only came out in the UK and i have a US PS3, will it work?", "response": "Yes, Make sure your TV HDMI connected.  Outside of AC3, all other games are accessed through ps network.  Hope this helps"}
{"product_id": "B000FN7K2S", "context": "Does it play on Windows 7?", "response": "Yes.  Best to install it using origin."}
{"product_id": "B002BRZ79E", "context": "When you buy the PS3 version on Amazon, do you get a code when it ships? or do you have to wait for your physical copy to ship through mail?", "response": "If you ordered a physical copy, It should be in the box with the disk. Patience grasshopper ;)"}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "Approximately 3 ft.  I don't have a tape measure handy, so +/-3 inches."}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "Yep, this game works on the 3DS."}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "Without taking an exact measurement, I would say it was about 6 feet long.f"}
{"product_id": "B0009WPZOA", "context": "Does this game have offline multiplayer (splitscreen)?", "response": "I'm sorry - I bought it for my grandson so I don't know much about games or systems."}
{"product_id": "B00BMFIXOW", "context": "what is the region ?", "response": "Dear Valued Customer-Thank you for the inquiry.  The item that you have asked about is the US version, region 1 - NTSC. Hopefully this answers your question, but feel free to let us know if you need any additional information.Thank you,Dimple RecordsCustomer Service"}
{"product_id": "B008M4BNQG", "context": "How long is the Cord on this Headset, I sit about 10 feet away from My TV ..is it long enough to reach 10ft??", "response": "Not sure length but more than 10. I sit back and still have cord and it's plugged in back of tv and front of the PS3"}
{"product_id": "B00AR1LX9O", "context": "Can I use these on a plane to listen to my iPad music or the free TV they have on the plane?", "response": "Yes you can if you have a usb wall plug or somewhere the wireless adapter has power then connecting an aux cable that connects from the wireless adapter to the ipad. Although without power for the wireless adapter then you cannot use the headset."}
{"product_id": "B00BGGIWZM", "context": "I am having trouble getting this expansion pack to run on my mac. Can you offer any assistance?", "response": "Not sure it will help, but... Better Business Bureau's contact information:  http://www.bbb.org/council/about/contact/"}
{"product_id": "B00B08REVE", "context": "Will this work on Turtle Beach Ear Force M5 Silver Mobile Gaming Headset?", "response": "The M5 model is designed for mobile devices and is not compatible with the Xbox 360 console."}
{"product_id": "B0056JPS84", "context": "Is this for xbox 360 phat or xbox 360 slim?", "response": "Yes with som mod it. Worked"}
{"product_id": "B000WCCURW", "context": "I have windows 7 can I install it? I just bought it", "response": "Yes - you can install on Windows 7"}
{"product_id": "B00DBDPOZ4", "context": "Is there any type of warranty? I bought one barely 5 months ago and the cord isn't charging the controller anymore.", "response": "Same rhing happened to me. As far as I know amazon won't take it back. You could call microsoft at 18004myxbox."}
{"product_id": "B00DCDZM2I", "context": "does this game have co op?", "response": "Yes there is local co op"}
{"product_id": "B004HYK8Y8", "context": "I see all reviews are from 2011. It's 2015 Have they fixed the bugs in this game yet? Considering purchasing but sounds risk.", "response": "I haven't had any bugs with it and I bought it recently."}
{"product_id": "B00FENJVOE", "context": "i am using all 10 character slots already and im wondering if the xpac gives you more slots or will i have to delete a character to make a crusader?", "response": "Yes. 2 additional character slid will open up."}
{"product_id": "B00AK4QB22", "context": "Can you play as a female character?", "response": "Yes! And there are fairly good customization options as well."}
{"product_id": "B00E447L8C", "context": "Assuming I have the correct USB to lightning cable, will it work with an iPhone 6?", "response": "Yes it will work. But I would recommend the 6000mAh battery over the 3000mAh as I've experienced a faster charging than the 3000mAh."}
{"product_id": "B00D2EGWDA", "context": "Unlike the launch version, does this version include a separate code for the 1st DLC or is it included the PS3 disc?  Expiration date for code?", "response": "For the extra maps listed on the back. They give you a slip with a code inside the game. It's locted on a piece of paper just log into your psn account and redeem code, and the extra maps given on the back will be downloaded into your PS3 system."}
{"product_id": "B004L6C6BK", "context": "Is there a way to mute my mic? I'm thinking of matching this mixamp with Audio Technica's ATHADG1 which requires you to hold the mute button closed.", "response": "I actually have the ATHADG1 along with the mixamp. I can confirm that pressing the mute button on the mic itself will mute your mic channel, but there is nothing on the mixamp itself that will mute it."}
{"product_id": "B00I9GZZGG", "context": "Does the microphone fold up?", "response": "Yes, it folds straight up out of the way against the headband."}
{"product_id": "B000NJBD90", "context": "Will this work with a PS2 Hori fight stick?Since there is no analog button on the stick how would it register when asked for the PS button?", "response": "I didn't see if the analog button was mapped as ps3 button. However it might be since ps3 uses analog all the time. I was using my PS3 Blu Ray remote to go to PS3 menu"}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "Make sure that the hard drive is pushed all the way in."}
{"product_id": "B00BGA9V2Q", "context": "does this version include the crusader class", "response": "Unfortunately no, this new class is appearing in the expansion \"The Reaper of Souls\" . With a heavy metal salute (devil horns) play on my friend!"}
{"product_id": "B00EVWZHLK", "context": "Is this trilogy a good place to start for a totally new beginner to the entire AC franchise?", "response": "To understand a bit of the story is better to play them all, but at the beginning of every game is a little resume of the complete story. The first one is really boring."}
{"product_id": "B0011E4J7O", "context": "How long is the cord?", "response": "It's a little over 3 feet. I was disappointed since the last one I had was longer."}
{"product_id": "B000H67DDY", "context": "what is the warrenty?", "response": "Not sure what the warranty is on this but I have had no issues with it so far. Amazon is great about backing up the products they sell and allowing returns if needed."}
{"product_id": "B0054JGGGY", "context": "Does this come with a bluetooth doggle or does the charging stand act as the receiver?", "response": "The charging stand is the the receiver."}
{"product_id": "B004JQK2E0", "context": "do i have to be on the internet to install port royale 3 pc game", "response": "I believe so. Registration and updates."}
{"product_id": "B002DUCF7Q", "context": "If i add alot of these like half a cockpit do i need to upgrade my Power supply?", "response": "There's only three but I have two yokes with a individual power supply to each and a fuel gauge rudder pedals and mine works great with x plane but if you buy it and its your first one you have to download plugins for it to work"}
{"product_id": "B00CERXJNW", "context": "Can one easily replace the LED's if one goes out?", "response": "Easily? No. But it can be done. A few screws (more like 15) and the plastic board comes off the aluminum shell and then a few ribbons to disconnect and you gain access to the LEDs and circuit board."}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "No Idea but Saitek doesn't support it, requirements are here: http://www.saitek.com/uk/prod/pedals.html"}
{"product_id": "B0032MK90E", "context": "Will it run on win8?", "response": "I have not used it on windows8.  Only on Vista"}
{"product_id": "B003O6C0V4", "context": "Has anyone actually been able to create a user account on the WII?  Each time I try the game informs me that the EA servers are down.", "response": "I could not tell you because when I got my product in the mail it did not work and so I could not even play the game without the arm band working... But I was able to create a account on the active game the first one. But was anyone there nope cuz you just solo it out."}
{"product_id": "B000IZAQD8", "context": "Does this connect to witrless internet by a router", "response": "Hi Brenda.. My son is telling me no it does not connect. Playstation 3 does though.. I hope this helps you..janice"}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yes it will,  no problem. There are separate sleeves/compartments or else I would have never tried it. I fit a Zelda 3DS XL system AC adapter and a Neo Geo handheld system in  bag all at the same time."}
{"product_id": "B00BCEK2LU", "context": "Is this wireless? It comes up under a search for wireless, but the pictures seem to show a wire coming out of the top.", "response": "Hi James, it's not wireless. Let me know if you have any other questions. :)"}
{"product_id": "B000BAVN14", "context": "Will this work for Macbook Pro? Running OS X Mavericks?", "response": "If you buy the mac version like Janea said, it should work with most versions of mac, but I'm not sure because i have mac os x leopard."}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "Microsoft is a US company, but whether or not any or all of the developers(and CD producers) reside in the US I don't have a clue."}
{"product_id": "B002MRUROI", "context": "will this work on XBox 360 Kinect'???", "response": "Sorry, don't know. It plugs into the power plug on back of the unit, the power plug then plugs into the cooling fan."}
{"product_id": "B00IYWV852", "context": "Will I be able to redeem the code for the deluxe version after June 3, 2015? Not going to be able to download the game, or register, for 5+ months.", "response": "Yeap, it's just a code. They will just discontinue to sell them as it gives a few extras :)"}
{"product_id": "B00CXI0BPG", "context": "Is this Mouse for palm handed grips or Claw handed grips?", "response": "Depends on the size of your hands. It's easy to do both for me. The mouse is a tad on the small size though. But it's good for FPS, and RPG'S."}
{"product_id": "B00D96BMV8", "context": "Does it play game sound through the headset?", "response": "Yes it does Im very pleased with this headset"}
{"product_id": "B004XGN8W4", "context": "Does it come with all the power cords, or will i have to get them seprate?", "response": "it depends on the seller if he or she has everything. i brought a really used up one but it works great and it came with everthing except hd cables."}
{"product_id": "B0087ZMATE", "context": "Are the ear cups over-the-ear (like ear muffs) or do they sit on top of the ear like earpads?", "response": "they sit on top of the ear, which i thought i wasnt going to like but once you put them on you forget they are there, the padding is very well done, hope this helps"}
{"product_id": "B009UCGVZC", "context": "Is this a Wii game", "response": "The game can be played on the Wii, as well as other gaming consoles. If your going to buy the starter pack, the one with the actual game, be sure you purchase the right one for the Wii. The figures themselves are not exclusive to any gaming console."}
{"product_id": "B00DGZDFO4", "context": "Is this a Steam game? Not just a game you can add to Steam, but an actual Steam game, as in Steam will acknowledge it has been purchased?", "response": "Yes It steam acknowledges its been purchased!"}
{"product_id": "B009LGO88E", "context": "is it a real 3ds", "response": "Yes and it works . Im very happy since I own monster hunter ultimate 3"}
{"product_id": "B0088MVQIM", "context": "Does it come with a cable?????", "response": "Yep.\"Get plugged in - Rocksmith includes a unique 1/4-inch-to-USB cable -the first of its kind - and allows users to plug any real guitar or bass with a 1/4-inch output jack directly into their Xbox 360, PS3 or PC.\""}
{"product_id": "B00B1N07QM", "context": "Is this the stealth version? If not, are you going to be offering the stealth version on Amazon?", "response": "My son said the one I bought him was not the stealth version."}
{"product_id": "B00FLLFJ68", "context": "Is there anywhere to get another dongle? I lost one and need two for my two controllers.", "response": "Looks like Nyko website direct order is the place. You might have to copy and paste the below link.http://www.nyko.com/products/product-detail/?name=Replacement+Dongles+for+Charge+Base+for+PS4"}
{"product_id": "B00DCDZM2I", "context": "is this compatible with xbox 360?", "response": "No, the 360 and One have completely different internal hardware.  The figures' RFID is universal though."}
{"product_id": "B008KE95UO", "context": "Does this game have multiplayer mode?", "response": "No, it was cut during development. The game is single-player only although it does have multiplayer type modes besides the campaign but you play against the computer."}
{"product_id": "B008X73CE8", "context": "What is the difference between SH4 and SH4 gold edition?", "response": "The gold edition has some missions I had not seen before... With a couple of subs that are not part of the standard offering..."}
{"product_id": "B00DGZDFLW", "context": "does it require a steam aqqount?", "response": "If aqqount means account, the answer is 'yes you need account for steam'.Because this product gives us steam code."}
{"product_id": "B0050SYDEQ", "context": "Does this work with the Xbox 360 wireless speed wheel?", "response": "I don't see why it shouldnt."}
{"product_id": "B0045ZB66I", "context": "Does this version (the physical PC version) require Origin or Steam?", "response": "not at all ready to go out of the box"}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "you can set whatever language you like"}
{"product_id": "B00HWMP0TU", "context": "Labeled as COMPLETE ED., but does't have EXT. PACKS & DLC as box describes. What do you recommend?", "response": "To receive all of the DLC (Brave New World and others) you'll need to activate the CD key through Steam where you will be able to download the game and all of its components. Keep in mind that you will need an account with Steam and have the Steam Client installed."}
{"product_id": "B008HPAXZ2", "context": "It's only one screed protector filter?", "response": "It has 2- One for the top and one for the touch screen"}
{"product_id": "B00HPU96FI", "context": "So this came in the mail yesterday, and I'm not getting any picture. I have an audio splitter and I can hear some sound. Any idea why?", "response": "Try a vga to hdmi adapter and hook it up to your TV. Hdmi is more reliable and compatible with modern TVs. While vga is great, it will actually look better with this adapter."}
{"product_id": "B0085P7U0U", "context": "Does this really work with OSX 10.9.5?  I bought games recently and they wouldn't work on this operating system.  It was a pain to try to get my money", "response": "I have MacBook Pro (late 2011)  with OSX 10.9.5 and Hoyle 2012 works fine. It did choke when we were trying to play Solitaire while on a hotel wifi.  Otherwise it works OK. BobM"}
{"product_id": "B00I4C2EKA", "context": "Can I buy this as a gift for a friend or will it automatically try to download to my PC?  I want to give the code to someone else.", "response": "When you buy it as a digital copy, they give you keys to use on Steam. This key can be given to your friend and they can use it to install the game on their Steam account. :^)"}
{"product_id": "B0045FEEAS", "context": "is it game cube controller compatable", "response": "I bought it for my brother. I can't remember if the game cube controller is compatible or not. I found this online. It might be in there.http://en.wikipedia.org/wiki/List_of_Wii_games_that_use_the_Nintendo_GameCube_controller"}
{"product_id": "B007TYC8MI", "context": "Was this new copy supposed to include an online pass voucher?", "response": "I do not know I only played for the story mode, I was not interested in the online voucher."}
{"product_id": "B00JM3R6M6", "context": "appropriate for 10 yr old girl?", "response": "Bought for 11-yr old granddaugher whose parents are very vigilant on appropriate exposure to things like violence, language.  They okayed it, and she LOVES it -- win, win for grandma!"}
{"product_id": "B006SVUQNQ", "context": "Will this work with an original XBox game?  I've been wanting to play Shenmue II with my XBox 360 Slim, but don't know if this harddrive would work.", "response": "I don't really know man. But the hard drive will fit in the Slim though."}
{"product_id": "B00B0QONB0", "context": "My Xbox 360 4GB will not recognize it. What do I do??", "response": "Return it.  I couldn't get mine to work either"}
{"product_id": "B00B312UDU", "context": "how many clicks does this have?", "response": "They mailed me a totally wrong mouse with different name...but mine has 2 clicks."}
{"product_id": "B00ENFVJJO", "context": "Will this work in the US? Also does this have a trickle charge or auto shutoff?", "response": "This definitely works in the U.S. and not sure if it is a trickle charge, but it indeed charges the device pretty quickly, and once it is finish the controller indication light does go off."}
{"product_id": "B008TP1OKI", "context": "Is this an official microsoft product? Will it play original xbox games?", "response": "If its the one from haussbell, no. You have to buy the $60 from the Microsoft seller for it to work with original Xbox games. Anything but the specific Microsoft brand will not play original Xbox games."}
{"product_id": "B0045FEEAS", "context": "Can this particular model play GameCube games?", "response": "no you need to add other products to play game cube games on your Wii"}
{"product_id": "B007OVHW90", "context": "Can I plug one end of this directly into my px4 headset and the other into my controller and have the chat volume and mic mute function properly?", "response": "Brad, it should work just fine."}
{"product_id": "B00DNGQTFI", "context": "Why are all dragon ball fighting games? Where can i purchase role playing DB games?", "response": "Dragon Ball Z Attack of the Saiyans for the Nintendo DS."}
{"product_id": "B00000K4MC", "context": "Will it work with Windows 8?", "response": "I tried it, and it didn't work, however when I installed Loopy Landscapes, and downloaded the patch for it, it worked fine"}
{"product_id": "B008GEH8LQ", "context": "what over the ear headphones are recommended for an 8 year old?", "response": "Any over the ear would work just fine for an 8yr old. Otherwise I personally enjoy the beats by dre but those are expensive and I don't really thing necessary for a young person. I'd say try Sony brand?"}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3?", "response": "No!... because it plugs into PS4 controller not console."}
{"product_id": "B000266786", "context": "Does it run on Windows 7 or 8?", "response": "The program is fun and educational.  However, the program won't run without the disk being in the computer.  It also wouldn't run on windows 8.  My kids loved reader rabbit and I am disappointed about the issues. My grandson would enjoy your it too. 😡"}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "It's the same one with the \"call of duty\" logo.  The good thing is that you can always buy him a new grip to cover it if he doesn't like the printing, since it's interchangeable."}
{"product_id": "B00HWMP0OU", "context": "This game is for girls or you can also create a boy protagonist?", "response": "It is for any gender. You can make your character either a boy or a girl"}
{"product_id": "B005764CWO", "context": "Hello, does this controller have sixaxis support?", "response": "No it does not"}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "According to the box, yes it will."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "yes and it is a GREAT collection."}
{"product_id": "B00CX8VYM0", "context": "Is this a digital code or the actual game disk?", "response": "I received the actual game disk. It works great!"}
{"product_id": "B00030GSJY", "context": "What type of plug does this Joystick use?", "response": "The throttle is USB and the joystick connects to the throttle with PS2"}
{"product_id": "B00FM5IY4W", "context": "will this play on the 360?", "response": "No. Forza Motorsport 5 is only playable on the Xbox One entertainment system. Forza 4 and Forza Horizon are two racing games, from the same franchise, that are available on the Xbox 360."}
{"product_id": "B004H7P0B6", "context": "Is this just one piece or is there a rubber attached to each piece that is removable?", "response": "It's rubber attached to the thumb stuck. It's still easier to tear off than the OEM stick though."}
{"product_id": "B0036VO4XO", "context": "will this work with a 32 bit os?", "response": "I'm sorry I can't answer.  My operating system is 64 bit."}
{"product_id": "B00DE2W4PK", "context": "Is the ps plus code they provide good for a free year subscription?", "response": "for me it is excellent and a real wonder"}
{"product_id": "B00562O78S", "context": "Why is the Playstation 3DTV only have 5000 for contrast ratio? Shouldn't LED be in the \"millions\" contrast ratio?", "response": "Never listen to the contrast ratio provided by manufacturers unless they're talking about static contrast. Anyone can throw out a ridiculous number out there like 1000000000:1, there isn't a standardized way of measuring contrast."}
{"product_id": "B00H1FCUBY", "context": "WILL THESE WORK WITH PS3?", "response": "No idea... But when they worked, I loved them.... Then they didn't, after about 15 hours of use."}
{"product_id": "B002RRLQIO", "context": "Does the variable volume control work with Windows media player?", "response": "The volume control calls the system volume of the default output, not the active application."}
{"product_id": "B00B98HBTA", "context": "how many players is this game", "response": "One player, or two-player co-operative. No online multiplayer."}
{"product_id": "B00BGA9YZK", "context": "Does it come with a redeemable code that I need, or need to play online?", "response": "You pay for a code redeem to download the game from playstore. After that you can play campaign and play on line if you are a psn plus user."}
{"product_id": "B000BAVN14", "context": "Which expansion packs does it include ? Does it have Apartment life ?", "response": "This isn't sims 2 this is the first sims game that includes all the expansion packs for it. No it does not include a apartment life pack."}
{"product_id": "B002YVD3KM", "context": "Will this make me have to remap my emulator's input options because the controller uses joystick buttons, or does it activate keys on the keyboard?", "response": "I believe you will have to remap your emulator's input options when you switch between controllers, though the D pad's input options might translate to the joystick's input options.  As far as I can tell, it does not activate keys on the keyboard."}
{"product_id": "B00DC7O77A", "context": "Does this game support the use of the wii u pro controller instead of the gamepad?", "response": "Yes, especially necessary with multiplayer mode."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "Yes, this works very well on my Windows 7."}
{"product_id": "B002YVD3KM", "context": "Can you hook up two of the controllers for co-op games like contra?", "response": "I had problems with getting two controllers to work as separate units; I solved it with the FCEUX version 2.2.2 for the PC - that release allows you to setup two controllers as different controllers. If you're using a different platform, try the latest release of the emulator you're using."}
{"product_id": "B001GROEEO", "context": "I have my ps3 registered  for  CHile (latinamerica)and I am not pretty sure if I can still use this , I am living in costarica,", "response": "Don't buy. Try somewhere else. My worst Amazon purchase ever. Plus I'm $50 out of pocket. DON'T BUY!!!!!!!!!!!!!"}
{"product_id": "B00005NIMB", "context": "Will this work on windows XP?", "response": "Yes it should. With the force feedback you will need the drivers on the disks to control how powerful it will be. You may have to find the software online."}
{"product_id": "B00DUARBTA", "context": "Does it have 2 player mode, i mean can 2 players play with two controllers at the same time, on same ps4 (i dont mean online)", "response": "yes it does have two player mode..two controllers"}
{"product_id": "B0001BR9Q6", "context": "will it download in Window 7?", "response": "don\"t buy any down loads from this site amazon  no custermer service on it"}
{"product_id": "B00BFOEY3Y", "context": "Does this G700s work on glass? I have the Logitech MX performance, and want more macro keys.", "response": "Hmm, I didn't try this until I saw this question.  Mine works ok on my glass desk if the desk is slightly dirty from normal use, but after cleaning the desk with Windex the mouse no longer tracks."}
{"product_id": "B0050SYILE", "context": "Why it is only 29$?", "response": "It's a used copy of game"}
{"product_id": "B000YQ639M", "context": "does it have a senario maker or make your own map", "response": "Not within the game itself."}
{"product_id": "B00D3RBYM0", "context": "Does this game have multiplayer mode", "response": "In free play, yes. Otherwise multiplayer online requires 2 systems and 2 games."}
{"product_id": "B003OZOAKY", "context": "can you play this game solo?", "response": "Indeed you can play solo. It allows multi-player which I haven't done yet."}
{"product_id": "B000R0SRNU", "context": "Does this game require an HD TV?", "response": "No, doesn't require an HD TV.  The graphics are really good even without an HD."}
{"product_id": "B00AWEMODK", "context": "Will this run on Windows 8.1?", "response": "Yes it will.  I'm playing on my laptop."}
{"product_id": "B000VLNXRU", "context": "Hello, this instrument supports P3D V2 it? Buy.", "response": "I only know it supports FSX, and then that's is questionable. I bought 3 if them based on reviews from other post. Personally I would not recommend them to any one."}
{"product_id": "B00GO4PTR0", "context": "These memberships works for just one account? Or multiple accounts in the same console? Thanks", "response": "It works just for one account..."}
{"product_id": "B001E27DLM", "context": "Is this the original game, but ported to DS?", "response": "Yes........same great SNES game with updated graphics."}
{"product_id": "B00CD1FCAC", "context": "do the keys fade? I have bought several keyboards where the keys scratch easily and the letters fade off revealing a white plastic underneath.", "response": "They haven't started to fade at all."}
{"product_id": "B00004VUFG", "context": "can you buy games for children to play with this", "response": "I do not know. My 8 year old nephew would use the wheel to play my husband's Formula 1 racing game. But we didn't have any children's games to try it with."}
{"product_id": "B001EYU1WS", "context": "Does this connect with USB?", "response": "Yes, it works with everything, even X-plane, but you will need to download software from their website to make it compatible."}
{"product_id": "B00B1N07QM", "context": "[Solved] Does the Orbweaver store the active profile on the device like the n52te does? Does it have only the dpad for the thumb buttons?", "response": "Nope not stored on the device. U can always check the razed webcite. And as far as thumb buttons there is the d pad which has 8 buttons on it, the space bar like button below it and a small button above it"}
{"product_id": "B006YDPU48", "context": "How is the pvp combat system compared to Dark Souls? I was obsessed with Dark Souls but Dark Souls 2 looks a bit sluggish and unresponsive.", "response": "from what i can tell it is smoother but i thought the pvp in dark souls was smooth. it really depends on the internet you have cuz not all internet connections are the same"}
{"product_id": "B00BY0G0YU", "context": "i know this is a 2 game pack but when i had final fantasy x2 it had a music video intro which i liked a lot does the hd version of x-2 also have that", "response": "The Real Emotion? Yes it does"}
{"product_id": "B0050SX7BQ", "context": "Please, is this game translated to spanish?", "response": "No, it is not , only english and french"}
{"product_id": "B00DGZDFO4", "context": "what controller is best to play this game on PC?", "response": "I use my wireless 360 controller and I am very pleased with it. Also it is compatible with most of the games out there so it is an option to consider if you don't have a controller yet."}
{"product_id": "B00D96BO7K", "context": "will these work with a pc", "response": "Yes they will they work for all brands except xbox one as far as I know."}
{"product_id": "B00E4MQODC", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "The scroll will is click stop but very smooth , new experience from logitech. You can't control it like the MX"}
{"product_id": "B007YLUCME", "context": "How do you turn it on after unplugging the usb?", "response": "You should be able to push the \"analog\" button to turn it on, but it must have a charge. Personally I can't get it to work with any of my games. Should have spent the extra money on a 360 controller :/"}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "I mostly use a Xbox wired controller. But that's just me."}
{"product_id": "B00DGZDFO4", "context": "what controller is best to play this game on PC?", "response": "I'm using an Xbox 360 controller and it works perfectly, no hassle. Just plug in and that's it."}
