{"product_id": "B00DNGQQUQ", "context": "Will this game work with Korean xbox?", "response": "If the game is PAL it should work but if it is NTSC it won't"}
{"product_id": "B008TP1OKI", "context": "Will this Hard Drive fit my \"Xbox 360 E\" not slim, but \"E\"? DO I need anything else or just the drive?", "response": "Don't know, I bought it for XBOX slim so not sure it would work on the 360 E"}
{"product_id": "B005VO5ZVY", "context": "Will this work with a DS3 XL?", "response": "It is not. For xl"}
{"product_id": "B007FTE2VW", "context": "I've heard that there is now a single-player does that mean that if the internet somehow goes off and I am on single player will I still play.", "response": "It appears so. Haven't tested it out for a lack of internet, but there is a single player program to it now."}
{"product_id": "B009S4JZKK", "context": "I have a 12 year old that loves trains. Is this game to complicated for a 12 year old? If so can anyone recommend windows 8 compatible please?", "response": "I wouldn't waste my money on this.  It is complicated and difficult to use.  Look elsewhere.There is a Japanese train simulator available on line, good fun and free!"}
{"product_id": "B008YRITPO", "context": "What key type is this? I'm guessing rubber dome?", "response": "I am guessing yes. Well constructed though, cause you still get the tactile feedback and it has a low profile."}
{"product_id": "B00562O78S", "context": "Resistance 3???? Does it still come with Resistance 3???", "response": "Anyone knows if they give away R3 right now or with the display??"}
{"product_id": "B00IVHQ0KI", "context": "is this can use for PC?", "response": "no，it is only for xboxone."}
{"product_id": "B00CMQTVUA", "context": "Hi, Can I use this in India?", "response": "You certainly can.but only if your in India at the same time."}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "Depends on your country because I believe some 3ds games are region locked. If you're in the us though, it will work. I'm in the us and mine works perfectly"}
{"product_id": "B00H8NS1K8", "context": "with the open back, I'm concerned about audio bleed into the mic. can anyone comment?", "response": "I'm not sure how you guys are not getting mic bleed, but it's awful. These sound amazing and it's really frustrating that the mic bleeds to badly. rip, back to the AT2020"}
{"product_id": "B00292OW1U", "context": "DOES IT WORK WITH WINDOWS 8 AND 8.1?", "response": "I'm sorry but I don't know Tracy.  I have Windows 7.  Happy Thanksgiving!  :)"}
{"product_id": "B00B5GZORW", "context": "What is the name of the other bonus games?", "response": "Girls with secrets, judge dee and night in the opera.  There are 3 bonus games"}
{"product_id": "B00AIALGZK", "context": "is it working on windows 8?", "response": "Yep, it has no problems with windows 8/8.1"}
{"product_id": "B009LGO88E", "context": "does it work for the american 3ds xl", "response": "Yes it works. Just wish there were more compatible games."}
{"product_id": "B009AFLXJS", "context": "how does this connect to the gamepad?", "response": "It doesn't connect to the gamepad. It comes with a cable that plugs it into the USB port on the back of the console for charging."}
{"product_id": "B000ZHMRTA", "context": "what about windows 8.1", "response": "My copy works with 8.1"}
{"product_id": "B0096PLB9O", "context": "My pc cant find the drivers for this, where can I go to download them. Have alienware x51 pc, wont work without installing drivers.", "response": "If you have Windows 7, use these instructions, http://smile.amazon.com/review/R17MEK6ESDTFRD/ref=cm_cr_pr_viewpnt#R17MEK6ESDTFRDIf you have Windows 8, use these instructions, http://smile.amazon.com/review/R172M7IP6UAFJ9/ref=cm_cr_pr_viewpnt#R172M7IP6UAFJ9I used the Windows 7 instructions, and it worked perfectly for me."}
{"product_id": "B00BTOAFXS", "context": "Will it make me have a faster trigger finger then now? People say I have a mod?", "response": "if it is used for call of duty, it will seem that you have a quicker trigger finger. the distance the trigger travels is decreased, so individual squeezes are quicker"}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "yes I bought one in each color my husband and our son is very happy with them"}
{"product_id": "B00D96BPL0", "context": "What adaptor do I need to purchase to be able to use these on an xBox one?", "response": "At the moment, I believe the only adapter on the market is sold by Microsoft. http://www.amazon.com/Xbox-One-Stereo-Headset-Adapter/dp/B00OIPOTYG/ref=sr_1_2?ie=UTF8&qid;=1416942895&sr;=8-2&keywords;=xbox+one+chat+adapter&pebp;=1416942902749 The Marvel Headset is really nice, I use it every day at the office."}
{"product_id": "B009DL2TBA", "context": "does hookup to analog tv? also, can get pandora and netflix?", "response": "you can get a netflix app and just use the ps3 internet browser to go to pandora.com"}
{"product_id": "B008YRITPO", "context": "What key type is this? I'm guessing rubber dome?", "response": "Hi, yes its rubber domed, not mechanical. Regards."}
{"product_id": "B0057WDBHA", "context": "is it wireless or wired?", "response": "This stick is wired. Quite honestly... I never mess with wireless sticks :P"}
{"product_id": "B007A7UJ4S", "context": "Does it have spanish sub titles?", "response": "I don't think so."}
{"product_id": "B00GZ1H07Y", "context": "Will this game play on the PS3 console?", "response": "No it won't. However a PS3 version can be bought from the Playstation Store."}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "The headset is powered by a cord using the Xbox One usb port. It has a permanent rechargable battery."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "Silent, much like a laptop's keyboard. Smoooth!"}
{"product_id": "B0029LJIFG", "context": "if i buy this product today can i use it next year? in other words my xbox member ship has about 6 months left, so can i buy this now and use it later", "response": "Hello Tyler! Yes you can buy this xbox live gold membership now and use it at a later time. It has no expiration date. Thank you for your question!"}
{"product_id": "B00DCDZM2I", "context": "does this game have co op?", "response": "Sure does, that's one of its major features. I play it with my child often."}
{"product_id": "B000B6MLSM", "context": "Does this remote work with Xbox Live? I need it to work with NetFlix that I'm streaming through my Xbox.", "response": "I'm pretty sure it will. I use it with the amazon app on Xbox and also my local cable providers app."}
{"product_id": "B00BDX1M00", "context": "Does this work on Windows 8 PC and is it wireless even for PC's?", "response": "I use mine for a Mac and it works wirelessly. I'm not so sure about a PC but I'd assume so."}
{"product_id": "B00GANWVJE", "context": "Does this game work with Nintendo DS?  Or is 3DS required??? buying for gift, not familiar with game systems . . .", "response": "You will need Nintendo 3DS but once you have that you can play all your old games on it too."}
{"product_id": "B00D4WTO1M", "context": "Does this game includes the season pass to download the 4 new maps?", "response": "The hardened and prestige editions come with the extra maps included.  The codes are now working for the season pass."}
{"product_id": "B00D6PTMB4", "context": "Does it come with the guitar?", "response": "no, you must provide your own instrument."}
{"product_id": "B00FLLFJE0", "context": "What's better, Rayovac AA rechargeable batteries or this nyko charge base for the xbox one. Which one will last longer?", "response": "I honestly can't tell you which is better as I haven't used the Rayovac batteries you mentioned."}
{"product_id": "B000GCJ6MK", "context": "I bought a \"used\" one and just realized it requires a product key. Will it work with with a product key that's been used before?", "response": "Shouldn't be an issue , as long as it is a valid key."}
{"product_id": "B000YQ639M", "context": "does it have a senario maker or make your own map", "response": "it Does Have a snerio maker but you can only pic from maps it has."}
{"product_id": "B00IYWV5HS", "context": "I am temporarily living in Europe. If I buy the US version, can I download and play on US servers from Europe?", "response": "Yes, in fact it's the only way to play on US servers.  If you buy a code from one of their European gates, or even through a European amazon gate, it will only be good for Euro servers.  I bought a code on US amazon for a friend in Europe and we play together on US servers."}
{"product_id": "B000SOYG8U", "context": "Does this work on Windows 8 PC's", "response": "The disk contains both the normal and expansion and on my win8 the original works perfectly, but for some reason the expansion won't work"}
{"product_id": "B005BLAJRC", "context": "what games are included on the cd?", "response": "Backgammon, battling ships (like the Battleships board game), checkers, Chinese checkers, chess, dominoes, tile games (mahjong tiles), master match, pachisi, panic, placer racer, reversi (like Othello), rummy squares, time breaker, word games (anagrams, crosswords, word searches, word yacht, wordox), yacht (Yahtzee), and zilch."}
{"product_id": "B009WI7V9E", "context": "Is the DLC on a separate disk or download via codes?", "response": "Each game has a separate disc with the DLC. Before you play the game, just put the disc in your Xbox and it will install all the DLC. It only takes a few minutes for each one."}
{"product_id": "B0053BCO00", "context": "Does this game work on a 3DS XL?", "response": "Of course! The 3DS XL is just a different 3DS model, not an entirely different game system"}
{"product_id": "B000FN7K2S", "context": "Will this play on Windows 8?", "response": "It does but I recommend purchasing it through origin."}
{"product_id": "B00IAVDPSA", "context": "I'll be hooking up the Tivo through the HDMI pass through. Can this remote be programmed to control the Tivo Box as well?", "response": "No, this is NOT a universal remote.This remote is a basic navigational aid for the xbox only."}
{"product_id": "B001CXYMFS", "context": "Anyone have experience using it in Warthunder and/or Aces High? Does it work with either of them?", "response": "It works for both of them great! Fully compatible!"}
{"product_id": "B001UWGDPS", "context": "will this run on win 7 32 bit", "response": "my computer is windows 7 with a direct x 11 video card and 8 gig of ram, and it plays it real well"}
{"product_id": "B00E88G054", "context": "are there any programmable buttons/does it come w/ a drive program?", "response": "No,there aren't,this mouse is plug and play"}
{"product_id": "B00A878J5I", "context": "I am unable to find any replacement batteries for this kit,  Does any one know of another battery type/brand that will charge with this charger?", "response": "Not to be used with any other battery."}
{"product_id": "B0080RAT42", "context": "will it work on a mac?", "response": "I really don't know. What do i know is that product works on Linux and Windows. Not sure about Mac, but I hope so. :)"}
{"product_id": "B003ZMF26W", "context": "is it wireless and does it work with windows 8.1", "response": "Hello it is a great mouse but is not wireless, and sorry i do not know if it works with windows 8 i have windows 7"}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "All parts in Sony color box"}
{"product_id": "B00BI9MDSO", "context": "Will this case get re-developed for the slim model?", "response": "I have no clue. All I can say is that it's perfect for the first version of the Vita. I'm sure there will be more heavy duty cases once the slim model picks up(if it does)."}
{"product_id": "B00B70WKUK", "context": "So is this like a steam key? Or a physical disc?", "response": "Its a disk that activates a steam game"}
{"product_id": "B003O6N64Y", "context": "can I connect this headset to a tv,thankyou.", "response": "Yes, follow the instructions for the home theater form. if you can't find them go to the ear force PX5 page on the web. They have complete instructions there."}
{"product_id": "B006W41X1S", "context": "If I buy these do I need to purchase any other cords for it to connect to my xbox 360? Will they work on my xbox One?", "response": "Depending on which version Xbox 360 console you have and your particular setup, an Xbox Audio Adapter *might* be required. The X32 headset is not optimized for Xbox One use.Compatibility and setup information for all our products is available here:http://www.turtlebeach.com/console-compatibility"}
{"product_id": "B009DL2TBA", "context": "does it play ps1 games and ps2 games too?", "response": "Sorry friend, no backwards compstibility, I'm afraid. Use the PS store/Amazon to get your fix. PS1 digital downloads are cheap and there are HD remasters of old PS2 games available for the PS3. Happy gaming!"}
{"product_id": "B00GHTP7SS", "context": "Does this game have multiplayer mode?", "response": "Yes it does through steam. It has same screen multi-player but No LAN support though..."}
{"product_id": "B009Q5XGO2", "context": "Is this essentially a second battery that charges the innate battery without plugging into the wall?", "response": "No. I seriously doubt that it \"charges the innate battery...\" I consider it a second/backup battery to the \"innate\" one. This battery's plugin serves as a bridge to charge the \"innate\" battery."}
{"product_id": "B002ZS6Y64", "context": "what can i do to make it work whith the xbox one ( i have the adapter too)", "response": "Mine snapped off at the headphone and is no longer working. They sounded great when I first got them, but they are very crapilly (like that word?) made. Hope you have better luck with yours."}
{"product_id": "B004C4U1VI", "context": "Will this fit SCPH-70012 PS2 Slim models? Asking because I see various people saying it fits their PS2 Slim and some that say theirs do not.", "response": "Yeah absolutely I use it on my fat and 2 different slim models and it works great mine just make sure to change the settings on your ps2 to output higher resolution"}
{"product_id": "B00DNHLFQA", "context": "Will this download work on Windows XP?", "response": "Hello Andrew,All games work on XP (sorry for my english)"}
{"product_id": "B004RMK57U", "context": "i'm from Portugal , and i have a portuguese psn account , if i buy it ,will it work for me?", "response": "work!!    this free & discount game for me every mounth"}
{"product_id": "B002672Z80", "context": "Do these Have Wii Motion Plus?", "response": "no they do not. they are regular controllers"}
{"product_id": "B00004XRBB", "context": "How many missions and planes are there?", "response": "I have honestly never finished the game, and I had it when I was a teenager when it first came out. The graphics and game content were far ahead of their time. There's at the very least 10 different planes you can fly between allied and axis planes. One of the best flight combat games EVER made right here."}
{"product_id": "B007XVTR12", "context": "Can you play multiplayer, online, local, and zombies?", "response": "Zombies were moved from the single player to the multi player platform for this game. You do play online. When you play online, it's similar to multiplayer,you are playing co operatively. No human are playing against you, just AI."}
{"product_id": "B0094H8H7I", "context": "can you save your game", "response": "No you cannot save it"}
{"product_id": "B00006B84X", "context": "Does it have independent centering for the pitch and roll axes? Can you feel that the roll axis is centered while moving the pitch axis?", "response": "Yes, you can feel it centering. You can feel the springs stop fighting you."}
{"product_id": "B00HN9LS48", "context": "I want to play my kinect on my old LCD tv which is 3 inches wide. Does this fit on it?? Does it have enough width so that the back flap works?", "response": "A bit late on the response but yes."}
{"product_id": "B00F27JGVA", "context": "Does this card works correctly with USA's PS Vita systems?", "response": "Works with the older and the new vita systems."}
{"product_id": "B006PP404Q", "context": "does this fit the ps vita 2001?", "response": "Yes,  it covers the screen but not the whole border around it."}
{"product_id": "B00DHF39KS", "context": "Sorry, first game I buy for PS4, is this the digital download or physical version of the game?", "response": "This is for the purchase of the physical disc. You can download the whole game from the PlayStation Network (PSN) as well for the same price."}
{"product_id": "B004GZ2RCY", "context": "Which mouse is it? There are 2 different pictures of the mouse.", "response": "Hi, the first picture is wrong, my review it's about \"SteelSeries World of Warcraft Cataclysm MMO Gaming Mouse\", the second image and Product Description are ok..."}
{"product_id": "B0096L2SJ0", "context": "where are the games stored", "response": "they are always on your tablet or smartphone, the controller is merely a means by which to control the physical movements involved with the game characters"}
{"product_id": "B00EEMLPR2", "context": "Can anyone tell me what features the 1080p HD Tactical Camera has. Is it worth it?", "response": "Yes it performs well, worth the purchase"}
{"product_id": "B0054SCSQM", "context": "Will it run on Windows 8?", "response": "Can't answer this question as I have Windows 7."}
{"product_id": "B001Q55D5K", "context": "Window XP/Vista? Would a PC game with a Windows XP symbol still work on a PC Windows Vista computer. Thanks", "response": "HiI have recently bought a new Laptop which uses the Vista operating system. And so far have had no problems installing games. Many of the games I play are old 2005-7 and all seem to run no problems. Also newer games such as Age of Empires and Medieval Total War II are running well under Vista"}
{"product_id": "B00BCEK2LK", "context": "Might be a stupid question, but is this mouse compatible with OS X software?", "response": "should be but be careful, I sent mine back.  the quality was horrible.  squeaky and sticky buttons"}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "I bought this keyboard in the US about a month ago. Standard QWERTY US Keyboard."}
{"product_id": "B0095P5K8I", "context": "How long is the cord on the mouse?", "response": "Mine is about 4 and a half feet"}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "Mine is large like the photo.   I can't recall off the top of my head if it has a smaller replacement in the box or not."}
{"product_id": "B0009VXBAQ", "context": "does this wii model read gamecube games?", "response": "Yes it does, Thank You."}
{"product_id": "B0016HG4H4", "context": "Is this set wireless", "response": "I bought this quite a few years back, but I don't think so."}
{"product_id": "B007SO6USW", "context": "Can you charge the controllers with the skin on them? I have a glow in the dark skin cover on one of my controllers and its a pain to have to take off", "response": "the port is a really tight fit.  it probably wouldn't work with a skin or anything else that would impede the connection in the slightest."}
{"product_id": "B0050SVHZO", "context": "the old wii remote works with wii U?", "response": "yes it does but you will need the motion sensor to use some of the games"}
{"product_id": "B00CPS59CE", "context": "is there a warranty on these? and also how do i know if these are authentic headsets?", "response": "I'm not sure if there is a warranty on them, but they are authentic and they work like a brand new set"}
{"product_id": "B004JKZUJI", "context": "Does it work with wii u?", "response": "yes, thats why i bought it, needed something that can do the classic controller functions of the wii and it did and also works rather well with the wii u's games"}
{"product_id": "B000ZKA0J6", "context": "So this is like Warcraft you have to play on line.. I hate that", "response": "You don't have to play on line. You  need to create an  account but you can play against the computer.  The game plays just like the original. I have been having a lot of fun playing it. If you liked the original you will like this."}
{"product_id": "B00IAVDPSA", "context": "do you need a kinect to use any of the remotes funtions?", "response": "No. Just the xbox one."}
{"product_id": "B00FE8WKPQ", "context": "Is this ready to play out of box or is another console required? Do I need to buy a regular Wii U first?", "response": "You need game system, controller and software. The pad is the controller."}
{"product_id": "B00CD1FCAC", "context": "Does this include a 2 year Limited Warranty offered by Corsair if I buy from amazon?", "response": "Yes. A slip was in the keyboard box stating I have a two year warranty."}
{"product_id": "B007SRM5U6", "context": "I didn't receive a code to download the bonus content. How can I get this content?", "response": "Easy, all the dlc content is on the disc.  All u need is Internet access and a psn id and your good to go ☺"}
{"product_id": "B00FEDP968", "context": "Can you use the headset and 5.1  speaker ports at the same time?", "response": "I've got my headset plugged in at the front USB and my Speakers at the back and I can use both at the same time"}
{"product_id": "B00DC7FWRE", "context": "Can one player use the Wii U gamepad or do all players have to use a Wii Remote Plus controller?", "response": "You need a Wii Remote for many of the core minigames, but not Wii Remote Plus. I'm not sure if any of the games require the motion plus, and if there are it's only a few modes. Specific modes utilize the gamepad, but you are going to want to have four Wii remotes to get the full multiplayer experience."}
{"product_id": "B009DYOPK0", "context": "I was wondering on a level 1-10 how loud the clicks are? odd question but gaming annoys the girl friend lol", "response": "On that scale, probably a 4-5. It's audible, but no anywhere near annoying."}
{"product_id": "B00FM5IY4W", "context": "Do you have to play this game online?", "response": "No you don't it's not like titanfall where it's online only this game isn't worth it save your money for GTA V later this year that would be worth every penny in value."}
{"product_id": "B00GBCLG0E", "context": "does it play ps1, and ps2 games", "response": "i dont have any ps1 or ps2 games to try so i dont know.  but i would assume that it should."}
{"product_id": "B0029LJIFG", "context": "What is the difference between this gold card and the newer version - besides price - wouldn't this one still provide 12 months of xbox live?  thanks!", "response": "Just the price. It's still 12 months of xbox live."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "No, even if you live in the contiguous US, this game does not qualify for release date shipping unfortunately (because the Monday prior to release is a holiday).They will ship it the day it releases instead of early like most big games."}
{"product_id": "B0018YXM3Y", "context": "Does this game run on windows 7 ?", "response": "Works with Windows 7 (Intel  i 7, 12 GB RAM, 2GB Nvidia Video Card). However, I have experienced game crashes which occurred during battles. I also had a campaign (with Prussians) freeze up which I had to abandon. I was able to complete another short campaign with Spain."}
{"product_id": "B000GCJ6MK", "context": "Does this game comes as a CD or DVD ? Are there any  other  appliances  that must be used i.e  joystick?", "response": "I ordered it on a DVD.  I think it can be purchased on cd's, also.  A joystick or yoke is preferable, but not necessary."}
{"product_id": "B0085VIILY", "context": "Does this come with a model plane? because the picture makes it look like that.", "response": "The Squadron Leader's Edition comes with the plane not the collectors edition."}
{"product_id": "B00KAI3KW2", "context": "Can you play classic xbox (1st console) and xbox 360(2nd console) games on xbox one?", "response": "Rajiv B. answered this already, but I just wanted to add some additional information. Xbox One has launched Backwards Compatibility Beta; it is only available for Xbox Preview Members as of June 15, 2015. All other xbox-ers have to wait until around November."}
{"product_id": "B0086UK7IQ", "context": "Did they iron out the firmware on this mouse, eliminating the weird motion skipping it suffered from?", "response": "My son said he has not had a problem with that at all with it. The mouse has been fantasic........."}
{"product_id": "B000LQ4HTS", "context": "Is this available for windows 7 ???", "response": "Hello, it works perfectly on my windows 7 system!"}
{"product_id": "B0041RR0TW", "context": "Do they come with batteries, if so what size, brand and/or type of battery?", "response": "I really don't remember if it came with them or not, but it uses AA"}
{"product_id": "B0053B5RGI", "context": "Can you enjoy this game by yourself, or do you have to be in connectivity mode and do multiplayer?", "response": "You will want to go multiplayer in the long run, but there's plenty to do by yourself like in the old games. You can easily put 100+ hours on single player on a pokemon game."}
{"product_id": "B00B3PDHBU", "context": "Was the packaging already opened upon arrival?", "response": "The package appeared factory sealed."}
{"product_id": "B00GJXMRX0", "context": "has anyone else had there pc completely shut down while playing assissins creed 4? mine does after about 25min. it has happened 5 times so far.", "response": "Haven't had that issue with this game, but I have had it on older computers. Sounds like either power supply or over heating issue as others have said already."}
{"product_id": "B00ESN8YGW", "context": "Region locked?? Is this game region locked or not? There seems to be conflicting info", "response": "Yes, its region locked. However, I bought the key on Amazon and used VPN to unlock it on steam. If you buy this game through vpn on steam, then you may have chance to ban."}
{"product_id": "B001GIUWX0", "context": "How many players can play at one time.", "response": "We have played with 4 racers at a time"}
{"product_id": "B00BCEK2LK", "context": "Does this work on Mac", "response": "I think it would work, but I am not sure."}
{"product_id": "B004JQK2E0", "context": "hey do i have to have steam to download port royale 3 on pc", "response": "Unfortunately I don't know. I did not download the game, I bought the disc. I don't think it uses steam though but I cant say that with certainty."}
{"product_id": "B002JVX5V4", "context": "will it work on laptop windows 8", "response": "It works on my desktop running window 7, so I assume it would work on version 8. Try it it's cheap enough."}
{"product_id": "B00CH923NE", "context": "Is this game better than Mario and Luigi 'Bowser's Inside Story'?", "response": "As a big fan of the previous games, no, it's not, by far. It's twice as long, with charmless writing, padding and backtracking, and endless tutorials."}
{"product_id": "B00A2WP4UC", "context": "What is included with this.  Does it play all WII games just like regular WII?", "response": "The Wii , the remotes and nun chucks, the skylanders game and starter pack. It is a fully functioning Wii. We use all games and watch Netflix on it. Great deal!"}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 8.1?", "response": "Yeah, I've 8.1 and it works."}
{"product_id": "B00ATF5YYI", "context": "will this play on win8", "response": "We have win7 and the game never did work.  Tried to get tech help from the makers online but that didn't work so called the long distance number and was on hold for about an hour and had to hang up.  Very disappointed !!  The game was supposed to have been a birthday present."}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "It only has one disk, but it takes about 30 minutes to download. It is a great game so far."}
{"product_id": "B00CX9L30W", "context": "i have it for pc but would like to play on ps4. will on characters be on both or will i have to start new ones", "response": "You can play your same character/s on either system because its the same account you normally log into for the pc. Only major difference is some added hub controls for the pc that do not show up on the ps4 version."}
{"product_id": "B00DE2W4PK", "context": "DOES THE PS4 PLAY THE PS3 GAMES?", "response": "No, the PS4 is not backward compatible like previous PlayStation consoles."}
{"product_id": "B007VTVRFA", "context": "Will this game work with Windows 8.1?", "response": "Yes. I am currently running on a Windows 8.1"}
{"product_id": "B00B98HF1O", "context": "Is this just for kids or can adults enjoy the game?", "response": "Adults can enjoy it too. Family night. ."}
{"product_id": "B00DC7G2W8", "context": "Can you use the Wii U gamepad? Or do you have to use a wheel?", "response": "You can use gamepad, pro controller, wii remote (with or without wheel), or classic controller (and pro)."}
{"product_id": "B0000C7GHG", "context": "does it come with memory card?", "response": "Unfortunately not. The system only comes with power cable, RCA cables, and the system itself. PS2 Memory Cards are to be purchased separately. I have 2x 128 Mb for $10."}
{"product_id": "B009GWLSFY", "context": "Does it have gauntlet?", "response": "It has Gauntlet and Gauntlet II!!"}
{"product_id": "B00I5LMSE2", "context": "Is this kirby in Chinese or in English", "response": "It's english, if it was in Chinese then it would have design symbols on the cover"}
{"product_id": "B00H8NS1K8", "context": "What systems do these work with? or just PC?", "response": "I believe in the other posts there are no issues using these direct from the PS4 controller. You can also use them with a mixamp from Astro or TB for virtual surround sound. Any other 3.5mm jack source."}
{"product_id": "B00821ME4O", "context": "is their rapid fire", "response": "Yes but it isn't great and there is no indication when it is on. I wouldn't buy it for the rapid fire option."}
{"product_id": "B00503EAG2", "context": "Can you play this game offline?", "response": "I couldn't. The game won't even let you load it if it's a used game (I tried), because you need the Steam password from the original owner. I ended up throwing the game away and getting a refund from the seller."}
{"product_id": "B00DC7FWRE", "context": "What controllers are supported?", "response": "We just have the regular Wii controllers and the Wii U controllers and they all seem to work just fine. It does come with a controller as well so for the price you can't really beat it."}
{"product_id": "B00CMQTVK0", "context": "does it come with warranty? and can you play minecraft the reason im asking is because i saw  a message somewhere , someone said that you cannot", "response": "It does come with a Standard 1 Year Warranty upon purchase when you register your console. You can play Minecraft, there is version for the Xbox One available for purchase."}
{"product_id": "B000OPOCFU", "context": "Where on the DVD is the product key.I tried entering and it still wont take it", "response": "Product key is on the top of the back page of the instruction manual. You can't miss it."}
{"product_id": "B00FFL0T46", "context": "I wanted to purchase this game but I do have a Steam account will this game will be able to be played through Steam?", "response": "Buy it through Steam. I did:-)"}
{"product_id": "B00FZ12F34", "context": "Will these work on a Wii U console?", "response": "Yes, but you need the Wii U base."}
{"product_id": "B000096L71", "context": "can it run on vista?", "response": "Probably, it runs on XP. It needs speed for all the graphics.  Processor and video card.  Runs fine on my hopped up old XP machine. The new edition  basically needs a high end gaming machine. Cool but not needed. MS generally runs somewhat old programs well, sometimes better. I am not an IT person."}
{"product_id": "B00GQTZ8TM", "context": "Does this really come with Pokemon X?", "response": "Hello. Thank you for your interest. Yes, it comes with X game already installed by manufacturer."}
{"product_id": "B00519C7CE", "context": "Can a 12 year old boy play this game? And not have it to many curse words", "response": "yes they can play it and in the settings menu you can shut off the foul language...at least you can in the zombies part."}
{"product_id": "B00286BZ4Y", "context": "Is this multiple choice?", "response": "Yes, you choose from multiple answers."}
{"product_id": "B00005LBHM", "context": "The game comes with the all box stuff?", "response": "No it does not come with the box or anything. Mine came in a game boy color cartridge case with a new battery. If you want one still in a box, it will cost a lot of money because most kids opened the box and then threw it away."}
{"product_id": "B002I0HJG8", "context": "Does this one give me Founder Status with the 8 Character slots, 4 bank slots and all, or do I need the Collector's edition instead for those benefit?", "response": "Yes, it gives 8 char slots and 4 bank slots. The only edge the collectoers edition has is the additional lion mount"}
{"product_id": "B00DCDZM2I", "context": "My grandsons have the trap team portal. Do they need this portal and disk to play the swap team characters?", "response": "They need to have the latest portal and the latest disks to use the latest characters. Older characters will work on any newer version."}
{"product_id": "B00CD90R4K", "context": "Does this come with French language mode?", "response": "Yes desire this game come With french language"}
{"product_id": "B000YQ639M", "context": "What are the computer specs for this game?", "response": "Sorry, I don't remember. I will need to rebuy the game one day."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "yes. but not as good as expected."}
{"product_id": "B0002DKTY2", "context": "does this dictionary have Audio pronunciations?", "response": "Not the one I got!  NO"}
{"product_id": "B00FNKMVUO", "context": "is the software user friendly?", "response": "yes it is , if you have any trouble there will be videos on youtube to help you"}
{"product_id": "B0015PHMFU", "context": "Hello, do I need to buy a universal adapter as well... for this univeral controller to work with my PS3? Thank you!!! :)", "response": "Hi! It comes with 2 plugs. USB and a ps controller plug like this http://img.dxcdn.com/productimages/sku_21329_2.jpg in the same cable. I dont have a playstation, I use it on PC but it says in the box that works with everything. It works fine for me on the pc thou."}
{"product_id": "B000PT18OS", "context": "What is the voltage and amp rating?", "response": "It was for my nephew so"}
{"product_id": "B008OQTR3S", "context": "I dont want to use the analog sticks, how can i switch to d-pad?", "response": "Sorry I can't help you there.  bought it for my 9 year old grandson."}
{"product_id": "B009D3HSTG", "context": "Can you get this to run on Android? I have one arriving and didn't think to check.", "response": "I'm a game developer and am fairly certain I've tested it with web browser based games on an Android tablet with a USB port, but I'll check again today. If there's no other comment from me on this, assume that it did work."}
{"product_id": "B00DC7G0GG", "context": "is it worth 50 bucks?", "response": "This is certainly worth $50. You can buy it used for cheaper, too. This is just my opinion, though."}
{"product_id": "B00009TW6R", "context": "Does this game work on a Powerbook G4 (Apple) and does it support controller? if so what controller", "response": "I am not sure. This specific game is made for desktops and laptops supporting windows. (unlike the original version for a console) Not sure about the controller, used a mouse and keyboard to play the game"}
{"product_id": "B00FBV6V56", "context": "I'm not experienced with refurbished products, will this have the same lifespan and quality as a new unit? I know ASTRO quality checks them the same.", "response": "I bought a pair a few weeks ago and was blown away at how nice it all is. Everything in the packaging is just like a new headset except the sleeve on the outside of the box says refurbished. There should be no issues with build quality or longevity compared to a new headset."}
{"product_id": "B00AU80ZSY", "context": "Will this work on windows 8 and where do I get a steam account?", "response": "Yes, it works on Windows 8. You can get a Steam account on steampowered.com."}
{"product_id": "B0099OZR9W", "context": "does anyone know if this will work in the xbox 360 E", "response": "All I know, is that the 360 slim takes it perfectly.  I would not know about the 360E, sorry."}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "There should be a cover/ panel on the wii covering 4 ports that they can plug into. Remember these are not for the wiiU. Just the wii."}
{"product_id": "B00BMFIXKQ", "context": "it is for One player or multiplayer?", "response": "It's has both, single player (story mode) and multiplayer (online)"}
{"product_id": "B00FEOR4MY", "context": "It looks as if you can play on it without taking it out of the case?  Has anyone been able to do that?", "response": "You can, but you run the risk of the games falling out."}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "I personally don't think so. I don't have a big head but it was uncomfortable for me."}
{"product_id": "B00E1DMWBM", "context": "this may be a stupid question but can it play sega genesis cartriges?", "response": "no, but you can download more games for it"}
{"product_id": "B002I0K3CK", "context": "Can this game be played on the original wii system", "response": "No, it can only be played on the Wii U"}
{"product_id": "B00ENFVJJO", "context": "Will it charge the Gold Wireless Headset ?", "response": "I doubt it will. The charging ports/cradles are shaped for DualShock controllers rather than the Wireless Headset."}
{"product_id": "B004QRKWKQ", "context": "This product comes with the Wireless Gaming Receiver Xbox? este producto viene con el Receptor de juegos inalámbrico Xbox 360?", "response": "I don't know the one bot is no longer listed and I just posted on the next best one for the product in general"}
{"product_id": "B00CERXJNW", "context": "So could this be a nice replacement for the good old Logitech G15?  Or not yet?  I hope those 18 keys on the side can be set up just as fast.", "response": "The software suite for configuring the 18 G keys is pretty straight forward. Once you unbox; I suggest to update the firmware. Once you go mechanical keys, there's no turning back. I would say the k95 is a definite viable replacement for a g15."}
{"product_id": "B0096L2SJ0", "context": "Can you use this as a gamepad for your PC or Mac as well?", "response": "Unless MOGA makes a driver for the PC or Mac to recognize the gamepad it probably won't work."}
{"product_id": "B002BRZ79E", "context": "Looks like a good game, just not into monthly subscriptions. Is that the only way to play this?", "response": "You get 30 days free...could just do the main quest/story line....and pay the 12 bucks for another month whenever something big is updated. But yeah..besides paying for base game and quitting after your 30....no other way."}
{"product_id": "B00EZKNT5O", "context": "How is the quality on these? I'm aware it's a licensed controller, but I'm still curious. PC gamer, have had Logitch F310 fail on me in under a year.", "response": "Seems to work great, pretty tuff controller if you ask me."}
{"product_id": "B004ASOLLM", "context": "Does it come with the charger?", "response": "No. it only comes with a USB cable. Hook up to USB to charge."}
{"product_id": "B00IRHE892", "context": "why does it say \"Batteries 2 AA batteries required.\"? never seen a wired mouse that needs batteries, could that be a mistake?", "response": "It's a mistake. This does not require any batteries"}
{"product_id": "B00BXONG7G", "context": "is the controller support better than BF3? i rember the controller support being horrible in BF3. i played BF4 on PS4 is the PC version different?", "response": "pc version is good"}
{"product_id": "B001Q24UAM", "context": "Will it work on windows 8?", "response": "Can't say for sure as I still use Vista but I would assume that Windows 8 has the ability to use earlier forms of Windows for earlier software programs.  Good luck!"}
{"product_id": "B00EZPCX1A", "context": "why does the blue 2ds cost more than the red 2ds", "response": "It shouldn't, is go to the store and get there if you can"}
{"product_id": "B000H1V56U", "context": "Does this work with the XBOX 360 core? And does it actually improve performance?", "response": "Yes, it works with the older xbox core system.  It does increase air flow and it looks neat in the process.  Its not going to stop a rrod system from red ringing but it should help a system to not get it in the first place."}
{"product_id": "B00F27JNGS", "context": "what is this for?", "response": "It's for playing vita games on your television. . But it is region locked and you must open a Japanese PSN account. I like mine would just love it if it was region locked"}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "You will get it immediately both in amazon website and via email."}
{"product_id": "B00E369SDM", "context": "Does this 12 gb  play fifa 2015 or I should get an external hard disc?", "response": "I tried to download and says no space available"}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "They are not something you will use with the original power charger. I treated both as some small gifts that the manufacturer sent out to customers."}
{"product_id": "B00CJD4HD2", "context": "Any weight balance issue? The G500 had a \"floating center weight\" that shifts and tug the mouse as you glide it, does the G500s suffers this? Thanks.", "response": "Our Design department uses these and they are not experiencing any weight balance issues.  They like the mouse, but if they had the option they would go back to the MX518. Apparently the MX518 is an all time favorite and no longer available."}
{"product_id": "B00DC7G2W8", "context": "Can you use the Wii U gamepad? Or do you have to use a wheel?", "response": "Also, you can turn motion sensing on/off with the touch-pad."}
{"product_id": "B0099OZR9W", "context": "can it be install on a xbox 360 model # 1439", "response": "I am not sure what that means, but this hard drive can be installed on any xbox360 slim. The newer black ones. If your xbox has a hard drive on the outside and is the original version, then it will not work. But if you have the slim, this is a good buy."}
{"product_id": "B0071NH8B8", "context": "Can you use this with regular WiFi, or do you have to buy the AT&T thing?", "response": "you can use it with any wi fi."}
{"product_id": "B00CTKHXFO", "context": "Does it include MGS: Twin Snakes?", "response": "Twin Snakes was a Gamecube exclusive, which was an upgraded port of Metal Gear Solid."}
{"product_id": "B00FZ12F34", "context": "Is buying this bundle just like buying them in store? Do each of characters and play sets come in boxes with power discs, and original packaging?", "response": "Yes they are all in original separate packaging just like if you were to buy them in the stores."}
{"product_id": "B005HN5LKY", "context": "I ordered this product and only received the cord that plugs into the wall, should I be expecting the brick, or is that not part of this purchase?", "response": "When I received my product, it came with brick, and cord."}
{"product_id": "B00DCBDNW6", "context": "Is there a monthly fee on this game?", "response": "Yes, there is a monthly fee but the game includes one free month"}
{"product_id": "B008TP1OKI", "context": "Battlefield 4 requires a 2gb hard drive space to install the game, but it needs a Microsoft offical hard drive. Will this HDD emulate microsoft HDD?", "response": "Yes it will I have Halo 4 a game made by microsoft and had no problems installing or playing it."}
{"product_id": "B00FYIXMHQ", "context": "Does the game used $ 83 brings beanie of Delsin?", "response": "This edition Includes the beanie"}
{"product_id": "B0018XWLKA", "context": "Will GTR EV. run on Windows 7, with a MOMO wheel? i have been burned before, buying games , then finding out they will not run on  windows 7... please help!", "response": "Yes, it works perfectly on Windows 7...even x64."}
