{"product_id": "B00JFCA6V2", "context": "dose it come with the charger", "response": "Yes.  Wall charger and USB"}
{"product_id": "B000H67DDY", "context": "what is the warrenty?", "response": "2 years like biggjoe said"}
{"product_id": "B0050SVNP8", "context": "Do you have to have played the first version to play Black and White 2?", "response": "The story is not wholly dependent upon the story of Black/White version. There are a handful of things that may make more sense, but nothing particularly necessary to enjoying the game."}
{"product_id": "B00GU4F4OM", "context": "How big is this thing?  I have large hands and FPS gaming can be a pain because my thumb and pinky usually drag on the mouse pad causing my shots to..", "response": "it's the biggest mouse I have ever seeen.  I too have big hands, and this one is comfortable fit for my hand."}
{"product_id": "B0073J8BYS", "context": "How big of a deal is it not having the motion controller?", "response": "You don't need it , actually are few games who need it"}
{"product_id": "B00CXCCH1I", "context": "does this game let you play with another person offline ?? if you add another control and the other person is next to you", "response": "Very disipointed game didn't work right out of box no scratches on it very in satisfied"}
{"product_id": "B007TYC8MI", "context": "It is in Spanish or English ?", "response": "It's in English, subtitles and all(where applicable)"}
{"product_id": "B00D3RBYM0", "context": "Have the bugs been fixed yet?", "response": "No. There have been no know patches. Unfortunately, it appears that this may not see a patch."}
{"product_id": "B00BCEK2LA", "context": "how does its size compare to the G502 Proteus Core which I've seen at Best Buy? My grandson is 14 and wants a little bit smaller mouse than some.", "response": "The G400s is larger, but it is very well designed to the form of a hand. It may be more comfortable for your grandson..."}
{"product_id": "B001O3066U", "context": "Replies indicate this edition will play on Windows 7 Home Premium.Reviews in other places indicate there are problems. What do you think?", "response": "I have Windows 7 Home Premium and this Scrabble plays perfectly.  I click the shortcut  and it appears instantaneously.  Responses are fast and graphics are excellent.  I have never had the slightest problem--except my playing ability above level 5."}
{"product_id": "B002XLR0JI", "context": "Is this product a mirror version?", "response": "The mouse has a glossy finish, so is the mirror version, although is not indicated in the product name."}
{"product_id": "B00005B8G3", "context": "On a scale from 1 to 10, how bright is the screen?", "response": "I'd say its probably close to a 3.  Its pretty dark but nothing a little light won't help.  When I'm playing mine I have to have a desk lamp pointed directly at it."}
{"product_id": "B003NSLGW2", "context": "Will it fit a Gamecube controller?", "response": "No it would not. To big."}
{"product_id": "B00DC7FWRE", "context": "What controllers are supported?", "response": "This comes with a free controller as pictured on the box. You can also use the standard Wii controller so you have two at a time."}
{"product_id": "B00DGZDFO4", "context": "The download includes the game or just the code to play online?", "response": "The download is the full game. You can also paste the code you receive into Steam to redeem the game that way."}
{"product_id": "B00ACMM9BO", "context": "I lost my instructions.. Where can I get a digital copy?", "response": "I have copy, but dont kno about digital copy, not that computer savvy! If u getvit to work please let me know if you figured out how to work the DROPSHOT????"}
{"product_id": "B001AWBYRA", "context": "Can u play modded zombie maps ?", "response": "watch out xause they'll eat your brains"}
{"product_id": "B000B78F72", "context": "Does this cd have the ORIGINAL CLASSIC SOLITAIRE????    I already purchased a cd that had 100's but did NOT have the classic game I wanted.....", "response": "On the original OLD \"Klondike\" solitaire, can you undo a play and go back to try another card...this is how I win some games.  Also, does it keep a percentage score running for you like the old ones did?"}
{"product_id": "B00D6PTMHI", "context": "Does the cable plug into USB? My laptop does not have audio-in", "response": "Yes the real tone cable plugs into the 2.0 usb port."}
{"product_id": "B001CXYMFS", "context": "does the Thrustmaster T-Flight Hotas X Flight Stick by Thrustmaster work on all flight simulators games for macs", "response": "I cannot say if it works on all of them but every game I have used it on for both mac and pc it worked great."}
{"product_id": "B0017Q4DGI", "context": "CAn you use this game on the wii u?", "response": "You know I'm not quite sure of that. But I don't think so. But go to any place that sells these tapes where you live and someone should be able to answer this question for you. I wish I could help you, but I don't know much about game systems much. Good Luck."}
{"product_id": "B00IAVDPSA", "context": "Does the remote stay \"on\", or will it shut itself off like the controller?", "response": "It's more like a TV remote. It only glows when it moves. It's never \"on\"."}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "They are equivalent imo; Uncharted has a slightly better gaming experience over Tomb Raider (more events, rich scenes, better progression, easier to reload content, go back at any point, etc.). Tomb Raider is a better story, easier to bond with the character and raiding tombs is a plus. I would choose Uncharted over TR."}
{"product_id": "B00DE2W33I", "context": "How many controllers does the console come with?", "response": "I just double checked my account details and I'm only seeing one in the description"}
{"product_id": "B00005B8G1", "context": "I have seen a device called the GBA Worm Light (Screen Light for Gameboy Advance) does that mean you need light on the screen to see the game?", "response": "Yes with standard game boy advances there is no back light but the gba sp does have a backlight"}
{"product_id": "B002TLTBN0", "context": "Can you use this controller to play GameCube games on the Wii? Something like Soul Calibur 2?", "response": "No, it only works for the Wii..."}
{"product_id": "B00CMQTVUA", "context": "Hi, Can I use this in India?", "response": "Don't buy power converter that is risky rather buy universal power supply brick that is easily available in India for around $15.. Happy gamming :D"}
{"product_id": "B000PS1TG6", "context": "will this work for guitar hero if i use a ps2 guitar will it work on my ps3???", "response": "It will not unfortunately. It does work with dance pads and regular PS2 controllers. If you want a link to one that does work, check my review :)"}
{"product_id": "B005M2KSLC", "context": "Is this version 1 or version 2?", "response": "I believe it is the second version because it has the newest avago optical sensor."}
{"product_id": "B00H7KDNBO", "context": "How well does this game run on a 2012 non-Retina 13-inch MacBook Pro (Windows 8)? Is it playable on at least the minimum settings?", "response": "Sorry mate, Windows OS Only.Minimum System Requirements:Supported OS: 64-bit Windows 7, 8, 8.1Processor: AMD Athlon X2 2.8GHz or Intel Core 2 Duo 2.4GHzRAM: 4 GBVideo Memory: 512 MBVideo Card: Radeon HD 4770 or GeForce 8800GT"}
{"product_id": "B005FMLZQQ", "context": "anyone happen to know if this remote works with windows media center?", "response": "Yes but my kids keep losing it!  It works great when I can find it!"}
{"product_id": "B004ASOLLM", "context": "I have one of these I got from a friend but no charger what kind of cable does it require to connect to headset?", "response": "not sure if this is the right size but maybe you can find 1 with changeable ends. USB to 2.5mm DC Charging Cable"}
{"product_id": "B001BYMZ5W", "context": "is there a better gaming headphone than this? or this is top of the line?", "response": "They are high quality.  Very good value."}
{"product_id": "B002B9XB0E", "context": "Does this Buffalo Game controller have R and L buttons?  Pic doesn't show it.", "response": "Yes it does. Just like the original."}
{"product_id": "B002AQNT96", "context": "will this game work on windows 7?", "response": "Well....I don't have this game...it was a gift for someone ...I never got to play it myself..sorry....but there were NO compliants from the receiver of this gift...so I take it ...it work just fine..."}
{"product_id": "B0041RR0TW", "context": "Any Ubuntu Linux users? I'd like to buy this for my Ubuntu 13.10 gaming rig.", "response": "I can't say directly, but the controller does have two modes.  If Ubuntu can handle either Xinput or DirectInput controllers, then in theory it should be use this controller (A quick Google search leads me to believe it has native Xinput support and you can get Directinput working using a Utility called xboxdrv)."}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "No, it has 60 campaign missions, LAN battles, and player vs computer. (Also has online)"}
{"product_id": "B00E369SDM", "context": "does it come with wireless controlars", "response": "It comes with one wireless controller"}
{"product_id": "B004UJNN5G", "context": "Do you need another version of sims to play this game?", "response": "yes you need the base game sims 3"}
{"product_id": "B009Q8PP16", "context": "does it work for black opps 2", "response": "Sorry Alexander we returned the controller because it did not do what they advertised. It was basically just like a regular controller. I hope that helps"}
{"product_id": "B001ELWMHI", "context": "Can you buy games for this model today?", "response": "Yes,they have them on Amazon and eBay"}
{"product_id": "B00ENFVJJO", "context": "does it charge one controller at a time even if you dock both at the same time, and automatically charge the second after the first?", "response": "It charges both at the same time."}
{"product_id": "B002L93F0A", "context": "Am I right when I see that there are two (2) controlers for $12.50 price?", "response": "Yes, there is two controllers for that price. Well worth of your money."}
{"product_id": "B005F1ZUU4", "context": "is the one that can work with the Xbox One as well??", "response": "If you're looking for an adapter for your PC that will connect an Xbox One controller to your PC, you may be able to already connect it using a USB adapter made for the controller.I don't know much about the Xbox One controller and its properties but do some research before you start spending your money."}
{"product_id": "B007SO6USW", "context": "Can you charge the controllers with the skin on them? I have a glow in the dark skin cover on one of my controllers and its a pain to have to take off", "response": "It will charge with it on, but it's tough to get it in the charging port just right."}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "I remember Galaga was developed for Namco"}
{"product_id": "B00009VRG5", "context": "I see these I spy game for sale list \"Older Version\" what is the difference between the old and new version? Somelistings do not mention old or new...", "response": "They may mean older publications.Referring to new as in compatible with vista and above. Maybe, not the answer."}
{"product_id": "B001GROEEO", "context": "This works for the ps4?", "response": "yes, i does. PS card are able to use in all sony's console."}
{"product_id": "B00EOI2MRS", "context": "Does this controller come with the cord? I understand from the description it is used only with a wire, just asking if the cable is included.", "response": "Yes. It is hard wired."}
{"product_id": "B0086V5UF0", "context": "Where can the \"just dance 4\" be played? Because I can't play it on DVD/CD player.", "response": "You have to have a Nintendo Wii system to play it."}
{"product_id": "B000B6MLPU", "context": "I have the new xbox model. It's called the Xbox E . With this model it only has a hdmi port. The picture makes i look like it will fit. Will it work?", "response": "You answered your own question actually; it is only able to use an HDMI cable. AV/Component output is not supported for that model so this product would serve you no purpose."}
{"product_id": "B00G0OYHCW", "context": "Are the games Physical or Digital?", "response": "The ones I bought which are Mario 3D World and Donkey Kong are both Digital. Very good games in my opinion."}
{"product_id": "B00FQFFQ2Q", "context": "does this come with case", "response": "some do some don't. mine didn't."}
{"product_id": "B00EEMLRTS", "context": "Does this include a code to download the ghost camo? Thanks", "response": "yes it should be in with the game case"}
{"product_id": "B009LGO88E", "context": "Does this work with Smash 4 as a c-stick?", "response": "Not that I know of. Usually games have an option for the circle pad pro in the control options (MGS 3 did), but Smash did not."}
{"product_id": "B0085P7U0U", "context": "Does this software work with new operating system Maverick", "response": "I don't have Maverick...works well with OSX"}
{"product_id": "B002TLTBN0", "context": "WIll these classic controllers when plugged into the wii remote, be compatible with Smash brothers?", "response": "If you're talking about Brawl, then yes. My brother prefers to play that way actually."}
{"product_id": "B007A7UJ4S", "context": "Does it have spanish sub titles?", "response": "Yes it does :). In the setup you can choose the languages From English French and Spanish"}
{"product_id": "B001EYU1WS", "context": "Does this connect with USB?", "response": "Yes. Be warned, though, that's is only compatible with Microsoft FSX. The driver software does not allow for custom programming, it has a plugin that automatically loads with FSX."}
{"product_id": "B00A0EPNPI", "context": "Is it a mechanical keyboard?", "response": "It is not a mechanical keyboard but it is a very good keyboard"}
{"product_id": "B00FXOP1JI", "context": "is this the same size as the DSi XL or is the screen on this bigger ?", "response": "The screen on the 3ds xl is supposed to bigger than the dsi xl screen."}
{"product_id": "B003O6E986", "context": "Can I use 1 Kinnect (xBox 360) on 2 players with split screen simultaneously? Thanks", "response": "I'm sorry I am unable to answer this question."}
{"product_id": "B008U5ZNIG", "context": "I have a razer black widow (mx blue) and some keys feel different. They make a weaker click sound and tactile feel when pressed. Is this normal?", "response": "This is a mechanical...as opposed to electronic...keyboard.  That is the reason it feels and sounds different.  For a gamer, according to my sons...all three of them...this is kind of a 'purist' thing.  For me, it is a matter of perference."}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "This controller is NOT a plug-n-play for Windows 10 64-bit, in fact, it wont work at all on Windows 10 - 64-bit."}
{"product_id": "B000OYMYZQ", "context": "How many charge-and-play kits can be plugged in at the same time to the Xbox 360 250gb console?", "response": "I believe only two can be plugged in since there are only two usb ports on the front of the Xbox 360. I could be wrong."}
{"product_id": "B0009WPZOA", "context": "Is this the same as the other need for speed most wanted", "response": "It is not.  There are 2 different versions, several years apart"}
{"product_id": "B0017HLYNC", "context": "Does this game work with Windows seven or just XP?", "response": "Don't know.  I run XP and it works there."}
{"product_id": "B00E1L78N6", "context": "Is Polk Audio 4Shot Headphone - Black - Xbox One wireless?", "response": "Question Thank you. This product does not have now. Thank you for the question"}
{"product_id": "B00DBKSN8M", "context": "Hello friend, I would like to know that quality is the PS3 has a defect ?", "response": "No defect that I know of. Since buying this system it has been a champ!"}
{"product_id": "B00FOGFP0A", "context": "I have heard that PS3 games are not region locked? This game only came out in the UK and i have a US PS3, will it work?", "response": "I have it and I have a US ps3. It works!"}
{"product_id": "B005QUQP80", "context": "Does it have extra USB port?", "response": "There is a peripheral USB port located on the top."}
{"product_id": "B0057WDBHA", "context": "is it wireless or wired?", "response": "It is wired and long like a PS3 usb cable."}
{"product_id": "B00GS6A6V8", "context": "I am in Australia and have purchased the base game here (in Aus), will this DLC bundle work on my PS3 with my game?", "response": "I purchased the base game in the US and the dlc bundle works on my PS3.  You are buying a code that will allow you to install the dlc on your system.  So it goes along with the base game."}
{"product_id": "B00CPKUV98", "context": "Is this 720p or 1080p resolution?", "response": "It says HD Video Output 480P-720P"}
{"product_id": "B00H72EMP8", "context": "can you hear your own voice with this headset?", "response": "No. Its not like turtle beaches where you can like hear yourself through the speakers."}
{"product_id": "B004QRKWLA", "context": "Hi, those any one know if it will work with Mac computer?", "response": "Better question: why would anyone be foolish enough to buy an overpriced Mac, especially if they want to use it for gaming? Macs are complete trash."}
{"product_id": "B00886XQO0", "context": "my son has connected and the audio works but they mic wont work it is giving him an error code of 8001009", "response": "Kim,Joshua has the best advice and have your son or you follow his instructions.If all fails contact Amazon and let them know the problem and you can get an replacement right away!"}
{"product_id": "B00EFFVZP0", "context": "This game is in language or subtitles in Spanish?", "response": "Mine is in English im not sure if you can change the language on it"}
{"product_id": "B00EFFW0HC", "context": "does it still have bugs now", "response": "Yes. 6 months and 9 updates later and it is still a lame excuse for a game. That is if you think a game is supposed to be fun."}
{"product_id": "B004QRKWLA", "context": "How long is the cord?", "response": "I measured it a while ago ( i think it's in a previous question as well) but it's quite long, I believe in the area of 8 feet."}
{"product_id": "B007JDMPOK", "context": "If I already have Tera on my laptop, can I use the code to get the goodies, and use the disk to install on another PC?", "response": "The code will only work once.  So if u use code on laptop version and unlock everything and then u use disk and install on another pc u will not be able to activate it."}
{"product_id": "B00CERXJNW", "context": "Hey, I'm a programmer and the one thong that really matters to me is: Can you adjust the G-Keys to type text? It would be very cool!", "response": "Yes, you can make them type strings of letters and numbers and choose the delay between each keystroke. Anything else you need to know?"}
{"product_id": "B006YDPU48", "context": "IS THIS GAME ONLINE ONLY?", "response": "No, it is perfectly fine to play offline only, but you will not get the PVP experience, the invasions by players, etc."}
{"product_id": "B008XHCLFO", "context": "If I put my 3ds xl in this case would it be able to still fit in here?: HORI Retro Mario Hard Pouch for NEW 3DS XL and Nintendo 3DS XL", "response": "can it fit a mugen extended battery inside?"}
{"product_id": "B000FQ9R4E", "context": "My son is 8 and wants this game for his birthday.  Is it inappropriate for an 8 year old?", "response": "the reason it's T is so young children will not get riled up because of the fast violence"}
{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "Of course it work in the us psvita .  You need this games monpiece monster japanise region neptunia u. senran kagura."}
{"product_id": "B0009WPZOA", "context": "Is this the same as the other need for speed most wanted", "response": "Nope not even close. I consider this version better and more challenging"}
{"product_id": "B0009SUW4W", "context": "Will it work on windows 8?", "response": "Sorry cant help, only have Windows 7."}
{"product_id": "B004MR3QY4", "context": "What is the difference with the black edition?", "response": "That looks like a right handed mouse."}
{"product_id": "B001GIOGBY", "context": "Hi, Can I used with my X-Plane 10 Global Flight Simulator in my Mac computer ??? the info is very confusing, please answer me before I buy it. Thanks", "response": "Yes, you can. Works without problems. Mountain Lion."}
{"product_id": "B00EEMLRTS", "context": "is this worth the price", "response": "Yes.  Multiplayer is awesome and the camera in the kit is very cool n. We use it all the time."}
{"product_id": "B00D9EPI38", "context": "So, DOES it have hdmi output? (The Xbod itself is not a monitor so I can't \"watch movies right on it.\" I still have to connect to a screen)", "response": "Yes but it depends on the tv because sometimes if you have a different tv it will set up differently"}
{"product_id": "B00004XRBB", "context": "Does it work on Windows XP?", "response": "I don't see why it wouldn't but there are workarounds for vintage games like dosbox that will trick the game into thinking it is running on an older version of windows so it can still be played"}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "It does!  I was actually surprised that it did."}
{"product_id": "B00009TW6R", "context": "work for Windows 7 Home ?", "response": "Worked fine for me. Burned my old disk in house fire, and had t replace that scratched one with the new. Good game and hear, good online."}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "It's a regular rechargeable remote like other ps3 controllers"}
{"product_id": "B00CX8VY4S", "context": "Is this game appropriate for my 12 yo son? Haven't looked into it yet.", "response": "Not from a responsible adult perspective."}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "No free files. Deduction Pro 2012 is included in the Block at Home software itself."}
{"product_id": "B00821ME4O", "context": "it weight really 5 pounds?", "response": "No, but it is very laggy. Like almost unusable. I returned it after a week. Looks nice, works terribly."}
{"product_id": "B000K9Q5NW", "context": "Flight Sim Seat Possibility? Is it possible to get a pair of the Playseats Gearshift Holder Mounts to put on both sides of the playseat and have a flight sim cockpit?", "response": "Wow, I appreciate the time you are taking to explain me this. Could you share the pictures on the product page too:http://www.amazon.com/gp/customer-media/upload/B000K9Q5UK/ref=cm_ciu_pdp_add?ie=UTF8&rnd;=1280598311so everybody can see you amazing setup? thing is I don´t know how to share my email privately.Thanks again."}
{"product_id": "B00I9UVY30", "context": "Is there coop online? meaning from the same PS3 system can 2 people play against someone online?", "response": "No it is not possible boy, just 1 v 1 feature, that's not even fair play guy"}
{"product_id": "B00FNKMVUO", "context": "What is the surface material on the mouse?  Is it soft touch smooth plastic (PU)?  I have a Logitech G602 wireless and it has a pebbly texture I hate.", "response": "Yes it is smooth plastic. It feels very good when u touch it. :)"}
{"product_id": "B0083H4NG4", "context": "Hi, i dont understood if thisa mouse had wheel tilting or not, i rly hope there is no tilt wheel function. i hate it on my precision mx.. if i need to", "response": "By tilt, you mean two additional click types by moving the mouse wheel to the left or right?  No, The mousewheel doesn't have that functionality. Just center click, and the scroll."}
{"product_id": "B00GANWVJE", "context": "I want to buy this game but it says 3Ds, is it eligible with a regular DS or just 3Ds", "response": "Just for 3DS.It won't even fit a regular ds slot."}
{"product_id": "B003O6EDSM", "context": "Is this game like Dragon Age (RPG) but with guns instead of swords and magic?", "response": "It's made by the same people, so I guess so. Never played dragon age, but it looks very similar."}
{"product_id": "B007MJSZDQ", "context": "is it good and last along time", "response": "I just received these but I can tell you already, it is so nice not to have batteries.  You just pop the rechargeable pack onto the remote and go.  Once it runs down, you recharge overnight and off and running.   I have these for the Wii remotes also, so much better!!!"}
{"product_id": "B00FAN4LRA", "context": "How sturdy are these headsets?", "response": "Very good my boys love them. Sometimes  the plug pulls out."}
{"product_id": "B002I0GF72", "context": "What controllers are supported?", "response": "The Wii U Gamepad and the Wii U Pro Controller."}
{"product_id": "B001BYMZ5W", "context": "Do these headphones offer sidetone? That is, can you hear your own voice through the mic?", "response": "I agree with Chris, you have to select the option through Windows playback. You can select \"Listen to this Devise\" and then you will hear you own voice."}
{"product_id": "B0016HG4H4", "context": "Will this work with Wii Band Hero?", "response": "Hi Beth,I believe it depends on which version, try looking at this page http://www.wired.com/2008/11/official-guitar/"}
{"product_id": "B001NT9TK4", "context": "Will this wheel work with windows 7 ultimate 64 bit os?", "response": "Yes, works with all windows platforms from xp and up."}
{"product_id": "B00ARCWQOO", "context": "So....MLB2k13 is the last in the series?  No version for 2014 for xbox 360?  Do they at least update rosters for 2013?", "response": "That I don't know. I l"}
{"product_id": "B008UQWX0Q", "context": "how many games brings ?", "response": "It doesn't come with any games. The games are sold separately."}
{"product_id": "B004N7IIQ4", "context": "Are the wires very long", "response": "yes and no the complete unit reaches over 10-12 feet but the control until goes 1/2 way but you can easily extend the usb that needs to connect to the console"}
{"product_id": "B00BI9MDSO", "context": "it is good protection but i afriad it will make damage or breaking ps slim or not because it is very very fit to push push and push even take off also", "response": "I'm not sure if the slim is designed to fit in there the same way as the original - you might want to look for a slim-specific case."}
{"product_id": "B005L38QK2", "context": "How long is the cord?", "response": "6 ft and it is heavy duty"}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "No. It is made in the United Kingdom by UBISOFT, but it is licensed by Microsoft."}
{"product_id": "B000K9Q5NW", "context": "What is with the fluctuating price? This seat was $299 last week.  I've seen the price move up and down around that number over the past several months.  Why the volatile price?", "response": "I'm curious too. I was researching this seat at various forums and it looks like the price once dropped to $199."}
{"product_id": "B009SJR278", "context": "Does it work on the ps4?", "response": "does the mic work?"}
{"product_id": "B0045FEEAS", "context": "is it game cube controller compatable", "response": "I really don't know I have not tried it thanks asking"}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "Yes is compatible and talk and playing online in ps4"}
{"product_id": "B001DPZE84", "context": "I have never played a flight simulator game before, and i am not a pilot. Could i still learn to play this game?", "response": "yes. my 8 year old had no issues figuring it out. It can be as complicated or as simple as you choose. Great simulator. Lots of free add ons, plane packs etc."}
{"product_id": "B00BGAA0SU", "context": "is this infamous really the limited edition?", "response": "no I ordered the limited edition and got the Normal version no Code."}
{"product_id": "B007VTVRFA", "context": "If i buy this off of Amazon can I play multiplayer with friends who buy it through EA?", "response": "Yes, when you buy it from Amazon you'll get a code to download from EA Origin."}
{"product_id": "B0000C7GHG", "context": "Does it come with Dragonball Z Boudkai Tenakichi 3?!!!!!!!!", "response": "No just the console."}
{"product_id": "B00FQFFPZO", "context": "can you vary the number of laps in a race or does the game force you into 400 or 500 miles?", "response": "you can set the race to a percentage of the full distance. i usually race at 30 percent which forces you to make one pit stop"}
{"product_id": "B000YQ639M", "context": "do i need steam to install Medieval Total War II Gold Edition?", "response": "It connects to steam to install.  It's a steam game, i.e., you cannot play with your family member or friends with one purchase.  If you want multiplayer games, each person has to buy a separate copy, which stinks big time!!"}
{"product_id": "B00CHGYUE2", "context": "Does this come with the nuketown map on it?", "response": "Just received this today and Nuketown 2025 is not already on the disk but multiplayer requires it.  Unfortunately it can't be found on Xbox Live and that's even after (right now) chatting with tech support.  It's also not accepting the revolution map dlc game code that was in the box.I'm not so sure about this right now."}
{"product_id": "B0087ZMATE", "context": "I am wondering if the mic volume is very good or not. I have a cheaper headset and the mic is almost inaudible, even when boosted from the PC", "response": "Mic works really well."}
{"product_id": "B00A878J5I", "context": "My son damaged the original charger cord for the Wii u pad , the one that comes with the system . Will i have to replace it now that Im buying this?", "response": "No you will not the pad rest on there just like it did on the stands that came with the WII U."}
{"product_id": "B002I0HD9G", "context": "Can I control the weather in this game while free-roaming??", "response": "Free roam is available all the time, and, from what I remember, you have no control over the weather, or day to night. It's been a while since I played the game."}
{"product_id": "B008FHL56S", "context": "for a xbox 360 slim do i need to buy a 500gb slim or a 500gb and does the 320 work better than the 500", "response": "You need the 500gb slim version or you can take apart the regular 500gb one (if you have the right screwdriver).  The 320gb and 500gb both work well, it just depends on how much space you need."}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "Yes, there is a game in the works called Don't Starve Together. If you own Don't Starve you get Don't Starve Together when it comes out. The beta for Don't Starve Together can be found on Steam. If you apply for the beta here you can play it early. http://dontstarvetogether.com"}
{"product_id": "B00F2ENJY8", "context": "Do the regular wii controllers work with this system?", "response": "All controllers and accessories for wii should work just fine. Only those made specifically for wii.  Gamecube controllers and WII U PRO controllers are not made for the wii. The wii mini will however work  with the wii classic and classic pro controls and balance board and wiimote (the motion control)  with nunchuck ."}
{"product_id": "B004QRKWLA", "context": "Do I need to calibrate or download programs and are the programs included?", "response": "what about with windows 8 can any one confirm its plug in and play?"}
{"product_id": "B008FHL56S", "context": "Does this work with Destiny?", "response": "It works with my x box 360 with out any problem. You will see this dive with Chinese/Korean sign on it.  It is storing all games and downloads. Works with skylanders trap force ( new one) plantz vs Zombie, mine craft Etc."}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "yeah, its take some force to adjust to fit your TV. i was scared at first but its a lot more durable then you think it it."}
{"product_id": "B004J6KRD6", "context": "Has anybody been able to get this to work with the xbox1/360/ps4 ?", "response": "This wheel only works on PC and PS3. It's designed for Gran Turismo on the PS3 so it never had Xbox support within reach, but UNOFFICIAL PS4 support has a chance to come in the future."}
{"product_id": "B009RXUOD4", "context": "Can I use this by connecting it directly into my ps4 controller", "response": "Yes you can but you will experience feedback issues,  its not worth it. Just go with the usb set up, plugging it into the controller is more of an xbox thing."}
{"product_id": "B00DCDZM2I", "context": "is this compatible with xbox 360?", "response": "The portal and disc will not work on the xbox360, the figures will work across platforms. I have both 360 and the Xbox one and interchange the figures regularly."}
{"product_id": "B0050SYX8W", "context": "All right i'll admit it, i'm a bit challenged when it comes to some of these things. My question is-if i buy this halo 4 x box game will my grandson be able to play this on his i pod?", "response": "Unfortunately, no. Xbox is a Microsoft (Windows) company; whereas, iPod is an Apple product.  Having said that, even if Xbox WAS an Apple product it would need reformatted by the developers.  Sorry for the inconvenience!"}
{"product_id": "B008CP6Q6M", "context": "Does this game sold from the Official Amazon, will it include ALL Discs and DLC Codes? Alot of people have been complaining about missing games.", "response": "My copy came with everything. And the codes got me another copy of second game and trial of first... dont know if that is how its supposed to be"}
{"product_id": "B007CM0K86", "context": "Is there any detailed information on what this game will be like and include for PS4?", "response": "It will release this year with more better graphics & included all DLC's & multiplayers maps"}
{"product_id": "B0015PHMFU", "context": "Has anyone successfully modded this arcade stick? Some people say the buttons holes are too small, but what about the joystick?", "response": "Does the Mayflash chip have some kind of special advantages over something like a Zero Delay?"}
{"product_id": "B00EOI2MRS", "context": "Does this work with the God of War Saga games? I can't press the buttons fast enough and want to play the games.", "response": "It works just as well as a stock playstation controller. Turbo is cool but I doubt it will help. Devil may cry is similar and u just need to learn how to play better honestly. Beside the tiny size diff,I love it. Bought two."}
{"product_id": "B00ATF5YZM", "context": "Do you need steam to download this game?", "response": "that's what I used. not sure if there's another client to download from..think its only steam"}
{"product_id": "B004C4U1VI", "context": "why cant i get sound when i hook up my ps2?", "response": "If you have it plugged into multiple systems at the same time, it will sometimes do that. try only having the ps2 plugged in and see if that fixes it"}
{"product_id": "B00AFYAUYW", "context": "Are the game cube ports included on this unit? I see them in the pictures, but then at least one reviewer says that they are missing.", "response": "I have located the missing item. How should and where should I ship to you. Sorry, My mistake as I have no use for this."}
{"product_id": "B00HFZ5KCG", "context": "Is this unit region-specific?", "response": "Nope! Sony products (unless specified) are region free."}
{"product_id": "B00I4C2EKA", "context": "What is steam client?", "response": "Steam is a program that let's you buy games, redeem codes for games, then launch games that are installed on your computer. Kind of like a game app store for your computer. Link to website: store.steampowered.com"}
{"product_id": "B00JFCA6V2", "context": "Is the OLED screen really worth buying this if you already have the newer, slim version?", "response": "No, not enough to buy one."}
{"product_id": "B0050SYILE", "context": "Is Assassin's Creed 4 a better choice than Grand Auto Theft V?", "response": "I'm a bigger fan of gta v. So I would go with the more free world map where you can out commit crimes and get chased by the cops. AC 4 is more of a story game with navel battles in between."}
{"product_id": "B0076HD2W8", "context": "does this work with a mac", "response": "We  don't have MAC"}
{"product_id": "B0000CNUUP", "context": "do you need an internet connection, thanks", "response": "Nope not at all"}
{"product_id": "B00FKV8AK6", "context": "Is XBox live (or internet connection) required to play?", "response": "No Xbox live on internet is required to play."}
{"product_id": "B00DUANBQM", "context": "Hello, May I ask ?   Does the old games in my PSP 1000 play in this PSP 3000 console ? Thanks !! :}", "response": "Yes, A PSP is a PSP! Just like ps3 game work in a phat and a super slim."}
{"product_id": "B00DB9JYFY", "context": "Do you need a \"chat headset\" and a \"Kinect\" in order to play Titanfall?", "response": "Thank you for contacting us. You will not need to use these items in order to play this games. Those items are optional."}
{"product_id": "B00BV72X1U", "context": "Would this work with windows XP?thank you in advance", "response": "The easiest way to set this device up is to install the Microsoft drivers and then manually select the driver in your device manager. With that being said there is an option to download XP drivers from the Microsoft site. I installed it on my laptop that runs XP and it worked fine for me."}
{"product_id": "B00FM5IY38", "context": "does this game require the kinect", "response": "No it does not"}
{"product_id": "B00DCBDNW6", "context": "Can the PS4 version play cross-platform with PC?", "response": "I'm pretty sure you can, even with ps3."}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "There should be a cover on the top of the Wii that can be removed, and underneath are the slots. I don't know if the WiiU has these slots."}
{"product_id": "B00GP0HQ3S", "context": "Does this come as shown in the picture without packaging or is it factory sealed?", "response": "It is factory sealed...like Fort Knox!"}
{"product_id": "B00A878J5I", "context": "if I leave the sleeve on, does the remote plus controller still fit?", "response": "You can't charge it with the sleeve on. They give you a special battery cover for the Wii Mote that has a hole where the recharge battery pops through, so it needs contact in order for it to charge."}
{"product_id": "B0011E4J7O", "context": "Can I use this with a wireless controller for PC with a AA battery pack?", "response": "No, the charger is just for the rechargeable battery pack that you can buy with the charger (it is Microsoft brand, not a knock-off)."}
{"product_id": "B00H1FCUBE", "context": "Is there a mute button for chat?", "response": "The only mute there is comes from the phone not the headset."}
{"product_id": "B0050SY4DG", "context": "This game comes with multi idioms included spanish?", "response": "Idiomas is Languages in Spanish, I believe. As Ian Sartwell said, you can download the Languages pack and switch it to Spanish."}
{"product_id": "B000FRU1UM", "context": "Has any one had problems playing/installing GTA or is it just me?", "response": "No I haven't had any issues with it and I'm nearly 3/4 through the game. Does your disk have scratches/dirt? if so you may want to take a cotton ball and some rubbing alcohol and thoroughly clean the disk."}
{"product_id": "B00886XQO0", "context": "I have the Headset Adapter that came with another set of Turtle Beach headphones, can I plug these into that for my Xbox One?", "response": "Hi there , that has no problem. It is compatible with Xbox one, even apple products and so and so"}
{"product_id": "B00ERDGMT4", "context": "hi, does this game come with everything offered by gamestop?", "response": "No, there is no subscription to a magazine you will never read nor renew and no being for money for games that aren't even fine yet."}
{"product_id": "B001E27DLM", "context": "Which languages does it have? Is Spanish included?", "response": "Unfortunately, there is no Spanish in this."}
{"product_id": "B009DYCTY4", "context": "What is the model of this console? Does this still have the original firmware version?", "response": "The model I got was CECH-4001B. Presumably the firmware would not be the firmware of the very first PS3. Probably the firmware must be updated in order to use the online services."}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "yes I think its abetter game for  alarge screen I phone"}
{"product_id": "B00FNQUN7Q", "context": "hello friend which sends the code?", "response": "not sure what you are trying to ask. Its a play station plus membership code sent by Sony and can be used for US based sony accounts."}
{"product_id": "B00GOOSORM", "context": "I'm new to this.  I've never heard of a time card.  Can someone explain what it is please?", "response": "Yes ..I switched to this time to avoid the credit card Hassel. Buy it and add the code on back to redeem 2 months of play time.. it's does not add anything but play time. . If you want crysta you have to buy a different card or use your bank card.."}
{"product_id": "B00CHSY0R2", "context": "have a question about these recertified headphones. why where they recertified and is there a warrenty on the product?", "response": "Unknown as to why they were recertified. But these are factory recertified and do come with a warranty."}
{"product_id": "B00JC9SWSC", "context": "does the bundle have move controller pack", "response": "The PlayStation 3 500GB Lego Hobbit Bundle does not include the motion controller pack. In regards to controller, the bundle does come with the DualShock 3 wireless controller."}
{"product_id": "B00475AYUA", "context": "can more than one unit occupy the same space of land at a time?", "response": "Of course. This is not only possible but necessary for military success."}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "Not universal but I can use it in 220v with no problems"}
{"product_id": "B00ECOAX34", "context": "How does the game look on the Wii U compared to the PS4? I have both systems and am having a hard time deciding which to get", "response": "I'm sorry I can't really be of help in comparison to the Wii U and PS4, because we only have the Wii U. The graphics and the sound are very good. The game looks like the movie, if you have seen it. Sorry that couldn't be of real help."}
{"product_id": "B00BQMGW4Y", "context": "Is this item only for the original Xbox or is it compatible with the Xbox 360?", "response": "Only for the original Xbox.  Don't make the same mistake I did."}
{"product_id": "B001COU9I6", "context": "is this console backwards compatible?(play ps1 and ps2 games)?...wifi built in?? hmdi?? can i know please?", "response": "It has built in wifi. And hdmi. I know for sure it can't play ps1 games and from what i know only the first gen 60 gig. Played ps2 games"}
{"product_id": "B009Q8PP16", "context": "Grand theft auto 5 Compatible?", "response": "Yes and no. You can have it on and stuff but honestly it's no help cause you can't get in a car and drive with most of them and it's just kinda useless. But don't get me wrong this remote is absolutely amazing, I never game without it."}
{"product_id": "B000LQ4HTS", "context": "Can the buttons be reprogrammed like the X55?", "response": "Yes, any button can be programed"}
{"product_id": "B004774724", "context": "Do I have to have the regular sims 3 game in order to get this, or is this a game within itself?", "response": "It's an expansion pack of the base game. It needs the base game in order to work."}
{"product_id": "B00000K4MC", "context": "Will it work on Windows 7 ?", "response": "It will not work on Windows 7 unless you are running a 32bit system."}
{"product_id": "B007SO6USW", "context": "Can you charge the controllers with the skin on them? I have a glow in the dark skin cover on one of my controllers and its a pain to have to take off", "response": "they are a pretty tight fit on the stand so i would say for the area it has to connect you would need to move the cover off."}
{"product_id": "B00FM5IY38", "context": "does this game require the kinect", "response": "No you can hold LB instead of using Kinetic during the speaking parts like \"fire volley\" etc"}
{"product_id": "B003NVMEVQ", "context": "is this usb powered", "response": "Yes it is.  Not wireless"}
