{"product_id": "B00CPS59CE", "context": "Does this come with the bluetooth wireless chat adapter as shown in the photo?", "response": "If you're talking about the puck then yes it does."}
{"product_id": "B00HNJ4DTA", "context": "So.. . I look at one of the previous customer review on your product saying that the paddles are hard to press.. .? Why is that?", "response": "The paddles aren't hard at all. It operates like a normal scuf. Really no difference in it at all."}
{"product_id": "B00DH1KRQQ", "context": "does it have the rumble feature?", "response": "No, none that I know of."}
{"product_id": "B004IK24MU", "context": "What color indicates that the remotes are fully charged?", "response": "They turn blue like shown, whn the batter is being charged the lights are red."}
{"product_id": "B00D96BJSO", "context": "Does this headset have mic monitoring?", "response": "You need to get the new version, the XO SEVEN Pro, to get mic monitoring. We just added it to the newer models of the XO ONE, XO SEVEN Pro, and XO FOUR Stealth."}
{"product_id": "B00BMFIXT2", "context": "How much storage space does it require on xbox?", "response": "It takes up 1.10Gb of space."}
{"product_id": "B00CXCCH1I", "context": "does this game let you play with another person offline ?? if you add another control and the other person is next to you", "response": "Yes it does :)"}
{"product_id": "B0076DO5A0", "context": "Can this be played on windows vista 32 Bit?", "response": "Just checked the box it says good for WinXP (SP3), Vista (SP1)/7/8 and that's quoted in system requirements. Hope this helps."}
{"product_id": "B006IOAHPK", "context": "Hello, is in the game German Subtitle available ?", "response": "I have not checked, but normally they are included.According to my information:Features Menus and Interface in - English, Francais, Espanol, Deutsch, Portugues and ItalianoFeatures Subtitles in - English, Francais, Espanol, Deutsch, Portugues and ItalianoFeatures Voice overs in - EnglishLike I'm French, I confirm the support of the French language in menus and subtitles"}
{"product_id": "B00BI4VVGY", "context": "is this a 30v 20 v or 10v?", "response": "+5V and +12V are required .."}
{"product_id": "B0072G4LB4", "context": "Can you change the LED's Color? or is it stuck to blue?", "response": "Only blue. Still my favorite mouse ever for overall feel, and responsiveness."}
{"product_id": "B000BAVN14", "context": "Will this work on Windows Vista?", "response": "No. You might be able to get it to work but you have to do some major work with tech support."}
{"product_id": "B00E88G054", "context": "How is the packaging? does it come in the original box and would it look presentable as a gift?", "response": "The one I ordered from this listing came in its original box, and I think it would look presentable as a gift."}
{"product_id": "B008D7F47Q", "context": "Does it Work with Windows 8.1? Trabaja bien con W8.1?", "response": "it works on Windows 8.0 but haven't tried with 8.1. I assume it should work with 8.1 as well."}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "The FIP from Saitek works with all airplanes in FSX but not with P3Dv2 yet. I have four and FIP's have no issues with any airplanes. I do not have that specific model but am confident it will work. For multiple devices use a powered hub to connect and use USB2 vs. USB3 if you can.Matthew"}
{"product_id": "B00DC9SWWE", "context": "This game has to be used with a XBOX hard drive.  I got some advice that it needs an 'internal' hard drive that costs $100+.  What is the correct product to use?", "response": "You need an internal HDD yes. A flash drive will not work. You need around 6 gb I believe. I would purchase an Xbox with the 200+ GB HDD or grab an external one to plug into yours. Just about any model with enough space should suffice."}
{"product_id": "B004W1IX1G", "context": "Does this work with the Wii U?", "response": "If you google this question, the answer says yes. There are steps to follow, best to google this answer before deciding to buy this game."}
{"product_id": "B00D2EGWDA", "context": "Hello , Does it include the original game + A free map pack ?", "response": "It does indeed as indicated by the $15 bonus content on the front of the game box."}
{"product_id": "B00CH923NE", "context": "Is this game appropriate for a 7 year old boy?", "response": "Super Mario Brother games are always good for everyone unless you see rockstar involved. lol"}
{"product_id": "B004S5TDUQ", "context": "The description says it comes with the cable, but does it?  I already got burned by another seller where the description said it came with the cable.", "response": "Both Rocksmith and Rocksmith 2014 that I ordered from this seller came with the cable"}
{"product_id": "B00FLLFJE0", "context": "Charging Base doesn't light up. Battery is in correctly and controller is working. Battery came with charge so not sure if that's why no light on Nyko", "response": "There are two lights on this device that should be lit whenever a controller is docked.  When this device is charging a corresponding light will indicate that controller is being charged by a red or green indicator.  When controller is fully charged only a white indicator will be lit when docked."}
{"product_id": "B0002GTXDM", "context": "what does this do?", "response": "It allows wireless communication from one gameboy advanced (Sp or standard) to another with the same piece.  It has use in many games but the most common use is for pokemon, allowing players to trade or battle pokemon over a wireless connection."}
{"product_id": "B002VBWIP6", "context": "if I buy 2 of these, and entered both codes, do I get a 2 years subscription ? or do I have to store the other code until the first one expires?", "response": "You can have to 3 years of Xbox live on one account"}
{"product_id": "B002B9FIUU", "context": "Does this work on Windows 8?", "response": "Yeah it works perfectly, used it with 8.0 and 8.1."}
{"product_id": "B00BS520SG", "context": "will this work on wii mini for outdoor challenge?", "response": "it plugs into the wii remote. So I'm not sure. It works for my wiiu"}
{"product_id": "B00GBCLG0E", "context": "Does it play 3D games? Does it read movies in 3D?", "response": "yes the PS3 can play 3d games and movies when connected to an appropriate 3d monitor."}
{"product_id": "B00F27JN8Q", "context": "How do psp games look on the big screen?", "response": "Psp games look really bad, not meant for big screen. Images are stretched and very pixelated."}
{"product_id": "B00503EAG2", "context": "Does this come with a new product key for activation on Steam? (Physical copy + Product key?)", "response": "yes ......activation to steam is automatic and product key is given with download"}
{"product_id": "B004JKZUJI", "context": "Does this work when playing games on the Wii Shop Channel?", "response": "Yep, it should work with classic games you download from the wii shop!"}
{"product_id": "B0002EAA36", "context": "Is it usable in the left hsnd?", "response": "Yes, however it is optimized for right-hand use."}
{"product_id": "B00GQTZ8TM", "context": "I bought one a while ago for my brother and it didn't come with a charger. I'm assuming that this one does, correct?", "response": "It came with a charger, but the pre-installed game wasn't there. It like the seller sold me the box, but put a different system in it."}
{"product_id": "B003ESDQW4", "context": "is Black cat in this game?", "response": "No, but she IS in Spider-Man: Edge of Time."}
{"product_id": "B008BGXYBM", "context": "Why does my razer taipan has only one laser sensor(8200dpi) while other taipan has the 4G \"DUAL\" sensor (2 laser sensor) ?", "response": "it is a good product , nice design. i feel comfortable when i am using it. :d"}
{"product_id": "B00AKIPBNS", "context": "IS this appropriate for a 8-9 year old?", "response": "I would not recommend it. It is quite violent and can be sexually suggestive at times. You could look into another series i play which is Rune Factory."}
{"product_id": "B0097CUREG", "context": "Will this work on a windows 8.1 pc?", "response": "I use it on mine at work but it's an 8.0."}
{"product_id": "B005BLAJRC", "context": "Can I download it to my computer or do I have to keep the cd in the computer to play?", "response": "You can download it to your computer."}
{"product_id": "B00GY4OAM0", "context": "Does the game cover material from the third movie?  If so, how extensive?", "response": "As far as I can tell it's just the first two movies."}
{"product_id": "B00EOUL7T0", "context": "can i control vg volume?", "response": "Yes , it's got a volume control nob on it not sure if that answers your question."}
{"product_id": "B009SJR278", "context": "Could this be used on Xbox 360? If not, can I buy an adapter?", "response": "No good, need to buy a special headset for Xbox 360"}
{"product_id": "B00A1AQJAO", "context": "I bought a used 3DS which did not come with any AR cards and the first thing the section would ask for is a \"?\" card; would this be included?", "response": "Atm I'm not quite sure how to respond because I don't know what your problem is caused by..."}
{"product_id": "B002L93F0A", "context": "Does this product work and if so how does it hold up to light/moderate use?", "response": "Only one of mine worked...and the buttons are tough...I honestly recommend you do not get this product.."}
{"product_id": "B0050SYILE", "context": "Would you let a MATURE 13 year old boy play this game?", "response": "No, I would not recommend it."}
{"product_id": "B00B3PDH5G", "context": "Can you pair it to multiple devices at the same time?", "response": "Yes. The headset's bluetooth port can only channel one bluetooth source at a time, but I frequently connect my laptop via bluetooth and listen to music through that connection, while also listening to a feed I create from the wifi base, which I connect to my PS4 via digital audio."}
{"product_id": "B00HPU96FI", "context": "I have one question.  I get video from this cable, but no audio at all.  Is there any way to get sound from this cable when it's plugged in?", "response": "It comes with audio cables (red white) as well. They need to be connected also to get sound. The VGA Box is much better than this cable. This cable makes vertical lines on the screen."}
{"product_id": "B00DHF39KS", "context": "Just getting into these games; are there levels of difficulty on this game so a newbee can learn easily???", "response": "Like most shooters with campaigns, the game has several levels of difficulty to try out, with the easy being a breezy for accustomed shooter fans and a great tutorial for beginners."}
{"product_id": "B007TFOO6K", "context": "I wanted to find out, is the blue switch keyboard BLUE led? they are showing red, it doesn't say on the description.", "response": "The Blue switch is the type of actuator the keyboard uses, amd not the LED color, which is red. Hope I could help."}
{"product_id": "B00HK74G2E", "context": "Can you play PS2 games w/ this PS3?", "response": "I'm afraid not, but a lot of the ps2 games are on the ps store.  If you want backwards compatibility you will need a first generation ps3.  Hope this helps."}
{"product_id": "B004HYIAPM", "context": "Bored with Everquest...Is ES V Skyrim a stand alone game? Or must I purchase the earlier installments?", "response": "Yes, it is a stand alone game and you do not need to get the earlier copies. However there is additional dlc that you can purchase to expand the normal gameplay."}
{"product_id": "B0029M6VKA", "context": "please tell me what is in this 149.99 item,only trackir 5? or with clip pro in it?thank you .", "response": "TrackIR 5 and the standard clip.  It does not have the pro clip."}
{"product_id": "B008BT2FWI", "context": "Will it work with Windows 8.1", "response": "Yes, I have it on my laptop."}
{"product_id": "B00I9GARIM", "context": "Hey, sorry, I couldn't find this answer in the description... does this headset come with extra ear cushions?", "response": "I returned mine because they were so heavy, but if I remember correctly they came with two sets of pads--one soft cloth material and the other a foe-leather material."}
{"product_id": "B00562O8U0", "context": "what does sony ps3 games mean when they say 3d compatable", "response": "that means that, they work like any other regular game, but if you happen to have the 3d glasses and a TV capable TV then you can enjoy the enhanced 3d experience."}
{"product_id": "B003VAHYQY", "context": "Is it compatible with windows 8?", "response": "It also works out of the box on Windows 10 without having to install any driver software."}
{"product_id": "B00A1Y2STQ", "context": "I'm an idiot for asking this but, is this wired or wireless? I can't find out if it is or isn't!", "response": "lol its fine, it defiantly wired."}
{"product_id": "B001AH8YSW", "context": "at launch game.    box pops saying I must be administrator to play first time. I am the administrator. Any help would be appreciated I am running windows 8", "response": "the issue could be you are running windows 8. right click it and select run as admin. if that doesnt work try going into the properties of the game and selecting compatibility and run in XP or vista"}
{"product_id": "B00DC9SWWE", "context": "I love campaign modes on other first-person shooters and play offline quite a bit.  This a problem with this game? Description troubles me.", "response": "Titanfall is a multiplayer game not a single player game for now. There are rumors that they might add campaign mode in the future as a add-on. Lets hope and see, cause then the game would truly be an ultimate comeback for first/person/shooter in years..."}
{"product_id": "B002XLR0JI", "context": "Does this mouse create loud clicking noise?", "response": "I wouldn't say it's any louder than a standard mouse click... Honestly, what you really have to worry about is how loud the keyboard is."}
{"product_id": "B00BFOEY3Y", "context": "Dose this mouse have a \"middle click\", usually the action of pressing the mouse wheel down? The wheel has left/right, but dose it click down?", "response": "From what I remember it did. Another thing I didn't like about this mouse was that it was cluttered with buttons, all in the wrong places. I returned it and got a G9X and I love it."}
{"product_id": "B003O6EDSM", "context": "Which DLC's are included in this trilogy? (I want to know if I need to buy the others or not). I would like to own all of the DLC's as well.", "response": "Hi, really I have not checked all of them, but it says that includes everyone but Pinnacle Station."}
{"product_id": "B004YC4NN0", "context": "hi this controller work with emulators run on a andriod tablet", "response": "JORDAN W. You should fix your answer this led me to believe it was wireless/bluetooth. I know now you must have used an otg cable but please specify not all people have an otg cable or androids with usb ports. Thanks. ( I bought this reading your review)"}
{"product_id": "B0010WS20W", "context": "Does it work on Windows 8?", "response": "yes it works.if you need any help, just email, the master poker wed site and he's very good about getting back to you"}
{"product_id": "B00DJYK8XS", "context": "Does it come with a Zumba fitness belt?", "response": "Yes, the belt is included."}
{"product_id": "B00BI83EVU", "context": "I was under the impression that games would be able to be delivered to arrive by the release date.  Is this correct?", "response": "Depends on whether or not it was on that truck Conan hijacked. http://teamcoco.com/video/clueless-gamer-watchdogs"}
{"product_id": "B00FNKMVUO", "context": "What is the surface material on the mouse?  Is it soft touch smooth plastic (PU)?  I have a Logitech G602 wireless and it has a pebbly texture I hate.", "response": "It is pebbly. Don't listen to them, it is super pebbly. I personally like it but if you don't this isn't the mouse for you. The only smooth plastic on this thing is on the bottom and a small patch on the top, for which I know not the purpose."}
{"product_id": "B00DFB99UI", "context": "is it good\\precise  enough to play .. MAME driving games on pc ?", "response": "I am using it for Eurotruck Sim 2 and for the price it works great but not force feedback. I would sum it up saying that if I could do it over I would save my money for a Logitech wheel, as I am an avid gamer, but again for the price I am happy with it."}
{"product_id": "B009RXUNGM", "context": "What Adaptors would I use to connect this to the Xbox One??", "response": "Plug the av cables into the TVs audio out and then plug the USB cable into the Xbox .PS its not wireless spend a couple of dollars more and buy the Plyer 2 scucandy"}
{"product_id": "B00ACMM9BO", "context": "can you send me instructions on how to program my controller i didnt get nothing with it", "response": "Sorry I got it for my grandson. Did you try googleing it. I'm sure you can find it online"}
{"product_id": "B000TK99PS", "context": "What games are actually on this ? is there Gravity Tiles and Majong and Backgammon etc.????", "response": "Yes to all of the above  This is a great package.  I play on this almost every day when I get home after a hard day's work and need to relax."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "yes.  My system is 64-bit windows 7 and it works very well."}
{"product_id": "B00AAS88K6", "context": "How well does this work with Nvidia SHIELD tablet? I've heard of stuttering and lag. should I pick up that $13 BT mouse on Amazon instead?", "response": "if you're only going to use it with the tablet, best to get this other one you mentionedthe reason why there may be stuttering it's because the razer synapse and drivers are not designed for androidOrochi is more suitable for mobile PCs and desktops"}
{"product_id": "B000WCCURW", "context": "Does this game have multiplayer mode?", "response": "Yah but I don't know if a lot of people go on it I just play solo it's kinda like Skyrim."}
{"product_id": "B00EI4V3X2", "context": "I have this headset, how can I remove the mic? I tried pulling it out with some force but nothing is unplugging it. How can I do this?", "response": "hi.the microphone is attached with a 2.5 jack. With a clamp blocks the attack near the ear pavilion, where there is checkering, and decisively wheel."}
{"product_id": "B00EWEHI5K", "context": "Does anyone know if it comes in the hard-shell briefcase if I purchase it directly from Amazon?", "response": "I purchased mine directly from the Razer website and it also came in a clear plastic cube - so, no briefcase there, either."}
{"product_id": "B00EF1OGOG", "context": "How do you recharge", "response": "It comes with its own wire. So you just plug it into the mini port (input) and the other side to an adapter."}
{"product_id": "B00562O8U0", "context": "my tv is a Samsung and infrared / shutter/ battery glasses. one of the first 3d tv. will they work ? I really want them for mulitplayer", "response": "I would say yes the should work my TV is a MITisbushi DLP 3d and the glasses I used prior to these were the Samsung infrared shutter battery glasses I actually like the size and weight of these Sony ones and the rechargeable battery"}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "Donnie R Longo. Get The Nyko Charging Base. I Recommend It."}
{"product_id": "B004YC4NN0", "context": "Will this work on phones, for emulators? Is it wireless?", "response": "It will work for any phone emulators using an OTG adapter, as long as your phone has OTG support. If you tell me what phone you plan on using it with, I can tell you if it has OTG support."}
{"product_id": "B0017HLYNC", "context": "this game is only language in english or in spanish too?", "response": "English only as far as I know but I found a few references to a Spanish version and one forum post (Majorgeeks) who complained that he purchased Syberia only to find it was in Spanish. You might try a web search if you have not yet done so.Ed"}
{"product_id": "B002I096AA", "context": "can i play older gameboy games on this such as pokemon yellow?", "response": "Unfortunately no you can't. It is compatible with older games for the Nintendo DS, but not any Gameboy games.The Nintendo DS Lite is however compatible with Gameboy and Gameboy Advance games. Hope that answers your question!"}
{"product_id": "B001Q55D5K", "context": "will it work with windows 7?", "response": "I don't know, please disregard my review of this game, I had it confused with another called \"Glory of the Roman Empire\". I have had the review removed since I just noticed my mistake. Sorry."}
{"product_id": "B002I0HD9G", "context": "Can I control the weather in this game while free-roaming??", "response": "No. The weather is not under your control."}
{"product_id": "B00CPKUV9I", "context": "which of these video cards will run this game?Sapphire Flex AMD Radeon HD 6450, XFX AMD Radeon HD 6450 2GB,Radeon R7 240 2GB or other ones", "response": "Don't know about the specific models you mentioned, but when I first got this game I was using a AMD radeon 6870, and the game ran terrible. Cut scenes video and audio were way out of sync. frame-rate was terrible. Since then I purchased a Nvidia GTX 970, and It runs great."}
{"product_id": "B002TLTBN0", "context": "Does this work for Wii games if playing on a Wii U?(for example Xenoblade Chronicles)", "response": "Not all Wii games will be compatible. Check each game for support.Example, couldn't use this with Kirby's Return to Dream Land.I bought this mostly for Smash Bros anyways."}
{"product_id": "B00GOOSORM", "context": "If I use a 60 Day Time Card, does it countdown based on my time played or just 60 consecutive calendar days?", "response": "60 calendar days your account is active"}
{"product_id": "B00IAVDPSA", "context": "Does the remote stay \"on\", or will it shut itself off like the controller?", "response": "It's like a regular remote its always in stand by mode ready for whenever you need it but if your talking about the light up back it comes on when you move it and is on for about 5secs then goes back out."}
{"product_id": "B00EPZ8POY", "context": "does this game is in english version and the characters speak english too???", "response": "The game is in japanese original audio with subtitles in english"}
{"product_id": "B004N3FGHC", "context": "is this a first party Nintendo remote?", "response": "If you are asking if this is an original Wii remote, no, I think it's a copy."}
{"product_id": "B005BLAJRC", "context": "Can I download it to my computer or do I have to keep the cd in the computer to play?", "response": "You do not need to keep the disc inserted."}
{"product_id": "B00EI4V3X2", "context": "When you connect the Headset to your PS4 controller in order for chat to work, is the in-game sound still 5.1 Surround Sound or not anymore?", "response": "No it's still surround sound :) it just doesnt work too well for phone music thats all."}
{"product_id": "B00BHSTXV6", "context": "I hit the space bar and it double space. Any fix for this? Thanks", "response": "Generally have to peel the key off gently and clean the area. If it's under warranty I'd do so first. Breaking it will void the warranty"}
{"product_id": "B00EPC3PY2", "context": "What language are the dialogues, subtitles, and the game menu?", "response": "The dialogue is in JP only. The rest of the game is in English. Menu, subtitles, coins."}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "Yes, but if you're trying to use FSX you're going to have problems."}
{"product_id": "B00A750QIE", "context": "is it a fun game for a 9 year old boy", "response": "If your 9 you will love it...it's actually better than the new one that came out."}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "This WILL work on PC pretty easily, but be weary of the actual input - it's easy to \"jam\" it into the controller, causing the actual micro USB slot to be recessed into the controller, meaning after only a few plugs/unplugs, it can stop functioning for PC use."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "Yes you will receive the code via email once the payment process is complete.  Usually it takes only 5 minutes to receive the email."}
{"product_id": "B003O3EFY2", "context": "How good is the wireless connection?", "response": "The connection is not very good at all.  You need to be directly in front of the system and no more than about 14 inches from it.  The system is great otherwise and I recommend purchasing wired controls of the system."}
{"product_id": "B002L93F0A", "context": "When I plugged my controllers into the sockets on my Wii I still can't navigate the menu or click anything. Anybody know what is wrong?", "response": "Maybe the controller doesn't work and need to be replace!!!"}
{"product_id": "B000B6MLPU", "context": "i plug it all in but there's no signal when on hdtv?", "response": "Make sure you are on the right component input. If that doesnt work then try it on another tv. It will let you know if the cable is bad or tv input is bad."}
{"product_id": "B002CZ7P04", "context": "Can I use the wii walk it out video game with the wii u", "response": "Sorry, I dont know about using it with the WII U as i dont have a WII U. But I have the balance board and hand controllers. I have been using this FOR YEARS and I still enjoy it a lot! Would love to see some squells to it. Like walk in different cities or countries."}
{"product_id": "B005G4CXPK", "context": "This is just a pop into the disc drive and play version of Assassin's Creed, right? No set-up crap?", "response": "No, you have to install the game on your computer it requires a certain amount of space on your hard drive ..see product for details on that. That's how computer games work. If you want a pop it in and play version , look for it on Xbox"}
{"product_id": "B001H4NMNA", "context": "Should I unplug this after my controllers are fully charged or just let the green light sit?I don't use my ps3 often so it kinda seems like a waist?", "response": "You just let the green light on! It is supposed to be like this. So you know if it is charged or not. I always keep my controllers attached to the energizer charging station. I never had problems with controllers dying while I'm playing a game."}
{"product_id": "B009SJR28W", "context": "The keyboard is new sealed 100%? is guaranteed everything ok? never bought on amazon ...", "response": "The one I purchased came brand new, perfect packaging, but it was the worst keyboard I have ever purchased.  I have had better $8 keyboards than this Razor.  I had high hopes, had nothing but good to say bout the Razor mouse lines, but I will never purchase another keyboard from them."}
{"product_id": "B000OPOCFU", "context": "Since it's used can it be installed and play by someone else?", "response": "Yes it can as long as you have the 20 digit activation code on the box or instruction manual."}
{"product_id": "B008BT80O0", "context": "Is this the English (U.S.) version of the game or an import?", "response": "english and it works like crap on ps3 maybe its better on the ps4, i don't know i only have a ps3. i couldn't make work, like it was too much. i only used it with a wheel and pedal set-up. good luck."}
{"product_id": "B00I14395A", "context": "Is there any noticeable latency when using the keyboard?", "response": "My keyboard is relatively close to my computer and I have no latency."}
{"product_id": "B00FQFFQ2Q", "context": "does it work on xbox 1 or not?", "response": "The one we got. Is only for Xbox 360."}
{"product_id": "B008MI7MWQ", "context": "what games are on the disc?", "response": "Cleopatra2- Coyote moon- Double diamond- Double diamond 3x 4x 5x- Kitty glitter- Lotus flower- Secrets of stonehenge- Siberian storm- Three kings- Treasures of troy- Triple double 7s- Triple stars- Wild wolf- Aztec temple- Bombay"}
{"product_id": "B00821ME4O", "context": "it weight really 5 pounds?", "response": "it weighs as much as a regular ps3 controller... its a very good product"}
{"product_id": "B00FJWNSWQ", "context": "Do you need XBOX live to play the ultimate edition?", "response": "No but if you want to unlock stuff for the mobile version (if you play it as well) then you would have to compete online which needs Xbox live."}
{"product_id": "B00GPH7Y8S", "context": "How does it compare with the old Panzer General?", "response": "never played Panzer General but I played Kampfgruppe(sp) and its not nearly as good"}
{"product_id": "B005LUUWL6", "context": "Will it connect to windows 8.1", "response": "What do you mean?"}
{"product_id": "B0086V5V8G", "context": "how much of the game is stealth  or can you go in guns a blazeing", "response": "Yes, you can go Stealth all the way.  You get MORE bonus points.  When you go guns blazing, you kinda die easily."}
{"product_id": "B00B3FIXJQ", "context": "how do you know the mods are onwhen you press the sync buntton and what color is each mod", "response": "Once mods on led light (blue) lights on and then blink for each mod"}
{"product_id": "B002BSA20M", "context": "Is this halo reach game work on pc's? (laptops)", "response": "No.  Absolutely not."}
{"product_id": "B005EQE0YM", "context": "would I need to by an audio adapter for this headset or just plug in and its ready to go out of the box?", "response": "Not sure what you mean by an audio adapter.   As long as you have an audio card installed on your pc,  this works straight out of the box."}
{"product_id": "B008M4BNQ6", "context": "?How do I get my head set to be able to heat the tv threw the headset?", "response": "I've tried heating it with he headset but it just doesn't work.  I'm currently ordering parts to to construct a very large microwave."}
{"product_id": "B00BMFIXKQ", "context": "The game is in English or multi language? has any subtitles at least? Which?El juego esta en inglés o tiene múltiples idiomas o subtitulos ? Cuales?", "response": "It has multi language option as well as subtitles. Great Game!"}
{"product_id": "B00DGZDFO4", "context": "The download includes the game or just the code to play online?", "response": "hi, is the code. you need to download the game from your steam account after using this code. (sorry for my poor english)"}
{"product_id": "B00J6DLPLK", "context": "is this game satanic/Demonic? and sexual?", "response": "This game is NOT Demonic and it certainly isn't Satanic. As for sexuality, besides the outfit you see the main character in on the cover, and the , very, occasional innuendo from the \"old perv\" character, there is little sexual in nature about this game. This game is more swords and sorcery. No demons and NO satanic material."}
{"product_id": "B00I4BGNVM", "context": "explorers pack still come with this?", "response": "Only if activated and downloaded from elder scrolls website but download takes 3-4 days due to poor servers at Bethesda download from steam you will miss out on explorers pack but have a 4-6 hour download time based on my connection of 60mb/s"}
{"product_id": "B00BM7NXMW", "context": "do the colors cycle through -or fade into each diff color automaticly with a setting", "response": "Bought it for my son, but he said you could set it."}
{"product_id": "B00ATHFLZS", "context": "Does it bring an installation cd? I bought one but the box was lost the mouse freeze and I am not able to select dpi options. Thks in advance", "response": "No I doesn't. And that is how it is with  alot of people who bought this mouse, including me. It freezes because it's cheap. It's a horrible mouse, if anything try and return it."}
{"product_id": "B004NRN5DU", "context": "Can this game be played off line?", "response": "Absolutely. It starts up in offline mode when there isnt a psn or xbl gold connection. Very little is lost in terms of functionality; it's a full-function game online and off."}
{"product_id": "B001IYR53W", "context": "will it work with Windows 8.1", "response": "I do know that it works on windows 8"}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "No. Did you read Japan Import? Is $20 more because it is imported. Sony announced that they will release the wave blue in US for 60 bucks in the fall."}
{"product_id": "B002672Z80", "context": "do these have the wrist straps with them?", "response": "Si lo tiene por lo menos el mio los trajo."}
{"product_id": "B003ZSN600", "context": "Does the wired controller can connet to PC through USB directly? or I need other tool support ?", "response": "I connects directly to the computer via USB."}
{"product_id": "B00EZAWV6W", "context": "How long did it take you to download onto PC (Windows 8)?  I have DSL and it is saying it's going to take 9 hours for download!", "response": "It took several hours (maybe 3-4?). But I have cable modem, so it would be faster than your DSL. That was my frustration with this purchase... downloading that much to my son's PC, and then NOT have it work unless it was on-line! Amazon never offered me a refund nor was there a way to request one."}
{"product_id": "B00CH923NE", "context": "Is the dream world too cheesey? Or is it not?", "response": "It's got its moments but it's fun!"}
{"product_id": "B00DBCAT3W", "context": "do you have to be online to play this game?", "response": "no it plays on my 360. It may have some download but I don't have an account with microsoft live."}
{"product_id": "B0058FAEAS", "context": "Is  this compatible with windows 8?", "response": "Cant say, still running XP, and only planning to go to Win 7 anytime soon."}
{"product_id": "B009K7OFSC", "context": "Will this work on a mac with all functions. Just need right,  left and center click and 4 way scroll", "response": "I dont know about mac. But I loved this mouse, but it quit working after several months. My take is that they have quality control issues and will not durability, will only normal use."}
{"product_id": "B00B1MXGDO", "context": "Does it come with the carrying case?", "response": "Indeed it does! And a pretty nice one at that. It's a soft shell case but the inside is lined with a thick foam that appears to be laser cut to fit around and protect the controller perfectly."}
{"product_id": "B000J18SR2", "context": "Does it also runs on windows 7 ?", "response": "Yes it certainly does. I play it on Windows 7 x64."}
{"product_id": "B00A8HIGSS", "context": "Is Motion Control required to Play this?", "response": "I only used a controller, so I can't really answer if it's required. All I can say is that I used a controller."}
{"product_id": "B00FBV6V56", "context": "Does it work with Windows 8.1?", "response": "I got it working on the windows 10 technical preview, it should definitely work on windows 8. Make sure you update the software from the Astrogaming website. Not much of a big deal though."}
{"product_id": "B003BKWEHS", "context": "doesn't work on windows 8 for me...just goes to a few countries and that's it", "response": "I updated my computer to Windows 7 and I lost more than 10 games including Jewel Quest 1-3.  I'm disappointed of what I paid for them and not being able to play them.  I wished I didn't update my computer. What a loss!"}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "was just updated.Delivery estimate: November 19, 2010 - December 13, 2010now 99.99"}
{"product_id": "B002672Z80", "context": "is it user friendly?", "response": "i would say yes it is, it is all about getting use to it.R.W."}
{"product_id": "B00CMSCWGS", "context": "Does this work on Macs ?", "response": "No this is for windows based computers"}
{"product_id": "B00A878J5I", "context": "when the indicators turn green, does the unit stop charging the controllers?", "response": "That's a great question. Unfortunately I have no clue. However, I do know that we leave ours on it all the time and it has not had any negative impacts."}
{"product_id": "B004QRKWLA", "context": "does it work with steam games?", "response": "Yes if the game supports a gamepad"}
{"product_id": "B00A7VK16A", "context": "work with xbox 360 e console?", "response": "Yes, it's fitting inside."}
{"product_id": "B00BZOBE78", "context": "Do you need gods and kings for this to work?", "response": "No. Civ 5 stands alone, Gods & Kings, and Brave new World are add ons.."}
{"product_id": "B000J18SR2", "context": "Has anyone been able to use this disk with Windows 7?  It works for a while then works partially until it needs to start a game", "response": "usually works fine on my Windows 7 system. It does fail sometimes due to DirectDraw error."}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "None. It comes with an adapter and gets plugged into the wall."}
{"product_id": "B00A878J5I", "context": "My son damaged the original charger cord for the Wii u pad , the one that comes with the system . Will i have to replace it now that Im buying this?", "response": "This comes with its own charger cord, so if your original cord is damaged you can use this to replace it. However, it won't plug into the Gamepad directly, it'll only plug in to the cradle. So you still won't be able to play games on the Gamepad while it's plugged in unless you get a replacement from Nintendo."}
{"product_id": "B00656HLGO", "context": "I keep reading reviews about not working with \"original title games\", what does that mean? If I don't have any games over 3 yrs old will this work?", "response": "I have no idea... Works for all my titles"}
{"product_id": "B007JM8ULS", "context": "Will I be able to play my original xbox games on my 360 slim with kinect with this hard drive plugged in?", "response": "Some games are reverse compatible with a hard drive. Not all original Xbox games are. If the hdd works then yes you should be able to but I would buy it at a game stop location to be on the safe side that way if it does not you can still return it fairly easily."}
{"product_id": "B00EI4V3FU", "context": "How come I just bought this headset and it does not work on my PS4?", "response": "IN My PS4 work Fine, i plug in Controller, works for chat, and if need put game sound too, need go to settings and put all sounds in reset, default phone is only for chat. but is possible put all sounds"}
{"product_id": "B00IRHE892", "context": "If anybody plays CS:GO with this mouse ---- When flick-sniping or playing scoutzknives, is the scroll-wheel accurate? Does 1 notch switch ONE weapon?", "response": "One notch switches one weapon. In \"locked\" mode, it's quite sturdy indeed and there's next to no chance of you actually scrolling the thing. In free scroll mode though, it's extremely loose and sometimes even picking up the mouse is enough to make the scroll move."}
{"product_id": "B00FZ12F34", "context": "in the amazon infinite bundle, do you get elsa, anna, Rapunzel, and jasmine????", "response": "Just Elsa and Anna.  Rapunzel is separate.  Jasmine can only be used with Infinity 2.0"}
{"product_id": "B0050SVMYA", "context": "My daughter who is 9 going on 10 wants a 3ds. Is it suitable for her age? also will i have to purchase additional cartridges or something?", "response": "Suitable. You will have to purchase games etc. as I understand it."}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "The battery charger charges the batteries, so no flashing lights on the controller indicating that the battery is almost dead."}
{"product_id": "B004FS8LYK", "context": "How much gore and eschatology does it have? Can it be reduced/censored?", "response": "It contains a considerable amount of graphic violence, but it's not gore, I think it's acceptable"}
{"product_id": "B0050SXFKE", "context": "Does this game come with  the greatest hits box (red) or the normal one?", "response": "Mine came in the actual box."}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yes. I to had old wii fit game and board and they both work on the Wii U."}
{"product_id": "B00BGGIWZM", "context": "I just downloaded sims 3 Island paradise but I cannot run it because it says I need to download Sims 3 first. Does any one know if this is the case?", "response": "It's becuse the sims 3 is the inporten one"}
{"product_id": "B00BV72X1U", "context": "Would this work with a chromebook?", "response": "Microsoft does not offer a driver for the chromebook, so ultimately no. You may be able to find a 3rd party driver that could force it to work however that can be risky."}
{"product_id": "B00CBQO930", "context": "The mouse information says 5 user profiles bound to specific games but i don't see the list of games. Will this mouse work with World of Warcraft?", "response": "I think by specific it means user-defined. So  yes,  it should,  but you need to set it up through their software."}
{"product_id": "B0081Q58AW", "context": "Is there a,way to play offline", "response": "Nope it's an MMO so there is no offline mode."}
{"product_id": "B002I0HJG8", "context": "few records come from? to buy the game is installed with your disks and then I guess updates and patches are downloaded ?", "response": "Thats correct. But its still much faster installing via disk."}
{"product_id": "B00DNHLFQA", "context": "Can I play multiplayer games? online games?", "response": "Absolutely, as long as u can find someone on the server, play all you can play :)"}
{"product_id": "B003V4AK8E", "context": "are the triggers switched on this controller like how the 360 cont is, that is the only reason I'm looking to get one?", "response": "Yep its just like a Xbox controller the frame is slightly slimmer on the grips and more compact buts its a great controller overall"}
{"product_id": "B0002GTXDM", "context": "If you and a friend were playing Gameboy Color games, would this still act as a connection?", "response": "Yes and no, the wireless adapter only works for handful of Games and if I remember right only certain gameboy advance games. I made that mistake when I bought it, just go on google and look up what games work for the wireless adapter."}
{"product_id": "B007VFHIHA", "context": "what is this code guys? can i or not play this game on my windows 7 desktop", "response": "Yes you can, enter the code on Steam and download"}
{"product_id": "B00BDS415I", "context": "How durable is this headset? I want one that can last me a few years.", "response": "It quite durable, just take care of it an you will be fine. I find that turtle beach makes a very durable headset. I have two pairs, mainly because this is the best headset for Ghost."}
{"product_id": "B00GOOSORM", "context": "if i baught this for friend in Canada(BC) would it work? i tried a psn points card once didnt work cuz of currency issues", "response": "yes it would. the lodestone ( ffxiv service page) will allow you to load service via a game time card to add service."}
{"product_id": "B00H8NS1K8", "context": "with the open back, I'm concerned about audio bleed into the mic. can anyone comment?", "response": "It does not, these are very nice cans, you won't have any feedback or bleed issues."}
{"product_id": "B003ZJ1VD8", "context": "What colour is the back light?", "response": "The only back light there is on this keyboard is the Razor logo. It's only Blue, but you can turn it off, make it pulsate on and off or just have it in a solid state."}
{"product_id": "B00HPU96FI", "context": "I know that light gun games do not work with HDTV's. But...becase this is connected through VGA has anyone tried to see if light gun games work?", "response": "Correct me if I am wrong, but because of the way light guns work they need a display with a really reflective surface which are mostly found on curved CRT televisions."}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac OS Mavericks? If so, how smoothly?", "response": "I've not had any problems thus far with iOS 10.9.5."}
{"product_id": "B00IAVDQCK", "context": "Can you hear your own voice when you speak ? (Like on Turtle Beaches, you can hear yourself through your own headset to allow voice moderation)", "response": "Yes, now with the newest Xbox controller update they enable mic monitoring for all headsets!"}
{"product_id": "B00FNKMVUO", "context": "I'm sure this is dumb question but, does the mouse change colors?", "response": "Yes, u can change the color scheme"}
{"product_id": "B00DC7G2W8", "context": "Anyone know if it will be compatible with the pro controller?", "response": "Yes. Alternatively, the game is also compatible with the previous console's controllers like the Wii's remote and classic controller."}
{"product_id": "B00A1AQJAO", "context": "does the action replay stop working in 3 months???", "response": "They don't last. My kid took care of it and replaced multiple times still. It will not buy them anymore."}
{"product_id": "B0098EVZZ8", "context": "New to all of this...can you use on PS3?", "response": "Yes but you have to buy a PS3 game and portal. The characters can be used on all consoles."}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "No, the desktop controller has its own sound card built into it. so you can disable your mother boards on-board audio. The other neat things is...it has bluetooth that can be paired with your cell phone, so you can take calls in the middle of game, or just use it as a hands-off device."}
{"product_id": "B00027CXEM", "context": "Does it work on a windos 7", "response": "Yes, it does.  However, it will require you to run it in compatibility mode and make some other changes to get it to work without crashing. See: http://gaming.stackexchange.com/questions/165797/kotor-2-freezes-on-movies for the fix."}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "No nudity or anything like that.  These games are prone to have some foul language though."}
{"product_id": "B00HK74G2E", "context": "Blue 250gb PS3 font is 120/240v?", "response": "Works in the U S 120 v"}
{"product_id": "B002Q4U5DK", "context": "Can this mouse be used as an ambidextrous mouse? I use my left hand to surf the internet and control my computer and use my right hand for gaming.", "response": "It's a right handed design, it's not confortable to use with your left hand, the shape of the mouse and the button placement would make it very odd. Razer has some ambidextrous options"}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "No because the game is downloaded to your account unless u sign in to there xbox and download the game"}
{"product_id": "B008CP6Q6M", "context": "Is it a free roaming game?", "response": "Yes all three games included are"}
{"product_id": "B00D78Q4UM", "context": "How high is the back of the keyboard raised with legs fully extended? Measure please? {:^)-{{{----[", "response": "the legs themselves lift about 1/2\" so the back edge of the keyboard looks about 1.5\" (don't have a tape but looks close)"}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "does it plays ps1 games and allowed creating memory card for ps1 games?"}
{"product_id": "B0071NH8B8", "context": "So, what is the upside to the regular Vita wifi?", "response": "The Vita with 3G had the ability to go online anywhere you want but you have to purchase a plan from AT&T.;"}
{"product_id": "B000B78F72", "context": "Does this cd have the ORIGINAL CLASSIC SOLITAIRE????    I already purchased a cd that had 100's but did NOT have the classic game I wanted.....", "response": "Yes, they call it Klondike in this edition."}
{"product_id": "B004X56PWK", "context": "Does this game have multiplayer mode", "response": "Hi Adam, NO, this game is for only 1 player."}
