{"product_id": "B00FOHP8XI", "context": "Is this PS3 Console only a vertical stand or can it be horizontal stand?", "response": "It can be put horizontaly, it does not come with the vertical stand"}
{"product_id": "B00AR1LX9O", "context": "My head-phones don't seem to work with I-tunes. They work with Pandora and other cites. Does anyone know how to fix this?", "response": "I have not used Itunes in a while but it may be that itunes needs you to select an audio out device. I am not sure why this would be but Itunes can be odd that way. I am assuming that you are using the USB plug on these headphones. In that case i would check the setting menu."}
{"product_id": "B00E1L78N6", "context": "Did the controller update with little to no improvement for my mic. Did you guys have the same issue?", "response": "No change after the update. Happy with the headphones however."}
{"product_id": "B00EFFW0HC", "context": "Does this come with the China Rising pack?", "response": "Nope.  You've either gotta have premium or pay for the DLC.  Either way you will have to download it, so technically it never came with the game."}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "I've been guaranteed by customer support that even though I haven't even gotten a shipping estimate in my email, the package should ship out tomorrow (on the release date) and arrive the same day. I find it hard to believe, but I guess I'll find out."}
{"product_id": "B0010WS20W", "context": "I'm new to poker. Is there a tutorial to help people learn the rules? Does the license permit using this on two computers my desktop and my laptop?", "response": "Funny, Everybody is new at poker...This CD is by far the best tutorial ever.Best money I spent in a long time.Hours upon hours of fun."}
{"product_id": "B002RYLG4Q", "context": "How long are the cables? The distance from my TV to couch is 8 feet. I know I won't have a problem with the Original NES, not sure about this one.", "response": "I don't know the exact length of the cables, but they're definitely shorter (And thinner) than the original NES console."}
{"product_id": "B002I0KP4G", "context": "Does this come with the Baneling pet?", "response": "Sorry :/ just the box with the game inside"}
{"product_id": "B0048XAVC2", "context": "I just have one question. I recently got a mac a few months ago. The version of my mac is 10.9.2, will this game work on it?", "response": "I have updated my system straight through from 10.6 to 10.9, and it has never not worked. It should be fine."}
{"product_id": "B000A2R54M", "context": "Can this game be played on the dsi", "response": "yes I bought it for my Grandson and he plays on a dsi  LOVES it"}
{"product_id": "B004SJFJUA", "context": "Does it work with 2ds", "response": "No it's not the same arrangement as the 3DS so it won't fit"}
{"product_id": "B002J9GDXI", "context": "Anyone used this with a KVM switch?  Logitech's web site doesn't commit either way; it says \"KVM switches may affect the functionality of your G500.\"", "response": "if you store the function in the mouses memory it works hopping between multiple computers, it will have issues if you store in profiles on the computer. i havent tested it on a KVM though."}
{"product_id": "B003NVMEVQ", "context": "When you click the mouse is the sound, soft or loud?  I need one that has as low noise as possible when clicking.", "response": "Its pretty low ,but clear."}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "No it is wired but to quote my son (who uses it) \"it has a really long cord!\""}
{"product_id": "B00GU4F4OM", "context": "What does the \"power button\" activate? and can the \"power button\" be programmed specifically to certain tasks?", "response": "The power button is that red button near the pointer finger, and it can be macro'd to all the same functions as the other buttons. I think they just call it the power button cause it's quick to click. I like to use it to throw grenades."}
{"product_id": "B0053B66KE", "context": "Do they ship the correct version based on ur region? Eg PAL to NZ and Europe, Or do they only ship American NTSC version?", "response": "you would have to verify on the game page itself, amazon carries mostly english versions, but sometimes there's a few PAL and JAP versions, you would need to make sure the one you are ordering is PAL."}
{"product_id": "B00HWMP0TU", "context": "Labeled as COMPLETE ED., but does't have EXT. PACKS & DLC as box describes. What do you recommend?", "response": "It comes with all dlc if that's what you are asking"}
{"product_id": "B001444IN6", "context": "does it work for windows 7 and 8", "response": "does it work for windows 7 if so how because my granddaughter is having a problem with it working on her windows 7."}
{"product_id": "B00005QEFD", "context": "I'm sorry, I've looked at all the questions and answers but I thought I should ask again: Does it come with all the necessary wires and one controller", "response": "No. This is the cube by its lonesome. Any additional bits and bobs must be bought separately, including the power cord/t.v. connector. Remotes are not included either."}
{"product_id": "B00BGHUS58", "context": "Is the game worth it to buy it new, or is used a better deal? Also, does it have any istallation issues?", "response": "The one I brought used keep freezes up at car chase. I suggest you by it new."}
{"product_id": "B00GZ9ESEE", "context": "Is the console \"glossy\" black or \"matte\" black", "response": "Brad, the console is matte black."}
{"product_id": "B000IBELZG", "context": "Does this camera work with the PS Vita?", "response": "No it is made for the psp and the plug is a usb mini the vita needs micro"}
{"product_id": "B0098EVZZ8", "context": "Can Chop Chop be used for spyro's adventure, being that he was in the original spyro's adventure game? I understand that shroom boom wouldn't work.", "response": "Chop chop does work on spyro :) we have spyro's adventure and giants and he works with both."}
{"product_id": "B002SCQSKE", "context": "why can't i hear any sounds while playing the game?", "response": "You have to go to the manufacturer's website, and download a patch.  Mine worked fine after that."}
{"product_id": "B0027AP5S8", "context": "Oh. So no special tools needed. But I have one more question, will the custom fan (Tailsmoon Wisper Fan) be a problem with the casing?", "response": "No special tools needed at all. Also, the fans work really well with the casing. If u send me your email address I can send you a pic of what it looks like after its all installed."}
{"product_id": "B001B5U80K", "context": "Is Torchlight made for any other game console, or just PC?", "response": "I play Torchlight on my mini Mac with OSX 10.9.2 (Mavericks)You can DL the mac version from Steam. (Google - Steam Torchlight)"}
{"product_id": "B00CX8VYM0", "context": "The game is multi language?", "response": "Yeah, the in game menu has several spoken language options as well as subtitle options..."}
{"product_id": "B00BU3ZLJQ", "context": "is it the full version with redstone?", "response": "I don't believe you get as much as you would with the PC version, but it does have red stone with all the levers & buttons"}
{"product_id": "B0087ZMAUS", "context": "Are these open eared?  Will i be able to hear whats going on around me and myself talk? Thanks.", "response": "They are considered open ear headphones -- cloth ear cuffs."}
{"product_id": "B004774724", "context": "does this work on kindle fire", "response": "It's an expansion pack for the PC."}
{"product_id": "B00BGAA0SU", "context": "What is the difference between the inFamous:  Second Son Limited Edition and the Standard Edition?", "response": "The limited edition comes with an extra couple missions and a exclusive jacket to be worn by the chracter. If the price is very different I would just buy the standard edition unless you really want those two missions."}
{"product_id": "B00F27JGVA", "context": "Will this be recognized by Playstation TV? Sony says only 32.", "response": "I haven't tested but I'm willing to bet it will work and the reason they said 32GB is because there's no official US 64GB."}
{"product_id": "B0083H4NG4", "context": "How much does this mouse way and how much do each gram of steel weigh?", "response": "I mean not sure on the actual weights but its definitely not too light and there is enough weights that it is pretty well adjustable"}
{"product_id": "B0065NP6NC", "context": "Are the missions like Call of Duty (mission 1 must be completed before mission 2) or like Far Cry (you can complete missions in different order)?", "response": "It's like far cry"}
{"product_id": "B00CHYOP80", "context": "are these a usb headset", "response": "I bought for my friend..i hope they are usb..i bought for games and etc..."}
{"product_id": "B0054SCSQM", "context": "Will it run on Windows 8?", "response": "Yes...I have Windows 8.1 and it works just fine."}
{"product_id": "B00519C7CE", "context": "Does it come with the zombie pack?", "response": "No pack, however it does have a zombies node ready to play when you start."}
{"product_id": "B004EJ0L8E", "context": "Is it usb plugged?", "response": "No it has 2 jacks 1 for sound and the other for the mic. I love these headphones dude"}
{"product_id": "B0038PBF1W", "context": "will this work on windows 7", "response": "Yes it will run , but do not buy, the program is  unplayable."}
{"product_id": "B009K7QB8O", "context": "Someone said that the CD is a mini CD. I have an HP TouchSmart 300. The CD not have a tray, the CD's slide into a CD slot. Will I be able to use the mini CD?", "response": "There is good news and bad news. The bad news is I looked it up and what I found was don't insert the Mini CD into the slot. The good news is you don't need to instal the CD to use the keyboard. You only install I if you want to program the keys."}
{"product_id": "B0005PHYPO", "context": "Will this load on Windows 7?", "response": "I have WIN XP on my computer, so I really don't know if this game will run on Win 7. I suggest that you do a \"search\" by inputting: \"Kings Quest 7 and Windows 7\"."}
{"product_id": "B004ASOLLM", "context": "This is compatible with HTC for calls, music, etc.", "response": "It works with my nokia phone"}
{"product_id": "B00GLZQR96", "context": "Is it split-screen multiplayer?  Online multiplayer?  Or is it multiplayer at all?", "response": "More specifically.....It is couch co op, online multiplayer, and single player (or like were going to do 2 couch co op and 2 players on our online friends list)You can play 1-4 players in both couch co op and online (if you have 4 controllers that is haha)"}
{"product_id": "B00DJYK8XS", "context": "If you don't want to play the game, but just use it as a Zumba video, will it still play?  (For example, no one is holding a remote.)", "response": "No, the remote detects movement and if there is none the remote shuts off. Shake the remote to keep it active."}
{"product_id": "B00GOOSORM", "context": "I'm new to this.  I've never heard of a time card.  Can someone explain what it is please?", "response": "Time cards can be use to play ff14 online. The game requires a free to play. Use time cards instead of credit card"}
{"product_id": "B00292OW1U", "context": "Is is compatible with Macs?", "response": "I own this keyboard, a PC and a Mac. It is NOT compatible with the Mac. I find it fascinating that a Mac user is looking into a hardcore gaming keyboard because it was unfathomable 10 years ago."}
{"product_id": "B0094H8H78", "context": "Can it play all Game Gear games?", "response": "I'm not sure. I think it just plays the games that it comes with."}
{"product_id": "B00DHUUTEM", "context": "How can I get the backlights to turn on? Fn + ESC does not do it?", "response": "They turn on a boot up, but go off after awhile, and F+ ESC does not work for me either.  I'm about to junk it, wasted money."}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "The gear shifter is not fixed to the steering unit and can be mounted anywhere you choose to mount it."}
{"product_id": "B00B77OKNI", "context": "will this work on a 2nd generation kindle fire", "response": "I am not sure I have only used it with my Fire HD!"}
{"product_id": "B001CXYMFS", "context": "does the Thrustmaster T-Flight Hotas X Flight Stick by Thrustmaster work on all flight simulators games for macs", "response": "I never tried it on MAC. However considering that a PC mouse works perfectly fine on a Mac too, there shouldn't be an issue.  Flight simulator designers will be crazy if they don't programme the software to work with joysticks!"}
{"product_id": "B00FATRKOK", "context": "can i get netflix", "response": "If you already have a Netflix account that allows streaming through another device you can do the same through the Xbox."}
{"product_id": "B00HEX8TA4", "context": "Has anyone tried this mouse with LoL? If so, how effective is it? LoL is the reason I just purchased this as well as a Razer Tartarus Keypad. Thanks!", "response": "Amazing, it feels like an extension of your hand"}
{"product_id": "B00BXONG7G", "context": "if i purchase this (Battlefield 4 [Online Game Code]) will i get the full game to download or only the key ?? if only key, where is the game", "response": "You will get the key and when you redeem it you will get the game code but you need origin to do so"}
{"product_id": "B00DC7G2W8", "context": "Will I be able to play this game on my regular Wii?  Or do I have to have the Wii U console?", "response": "why would you be able to play wii u games on the wii? are you able to play ps4 games on your ps3?"}
{"product_id": "B00B5QLS4A", "context": "This mouse is 100Hz or 1000Hz? Just wondering if it was a typo or not.", "response": "1000Hz max (1ms response time)."}
{"product_id": "B00CWFUHT0", "context": "What is included in the box?", "response": "PS3 Super Slim 500 gbwhite, AV cables, and a ps3 bluetooth controller."}
{"product_id": "B00AAQRNQ8", "context": "How does this feel in the hand? Cheap? Sturdy?", "response": "I'd say its somewhere in the middle."}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with consoles sold in U.S.?", "response": "My US WiiU works just fine with it. I didn't realize it was an import until I received it, but other than the packaging it's just like one you'd find in a US store."}
{"product_id": "B009SJR28W", "context": "Are the keys noisy", "response": "No, the keys are actually low profile and very whisper quiet."}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "I bought it a couple of months ago and ended up returning it.  It is terrible.  Even the way the game plays, if you can get it to play, is terrible.  Lobstermania and Wolf Run is so much better."}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "Yes it has four disc for the Xbox 360."}
{"product_id": "B00B15EXJC", "context": "Is this rechargeable or does it use batteries?  If batteries, what size and how many? Thanks!", "response": "It is rechargeable and it comes with its own usb chord. However the chord is short so playing while it's charging isn't much of an option. Sorry I was really late with you answer."}
{"product_id": "B00B1OK3TC", "context": "does it work on xbox", "response": "Yes, pretty much anything with a component video feed. Isn't the best quality."}
{"product_id": "B005BLAJRC", "context": "Does it work on Mac os x maverick?", "response": "For anything higher then 10.6 , we offer the following resolution to this problem on our official Technical Support website :http://support.encore.com/technicalsupport/kb.aspx?kb_id=1615&product;_id=2830"}
{"product_id": "B003N3HEU0", "context": "waht kinde of remote can you use for this game the classic controller pro?????????", "response": "I don't have a classic controller - I use the normal wimote with a zapper attachment, but I assume that it would work with the classic  -- and I had no problems as mentioned by kimpritis (my wii is about 5 years old)."}
{"product_id": "B00GJXMRX0", "context": "Is it compatible with windows 7?", "response": "Any game released after 2010 is compatible with Windows 7 thus suggesting that Assassin's Creed IV:Black Flag is compatible with Windows 7 because it was released in 2013."}
{"product_id": "B0047ERZ7Q", "context": "can this cam work with the vita system", "response": "The PSvita already has a camera installed."}
{"product_id": "B002I0KP4G", "context": "Is there a way to redeem this through battle.net after I order so I can DL and start playing or do I have to wait for the physical copy to arrive?", "response": "If you order the Expansion through Battle.net then yes. But if you order from a retailer, then you will have to wait for the shipment to arrive."}
{"product_id": "B009M72E5Q", "context": "Will this particular Wii play the GameCube games?  Does it have the ports to connect GameCube controlers?", "response": "No I don't I have tried other discs and they don't work."}
{"product_id": "B00HG0B8NA", "context": "I get the following error while updating the game: \"The application cannot be installed due to a certificate problem...\"", "response": "Dear Margie,You have to uninstall old version of the game manually, then you will be able to update the game without any problems.Thank you!"}
{"product_id": "B008VQ68C4", "context": "Is it possible to use with phones", "response": "No, this is a USB headset."}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "They send you PSN codes that you input into the PSN Store to start the download."}
{"product_id": "B0002DKTY2", "context": "will this work with windows 7?", "response": "this software will not work with a 64 bit machine.there in the merrium Webster dictionary that will I got on amazon down load on line only for about $20. there is not a disk available for a 64 bit machine"}
{"product_id": "B00BU7WVG8", "context": "is this a 2 players", "response": "I had asked my nephew and he said, \"Yes it is.\""}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "I don't think so.  I installed it on my XBOX1, and it showed up on my 360 as a download.  It was supposed to send you a code to redeem for the 360..."}
{"product_id": "B00CX8VYM0", "context": "is the sexual content strong in this game or mild,", "response": "Thank you for contacting us. The item you are inquiring about is mature for 17 year olds and older."}
{"product_id": "B009AP23NI", "context": "Is this an official Nintendo product?", "response": "Yes - I purchased one, and it is officially Nintendo. Arrived in box."}
{"product_id": "B009S4JZKK", "context": "Does this work on Mac?", "response": "is not working on windows about the mac ...i dont thing so, what you need is to go on line to download a lot of files and of course you will find a virus after that....dont buy!"}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "You get the code via email and in your web browser instantly."}
{"product_id": "B00FE8WKMO", "context": "will this game work on the regular wii?", "response": "No. It will only work with the Wii U system."}
{"product_id": "B001COU9I6", "context": "does it last long", "response": "it's a good item to have"}
{"product_id": "B00G6IJ5QK", "context": "Can the button for the CPI toggle be remapped to be held down? Like as a PTT for Ventrilo?", "response": "It can be remapped, but you can't map it to be a continuous hold.  It can be mapped to a one-off macro of keystrokes in the driver.  Could be used as a toggle for voice activation or microphone mute, but not the traditional PTT."}
{"product_id": "B00DH1KRQQ", "context": "does it have the rumble feature?", "response": "Yes, people who said it can't probably didn't bother to install the driver for it."}
{"product_id": "B0071NH8B8", "context": "Can you use this with regular WiFi, or do you have to buy the AT&T thing?", "response": "Hello such, if you can use it with wi-fi not usually need to buy the AT & T service greetings"}
{"product_id": "B0050SYR74", "context": "does the xp500 transmitter work with the xp510 headset", "response": "As they are two different model numbers, I doubt it"}
{"product_id": "B0000A2TPE", "context": "Can this work on Windows 7?", "response": "Yes, that's what I play it on."}
{"product_id": "B00BCEK2LU", "context": "My kb sets on s slide out tray so over all length is a factor. What's the side to side length of the G510S?", "response": "From side to side the length is 20.9 inches or 53 cm, is quite large."}
{"product_id": "B0050SY77E", "context": "In the game stills, I can see the playable character. Does this mean it has a 3rd person view option?", "response": "no, this game does not include 3rd person view."}
{"product_id": "B00DC9SWWE", "context": "I love campaign modes on other first-person shooters and play offline quite a bit.  This a problem with this game? Description troubles me.", "response": "Can it be played over a local network?"}
{"product_id": "B009LGO88E", "context": "I have the Newest 3DS XL with the new tiny right joystick that seems useless at its size. Will this device work as a supplement for that?", "response": "No sorry the new xl and the old xl are just a tiny bit different in size. It's worth it if u have the old one and don't want to upgrade to the new xl"}
{"product_id": "B001ELWMHI", "context": "Does XBOX Console works out of U.S.?", "response": "If you have the proper power adapter or correct cable in respect to your region or country, it should work!"}
{"product_id": "B002I090AG", "context": "would the charger and pen be included with the console/", "response": "both of these items were included. However, the charger that was given to me didn't work at all."}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "Last machine I ran it on was a win7 republic of gamers laptop. It had to run in compatability mode, but I was able to play it (with minimal hicups, but some graphical degradation) I was using a beefy spec rig though, your mileage may vary. I havent tested it on windows 8/8.1"}
{"product_id": "B007A7UJ4S", "context": "Do this game have English Voices?", "response": "Yes it does, that's how my version was. There are 2 versions, american and japanese. You can choose in american, but other one is full Japanese it think"}
{"product_id": "B000H67DDY", "context": "Is this device HID compliant? Or does it rely on the included setup software for assigning controls?", "response": "To set it up properly I depended on You Tube tutorials and the enclosed instructions. It went flawlessly. No problems what so ever."}
{"product_id": "B00DWXUYN0", "context": "Will a regular 3ds fit well in this case? Would it have too much room and slide around?", "response": "My 3DS XL is strapped down pretty good. Even though the footprint of the regular 3DS is smaller, it's not that much thinner. I think it will fit!"}
{"product_id": "B00FYAQUPU", "context": "Can you buy the dark characters seperate from the starter pack? I have the Swap Force game and portal but want to buy the dark characters?", "response": "They only come in the Dark Edition starter pack, unless you buy them from someone who is selling them as a loose item out of the starter pack"}
{"product_id": "B005764CWO", "context": "I can't seem to get it to connect. Any help/suggestions/directions?", "response": "contact air flo.... its a piece of junk. i tried contacting them but with no luck i ended up throwing it away and just boughta new oem ps controller"}
{"product_id": "B00475AYUA", "context": "can more than one unit occupy the same space of land at a time?", "response": "Yes, any number of your own troops can occupy the same space."}
{"product_id": "B00CERXJNW", "context": "Is this the keyboard that has 16.8 million color schemes", "response": "Nope. Just white. You can select the keys to be illuminated individually tho."}
{"product_id": "B0050SZ0SY", "context": "Will this work with Win 7??", "response": "It Runs fine on my Win&."}
{"product_id": "B000FN7K2S", "context": "Does it work on The second newest Mac?", "response": "I do not know - we have Windows 7. Sorry I couldn't help."}
{"product_id": "B0002DKTY2", "context": "Random House Webster College Dictionary Will this DVD work on a 64 BIT system?", "response": "I just tried to install it, and it wouldn't install because I have a 64 BIT system."}
{"product_id": "B006W41X36", "context": "Is this the right decoder needed from a Samsung 4k to a Sound Bar that does not have an internal decoder in order to get all sounds from PS4 & DVR?", "response": "I doubt it... This is designed for a headset, not a soundbar."}
{"product_id": "B00CD1FC6G", "context": "Is the wrist-rest removeable?", "response": "Yes the wrist rest is removable"}
{"product_id": "B0002EAA36", "context": "Does it work with PC arcade games like Pac man, Space Invaders?", "response": "can you use it with a ps2"}
{"product_id": "B00EOI2MRS", "context": "Does this controller come with the cord? I understand from the description it is used only with a wire, just asking if the cable is included.", "response": "Yes it comes with the cord. The cord is attached to it ."}
{"product_id": "B0087N222Q", "context": "How do i plug this pair of headphones To the ps3 so y can speak With my friends(black OPS 2)?", "response": "On your PS3, scan for bluetooth devices, then hold the button down on the headset until the lights alternate flashing between red and blue. Select the headset, enter the code (0000 usually)."}
{"product_id": "B003EUPCZG", "context": "is it good for left handers", "response": "I think it would be fine for left handers. I bought my grandson a custom built computer with the mouse and a razer gaming keyboard and a 24\" screen. He loves every piece. He said the mouse has buttons on the sides. He doesn't see a problem with a left hander using without any trouble."}
{"product_id": "B00CJD4HD2", "context": "Can the scroll wheel move left and right?", "response": "Why yes, yes it can.  I'd strongly recommend the g700s though, disregard ppl bashing the battery and instead look at its mouse functionality.  Your hand will thank you."}
{"product_id": "B00B70WKUK", "context": "How is the game play with using a keyboard and mouse? Does it feel like CoD or MoH?", "response": "Yup, aiming and shooting feel very similar but managing your inventory and weapons is more complicated in RE6"}
{"product_id": "B006YDPU48", "context": "Does this game have an online co-op mode where you can play private with a friend?", "response": "No, It has only a online mode where you can play but not in private, some player can put a signal on the floor and you can invoke the spirit of him for your help."}
{"product_id": "B00DLRLDBO", "context": "Does the headset acutally connect to an Xbox 360 controller? For chat?", "response": "Yes, it does connect to the controller for xbox 360.  There's several cords to connect first but it wasn't difficult.   The volume controls didn't work though."}
{"product_id": "B00F27JE1C", "context": "What does this come with?", "response": "Nothing but the game system. Nothing extra."}
{"product_id": "B008BT2FWI", "context": "are these games 3 hiden objects system", "response": "Sorry.  It's is matching same tiles."}
{"product_id": "B001ELWMHI", "context": "So does this play KOTOR and all the other original xbox games?", "response": "Yes it can, Except for DVDs and Aufio CDs, but I've replaced the DVD drive from my old Xbox console, swapped the tray cover from scratched to non-scratched"}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "This is for the original PS Vita 1000, the one with the OLED display."}
{"product_id": "B0065NP6NC", "context": "Can you transfer your progress on the original fallout new vegas game to this new game?", "response": "Yes. You can actually still use the old game disk as well, you just have to install the second disk of the set which has all the dlc on it"}
{"product_id": "B00CD90R72", "context": "What about the teams from Argentina, Colombia or Brazil, are there in this game ???", "response": "In fact yes, all three leagues as well as their national teams (with updated, world cup rosters) are in the game. If you connect online they are constantly updating the squads."}
{"product_id": "B00D2EGWDA", "context": "Is nuke town map and extra zombie map included on the standard version or is it only on the other versions like the hardened or deluxe pack?", "response": "I think nuke town is included also"}
{"product_id": "B005BLAJ68", "context": "does it play pitch?", "response": "I see Pitch listed. I have never played it, however."}
{"product_id": "B008YA9BVC", "context": "does the headset work on the Wii? or does it work on just the Wii u?", "response": "It's not compatible with Wii. It works on Wii U via the headphone jack on the Wii U gamepad. It should also work with anything that has a 3.5mm headphone jack."}
{"product_id": "B00D96BJSO", "context": "Can you hear yourself chat through the headset?", "response": "unfortunately no you can not hear your self through the headset"}
{"product_id": "B00BU7WVG8", "context": "does this play 2 players", "response": "It has \"couch co-op\" (2 players on the same console).  No online MP/co-op."}
{"product_id": "B00B5QLS4A", "context": "Does this mouse have a middle-click function on the scroll wheel separate from the button below it?", "response": "Yes, Corsair comes with software that allows you to map the scroll wheel as a button."}
{"product_id": "B007MJSZDQ", "context": "is this product junk?", "response": "In the long-run, yeah. I got a pair of batteries hat worked completely normal compared to other reviews and they worked great for a couple of months. So, if your thinking of buying this, just remember these batteries don't last 6+ months with a good charge."}
{"product_id": "B00DC7FWRE", "context": "What controllers are supported?", "response": "Each player needs one Wii Remote, with or without Motion Plus makes no difference. You will also need the Wii U Gamepad for many of the games, often passing it around. All other controllers like Pro or Classic Controllers are, as far as I know, not supported at all."}
{"product_id": "B005MQ3BSK", "context": "are the instructional videos on frtz 13  complete, or at least more complete than the miserable video 'snippets' on frtz 11", "response": "Sorry...can't help here. I have never viewed Fritz videos."}
{"product_id": "B00I9UVY7G", "context": "in order to play the worldcup tournament should we connect to xbox live or we can the play the game witout connecting xbox live?", "response": "Hi. This game NEVER worked.we could not use it in USA.there was an error for area code.probably was for an other zone.be careful!"}
{"product_id": "B00CWFUHT0", "context": "what does cech-4012 stand for.can u use it with any smart t.v-europe or America?", "response": "I'm not sure on that. But it works great"}
{"product_id": "B0083H4NG4", "context": "My window 8 laptop does not have a cd drive, would still be able to install all the necessary drivers and software", "response": "Yes you can.  http://www.perixx.com/en/driver.html  You can find the driver download at the link I posted.  You can also find the users manual here: http://www.perixx.com/en/service/manual.htm"}
{"product_id": "B00DC7O77A", "context": "Does this game have multiplayer mode?", "response": "Yes you can play with a friend.  One person controls DK and the other controls the other character and you can work together."}
{"product_id": "B005F1ZUU4", "context": "Will this work for multi-player? Could I connect two wireless controllers to this one adapter?", "response": "I have ran up to 4 so far"}
{"product_id": "B004HYIAPM", "context": "Is this game appropriate for a 12yr old? What are the \"sexual themes and alcohol\" content in here like the rating says?", "response": "The only sexual themes may be getting married, and alcohol is just one of the drinks you can get at the tavern. The game is based around combat tgough, but is one of the best I have ever played. if your 13 year old can handle violence, this is one of the greatest games out there."}
{"product_id": "B004FS8LYK", "context": "Can you recommend games for 8 year olds?", "response": "Sorry i dont know any."}
{"product_id": "B000SOYG8U", "context": "is it about the clone wars pleace answere", "response": "No the first one is only rebels and the empire. Second one is rebels empire and the zaan consortium. Very powerful pirates with a few units from the clone wars like droidekas."}
{"product_id": "B005OSFUZI", "context": "Does it work on Windows 7 OS?", "response": "Yea it should work fine, thats what I use."}
{"product_id": "B001DWI4FM", "context": "Ghosting Does anybody know if this keyboard has anti-ghosting?  If so, what kind?", "response": "I had this keyboard for a week and it has ghosting problems. Example, you can't press shift + x + arrow keys at the same time. Searching online for \"microsoft sidewinder x6 ghosting\" you'll find a bunch of articles about this and issues with other key combinations."}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "Video game ratings should be taken seriously. There's a reason why a kid under 17 cannot buy this game at a retail store. It's not about opinion. It has a rating. Pay attention to it."}
{"product_id": "B00EM5UFEK", "context": "does xbox one require a gold membership  or does ps3or 4 requiree any membership or play on split screen?", "response": "I think acess too certain games in xbox one requires the same gold membership extra money per player as 360.  play station does not require additional payment no matter what version and all games like Minecraft and plants vs zombies are ps just like xbox. only xbox seems to want to charge extra"}
{"product_id": "B00G6IJ5QK", "context": "Does the mouse come with warranty?", "response": "Yes. I believe all Steel Series products come with a 2 year manufacturer warrenty. It may not be 2 years, but I know they do come with some sort of warrenty."}
{"product_id": "B00D78Q4UM", "context": "Do the keys have the tactile click? My K95 with cherry red switches don't have the click and I hate it. I need the click for my typing style.", "response": "I'm not sure what you mean by the clicks but, it has a real good feel to it and you'll definitely feel the moment the key stroke gets registered. Great weight, feel and price."}
{"product_id": "B00CX8VY4S", "context": "Does this game require a xbox gold membership or can I still play the game fully with out the membership?", "response": "It has the campaign which is single which you dot need live but the multiplayer you do. You do need live to get updates on the game though. So to get the best experience while playing this game, I would get Xbox live but you don't need it for the campaign part."}
{"product_id": "B002I0K6X6", "context": "Will this work with the PS4 ?", "response": "Honestly, I have no idea."}
{"product_id": "B00HHAIY72", "context": "Does it pay to get a used x52 pro. The Warthog is close to $500 and the less than stellar reviews for this item on Amazon and elsewhere are scary.", "response": "The X52's stick was way to loose for me for precision corrections. It also had a dead zone that I just didn't like.  X-55 is much, much better."}
{"product_id": "B00C7103DO", "context": "Hi, I would like to know whether it is the full game or is it the 10 GB version and we have to download the extra 8 GB?", "response": "well when i bought it from amazon it was the digital version. they just gave me the code through an email. and when i redeemed it on psn i had to download the game then install it. once i launched the game there was a mandatory data install as well."}
{"product_id": "B0076DO5A0", "context": "What are the spec. for  video card Now using 7800", "response": "512mb graphics card, Nvidia 8800gt 512mb +: I have Nvidia gtx680 super clocked2gb. runs bf4 at ultra settings. Hope was helpful info."}
{"product_id": "B0091A3AHA", "context": "Can an Xbox One fit into this device?", "response": "There is an upgrade kit to change the foam in the bottom for the Xbox One, I am asking to see when that kit will be added to Amazon."}
{"product_id": "B000BU0F5Y", "context": "how would u rate this against the razer game pad ?", "response": "Not recommended.  Good in gameplay, not lasting longer in heavy gaming.  It broken on me, not able to get replacement or refund from Saitek."}
{"product_id": "B003ZSHN0O", "context": "will it work for windows 7?", "response": "We have it on XP    I would go to their website and check"}
{"product_id": "B005J37I4Y", "context": "Is there a mute button on this or do I have to use the one on my headphones?", "response": "You use the one on your headphones. The one button on the XBA is for pairing."}
{"product_id": "B00D6PTMSW", "context": "What elements of the game does Kinect enhance? It says it is better but not required to play with Kinect. How?", "response": "When I tried using the Kinect I found that it picked up hand motions only causing confusion.  I'm sure it works better for some and I was looking forward to never having to take my hands off the guitar but it didn't work out for me."}
{"product_id": "B005QUQP80", "context": "Does this keyboard response with Windows 8.1?", "response": "I had no issues with it on Windows 8!"}
{"product_id": "B003O6EE4U", "context": "do you ship this item in its original box?", "response": "Mine did arrive in the original box"}
{"product_id": "B00F2ENJY8", "context": "Can you do 2 players on this console? And How?", "response": "I researched this thourgly before my purchase. This mini is supposed to do all things wii does except get online and play dvds. Mine under tree so caannot tell you for sure, sorry"}
{"product_id": "B00CMC6HCY", "context": "Is Ultimate Warrior on this game, and can you play as him? I've read contradictory-sounding things...", "response": "Yes he is on the game & we can play as him, but he is hard to get you have to complete a task on 30 years of Wrestlemania & it is not easy."}
{"product_id": "B002I0K3CK", "context": "Can you play multiplayer (2 people) with 2 Wii U Pro Controllers?", "response": "Yes, there is a free update which permits it."}
{"product_id": "B000HZFCT2", "context": "I know it's compatible for Windows, but does it also work for Macbook Pros?", "response": "Yes, in fact I myself have used it on my Macbook. I used this guide to set it up: http://www.maclife.com/article/howtos/how_use_xbox_360_wireless_controller_your_macHappy Gaming :)"}
{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel have left,right and middle click on the scroll wheel ? I really like this feature", "response": "the mouse wheel clicks but only down not left and right."}
{"product_id": "B002LARYGA", "context": "Dose it work with PS4 Thanks", "response": "Hi, I do not have a PS4 but from what I've read on the internet there are compatibility issues of PS3 remote with the PS4, so this may not work on PS4. You could email the manufacturer at -pcsupport@smkusa.com - to get a specific reply. Hope this helps."}
{"product_id": "B00B3PDHBU", "context": "Will this headset work on the xbox 360 & the xbox one?  Looking for a headset that will work on both.", "response": "Yes but you need to buy an adapter for Xbox 1"}
{"product_id": "B00B1N07QM", "context": "Wife tried Nostromo and her small hand felt slightly strained to hold  in the WASD position. Is this better for smaller hands?", "response": "This has an extra row so with smaller hands I'd imagine it would be harder to reach the extra row.  It would probably be slightly better to hold in the WASD position due to the adjustable palm rest and the slider all the way closed if she doesn't care to use the extra row."}
{"product_id": "B0000A2TPE", "context": "Does it work on Mac? Is there a version of Zoo Tycoon that works on Mac?", "response": "Being a PC user and not Mac, I couldn't tell you.  I hope someone else can; sorry."}
{"product_id": "B00CD1FC6G", "context": "Does this board still have the LED Issues? (Them dying off after a month or two)", "response": "Yes, mine started going bad within hours of hook up."}
{"product_id": "B00GG4BBUM", "context": "How do you get the controller skin?", "response": "It was a pre-order offer from Amazon. But, you can purchase one from skinit.com."}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "It plug into an ac outlet."}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "Yes, i recieved the slim unit"}
{"product_id": "B001AI7CF2", "context": "$ 7.99 is the price for each extension? or for the package of four extensions? Please clarify", "response": "All four come together"}
{"product_id": "B00A7VK16A", "context": "Has anyone used a xbox slim when in a car? Will the disk get messed up?", "response": "Yes, the Xbox wasn't designed with mobility in mind. unless you set up a custom suspension for everything the disk will get scratched hitting a bump on the road this happened to me."}
{"product_id": "B00I4A751U", "context": "is it in english", "response": "yes.  it is the US edition"}
{"product_id": "B00DWXUYN0", "context": "will this case fit the dsi xl?", "response": "It fits the 3DS XL, so it should fit the DSi XL"}
{"product_id": "B005EQE0YM", "context": "Are these very comfortable?", "response": "Super comfortable. I wear them for hours, a fact that I'm not proud of."}
{"product_id": "B005VO5ZVY", "context": "Will this fit XL size?", "response": "No.  It is a very specific fit & not stretchy or anything.  It is definitely a case for protection.  And it has been awesome on my son's 3ds. But this model only fits the regular 3ds.  Maybe there's another model size?  If so I strongly recommend it."}
{"product_id": "B00EZAWV6W", "context": "I have an old Vista will this game work on my computer???? My son wants to play it.", "response": "I believe so. The only real issue with Vista is that it doesn't have anti-virus updates any longer. I liked it much better than the Windows 8 I have now. My son loves this game, so I'm sure yours will too."}
{"product_id": "B001O3066U", "context": "Does anyone know if this version will work with Windows 8?", "response": "Yes, it does. Some minor problems that I cannot fix are it plays on full screen (so horizontally enlarged) and a bit blur screen probably due to the 32/64 bit difference (not sure tho)."}
{"product_id": "B007SRM5MO", "context": "Anything inappropriate for a 10yr old?", "response": "I would rate it PG-13 due to the few curse words and the costumes of such characters as Catwoman and Poison Ivy. But then again my 6 and 3 y/olds girls love watching me play it and the 6 y/o plays it on easy difficulty."}
{"product_id": "B00HVBPRUO", "context": "Does the sounds on the headset leak? if i were to play loud music on these, would other people around me hear the music as well?", "response": "No my gf sleeps right next to me wile I play all my games, this headset does not leak at all from my gf standpoint and I have it very loud sometimes."}
{"product_id": "B00CJ7IUI6", "context": "If I already have Skyrim and just wanted to add the expansions, would I be able to continue with my game if I got this or have to start over?", "response": "You would absolutely be able to continue! The DLC comes on the disk and all you do is install it onto your system, it will go right along with your saves."}
{"product_id": "B006W41X1S", "context": "does the mic work good", "response": "Mic sounds great and no one online has complained about my mic. can hear everyone else great too."}
{"product_id": "B00JC9SWSC", "context": "Does the console include a way to charge the controllers or do you need to buy that seperately?", "response": "It has one controller with charge cable."}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "Yes and no.  After I wrote my initial review on the Sidewinder, it worked great for about a week.  Afterwards, it was hit or miss as to when it would work.  I finally gave up and got this instead:  Thrustmaster T-Flight Hotas X Flight StickNo problems since!"}
{"product_id": "B005G4CXPK", "context": "Will the keys activate on steam?", "response": "No, these particular versions are drm locked to Uplay."}
{"product_id": "B00DNGQQUQ", "context": "Will this game work with Korean xbox?", "response": "No, it will not, different formatted disk."}
{"product_id": "B000VRCNLG", "context": "Is this program compatible with Windows Vista?", "response": "Yes as I have used it with Windows NT4.0/Xp/Vista/and Windows 7.I have a Sidewinder II,and it works with all programs as such as it is supposed to."}
{"product_id": "B00ATHFLZS", "context": "Does this product have a warranty", "response": "Yes it does, I think it's a one year warranty, I made use of it because my original shipped with a broken cord."}
{"product_id": "B0090ECASW", "context": "Can you set the keyboard backlighting to change based on what program or game you are running?", "response": "I have one, but have seen no way to do it myself.  But at least it doesn't take much reach to hit switches I, II and III.    :)"}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "It would be fine. I don't remember too much of any of that stuff. Language is not bad at all. And nothing really sexual to it at all."}
