{"product_id": "B008GEH8LQ", "context": "what over the ear headphones are recommended for an 8 year old?", "response": "I'm not sure but I would advise you to buy child specific headphones as adult headphones don't fit right and drop below the ear at times"}
{"product_id": "B008SBZF2Q", "context": "Does this character work with WII U?", "response": "It's only been used on a ps3.. never tried with wii u"}
{"product_id": "B006JSY3MI", "context": "Are the controls for the PC version easy to use?", "response": "It's only hard for me to control because my computer lags."}
{"product_id": "B004SJFJUA", "context": "Is the base necisary? Or does the battery pak, once installed, just charge when the 3DS is plugged into the 3DS charger?", "response": "Yes the base is necessary and that's where you can charge the battery. The Nyko battery is attached to a cover replacing the 3DS bottom cover and i haven't tried it you but i don't think you can charge the Nyko battery without the base."}
{"product_id": "B002BRZ9G0", "context": "Does this use the classic controller?", "response": "Classic Wii controller, yes."}
{"product_id": "B00E3667XQ", "context": "While console mode is enabled, is it obligatory to have the shield in clamshell mode?", "response": "No. You need the screen up even if you aren't going to use it (HDMI-Out Only) as when the clamshell is closed it covers up the buttons on the top."}
{"product_id": "B0016HG4H4", "context": "Does this work with Wii Rock Band 3?", "response": "Yup, kids love it."}
{"product_id": "B00002SANH", "context": "I cannot get the game to work on my lap top operates windows 7 64 bit pc", "response": "I never got it to work on Windows 7  ...it will only work on XP"}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "Yes it has Bridge, poker, hearts, spades, rummy,  euchre,gin, canasta, solitaire, blackjack, pinochle, go fish, old maid, cribbage and war.  It works on Win 7. Thats what I have. I have only done euchre and cribbage so far it works fine."}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "Mine worked well with Win 8 but I primarily use it on the Win 7 machine. The keyboard is a very nice keyboard."}
{"product_id": "B00DCBDNW6", "context": "Monthly Fee???!!! u mean besides the PlayStation Plus Subscription and the Game Disk's actual price (37.58$) there is still a monthly fee?", "response": "The PS4 version comes with a free 1-month subscription.  Do I still have put in my credit card information in order to use the 1-month free subscription?"}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "It has a detachable big palm rest."}
{"product_id": "B00CX8VY4S", "context": "So you can just play straight campaign even if you have an Xbox live membership? Or are you forced to play online?", "response": "You can play straight campaign. There are some head to head games on here that are side missions as well"}
{"product_id": "B00GPH7Y8S", "context": "is this game compatible with windows 8.1 ?", "response": "My current operating system is windows 8.1 installed on a HP Laptop and I have no problem running all the components of the Blitzkrieg suite."}
{"product_id": "B008CP6Q6M", "context": "Does this come in a plastic case or cardboard sleeve", "response": "the game comes in its own plastic case."}
{"product_id": "B0000C7GHG", "context": "How long is the controller cord? Also, doesn't the PS2 make noise?", "response": "This model of the PS2 is very quite as for the cord: the standard cord is about 4ft long. Hope that helps"}
{"product_id": "B00DC7G2W8", "context": "Will I be able to play this game on my regular Wii?  Or do I have to have the Wii U console?", "response": "There is a really nice bundle for Wii U Mario Kart that basically gets you the game FREE! Wit the extra free download game it's a pretty sweet deal."}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "Yes it works with the apps. I use when watching Netflix and I have no problems using it."}
{"product_id": "B00D96BORK", "context": "how would i set it up for hdmi?", "response": "This should help http://www.turtlebeach.com/support/entry/830516342/"}
{"product_id": "B006JKARP8", "context": "can i charge my samsung  galaxy tab 2 with this portable charger? i have a ps vita too, but i would like to know if i can use it with my tablet and my iphone 5.", "response": "I have charged my galaxy tab 3, Note 2 , Ipad 4 and ps4 controller with this"}
{"product_id": "B002CZ7P04", "context": "I have a problem with the contoller.  When I am in the menu for pause/save, etc., the controller arrow floats and I can't control it.  Does anyone else have this problem?", "response": "I have not had this problem. But maybe you are either to far from the Wii box or way to close. See if you can find a happy medium between you and the box. Worth a try."}
{"product_id": "B0095D1CM8", "context": "Does it has all its accesories?", "response": "It has a few removable weights, an Allan wrench for the adjustment screws and 6 replacable pads. 3 for the pinky side and 3 palm pads. You will have to download the software."}
{"product_id": "B002JTWODG", "context": "Is this the 6400dpi found on the Razer website?", "response": "No, it's not 6400dpi"}
{"product_id": "B00B0QONB0", "context": "is this for titanfall", "response": "You can use it for titan fall if you Dont have a hard drive in your xbox. Thats the only reason i got this Hard Drive was to play titan fall"}
{"product_id": "B001GIOGBY", "context": "Has anyone tried it with Windows 8? Does it work like in Windows 7?", "response": "I have only used it with  Windows 7 and Mac OSX and both work great.  Go to their website, it should say there."}
{"product_id": "B00EH5V1IO", "context": "I Realize it only says pc and mac, but has anyone tried these who has linux?", "response": "Hi, omelet. I have Windows 7 and Ubuntu 14.04. This headset works on Ubuntu just same great as on Windows.You even don't need to change any settings. Also i checked mic with Skype, works great. But if you have Ubuntu 10-13, you may need to fix mic (youtube / watch?v=tULmqpe5Yos)"}
{"product_id": "B00B98HDNO", "context": "after i insert the disk and the game starts installing, it asks for a product code. Where can I find it?", "response": "Inside the case, there's an \"installation\" sheet, labelled \"INSTALLING THE GAME.\"  The \"Product Code\" is the 15 character assortment of letters and numbers at the bottom of the \"installation\" sheet.  For example: \"K5UJE-8C8D4-8D8GG,\" (not an actual Product Code)."}
{"product_id": "B0036VO4XO", "context": "does it work on ps4?", "response": "This was designed for the PS4: Turtle Beach - Ear Force PlayStation 4 Upgrade Kit for Turtle Beach Headset Compatibility - PS4"}
{"product_id": "B002DUCF7Q", "context": "Does this work with X-Plane?", "response": "The Saitec panels are only company supported for use with Microsoft Simulators.  However drivers compatible with X-Plane are available from x-plane.org and I have had excellent results with them."}
{"product_id": "B0072G4LB4", "context": "Does it works on win 8?", "response": "yes, very well actually, I love this mouse, still the best one"}
{"product_id": "B00CD1FCAC", "context": "do the keys fade? I have bought several keyboards where the keys scratch easily and the letters fade off revealing a white plastic underneath.", "response": "I've had it for several weeks and there's no sign of fading, For the quality of the keyboard, I think the keys will endure for long."}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "The backlighting on the sliver keyboard is indeed blue while the black keyboard is red. Not switchable, but you can adjust the brightness level."}
{"product_id": "B00FB4BUMW", "context": "does this come as a usa keyboard layout if i order from the us?", "response": "i have the same question, plz answer it !"}
{"product_id": "B000TK99PS", "context": "Does anyone know if this is compatible with Windows 8 operating system?", "response": "Yes. I play Hoyle games esp. the card games."}
{"product_id": "B000056SPM", "context": "can u use it with xplane 9? Please anwser before 15.12.13, that be great because i need it for my sun's christmas present", "response": "Hello fellow time Traveler.  It will work.  I use it w/ both X-Plane 9-10 and both Microsoft programs Century of flight etc.  all the best Merry Christmas to you and yours.  Scott St. John¢¼"}
{"product_id": "B00FEDP968", "context": "you said it will work with a ps4. But how about using the voice changer on a ps4?", "response": "The headset/control base connects through USB, so this MIGHT work on the ps4.  All those special modes, voice changer, and whatnot can only be accessed through the PC."}
{"product_id": "B00B312UDU", "context": "Does anyone know is exist a software for this mouse???", "response": "They send u completely different mouse"}
{"product_id": "B00074TQFO", "context": "Do the pieces lay in the position that they fit together, so you don't have to rotate them. Does it have a back ground picture so you can tell if things are fitting together right.", "response": "The pieces lay in the right position , I have not tried to rotate any pieces but under Options you can click on\"rotating link\" but I have not tried this yet. There is a background picture that is faded but it does help in placing the pieces. fun puzzles.  DH/ AZ"}
{"product_id": "B00D3TRMD8", "context": "Does this come with the Reign of Giants DLC?", "response": "No it doesn't. I can be bought on steam for about $5 if I remember correctly"}
{"product_id": "B004X56PWK", "context": "Can you play the game on PS4?", "response": "The game was a gift to my neighbor, he is really enjoying it"}
{"product_id": "B0072A4JVW", "context": "Does this allow for access to a portable charger?", "response": "Certainly, the connectors are all free and available"}
{"product_id": "B00A1Y2STQ", "context": "Is this a quiet keyboard or are the keys noisy when you strike them?   Thanks.", "response": "They do make nois when you strike them"}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "All of the keys will change at the same time. No individual key colors"}
{"product_id": "B003O6JLZ2", "context": "is the controller wireless?", "response": "The controller originally sold with this console was wireless, but there was no controller included with mine as I bought mine used."}
{"product_id": "B001PO2BJI", "context": "Can this be used with a Wii remote plus?", "response": "It can be used with a remote with the Wii plus built in, but not with one where the plus part snaps onto the bottom of the remote."}
{"product_id": "B00GG4BBUM", "context": "Does the PS4 version support Playstation Move and custom sounds of the show?", "response": "Not sure about the move , Currently the PS4 does not support Sounds of the show because there is no Audio software ."}
{"product_id": "B001BYMZ5W", "context": "is there a better gaming headphone than this? or this is top of the line?", "response": "I have had a lot of headiets and this is the best one yet. Paired with my creative zxr sound card I hear way more then I ever did before and they super comfortable. I would recommend to anyone who has the money to purchase."}
{"product_id": "B00DC9T2J6", "context": "Does this work on Win 8?", "response": "Does on my Win8.1 64but OS"}
{"product_id": "B002I0HD9G", "context": "Does this work with a racing wheel", "response": "Sorry, but I bought to my nephew and I don't know any about that."}
{"product_id": "B002I0IIPY", "context": "I have the Wii mini, can this game still be played on it with no wi-fi connectivity?", "response": "There is no internet need for this game. I would assume it would work on the Wii Mini."}
{"product_id": "B004EJ0L8E", "context": "Do these work well with Xbox360 if i get a USB converter?", "response": "Don't buy it. Mine fell apart."}
{"product_id": "B000056SPM", "context": "Does the control rod extend out of the back of the case, or is it completely enclosed? Thanks...", "response": "It sticks out about 2 inches at rest and about 4 inches at full down elevator."}
{"product_id": "B0091WIOJ2", "context": "Can I use it for xbox one?", "response": "Yea, that's what I use mine for."}
{"product_id": "B002I098JE", "context": "Is good for 9 year old", "response": "I wouldn't let my 9yr old play this mainly because if people somehow did find out he is 9 he'd be made fun of so..no?"}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "It does. Download the official Microsoft driver here: https://www.microsoft.com/hardware/en-us/d/xbox-360-wireless-controller-for-windows and them follow Cabbit's instructions."}
{"product_id": "B0050SYX8W", "context": "Can you jump into Halo 4 not having played the other games?", "response": "Yes, it shouldn't be a problem. My son has played the others and says he doesn't see why it would be a probnlem and my daughte has only played Halo 4 without having ever played the others. Go to it."}
{"product_id": "B004XIQN3I", "context": "will it work with logitech extreme 3d?", "response": "no idea. my computer is very slow .would not recomendthegame."}
{"product_id": "B00BHSTXV6", "context": "How does this thing handle dust, Are there any piano glossy black parts? If so I'm not buying it because I live in an EXTREMELY dusty area", "response": "Hm.I have same problem.Dusy room  also.So u need to be carefull  with it.Cleaning once  per week.I hope u will manage to do it.:D.But still its not compatible with SS engine 3.Only working with 2.9.:/"}
{"product_id": "B00EEMLPR2", "context": "Can anyone tell me what features the 1080p HD Tactical Camera has. Is it worth it?", "response": "How much video can it record in terms of duration? Can it record audio?"}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "It will allow youtube and netflix and tv if it is all throughtyou xbox 1"}
{"product_id": "B005M0KSIM", "context": "Will this work on a computer running windows 8?", "response": "yes, it even supports touch screen thru Steam"}
{"product_id": "B00HWMP0TU", "context": "does this version require me to load it via a cd drive or will it allow me to just download it on steam?", "response": "You have to use steam. Which is one reason I stopped playing."}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "I have it installed on two macs. Spore no longer works on either of them. I just gave up. They don't support it and I am tired of having to figure out workarounds for problems that could have been fixed years ago."}
{"product_id": "B00DBCAT3W", "context": "does this game have multiplayer mode?", "response": "Nope. My girlfriend wanted to play but she couldn't. I don't know about online."}
{"product_id": "B00H1FCUBY", "context": "Are these headphones compatible with Bluetooth 4.0 devices?", "response": "Yes, It works great with both my tablet and computer."}
{"product_id": "B000VTQ3LU", "context": "Do you need a PSMove controller in order to operate the PSEye camera itself?", "response": "Hi Karleen! The camera is stationary on its base. To my knowledge a PSMove controller is not needed. I just set it under my tv and operate it stationary from there. Hope that helps . . ."}
{"product_id": "B0050SVNP8", "context": "Is Spanish languages included?", "response": "We got the black version and no Spanish"}
{"product_id": "B005BLAJRC", "context": "Do we need a \"joystick\" type device or will the games work with just a mouse?", "response": "All you need is a mouse."}
{"product_id": "B00B1OK3TC", "context": "How good of quality?", "response": "The quality is very low and the software has many glitches it is not worth the buy"}
{"product_id": "B0050SYILE", "context": "Is it safe to order a used one or better to buy a new one?", "response": "My thought on this is you want to look at reveiws first. But if the used game is about the same price as a new game you are better to go with new. hope this helps."}
{"product_id": "B009AFLXQQ", "context": "How would compare this controller to the DualShock 3?", "response": "Its less sensitive than the Dualshock. It lasts longer than the dualshock and surprisingly it feels a bit comfortable than the dualshock. Theyre both great controllers but I can see the Wii U pro lasting a lot longer in quality."}
{"product_id": "B00FXOP1MU", "context": "Does this come with charger (meaning that I don't need to buy things other than this)?", "response": "Yes it does, the game is downloadable as well, which means when you connect to WiFi the box will give you a downloaded code for you to download from the Nintendo Store and will have it in a couple minutes."}
{"product_id": "B00BCEK2LA", "context": "Does this have adjustable weights? If not does it feel too heavy or too light in your opinion. Does this come with a warranty in case it breaks?", "response": "It doesn't have weights, but I find the weight just right.  I'm sure logitech has a warranty of some kind, but I've never had any problem with any of their products.  I'm very happy with this mouse."}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "for those of you that have pre ordered the item when it was 129.99 you can contact customer service and they will lower the price for you"}
{"product_id": "B00AJZNUUI", "context": "WIll I need to purchase any additional remotes so that more than one person can play at a time?", "response": "on some games yes others allow u 2 pass it once you have had your turn"}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "no idea. We don't use it. maybe advertising?"}
{"product_id": "B00EFFW0HC", "context": "I have a xbox 360 4GB will that hard drive be big enough to play this game??", "response": "Don't forget, Kaija, that you can also just buy a 32GB flash drive and install the game on that."}
{"product_id": "B000087H7T", "context": "does the save work?", "response": "If the game cartridges have a save feature. It should work. The system itself does not have a save feature. It's too old of a game system. Nintendo DSi and Nintendo 3DS has a small internal memory on the game system as well as a SD card slot. I have owned and still own all 3 systems."}
{"product_id": "B00DC7FWRE", "context": "Is this just the game or does this come with the stand, and a remote?", "response": "It came with a remote. No stand."}
{"product_id": "B004H7P0B6", "context": "Is this just one piece or is there a rubber attached to each piece that is removable?", "response": "The piece is all rubber is necessary to dismantle the controller to install (Is very easy, but you need a Tri-wing Screwdriver for Nintendo is very cheap and works in other nintendo machines).Replacement is perfect, if you don't say anything the people will not know if the original is or is this replacement part."}
{"product_id": "B0096L2SJ0", "context": "Can you use this as a gamepad for your PC or Mac as well?", "response": "Download ZeeMouse from http://www.bitbanksoftware.com/tinytools.html and it will let you map the buttons correctly. Works great!"}
{"product_id": "B00D96BO7K", "context": "Will they work on an xbox one?", "response": "Alex, you would also need to purchase an Xbox One headset adapter to make this headset work with the Xbox One. This is probably my favourite headset, it is really comfortable, looks cool and sounds great."}
{"product_id": "B0050SVNP8", "context": "This is the U.S. version of pokèmon right? Does it matter?", "response": "Please elaborate your question. Matter how so? I've been playing the US versions for over a decade with no problem"}
{"product_id": "B00919RM1Q", "context": "can this version be loaded on both my lap top and desk top?", "response": "Yes it can be played  on a laptop or desktop and after its installed CD is not needed to play"}
{"product_id": "B00009ECGK", "context": "Does this need a CD key?  Will I be ok if I buy a used copy?", "response": "This does use a cd key, so if you're buying a used copy, be sure it comes with it, however it would be safest to buy new as the program might check the cd key online and if it shows another computer is using the same key it won't work"}
{"product_id": "B00GO4PTR0", "context": "These memberships works for just one account? Or multiple accounts in the same console? Thanks", "response": "I'm pretty sure that it's one account per person but the account follows you from console to console. So you could use your account if you're signed in at a friends house and whatever you purchase will also show up on your home console as well."}
{"product_id": "B002YVD3KM", "context": "Good for GBA emulation?", "response": "Yep. Works just fine for GBA emulation too. I've also used it with some SNES emulation."}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "According to Gamestop, it has been pushed back until August 24th."}
{"product_id": "B00FE8WKMO", "context": "will this game work on the regular wii?", "response": "This version is for Wii U only but there is one that is for the Wii.  The Wii version doesn't use the meter.  http://www.amazon.com/gp/aw/d/B002BS47JE/ref=mp_s_a_1_2?qid=1409444199&sr;=8-2π=SY200_QL40"}
{"product_id": "B00656HLGO", "context": "Just to confirm, will this work with the Xbox 360 Arcade console?", "response": "yes, it will work on all xbox 360 consoles except the slim versions"}
{"product_id": "B009WI7V9E", "context": "Is the DLC on a separate disk or download via codes?", "response": "I believe it came on a separate disc"}
{"product_id": "B00FM5IY4W", "context": "will this play on the 360?", "response": "never. It is a xbox one game"}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "I bought the Blue Version at Best Buy - Insignia branded packaging (same exact case). My Borderlands 2 PS vita fits perfectly! Bring it in to a store and try before you buy!"}
{"product_id": "B000VBFWAG", "context": "Do you have to have this disc in the computer to play it", "response": "Yes you do. And you also need to have the windows Game Center on your computer. Which I learned the hard way."}
{"product_id": "B005Q1YA5O", "context": "In your opinion which expansion pack is better, the Pets or Supernatural. Not looking to buy both so would be helpful to get some opinions", "response": "It depends on persoonal taste I think. Both have cool gameplay features. Ask yourself if you prefer raising and breeding animals or being a supernatural creature.  Also with both packs you get the chance to find and own a unicorn."}
{"product_id": "B00EF1OGOG", "context": "When used to charge an Android (Nexus 5, in particular), does it show up as \"Charging (AC)\" or \"Charging (USB)\" in the Battery menu?", "response": "This unit DOES fast charge the Nexus 5, showing 'Charging (AC)'."}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "I have no idea since I run mine on Windows XP."}
{"product_id": "B002YVD3KM", "context": "Just received it.  Nestopia is recognizing it is plugged in, but there's no gaming response to any of the buttons.  What am I doing wrong?  Win7, hp", "response": "You have to go to Options --> and configure the controller/buttons"}
{"product_id": "B008TXMPJE", "context": "Why do i have to buy the first orginal sims 3 to be able to play sims 3 pets? also is sims 3 seasons a substitute for the sims 3(the first game)?", "response": "You have to have the base game in any Sims series to play any of the expansions. Seasons is an expansion so no it is not a substitute."}
{"product_id": "B008MI7MWQ", "context": "why wont it download to my computer", "response": "It may be the type of computer that Tammy is using. Some can't handle that type of game if there are of an older type. Just a thought. Good luck :)"}
{"product_id": "B00DRKJBC8", "context": "Is this the whole game or just a code for items?", "response": "this is code for the legal copy of the game. You will need to go download from Steam"}
{"product_id": "B002I096AA", "context": "Is the 3DS an American DS, or otherwise?  Thanks~", "response": "The one I bought was American."}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "No, only on the wii u."}
{"product_id": "B00BXONG7G", "context": "Played BF3 all the time, and never picked up BF4.  What's the best deal to get 'everything'?  Looks like $49 + $49 - looking for a better deal", "response": "i bought it at 34 dollars. and in origin is around that price wait until you get a best price"}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "voices are english by default but you can buy a $4.99 DLC for japanese voices. be aware that it's a 10gig download while the base game is about 15gigs on psn."}
{"product_id": "B00DRKJBC8", "context": "is this a game download or a streaming game? I have never bought a game from amazon before Just wondering", "response": "It is a game download. You have to have download steam and then you can download the game but it works great."}
{"product_id": "B00I5LMSE2", "context": "can you play this on a 3 DS XL", "response": "Yes, one of my son has a 3DS XL and has played this game on it."}
{"product_id": "B00CQ9L1Z6", "context": "does this device allow you to use cheats in a traditional sense? as in like the kind that modifies the raw code and memory address and stuff?", "response": "I just use it to change ivs,  natures,  and to shinyfi sometimes. Not sure if doing that modifies the raw code"}
{"product_id": "B00ECOBFA4", "context": "is there a free play mode", "response": "Yes there is you must complete the game first to unlock it."}
{"product_id": "B00F68LBE0", "context": "What's the wireless range on this controller?", "response": "Just now tested. Within 20 ft."}
{"product_id": "B00E6OLJ88", "context": "How fast is rapid fire", "response": "On the instructions it gives a list. And it should say in desc. But I think the max is 80 shots per second"}
{"product_id": "B008GEH8LQ", "context": "Can you watch videos on this?", "response": "Netflix is also available on the 3DS."}
{"product_id": "B00DC7G2W8", "context": "Can you use the Wii U gamepad? Or do you have to use a wheel?", "response": "Yes, you can use the Wii U's gamepad. Alternatively, you can also use the Wii U's regular pro controller, and the Wii's classic controller and Wii remote."}
{"product_id": "B0016897GS", "context": "I see in one of the product pictures, the cable covering is torn.  Is this just for illustration of the wiring, or will my cable be defective?", "response": "The cable sent to me was in perfect condition. It works great."}
{"product_id": "B002FY0CM0", "context": "Will this fit the Sega Genesis system model number MK-1631 9 pin?", "response": "This AV Cable is for the Sega Genesis #1. I believe you need the AV Cable for the Sega Genesis #2 & #3."}
{"product_id": "B005EQE0YM", "context": "Are these very comfortable?", "response": "they are if your room is cool (temp)."}
{"product_id": "B00B98HBTA", "context": "I want to know what language is this game .....", "response": "My son who plays this says it's in English."}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "Yes you can you can have up to 3 devices on a psn accou t"}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "The Season Pass includes all the downloadable content for the game, including the Left Behind campaign. It does not include the actual game."}
{"product_id": "B00886XQNQ", "context": "My PS3 has a DAC to my home theater for SurroundSound and an HDMI to my TV for normal sound at night. How do I pair these to get the SurroundSound", "response": "You need 1 optical digital from ps3 out to turtle b receiver in and 1 more optical digital to your home theater in ( configure your ps3 audio to optical digital audio or both)"}
{"product_id": "B001AATQ0Y", "context": "does this work with ps2 DDR pad?", "response": "John,i own a plain old  PS2& the HDE PS PS2 USB Dual Controller  doesn't work with it..So ,my answer  would be I don't think so"}
{"product_id": "B0049B2FP4", "context": "How do you fix the mod installer and download mods for windows 8.1?", "response": "Go to Emergency Planet then to downloads then emergency 3 then go to patches then click on 911 first responders registry fix should be the first one then download it then you can download la mod for your game. It worked for me hope this helps."}
{"product_id": "B00FENJVOE", "context": "can we have more than one account or username", "response": "Only if you buy multiple copies.  Blizzard's policy is one copy, one player.  Your wife/husband, girlfriend/boyfriend, children, and friends can not play your copy.  It is grounds for account termination."}
{"product_id": "B009WI7V9E", "context": "I'm wondering about sexual content because I have younger kids in the house.", "response": "There really has no sexual content. It does have alot of violence."}
{"product_id": "B00F27JE1C", "context": "can u play with friends", "response": "Yes. everything works just like the american version. Only diff is in home screen is O button is to confirm and X is to cancel but its no biggie"}
{"product_id": "B0053BCO00", "context": "Works in the 2ds?", "response": "Yes!  All 3ds games work great in the 2ds.  We have had no trouble."}
{"product_id": "B006JSY3MI", "context": "Can I add PC version to Steam?", "response": "Yes that's what I did. Whenever you install the disc, the game will add to your steam account."}
{"product_id": "B001AH8YSW", "context": "When I try to launch the game I get an message that says to insert the original game disc. That is what I believe I have done. I have Win 8& 4 discs ?", "response": "If I remember correctly, it needs an update before it will work - check Google for a better answer."}
{"product_id": "B00BGA9X9W", "context": "Why doesn't this come with a USB cable to charge it?", "response": "When you buy a PS4 a USB charger comes with it"}
{"product_id": "B00F27JN8Q", "context": "can you put ps vita cartridges in it?", "response": "Yes it has a slot for you to insert Vita cartridges. US cartridges will work on the imported vita tv as well."}
{"product_id": "B001FBHT34", "context": "are these headsets adjustable and suitable for an 8yr old for 360 xbox live", "response": "The headset is adjustable yes, and would probably fit a child's head, but the XBox uses a specific type of headset that plugs into the controller for XBox Live. You're best off searching directly for gaming headsets for the xbox 360. This headset is designed for use on a computer."}
{"product_id": "B007MJSZDQ", "context": "is it good and last along time", "response": "Yes it's a good product, and it has lasted quite a while for me."}
{"product_id": "B00A1Y2STQ", "context": "how many colors does it has?", "response": "It only has the one color you want, it does not change."}
{"product_id": "B005EQE0YM", "context": "If I buy this product itself do I need anything else to buy for it to work?", "response": "No but I have had a lot of problems with them."}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "That's how it's supposed to be. However if you feel like you might break it, I suggest you grab it by the center and have it as close to your body as possible. At first I was afraid it might break also, but gave it a try and it gave in. Which it was better designed though."}
{"product_id": "B00E6OLJ88", "context": "How fast is rapid fire", "response": "It is decent. A friend of mine has a faster trigger finger. But it's still good for people who don't have a tringer finger"}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "Only multiplayer. Must have Internet access to play sadly."}
{"product_id": "B00IYWV852", "context": "How do you get theThree Guest Passes with seven days of play time that come with this edition?", "response": "Carbine/NCSoft sends you an email with the codes after you create your account"}
{"product_id": "B00CERXJNW", "context": "This keyboard looks as if it sits in a try.  Can it be removed from this tray, sacrificing the media keys above the function keys?", "response": "It may seem like it but actually it's all just one piece of metal that goes from the numpad to the tap/caps/shift key. The macro keys are placed into a different piece, that one is made from a hard plastic (the same from the back of the keyboard)."}
{"product_id": "B0029LJIFG", "context": "if I make a purchase today, could you email code to me?", "response": "Not this kind of xlive gold, this one you will get the actual card, however they are other sellers from amazon that will do just that email you the access code."}
{"product_id": "B007TMFD7C", "context": "Does it come on a CD or how do I load if I don't have a CD Drive?", "response": "Ours came on CD; however , I think you can also download it"}
{"product_id": "B00EH5V1IO", "context": "Do the headphones have to plug into a usb port? or can the also plug into an iPhone? ps i don't know why we are called disappointed on here!", "response": "it should come with an extra cord that lets you attach it to your iphone. its a string that has a input,  and the chord to ur headset is inserted in this attachment. i recently used it to use it as a PS4 mic. so it is possible if you have that cord attachment"}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "Oh no it's a pretty tight squeeze with just the vita alone"}
{"product_id": "B0000A2TPE", "context": "Do you have to have a cd drive to play it?", "response": "My Zoo Tycoon is on a CD.   I put it in my computer to play the game.  My PC plays all discs.  I am using a windows 7."}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "These drives are for the X-Box 360 S. This is an INTERNAL hard drive that is installed through the bottom access. See how in this video link.http://www.youtube.com/watch?v=14zCYhJQDAA Tee video is not me nor do I have any connection with this video or person in the attached video."}
{"product_id": "B007MJSZDQ", "context": "dose it come with the battery packs?", "response": "yes, 2 of them."}
{"product_id": "B0050SYX8W", "context": "Can I play in online mode, if I buy a pre-owned game?", "response": "Im not 100% sure. But I dont see why you couldn't play pre-owned games online. My opinion would be that it shouldn't matter if its a new game or pre-owened they should all be able to play online."}
{"product_id": "B00JM3R6M6", "context": "If I'm an adult and I play this game, should I be publicly executed or just shunned from all society?", "response": "No this game is awesome! I just need to get money for a 2DS and the game now."}
{"product_id": "B007W8S2MG", "context": "Does the have a tutorial to explain the mechanics?", "response": "Yeah, it walks you through how to do everything in the beginning and it's really easy to get the hang of"}
{"product_id": "B00006B84X", "context": "left or right handed? I am looking for a joystick to buy and the others are either junk or for right handed people. Is this a joystick for lefties?", "response": "The default model is right hand only, but I have seen a left hand version.  I am not sure where it came from."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "Yes it does play on Windows 7"}
{"product_id": "B00DLDEKOK", "context": "Can this plug into the chatpad?", "response": "yes...only the wireless controllers...i don't recommend this item..They came in my home out right out the package broke...never got to use them"}
{"product_id": "B00HVBPRUO", "context": "Has anyone tried it on the xbox?", "response": "I've read it does work with Xbox One Controller and Adapter but you have to plug cord into adapter. If I buy these I can confirm."}
{"product_id": "B00F27JDUY", "context": "Does it vita could ship to Cambodia country?", "response": "Dear  Chumnith M.,Thank you for your question.We're afraid to inform you that the item is not availableto be shipped to Cambodia country.We're very sorry for your inconvenience.Sincerely,"}
{"product_id": "B003OZOAKY", "context": "Will Rome Gold Edition work with Windows 8 ?", "response": "I'm sorry but I don't know.  We have Windows 7 and it works.  If I remember I will check the game case to see if it says more than you can see online."}
{"product_id": "B002L6HJCI", "context": "Could you tell me if this comes with all expansions for Age of Empires 3?", "response": "Yes, it do.  It sho-lee do.  Gonna be some fun in yo house tonight!"}
{"product_id": "B008SBZD9G", "context": "Which is better the steam version or the FF14 client? (I mean the steam version uses the FF14 client anyways right?)", "response": "No choice between the two;;"}
{"product_id": "B002TLTBN0", "context": "is this controller wireless", "response": "It connects to the wii-mote like the nunchuck would. So it's wireless in a way."}
{"product_id": "B00FZ12F34", "context": "this Exclusive Amazon DISNEY INFINITY Infinite Bundle, with Sorcerer's Apprentice Mickey Figure is for PS3?", "response": "Yes that is what I bought it for"}
{"product_id": "B00E8RVP0U", "context": "Does this also play on a wii mini?", "response": "Yes, it plays in the Wii mini."}
{"product_id": "B0072HYRNK", "context": "Is this a pack of 3 controllers?", "response": "Good day,  This pack contains only ONE Move Controller. I do believe you may have gotten mixed-up with the number '3' after 'Play Station'. I hope that I was able to answer your question clearly. Do create a wonderful day, Regards, Lorne Sandy."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes it will, works on any Playstation 3. Playstation 3 games are region free! So you basically can play any game. I would recommend Gundam extreme vs full boost if you like since most North American players have moved to the latest version of the extreme vs line. =)"}
{"product_id": "B00E4MQODC", "context": "Does the usb receiver work with logitech keyboards? E.g., I am looking at a LT K750 and wondering whether either receiver will work for both devices.", "response": "I don't think the receiver will work for both, but that would definitely be worth a call or email to Logitech!"}
{"product_id": "B002B9XB0E", "context": "How long is the USB cable? I can't seem to find that on Amazon or Buffalo's site (my Japanese is pretty much nil).", "response": "The cord is 5 feet 6 inches, I used a tape measure."}
{"product_id": "B00AQ2BLI2", "context": "good for windows 8?", "response": "I have windows 8 and it runs perfectly for me."}
{"product_id": "B005BLAJ68", "context": "Can HOYLE Card Games 2007 be used on another pc in my home?", "response": "Yes  have added it to three different computers."}
{"product_id": "B004N7IIQ4", "context": "is the mix amp compatible with xbox one", "response": "yes it is are compatable with xbox one via the optical cable"}
{"product_id": "B008BT80O0", "context": "Is this the English (U.S.) version of the game or an import?", "response": "Yes, this is the English US version..."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "do not no, i used it for my wii u for games that needed the classic controller"}
{"product_id": "B00EZKNT5O", "context": "what am i doing wrong? my computer registers that this controller is present and what it specifically is, but is unresponsive in 2 different games...", "response": "it doesnt work with all games some you need to use xpadder"}
{"product_id": "B00DGZDFLW", "context": "Is it worth buying on PC if I already own it for PS3?", "response": "It depends...if you like eye candy then yes.  The game looks and runs amazing at 60fps.  The content is identical though"}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "Yes the xbox comes with hdmi cable"}
{"product_id": "B00CXI0BPG", "context": "Is this a smaller mouse or is it the same size as a regular mouse?", "response": "The M40 mouse is a full size mouse. It is not shrunken down in any way."}
{"product_id": "B004RMK4P8", "context": "hello, the code they send me to my mail? live outside the US, but my account is USA", "response": "yes they send the code to your e-mail and then you can redeem the credit in your usa account"}
{"product_id": "B009RXUNZI", "context": "will it work with xbox one", "response": "I think so, it works fine on my PS4 with no adapters or anything. If the Xbox One has a usb port it should work."}
{"product_id": "B002TLTBN0", "context": "is this controller wireless", "response": "It plugs into the Will Remote"}
{"product_id": "B005Q1YA5O", "context": "In your opinion which expansion pack is better, the Pets or Supernatural. Not looking to buy both so would be helpful to get some opinions", "response": "I never bought Supernatural but would agree that it depends on what you're looking for. I figured I'd prefer the pets to add another element of realism to the game. I knew I didn't really want every aspect of Supernatural in my game which is why I personally chose Pets over Supernatural."}
{"product_id": "B00HG0B8NA", "context": "is this the same freecell on my windows seven computer", "response": "I don't think so but really like software for price."}
{"product_id": "B00EFFW0HC", "context": "Does this come with the China Rising pack?", "response": "Not 100% sure..... but I think it does.  I remember seeing something like that on the package.  I bought it for my son and so I don't have it handy to check."}
{"product_id": "B004774724", "context": "If I bought the download, would I be able to install it on my PC and my laptop? Or would I have to buy two copies?", "response": "You can install it on both"}
{"product_id": "B00CH923NE", "context": "Is the dream world too cheesey? Or is it not?", "response": "No it's really great the game overall is an awesome game you won't be disappointed"}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "It doesn't work because they are configured differently. The region you assign your 3DS is the region it works in. From my understanding if you moved to another region, you would have to purchase another console. I know of many people who are angry about this. The same issues happen with DVDs."}
{"product_id": "B006LVZEN0", "context": "There doesn't seem to be an option to map mouse keys to launch software? The profile configuration only allows macros and pre-determined hotkeys.", "response": "Correct. You can't map software on the mouses keys and launch said software with said keys. The strike7  keyboard can that"}
{"product_id": "B000B9RI00", "context": "works for xbox one?", "response": "I don't know, I don't have that one, but a friend told me both will be on the same account, you can only have one on at a time, so I can only guess yes."}
{"product_id": "B00CMC6HCY", "context": "in the storymode do you HAVE TO DO THINGS  to move on in the story line", "response": "Yes you have to to be able to go on harder levels."}
{"product_id": "B002CZ7P04", "context": "I have a problem with the contoller.  When I am in the menu for pause/save, etc., the controller arrow floats and I can't control it.  Does anyone else have this problem?", "response": "No, I haven't had that happen...sorry!"}
{"product_id": "B007JM8ULS", "context": "what is the difference between this one and the one that cost $41 also made by generic?", "response": "I can't say the difference.  My experience has been excellent.  Opened the x-box.  Shoved it in and never had to think about it since.  My son is an avid gamer and even he hasn't made a dent in the space available.  Good luck"}
{"product_id": "B008SBZF2Q", "context": "Does this character work with WII U?", "response": "I think yes! If you  have the game disc and portal suit for WII U.  And the giants character can also be play in swam force but not the spyro's adventure."}
{"product_id": "B00FEDP968", "context": "Do these headphones have voice feedback to reduce yelling during loud games?", "response": "Yes. Right Click volume icon > volume control options > playback tab > select KAVE XTD Headset > properties > Levels tab > turn microphone up to 100"}
