{"product_id": "B0087OZ5FG", "context": "A)  Does software work with PS4.  (Lower Mic Volume normally)  B) How comforable are they?", "response": "Yeah it does. And yes, they're pretty comfortable, the sound is amazing. Best choice for sure."}
{"product_id": "B004HYIAPM", "context": "As a new player what should I know going into this game? Any recommendations or suggestions?", "response": "Nexus Mods has a lot of fun additions to Skyrim, including unofficial and comprehensive patches that fix a lot of the bugs. SkyUI, SKSE, FNIS and XP3 Skeleton come highly recommended."}
{"product_id": "B00D6PTMSW", "context": "Is there a left mode? I'm left-handed and have been itching to learn guitar but don't know how to go about it.", "response": "For this sinistral bass player, it was easy getting the settings set just the way I needed them. The initial setup was how I got it done, but there is the option in settings as well, which was pretty simple to find, too."}
{"product_id": "B00FM5IY0Q", "context": "Is this game exclusively for XBox One - or can it be played on an XBox?", "response": "It is Xbox One Exclusive only"}
{"product_id": "B00HGAWFJG", "context": "just got this today, was excited, but then connected it and to my surprise the lights on the stand won't come on even though the PS4 is turned on", "response": "You should just return, lights should turn on when your ps4 is ON and connected to the USB port."}
{"product_id": "B00BQWTGIS", "context": "My husband really likes this game.  Can someone please suggest a couple of other games that are similar?  I'm Christmas shopping.", "response": "Assassin's Creed and Skyrim are both excellent"}
{"product_id": "B00BI9MDSO", "context": "How far back does the case open? Can it only open to the degrees shown in the picture or does it extends further?", "response": "It opens about 235 degrees"}
{"product_id": "B005EOOT90", "context": "Is this also compatible with PC?", "response": "Most turtle beaches work with pc and consoles"}
{"product_id": "B00EZKNT18", "context": "How long is the cord?", "response": "This is the best wired controller. Don't waste your time and money getting anything slightly cheaper. i made that mistake."}
{"product_id": "B002JVX5V4", "context": "will it work on laptop windows 8", "response": "I have Windows 7, so can't answer this.  Sorry.  Couldn't hurt to try..."}
{"product_id": "B000NJBD90", "context": "Would it work for a Guitar Hero 2 controller for the PS3 Guitar Hero and Rock Band games?", "response": "I tried this product and it did not work for me."}
{"product_id": "B002I0J5CO", "context": "is it good for hearing the steps in black ops? please be honest", "response": "Yea! I used it on ghost, advance warfare, black ops 1 and 2. Footsteps are clear on all but advance warfare but that's a game issue not headset issue. It's a great headset especially if you're on a budget. Quite durable too. Had a few rage moments where I tossed it and it didn't break."}
{"product_id": "B00HEX8TA4", "context": "Can you change to any color without the dpi changing? Or is each color locked into a dpi preset? Thanks!", "response": "Yes you can your just going to have to navigate threw the included vs disk that let's you program the mouse"}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "I am sorry yes you get a first month free than after that you have to subscribe you if you you want to keep playing after the free first month is up"}
{"product_id": "B009AP23NI", "context": "Is this compatible with Wii games played on WiiU?", "response": "Yes, is the same controller.  totally compatible"}
{"product_id": "B00H72EMP8", "context": "Does anyone knows if it works with WiiU, nintendo 3ds,and PC? It's because I've seen one of this model Kunai(advertise of the company)saying that.", "response": "Yes it works, as long as you don't mind the long cord. It plugs directly into my ps4 control."}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "don't know doesnt work well wth win 7 great with vista"}
{"product_id": "B00J6DLPLK", "context": "Is this a disk, or just a code?", "response": "You can buy the physical disk version at a local video game retailer or download directly from PSN."}
{"product_id": "B00E1L786S", "context": "Anyone know if there's any issues using this with a PS4? I'm guessing probably not. It's just audio inputs, etc.", "response": "There are no issues I have a PS4, and it works great with it."}
{"product_id": "B00E447L8C", "context": "How do u guys apply to iPhone 5? It is a micro USB port!", "response": "I am using it on my iphone 5 and it works well.Just use the USB port of your iphone 4/5."}
{"product_id": "B004FS8LYK", "context": "This game is Spanish or subtitled in Spanish?", "response": "No, only in English."}
{"product_id": "B00D4WTO1M", "context": "why does it lag so much on multyplayer? its like the ps4 cant handle the memory requirements for the size of the map?", "response": "You mean online with other players or just multyplayer with you and a friend against each other because it works well both ways for me maybe your internet connection may be the problem I've had this game for 4 months now works fine hope this helps"}
{"product_id": "B004AM5RAW", "context": "Is the size/shape of this one the same as the Naga MMO?  I have that one and like it a lot.", "response": "Yes it is, but beware of the infamous double click Issue, green NAGA 2012 its the same design as its predecesors, the new naga 2013 its a little bit different and I dont know if the issue persists."}
{"product_id": "B0001BR9Q6", "context": "Will it plqy on Window 7?", "response": "I bet it does, I use it on Window 8.  I love the bridge game, wish Hoyle Card games would put one out for iPad."}
{"product_id": "B00GJSUXLS", "context": "Does this game still come with the code for unlocks when TPP comes out?  Does the One version?", "response": "It seems like if you bought a copy of Ground Zeroes for the next gen consoles (XB1, PS4), you could transfer over unlock codes. Linking an article with a more defined answer: http://www.metalgearinformer.com/?p=12825"}
{"product_id": "B0086UK7IQ", "context": "I often switch between a palm grip and a claw grip depending on what I'm doing. Is this mouse only suited for one style of grip preference or not?", "response": "It seems to be a bit more loving to a palm grip, but either will work"}
{"product_id": "B00BGA9V2Q", "context": "Does Diablo III on PS3 allow offline(Local) multiplay? In the other word, can 2 people play D3 on one PS3 at the same time?", "response": "Sure can! It's great. PS3 version is great. U do share the same screen though."}
{"product_id": "B00166N6SA", "context": "How large is the case itself that it comes in?", "response": "It comes in a little yellow package about the length of a 12 inch ruler and the width of a 8 inch ruler. It doesn't come in a box."}
{"product_id": "B00BGA9X9W", "context": "Can i play on my pc with this controller? Need a software?", "response": "It can be used to play on a PC but it does need special software.  Try this address for software- http://forums.pcsx2.net/Thread-DS4-To-XInput-Wrapper"}
{"product_id": "B0057S9SYY", "context": "Will these support chat via the xbox one headset adapter?", "response": "Yes, this headset will support the Xbox One headset adapter. If you are planing to purchase this headset, be sure that you purchase the Xbox One headset adapter. Also, this headset is a high rated one for the Xbox 360 as well."}
{"product_id": "B00D9EPI38", "context": "will the 320GB hard drives for the XBOX 360 slim fit in this model? are they the same?", "response": "What is the year and month of this version?"}
{"product_id": "B005THAX5Q", "context": "this game is the spanish ?", "response": "If you ever played a game intoxicated then you will get the same feeling when you play this game, minus the alcohol but with the same affect. So it won't matter if the game is in English or Espanol, because you won't care what they are saying, malo is malo."}
{"product_id": "B00CMQTVUA", "context": "Hi, Can I use this in India?", "response": "You can use this world wide. Internet speed and service will depend on your location."}
{"product_id": "B001DPZE84", "context": "Can you make your own missions?  Can you get unlimited fuel?", "response": "You can \"Free Fly\" from US airports.  I have not been able to ascertain if you can plan your own flight (from one airport to another)."}
{"product_id": "B00074TQFO", "context": "Do the pieces lay in the position that they fit together, so you don't have to rotate them. Does it have a back ground picture so you can tell if things are fitting together right.", "response": "yes to both questions.  I do not care for the background picture.  I do like the click when the piece is in proper place."}
{"product_id": "B00C71034I", "context": "The game comes in multilanguage? I want it in Spanish?? El juego viene en multilenguaje? lo quiero en español", "response": "It's possible to change the system's settings, I believe."}
{"product_id": "B00CMQTVK0", "context": "If I was to buy the used like new day one edition will I still be able to get the day one achievement?", "response": "The day one bonuses are just QR codes similar to the free 2 days of Xbox Live in most games. As long as those haven't been used then yes you can."}
{"product_id": "B002ST7AEU", "context": "Will they work with the Xbox 360 Quick Charge Kit (2 battery stand up charging base)?", "response": "Yes, I use mine and they charge fine but I yhink they take a little longer."}
{"product_id": "B004N7HSGU", "context": "Will the ASTRO A40 PC version sold on the Astro website work on the Xbox One using the MixAmp Pro?", "response": "yes but the sound quallity is about the same as with out"}
{"product_id": "B0081GA50U", "context": "Does this work for the PS Vita 1000 series?", "response": "Yes it does work"}
{"product_id": "B003NVMEVQ", "context": "does it change colors", "response": "Nope, it only comes with a blue LED."}
{"product_id": "B003981JQ4", "context": "Will a Nintendo DS fit in here??", "response": "I don't think so"}
{"product_id": "B00562O8U0", "context": "will these work with the viewsonic pjd5133? thanks!", "response": "Sorry don't know. They work on the Playstation 3 and on my Sharp Elite 70\"."}
{"product_id": "B009SJR28W", "context": "Are the keys noisy", "response": "They make a little noise but my son usually wears headphones so he doesn't notice it."}
{"product_id": "B00BMFIXKQ", "context": "it is for One player or multiplayer?", "response": "One player story mode, online multiplayer"}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "I think it only works on Steam if you buy a game code. Though, if you buy a disk, it should work with whatever program you have."}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "We couldn't install the game.   The product code provide with game didn't work.  Waiting on refund now.   I had to pay return postage."}
{"product_id": "B0098W4ZD4", "context": "Does this mouse have left,right and middle scroll buttons ?", "response": "Simply only middle mouse."}
{"product_id": "B006IR6NH8", "context": "How does this thing steer? does it attach to something or does it use an accelerometer? and will it work with most racing games?", "response": "It does not attach to anything. It uses an internal accelerometer kind of like a Wii remote. It has worked in every game I have tried it in. You have to manually map the controls but it works great."}
{"product_id": "B007VTVRFA", "context": "My 10 yr old wants to play this game, but he doesnt have an e-mail address... does he need one to play this game?", "response": "Yes, you need to have an origin account to be able to play this game which does require an E-Mail."}
{"product_id": "B00F27JGVA", "context": "Will this be recognized by Playstation TV? Sony says only 32.", "response": "I don't know about that , you could try , or use the 32gb"}
{"product_id": "B000TK99PS", "context": "What games are actually on this ? is there Gravity Tiles and Majong and Backgammon etc.????", "response": "Yes, those games are included."}
{"product_id": "B00DWXUYN0", "context": "is a product for the \"new 3ds xl\" ?, because the new 3ds xl it's bigger than a nomal 3ds xl", "response": "It fits all 3ds models including the new XL which I bought it for"}
{"product_id": "B00FKV8AK6", "context": "does it have fotus armor included???", "response": "No, sadly, it actually doesn't, the fotus armor was only included in the limited console edition"}
{"product_id": "B00FQFFPZO", "context": "Can you list the track locations -- other than the Daytona, Sonoma, Talladega?", "response": "It has every track on this years Sprint Cup Schedule."}
{"product_id": "B007JM8ULS", "context": "can i play destiny", "response": "Yes you can play destiny"}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "no it is just to make the game seem more appealing, good question though, all you need is a tv, hd is better"}
{"product_id": "B0050SYILE", "context": "I have two questions. 1: how much storage is required to play the game. 2: Would you get this for a person that is turning 11", "response": "Storage needed is 2 GB and for an 11 year old? I honestly wouldn't given to fact of how much violence and sexual content it contains."}
{"product_id": "B003S9WJ9A", "context": "Do you need 2 xbox's to transfer? I want to move my games from my 120G HD to a new 320G", "response": "No. The transfer cable powers the new hard drive while transferring."}
{"product_id": "B00BGAA29M", "context": "I have two dualshock 4 controllers. But I dont see an option in the game to play two player co-op. can you help me please?", "response": "I played two player with my girl friend. I think you just hit start on second control and the second player joins in as a silver looking knack. It's size and what not is dependant totally on any artifacts that player one acquires. If player one grows so does player two."}
{"product_id": "B007LQG9A6", "context": "is it compatable with pc games?", "response": "It is compatible with the games that are already configured for an XBOX controller layout. Pretty much every game that came out for both PC and XBOX should work just fine for using this controller on your PC. That's what I bought it for."}
{"product_id": "B004W1IX1G", "context": "does it work for the wii u", "response": "Yes it does. Just load up the virtual Wii menu, and it will show up in the \"Launch Disc Software\" area."}
{"product_id": "B005761E70", "context": "are the thumstick controls more presise then the original,for the original controller sticks are too loose.", "response": "Sorry Don't know I bought it for my Son"}
{"product_id": "B003XNU1JQ", "context": "Is there a way to save your progress when you get to different worlds?", "response": "No there is no way to save your progress"}
{"product_id": "B005YR308S", "context": "Does this game come brand new, factory-sealed in the plastic?", "response": "The copy I purchased was used so it didn't. If it says new it should."}
{"product_id": "B002B9FIUU", "context": "Does this work on Windows 8?", "response": "it should it reads in windows as a generic usb game controller. there are no drivers for this because windows built in drivers work for this."}
{"product_id": "B00B5GZORW", "context": "What is the name of the other bonus games?", "response": "There are 3. \"Girls with Secrets\", \"Judge Dee-The City God Case\", \"Night of the Opera\". Quite frankly, I was not impressed with any of the bonus games and couldn't get anywhere at all with the Judge Dee game."}
{"product_id": "B009UCGVZC", "context": "does ur set contain the cards?", "response": "yes, original packaging with cards"}
{"product_id": "B000H67DDY", "context": "Do the Rudder pedals control nose wheel steering?", "response": "Not only do the control NWS, they can also control differential braking"}
{"product_id": "B007TFOO6K", "context": "Can you change the cherry mx keys out? I'd rather have brown D:", "response": "The blue isn't bad. This keyboard is getting more difficult to find for a reasonable price, let alone find in a cherry brown, which I had sought as well."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "Absolutely Not! This game is rated M for mature appropriately. There is nothing kid-friendly at all."}
{"product_id": "B003VAM392", "context": "does it work on steam? and is there the deadzone problem?", "response": "It works on Steam."}
{"product_id": "B00CHGYUE2", "context": "Does this game come as disk media or is it a game case with an online download code inside?", "response": "Not sure about the one you are looking at but the one we ordered came as a disk that you put into your xbox."}
{"product_id": "B00H1FCUBE", "context": "I just got mine today and I tried to use it for ps3 and it says I need a pass key. do you no the pass key", "response": "It's probably 0000. I never needed to use a Pass Key but if it's asking for one I would thing that is it being that is usually the default number."}
{"product_id": "B001Q24UAM", "context": "What operating systems will it work on?", "response": "These game disks are glitchy garbage.  Tech support is almost non existant.  You will find that most of the games are defective and you cannot get help to fix the problem.  I returned 2 of these disks to Amazon.  Don't bother buying them............."}
{"product_id": "B00DC7O77A", "context": "Does this game have multiplayer mode?", "response": "Yes, and w the new characters, there are advantages, like special weapons. Its still difficult w two players and all the carefully timed, perfect jumps required to advance in the levels. It is challenging."}
{"product_id": "B00005NIMA", "context": "Is this a USB stick?", "response": "Yes , this is a USB  interface to  the computer. Usually there is a CD  for installation... but not necessary"}
{"product_id": "B00EPC3PY2", "context": "GameSeek has this game listed twice for 2 different prices. Can you tell me how they are different?", "response": "Are they both Pirate Warriors 2?   Because there is a 1 as well."}
{"product_id": "B00EPC3PY2", "context": "What language are the dialogues, subtitles, and the game menu?", "response": "It is in English.  If the title on the cover is in English the dialogues and subtitles are in English as well"}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "If there's no wireless adapter receiver, this *might* work for PC with drivers while plugged in / charging, but it certainly will not work wirelessly."}
{"product_id": "B004HYK8Y8", "context": "is it first person or third?", "response": "It is both. You can change perspective from your characters eyes, to floating behind and above your character."}
{"product_id": "B00FLLFJ68", "context": "Is there anywhere to get another dongle? I lost one and need two for my two controllers.", "response": "I'm not sure you could check amazon"}
{"product_id": "B00H8NS1K8", "context": "I have ATH-M50, is it okay to buy this or stay with M50? Thanks.", "response": "I'm pretty sure the headphones are exactly the same except that the ATH-ADG1's have a microphone whereas the M-50's don't. That being said though, the ADG1's are exceptional to game with, they are extremely comfortable and produce very high quality sound."}
{"product_id": "B008TXMPJE", "context": "I have the base game & dlc on disk with Origin. Will amazon dlc work with it? Steam ones do not, so I worry", "response": "If I understand your question, you're adking if you download it on amazon if it will be compatible with origin... so you have use origin to connect it witb your game if you need to download it in the future. I downloaded it tgen used the code to save it on origin."}
{"product_id": "B0050SVNP8", "context": "Is White 2 and Black 2 the same game? I'm confused because they have the exact same number of reviews and I don't know which to get my daughter.", "response": "At the core, they're both the same game. There are only minor differences here and there, such as what pokemon you can catch."}
{"product_id": "B00DC9SWWE", "context": "Is there an online game code that comes with the game? I ask because there are some great used game deals for TitanFall.  Thanks.", "response": "I believe it only came with a 2-day Xbox Live Gold Membership."}
{"product_id": "B00AR1LX9O", "context": "Will this work on mobile phone?", "response": "Yes you need a aux cord to plug in the head phone jack and the receiver needs be plug in in with USB power"}
{"product_id": "B00FRESQYG", "context": "is this a good one to start with? i know nothing about this game except it looks like something i can play with my son.", "response": "It 'a game for me, from the collection!"}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "It clicks as you pull it. It's really simple. The back piece just hugs the back of the tv. I checked it several times cause the design looks to simple to work but it does it's function well."}
{"product_id": "B0086UK7I6", "context": "What is the texture like on this mouse? Is it slick like Razer mice, or lightly textured like most other mice?", "response": "Just to clarify, the texture is part of the plastic and not a coating. So you don't have to worry about it peeling."}
{"product_id": "B00D3RBYM0", "context": "Does this game have multiplayer mode", "response": "The game itself is only multiplayer. You play in the world where you have online players, some are cops some are racers. Also there some AI that you can engage.  All this happens in a multiplayer world. Keep in mind no local split screen or local co-op."}
{"product_id": "B00DLRLDBO", "context": "does it work perfectly with xbox 360 controller do I have to do anything special and can I use it for a PS3 IPhone and PC??", "response": "Yes works fine with xbox360.  Dont know about iphone as I have an android phone"}
{"product_id": "B00GHTP7SS", "context": "How do I get the game to recognize and allow the use of a xbox 360 game controller?", "response": "Do you have the wireless adapter for the PC? It should recognize it once the drivers are installed."}
{"product_id": "B00562O8U0", "context": "would they work with the sony VPL-HW40ES", "response": "Confirmed.  They work with this projector."}
{"product_id": "B00F9RGFEY", "context": "I just want some clarification. Some customers are saying it works on Xbox One. The advertisement does not. So, is it compatible or not?", "response": "It won't work in the sense that with the Xbox one headset adapter, your Afterglow headset doesn't even have to be on. You can plug in the surround sound to the back of the Xbox and not use the adapter to get the full Dolby 5.1 effect, but you won't be able to chat."}
{"product_id": "B004AM5RAW", "context": "Does it get hot? With the way it's shaped it seems like it would get a little hot...", "response": "Not at all, Ive had mine for a while and it stays cool. its just a lil led in there so it doesnt get hot."}
{"product_id": "B0029M6VKA", "context": "Can you set an \"escape\" hot key that would disable the TrackIr input while it's held down, for use with fine aiming or menus?", "response": "There is a disable hot key \"F9\" for me. However, it is a toggle On/Off input, not a hold down input. I know that these features can be customized fairly easily in the Trackir software program. I highly recommend this product, especially for flight sims and combat sims such as Arma or Dayz etc."}
{"product_id": "B000HZFCT2", "context": "does it work with steam?", "response": "Yep. Works with games that use controllers like skyrim"}
{"product_id": "B00FB4BXGA", "context": "Is the red one actually fully red LED or is it blue LED? Because the picture shows blue LED.", "response": "as far as I know the red color is indicated by the mechanical keyboard switch not the LEDs. The keyboard is individually let with LEDs in ice blue color."}
{"product_id": "B00B76QR44", "context": "will this game work with windows eight?", "response": "I use Windows 8 64 bit and have have no issues running it."}
{"product_id": "B00DJYTGYU", "context": "How long is the wire?", "response": "From the console to the controller, it's almost exactly 10-foot(includes connectors at each end).  It will not function wirelessly despite the spam."}
{"product_id": "B0000CNUUP", "context": "Please advertise that this runs through the steam client. I expedited the shipping and basically paid 4 times for something i didnt want.", "response": "Works perfectly fine for me, through steam no less. Only run into problems when I mod it to oblivion but that's to be expected and is my own fault."}
{"product_id": "B003NVMEVQ", "context": "What is the difference between the mirror and the normal abyss?", "response": "The mirror is smoother and easier to clean. The normal abyss looks and feels better, but it will absorb sweat, so after a long period of using, it's not as good as b4"}
{"product_id": "B00CTKHXFO", "context": "If I buy this game today, will I be able to download the content or did the codes expire?", "response": "The only download is  mgs1 and vr missions and the voucher is still good and will be until at least 2015 if not later."}
{"product_id": "B0099OZR9W", "context": "When I put in this hdd, will my xbox 360 slim recognize it?", "response": "Mine ended up working fine, I just don't believe that it has the integrity of a real xbox one"}
{"product_id": "B000NJBD90", "context": "Can this be used to connect a PS2 controller to a PC?", "response": "Definitely! In fact, that's why I bought it, so I could game on my PC with a PS2 emulator."}
{"product_id": "B00030GSJY", "context": "What type of plug does this Joystick use?", "response": "No plug, just usb. The joystick connects to the throttle which connects to the computer via usb."}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "You have to give it a gentle shake ,  I only have to pick mine up and insert camel and that moment alone is enough to start  charge"}
{"product_id": "B00D7UHT0E", "context": "Just Dance Nintendo is Ok to use with regulat TV?", "response": "I have the Just Dance for WII."}
{"product_id": "B00G0OYHCW", "context": "What does this deluxe set come with besides the games? Does it include the charging station?", "response": "does it come with remote controle"}
{"product_id": "B00CX8VY4S", "context": "the game is digital download?", "response": "This is for the disk.  If you want the code, you can purchase it that way too. Watch Dogs [Online Game Code]  I hope that helps!"}
{"product_id": "B00E8RVP0U", "context": "can we watch this on a DVD player?", "response": "not that i know of , its for wii"}
{"product_id": "B00HN9LS48", "context": "Does the Kinect actually clip on and become secured to the unit or does this item just act as a wide table for it to sit on?", "response": "Yes it snaps on to it"}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "It works for Xbox one when you buy the Xbox one stereo headset adaptor. Cost about 25 at ganestop"}
{"product_id": "B001BZ2F56", "context": "Is this a digital download or a disk download?", "response": "Its a disk delivered to your home"}
{"product_id": "B00D6PTMB4", "context": "is it lead only or can it teach me bass aswell?", "response": "Lead and rhythm yes.  Not sure about bass as I don't play bass, so I just checked and the good news is YES.  Have fun"}
{"product_id": "B009RHEBWA", "context": "Is there a limit on how many people can file their tax using it?", "response": "I am not sure of the limit, I have used it for 5 people."}
{"product_id": "B000K9Q5NW", "context": "Flight Sim Seat Possibility? Is it possible to get a pair of the Playseats Gearshift Holder Mounts to put on both sides of the playseat and have a flight sim cockpit?", "response": "Thank you so much. :)"}
{"product_id": "B00EV7AYAO", "context": "Is it a mechanical keyboard?", "response": "No, but it look pretty awesome and fairly easy to setup."}
{"product_id": "B00CBNV7UQ", "context": "Is it 2 player", "response": "I would assume you can do split screen co-op as in the previous games, haven't tested it on 8 though. As far as I know though, there is no online play."}
{"product_id": "B00BU7WVG8", "context": "Does this game have cops in it that chase you?", "response": "yes but you cannot drift.  my grandson liked it except for the drifting."}
{"product_id": "B000FN7K2S", "context": "Does it work on The second newest Mac?", "response": "I couldn't get the game to work.....AT ALL!"}
{"product_id": "B00ECOBFA4", "context": "- Does this game have multiplayer mode?", "response": "My son says that up to 2 players can play."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "Hard to answer but overall excellent IMO.  I don't binge play for 20 hour segments, but I play for a few hours each night and it lasts a week or two."}
{"product_id": "B00BFOEY3Y", "context": "Dose this mouse have a \"middle click\", usually the action of pressing the mouse wheel down? The wheel has left/right, but dose it click down?", "response": "Yes, and it's just as audible as the left/right wheel clicks."}
{"product_id": "B001B5U80K", "context": "Is Torchlight made for any other game console, or just PC?", "response": "All games have the platforms they are designed for plainly visible on their covers. Some might say Mac and PC some just PC.  X-box and other console systems have their own unique platforms and manufacturers will specify those that will play another's platform in their instructions.The Torchlight game I purchased and is pictured here is for PC only."}
{"product_id": "B0050SXFKE", "context": "Can you play this game on a PS4? I am looking to buy a PS4 for my son but he wants Assassin's Creed 3 and it looks as if its only for PS3. Ty", "response": "At the moment, the PlayStation 4 will only play PS4 games. Unless Ubisoft Montreal decides to make a PS4 version of this game, which is unlikely being that they are currently working on the production of newer Assassin's Creed titles, this game will only be playable on the PlayStation 3."}
{"product_id": "B00EEMLPR2", "context": "i wonder if the season pass got expired and other DLC ?", "response": "i just got this and tried to activate the season pass on 1/5/2015.  It says the code is invalid.  YMMV.  Dealing with Activision seems to be a hassle since you have to catch them during the day, 11am to 8pm PST, which might not be easy to do depending on your work schedule."}
{"product_id": "B00BMFIXZG", "context": "i just got this for my windows 8 toshiba and it is lagging so bad that i cant even get through the tutorial. how can i fix it?", "response": "Unfortunately,  whit out knowing many more details about your system, CPU, graphics card installed,  RAM,  I can only recommend turning down the graphics in the game to improve your performance."}
{"product_id": "B003O6N64Y", "context": "Will these work with PS4?", "response": "No not worth it."}
{"product_id": "B00D6PTMB4", "context": "is it lead only or can it teach me bass aswell?", "response": "It does have bass."}
{"product_id": "B00DBRM3G8", "context": "what difficulty mode is best to play on?", "response": "I don't know yet. I only play the carreer mode (offline)"}
{"product_id": "B0095P5K8I", "context": "is this mouse official e-blue or is it a cheap rip-off?", "response": "It looks like the real deal, it's been working fine since I got it a few months ago."}
{"product_id": "B002YVD3KM", "context": "Will this make me have to remap my emulator's input options because the controller uses joystick buttons, or does it activate keys on the keyboard?", "response": "You will be able to reset your button on the controller instead of the keyboard. i return this one because the buttons stays stock and get the SNES buffalo that feels a lot better"}
{"product_id": "B00DC7FWRE", "context": "does this game have bowling?", "response": "Whats region of this game?Disk playable on Europa consoles (Russia)?"}
{"product_id": "B0086UK7IQ", "context": "Is this mouse ok for smaller hands? Mine are, and though it's hard to tell from the photos, it looks rather large...", "response": "Like most other Logitech mice, it is big enough for it to be literally painful for me to use. Logitech products hold up much better than Razor ones, but if you have small hands and are looking for a mouse with this functionality, the Razer Naga is still probably your better bet."}
{"product_id": "B000OYMYZQ", "context": "Will this arrive in an original Microsoft Xbox package or wrapped up in bubble wrap? Also what is the mAh rating on the battery?", "response": "it will arrive in the official Microsoft Xbox package"}
{"product_id": "B0050SYK44", "context": "what is the best person to use in the borderlands 2 game?", "response": "That would be Salvador.Hope this helps"}
{"product_id": "B001KMRN0M", "context": "does this plug into ps3 console?", "response": "Yes, the PSP will plug into a PS3. It uses the same mini-usb cable the PS3 controllers use. There is not a whole lot you can do with it other than transferring games, however remote play is still possible with a select list of supported games."}
{"product_id": "B00B1MXGDO", "context": "Is this work for windows 8?", "response": "Yes it does work with windows 8"}
{"product_id": "B0086UK7I6", "context": "Can you use fingertip or claw grip with this mouse?", "response": "I use claw grip but you may find that you accidentally press the third finger key when moving the mouse to the left since you don't have much grip on the mouse with claw grip."}
{"product_id": "B009LGO88E", "context": "good I want to know because it says console not included in case it is not a nintendo 3ds xl ??", "response": "The circle pad pro is compatible with the Nintendo 3DS XL, also known as 3DS LL. 3DS system is not included with the circle pad pro"}
{"product_id": "B0095D1CM8", "context": "it stops working for no reason. Where I can fix it?", "response": "Try RMA through MadCatz, but they are very strict on their warranty/support. Don't be surprised if you get turned away (I did)."}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "And still work perfectly"}
{"product_id": "B004S5PBM0", "context": "this game include the cable? D:", "response": "Yes, if you buy the game with the cable. You can also buy the game without the cable."}
{"product_id": "B005QUQP80", "context": "Does it have extra USB port?", "response": "It has one USB port on the keyboard itself; also it takes two USB ports for the keyboard itself."}
{"product_id": "B00EF1OGOG", "context": "Will it fit and charge at old AT&T flip phone?", "response": "if its USB YEap!!"}
{"product_id": "B0079V29EI", "context": "Yes, I have the original vita model.  If I have a Hori skin protector attached, will it still fit on the grip?  Thanks!", "response": "No, I actually had the same Hori protector attached before I bought the Nyko grip and it doesn't fit unless you take the Hori off.  Sorry."}
{"product_id": "B005F1ZUU4", "context": "is the one that can work with the Xbox One as well??", "response": "I could not get it to work with any of my products. Sorry"}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "Yes. I happen to have a copy of Chrono Trigger (North American version), and it plays fine on the 3DS (again North American version). The graphics will not be in 3D, but everything else works as usual."}
{"product_id": "B00ECOAX34", "context": "Does it have an explorable world?  Can you be Wyldstyle?", "response": "Yes and yes. It follows the formula of the other Lego video games, but I personally prefer this one among the rest. :P"}
{"product_id": "B007JDMPOK", "context": "If I already have Tera on my laptop, can I use the code to get the goodies, and use the disk to install on another PC?", "response": "yep you can enter the codes on your account"}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "yes  i have 8.1"}
{"product_id": "B00B70WKUK", "context": "So is this like a steam key? Or a physical disc?", "response": "You get a disc"}
{"product_id": "B00DC9T2J6", "context": "My son really wants this game but M rating isn't going to fly with Mom. Is there a way to turn off blood / gore for PC version?", "response": "To my knowledge, no there is not a \"on/off\" button. But there is not really any hardcore blood and guts. A quick shot of red mist when a player is run over by a titan or blown up by one of the titan cannons."}
{"product_id": "B00GPH7Y8S", "context": "I see some reviewers complain that the game does not work with Windows 7.  I have Win 7 32 bit version.  Will it work?", "response": "I have only had time to run the demo, but that worked fine."}
{"product_id": "B000AOJ7FK", "context": "Does it come in case or download from here", "response": "I bought for my nephew. He already had this. I cancelled the order. I did not get the game."}
{"product_id": "B002I0K3PM", "context": "Does it support off-tv play, meaning can you play with only the Gamepad and not the tv screen?", "response": "Sadly, no,=.  This feature is not available in Lego City Undercover. But I really liked the gamepad implementation within the game."}
{"product_id": "B00006B84X", "context": "where can I download an operating manual", "response": "I've never needed an operating manual, per se, since the stick itself is pretty self-explanatory. But maybe you are looking for information about how to program the stick, or profiles for particular games? If so, go to http://www.ch-hangar.com/forum/ to find a number of forums with plenty of help, including a \"Dummies\" guide under the downloads section."}
{"product_id": "B001GIUWX0", "context": "i have a wii system does this game work with both wii and nintendo systems", "response": "Just on your wii system"}
{"product_id": "B00D78Q4UM", "context": "Is the palm rest removeable?", "response": "It is removable because I used it without the palm rest."}
{"product_id": "B001BYMZ5W", "context": "Do these headphones offer sidetone? That is, can you hear your own voice through the mic?", "response": "You can always set that option through playback devices in Windows. Just right click on the mic device in playback and choose listen to."}
{"product_id": "B004W1IX1G", "context": "is Wii motion required?", "response": "Yes. Each controller needs one-I believe."}
{"product_id": "B00005B8G1", "context": "what is the difference between  the gba and the gba sp ?", "response": "The GBA SP is designed more like the old Game Boy Color, but it folds in the middle, making it more compact."}
{"product_id": "B00HFZ5KCG", "context": "Is this unit region-specific?", "response": "Nope, the PS Vita is region free! If you decide to buy import games, you just have to use a seperate memory card; one per region."}
{"product_id": "B00C2B355W", "context": "My son plays games on his MacBook Air.  Are they compatible with a MacBook?", "response": "I am sure it is compatible with MacBook or any laptop. But I wouldn't know for sure because mine broke in less than 3 months, before I could use it on other devices."}
{"product_id": "B002ST7AEU", "context": "How many batteries is included? 1 or 2?", "response": "It comes with only one battery."}
{"product_id": "B00475AYUA", "context": "If we get a download code, where do we download it?  Don't want to use steam if possible?", "response": "NP. DL is straight to your HD"}
{"product_id": "B00A8HIGSS", "context": "What does it mean by \"DLC valid till 2015,march 31\"? Does this game have DLC?", "response": "No Idea. I bought it just so I could have a physical copy. I've never opened it."}
{"product_id": "B00H1FCUBY", "context": "Do these headphones have that typical annoying flashing blue light!?", "response": "Check my picture http://www.amazon.com/gp/customer-media/product-gallery/B00H1FCUBY/ref=cm_cr_dp_cust_img_see_all_txt. It's a recessed light and not very visible because it points down. Also like the other answer said it is quiet dim. I guess if you were in a low light situation and pointed it at someone they would be bothered bothered by it."}
{"product_id": "B00BKF5IXS", "context": "Does this bundle have everything needed to play regular ps 3 games. Not just move games. Or do I need another console?", "response": "this bundle comes with everything you need to play your games . the move is just an extra bonus ."}
{"product_id": "B005EOOT90", "context": "if u buy the headset do u need to get an adapter or something im not sure", "response": "If you have a first or second gen 360 and wanting to use hdmi cables (if your wanting to hear the gameplay through the headphones), than yes. If no hdmi than it just plugs in with your av cords...... scratch all that, no you don't need adapter cables unless you actually do."}
{"product_id": "B0085P7U0U", "context": "what games are included?", "response": "These are included: Bridge, Canasta, Crazy Eights, Cribbage, Euchre, Gin, Go Fish, Hearts, Memory Match, Old Maid, Pinochle, Pitch, Poker, Rummy 500, Skat, Solitaire (40+ variations), Spades, Spite & Malice, Tuxedo, and War."}
{"product_id": "B00E369SDM", "context": "does it come with wireless controlars", "response": "Yes it does 1 wireless remote"}
{"product_id": "B00F2ENJY8", "context": "Can you do 2 players on this console? And How?", "response": "Purchase an additional controller and nunchuck. It may be helpful to purchase 2 steering wheels for the Mario kart game as well. I would make sure the controller and nunchuck are manufactured by Wii."}
{"product_id": "B00EZPCWWA", "context": "Can photos taken with the 2DS be downloaded to a computer?", "response": "I just loaded them to Facebook from my 2DS, then downloaded them to my computer. Since it uses a Sim Card I would assume you could put it in the Sim card slot on your computer, I would also think you could take the Sim card to a photo kiosk and print them out. Honestly I haven't tried though."}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yes it can fit a whole 3DS XL, 2 extra games, in-ear headphones and an AC adapter. In my opinion its a great buy."}
{"product_id": "B00HGAWFJG", "context": "Can you turn the light off? Or, does it turn off while in stand-by mode?", "response": "You cannot manually turn the light off on the stand itself. The light will stay lit in stand by mode, so you have to either unplug the USB cable OR turn off USB charging on the PS4 itself. Hope that helps!Jeff :-)"}
{"product_id": "B00F27JDY0", "context": "I've heard the x and o button are backwards, is that true and then is it possible to change it and have x as enter and o as back?", "response": "Japanese imported Vitas do have O for confirm and X for back. You can't change that. But it's only for the main menu! If you're buying Western games, it isn't like that.I've gotten kind of used to it since the games still have O for back and X for confirm."}
{"product_id": "B000K9Q5NW", "context": "Flight Sim Seat Possibility? Is it possible to get a pair of the Playseats Gearshift Holder Mounts to put on both sides of the playseat and have a flight sim cockpit?", "response": "It looks like the user photos have been removed. There isnt really anything for me to sell, its just a $10 modification to the Gear Shift Holder which you can order thru amazon. Send me your email and I can send you some pics."}
{"product_id": "B000PT18OS", "context": "Is this is 100-240v. Is this works for Xbox 360 pro.", "response": "I'm not sure, this one works on my old xbox360 which is not the newer slim type."}
{"product_id": "B000PS1TG6", "context": "Has anyone tried this on PC with success?", "response": "Worked just fine with PCSX2 on my desk top."}
{"product_id": "B00GY4OAIE", "context": "Why did this product come in a paper sleave instead of the protective plastic blue ray case?", "response": "My LEGO Hobbit came in a plastic blu-ray case."}
{"product_id": "B00G6YJ60E", "context": "I am a real novice.  What is a steam account?", "response": "Steam is a video game download service. Free to join but it allows you to purchase video games for download."}
{"product_id": "B005764CWO", "context": "What kind of plug does this have? I'm looking for s USB controller.", "response": "It has USB. But the controller is not good, the sticks were not accurate and lagged. I have used it once."}
{"product_id": "B005DKZSVS", "context": "I bought one but the software can not run correctly. It doesnt work now. Where can I get help? I have visited the website of mad catz and ambx", "response": "hi...  can u explain it clearly . do u have problem installing d drives ????  /  or it doesnt work properly with the VLC /Games ext ?????/"}
{"product_id": "B00FBV6V56", "context": "I'm not experienced with refurbished products, will this have the same lifespan and quality as a new unit? I know ASTRO quality checks them the same.", "response": "You get the same 1 year warranty. Go for it, I did, and I certainly don't regret it."}
{"product_id": "B000TKH6H6", "context": "does it play on mac osx10.6.8?", "response": "Don't know - I have windows 7 and it works"}
