{"product_id": "B0015PHMFU", "context": "does this work with mame?", "response": "I have bought this to use in MAME and off the shelf doesn't work with MAME.You can quickly configure it though to make it work with MAME.The real problem with that approach is that diagonal moves are really hard to configure it you manage at all."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "You can write it down and text it to them but your account is private. there are no links to it."}
{"product_id": "B00HS5FETM", "context": "I have px3. I hooked it up where my game in sound on the transmitter is connected to my headphone Jack on TV. why do I need this cable??", "response": "I thought you only needed it for ps4 to go from the controller to the headset for voice chat I didn't think you need it for ps3 I could be wrong tho"}
{"product_id": "B0065NP6NC", "context": "Can you transfer your progress on the original fallout new vegas game to this new game?", "response": "Yes you can still transfer"}
{"product_id": "B0050SXFKE", "context": "Does this game come with  the greatest hits box (red) or the normal one?", "response": "It comes in the normal box"}
{"product_id": "B00CD1FC6G", "context": "Does this keyboard have the ability to toggle the Windows Key on and off?", "response": "Yes, there is a windows lock key that will disable the windows key."}
{"product_id": "B009JZ04BC", "context": "Does it work with windows 8?", "response": "I will let you know tonight. My laptop is running windows 8"}
{"product_id": "B00FM5IY38", "context": "Is there any sexual content or obsene language in this game.", "response": "No not at all. Its just a little gorey from time to time when u perform a special attack. Remember its very repetitive with the missions"}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "Hmm Good question!  I'll try it and get back with you Chris."}
{"product_id": "B00A378L10", "context": "Can the keycaps on this keyboard be replaced with other keycaps?", "response": "It comes with a key remover.  I would think so."}
{"product_id": "B00B312UDU", "context": "Do the side buttons (page up/page down) work on mac?  My keyboard doesn't have page up/down keys?", "response": "I don't know but I think you can configure them to."}
{"product_id": "B002I090AG", "context": "is it region locked  if it is which region America  / Europe / Australia", "response": "The one I bought was for the American region."}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "so do you need the disk to be able to use the receiver because my computer doesn't have a slot for CD's"}
{"product_id": "B00DCBDNW6", "context": "Monthly Fee???!!! u mean besides the PlayStation Plus Subscription and the Game Disk's actual price (37.58$) there is still a monthly fee?", "response": "Yes. This type of game isn't for everybody. In return for the fee they are going to constantly add new content, patches to make the game run smooth and just all around make sure we always have something to do in the game. If you play it alot It's worth it. If not, it might not be for you."}
{"product_id": "B003EUPCZG", "context": "is it good for left handers", "response": "No, the way the mouse is designed it would be very uncomfortable. I believe there is a left handed edition though."}
{"product_id": "B00CXCCB64", "context": "If I Downloaded all the expansions for XBox 360 will they transfer over to XBox One? Do I have to repurchase all those downloads again or buy premium?", "response": "you will not have to repurchase the map packs but if you bought shortcut kits they don't transfer over"}
{"product_id": "B00D6PTMSW", "context": "Do I need to have a hard drive installed on my Xbox 360 to run this game?  I have a version of the Xbox without the hard drive.", "response": "If your cloud has space then a hard drive would not be needed. I so far have only saved progress so that would be handled by the cloud system. If you do not wish to get a hard drive and want a physical copy of the files then saving to a flash drive inserted into the console is possible."}
{"product_id": "B005VO5ZVY", "context": "does this cover fit the 3dsxl", "response": "it fits the 3ds, not the xl model."}
{"product_id": "B00FXOP1MU", "context": "Does this come with charger (meaning that I don't need to buy things other than this)?", "response": "If you buy this new, It will come with a charger, stylus (I think an additional one) and voucher for game download.  Plus AR cards"}
{"product_id": "B00BZOBE78", "context": "Does the pc dvd work with a mac???", "response": "I never tried it. Let me check this evening if I have time and I will let you know. Once you install it on Windows I believe Steam will allow the content to be accessed from any where you log on."}
{"product_id": "B00004VUFG", "context": "can you buy games for children to play with this", "response": "If they like racing games, then sure."}
{"product_id": "B0090ECASW", "context": "I saw in a video that someone had a different logo next to the keyboard instead of the red Mad Catz one. Is it possible to replace the Mad Catz one?", "response": "Yes but you will void the warranty."}
{"product_id": "B001UIG6M2", "context": "is this for European consoles or US consoles?", "response": "The machines I have used it on were all American PS2's."}
{"product_id": "B00HGAWFJG", "context": "just got this today, was excited, but then connected it and to my surprise the lights on the stand won't come on even though the PS4 is turned on", "response": "Did you connect it to one of your PS4 USB ports?"}
{"product_id": "B000B6MLPU", "context": "I have the new xbox model. It's called the Xbox E . With this model it only has a hdmi port. The picture makes i look like it will fit. Will it work?", "response": "No it won't, might want to try looking for hdmi to Av aadapter if u have a tv that does not have an hdmi port"}
{"product_id": "B00DLRLDBO", "context": "Do you need any extra cords or items to use with xbox 360", "response": "The items is use with the 360 its universal so it can be use on pc ps3 n xbox"}
{"product_id": "B00DC7G0GG", "context": "Do you have to use the gamepad if you are playing single player?", "response": "Yes, I would suggest you use the gamepad because its more fun interacting with Super Mario 3D. However, there is the option of not using the gamepad so the chose is up to you. Thanks!!"}
{"product_id": "B00EFFW0HC", "context": "I have a xbox 360 4GB will that hard drive be big enough to play this game??", "response": "No, It takes a separate hard drive to play Battlefield 4."}
{"product_id": "B002DUCF8A", "context": "I have a Cessna trim wheel for pitch control -- will the trim wheel on this panel conflict with its operation?  And if so, what's the recommended workaround? Thanks!", "response": "I use the yoke \"electric trim\" toggle for trim, I get a better feel for trimming the aircraft. It might be that its just my personal preference. I don't have a conflict on my setup."}
{"product_id": "B000J18SR2", "context": "Do any of the Age of Empires III have the Alamo battle?  Thank you.", "response": "I beleive there might be an expansion pack or a MOD but NO the normal game doesnt have the ALAMO battle. Sorry!"}
{"product_id": "B000B78F72", "context": "Does this cd have the ORIGINAL CLASSIC SOLITAIRE????    I already purchased a cd that had 100's but did NOT have the classic game I wanted.....", "response": "yes.  I think so."}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "got the game today(3-30-2015) the code \"Works\" in that after i entered it i was able to download Festival of Blood, and the inFamous 2 DLC's for free. it said there was an error after i entered the code but i just searched the DLC and done."}
{"product_id": "B006JKARP8", "context": "Will this work with the new vita to be released on may 6th?", "response": "Will not work with the new Vita. The charger requires the use of the cables that came with the Vitaand the plug ins are not compatible."}
{"product_id": "B0095P5K8I", "context": "Does this feel exactly like the blue e-blue cobra? Same size, weight, etc?", "response": "Yes, its really light"}
{"product_id": "B006W41X1S", "context": "Can I just play my games offline and hear game sound on headphones or do I need to play online?", "response": "it does not matter you can play however you would like their hopes up sound wise through your television I'm not your Xbox Internet"}
{"product_id": "B000PT18OS", "context": "Is this ac to dc power converter? Curious because I know how to hook a car amp up to one but it must be dc", "response": "Thought this was a part for the Xbox a gaming system but it doesn't work at all"}
{"product_id": "B00GD962OA", "context": "how many GB IT HAS??", "response": "The system has 8."}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "Sorry, I purchased this as a gift.  I don't have an answer to your question."}
{"product_id": "B003BKWEHS", "context": "does it work on window 7?", "response": "I have Windows 7 and it works for me."}
{"product_id": "B00CJ7IUI6", "context": "Does it require internet?", "response": "No. You can play offline with no problem"}
{"product_id": "B00J128FPA", "context": "do you need to pay any fees to play online?", "response": "Yes it's $15 a month. The game new comes with a 30 day subscription. You can pay online or buy game time cards at the store. You do not need PlayStation plus to play this game online."}
{"product_id": "B00GHTP7SS", "context": "Does this game have multiplayer mode?", "response": "Yes. It has local and online multiplayer for 2 players. Online also lets more than 2 people join a game together, but only two people will fight at one time. All extras basically line up and spectate until it's their turn."}
{"product_id": "B004XGN8W4", "context": "does it need to be plugged into an outlet to work", "response": "yes it needs two outlet one for the screen an one for your game system"}
{"product_id": "B000H683YC", "context": "Pioneer for Xbox 360 - Is it HDMI compatible? Does anyone know if the system is HDMI compatible?", "response": "Thanks for the explanation."}
{"product_id": "B000VBFWAG", "context": "Do you have to have this disc in the computer to play it", "response": "yes the disc is required to play the game at all times."}
{"product_id": "B00519C7CE", "context": "Can multiple players play this without being online?", "response": "2 players can play using the same xbox not more that that"}
{"product_id": "B00CWFUHT0", "context": "does it come with its original box?", "response": "no it did not but it did come well protected and clean"}
{"product_id": "B000SOYG8U", "context": "i was install the game in my pc but the system require the eaw dvd, so i cant play the game, please help me", "response": "You can also download it off Steam. Steam is a free download. Make a free Steam account, download Steam, and buy the game"}
{"product_id": "B008GEH9HO", "context": "Does This Come With A Charger?", "response": "Does this come with charger?"}
{"product_id": "B0099OZR9W", "context": "When I transfer content, does it mess up my game saves and data?", "response": "Not at all. It's basically a 60gb flash drive for your xbox. You just go through the content on your console and move it to the hard drive. It's really quite simple and does not do anything to your content."}
{"product_id": "B00BGAA0SU", "context": "Is this game 3rd person only?", "response": "It is only a 3rd person POV game.  Don't let that detract you from getting it if that is a deal breaker for you.  It is truly a fantastic experience and one of the best looking games on Next Gen so far."}
{"product_id": "B00A1Y2STQ", "context": "How long is the usb cable?", "response": "It's 6 feet with a really nice usb, I loved it and you will too :)"}
{"product_id": "B006JKARP8", "context": "So I realized that this is an european model, so can I still charge it using my american vita ac adapter? or do I need to get a converter?", "response": "It works just fine with US chargers. The only ports on it are a USB and a Vita Proprietary port."}
{"product_id": "B001ELWMHI", "context": "Can you buy games for this model today?", "response": "Yeah you can you can buy some on amazon and other places lukie is also a good place for old games  thats were i get all my old games"}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "I use it for a FPS game, Tribes Ascend, works great and switches weapons like a dream..  :)  Yes, It's clicky."}
{"product_id": "B008SBZD9G", "context": "Can I use a Xbox 360 game controller for the PC version?", "response": "I really don't know since the game never worked."}
{"product_id": "B004RMK57U", "context": "I´m from Vzla, to activate the code in my ps4 I will need an american credit card code to use it?My PSN account is american, I have not US credit card", "response": "Not, you dont need an american credit card. Buy it and actívate it."}
{"product_id": "B0076DO5A0", "context": "Do I have to have Steam to play this game?", "response": "You do, yes. I hated the whole Steam concept in the beginning but I've come to accept it. If you buy games on sale at Steam it's a good deal. You just can't loan or re-sell what you've bought."}
{"product_id": "B005M0KSIM", "context": "I'm worried about disk space. Does it make sense to buy the physical copy, or does all the required software (steam, directx, etc) dismiss this idea?", "response": "The minimum and recommended system requirements both show Hard Disk Space as 8 GB or more. If your computer meets the recommended system requirements listed in the Product Description, you shouldn't have any issues with the physical copy."}
{"product_id": "B00HWMP0TU", "context": "I understand that I need an internet connection to download the game. Can I play the game offline once downloaded on my computer?", "response": "yes as long as you are by yourself and don't need to update"}
{"product_id": "B000B6MLSM", "context": "This is the large remote control like the picture or the small version ?", "response": "It is 8.25\" long X 1\" thick X 1.75 to 2\" wide at the tip. Just like the picture."}
{"product_id": "B00D6PTMHI", "context": "Does the cable plug into USB? My laptop does not have audio-in", "response": "You need the original cable to connect the USB."}
{"product_id": "B00AJILG1K", "context": "What do you people mean by this keyboard doesnt have a caps lock key? i see this in some of the lower ratings like 4/5 stars.... care to explain?", "response": "It does have caps lock you have to turn on caps lock in the roccat keyboard software. It is very easy to use"}
{"product_id": "B00BQZ5EWW", "context": "how do i patch the pc version?", "response": "Look into piratebay or isohunt also because the game is newer you might have to wait for the patch to come out on pc rather than steam"}
{"product_id": "B00EV4O7B4", "context": "Does this come with X & Y games as well as the 3DS?", "response": "No, it's just the 3ds console"}
{"product_id": "B004EJ0L8E", "context": "What do you put the headset into USB or audio jack?", "response": "Audio jack. it confused me at first but there an audio jack and a microphone jack that you plug the headset into"}
{"product_id": "B00EM5UFF4", "context": "I have Xbox Gold. My kids have accounts on the Xbox but never played live. Is it possible for my family members to play XBL since I have gold?", "response": "You just need to give them your user name and password.  But you cannot have 2 people logged in to the same account at the same time."}
{"product_id": "B00519C7CE", "context": "Why is this game rated m?", "response": "M means mature content Violence's and graphic language this game has both"}
{"product_id": "B00FWWY1V0", "context": "I bought these to use with my newly purchased wired 360 controller, but these won't even fit.  Can I do anything aside from getting a refund?", "response": "They are a tight fit on my controller, but I did get them to fit. I have a Microsoft brand wired controller, along with 4 wireless controllers and they fit them all."}
{"product_id": "B009AP23NI", "context": "Does this take AA batteries?", "response": "Nope. It is rechargeable. Just plug it in to the Wii U with the cable it comes with. :)"}
{"product_id": "B0053B66KE", "context": "Is Pokemon X and y a good entry for someone who has never played any Pokemon game at all but does love to play RPG's?", "response": "Ya it was tell some one stolen it from me"}
{"product_id": "B000B78F72", "context": "Does it have tripeaks", "response": "Yes it does have a tripeaks version called Triple Peaks in the Regular games folder"}
{"product_id": "B00JC9SWSC", "context": "Can you download movies and save them on the PS3?", "response": "I don't know. never really wanted to do that. To me, I think is a waste of money to do this because if system crashes I loose the movie. I would just rather on the movie on disc."}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "This controller is compatible when using the Nintendo GameCube controller Adapter for Wii U. Note that at this time, the adapter only works with Super Smash Bros. for Wii U and is not recognized by the Wii U menu or any other Wii/Wii U games."}
{"product_id": "B007MJSZDQ", "context": ". 1.Does this work for any Batter pack or is it just the 2 given to you?", "response": "The 2 you gave me"}
{"product_id": "B004QRKWLA", "context": "Has anyone used this with old-school console emulators, and if so, does it feel okay playing older games?", "response": "Yes it will work. Dreamcast games work well with this controller on the pc."}
{"product_id": "B0072A4JVW", "context": "Does this allow for access to a portable charger?", "response": "Yes it can allow"}
{"product_id": "B009S4JZKK", "context": "Does this work in Windows 8?", "response": "I believe it does. Syetem requirements are on the box. Also the website \"steam\" has Q"}
{"product_id": "B00GQTZ8TM", "context": "Does this come with a sleeve or case to keep the 2ds in?", "response": "No but they're pretty cheap on Amazon"}
{"product_id": "B003N3HEU0", "context": "We have the older Wii.  Will this game work on it?", "response": "Older Wii?There Is Wii And New WiiU.(You Can Play Your Wii Titles On The New WiiU)We Have Just The Regular Wii So Yes It Will Work For You."}
{"product_id": "B006NU6F28", "context": "does it work on windows 8 at all?", "response": "Yes, it does work"}
{"product_id": "B00G6IJ5QK", "context": "How is this mouse for Claw Grip?", "response": "Pretty good, my hands are fairly big though so I can claw grip most anything."}
{"product_id": "B00FE8WKPQ", "context": "Is this ready to play out of box or is another console required? Do I need to buy a regular Wii U first?", "response": "Yes, you need to first purchase a Wii U console before you can play the Wii U Fit game."}
{"product_id": "B000GP8448", "context": "what games does this product work with", "response": "I've only used it with grand torismo, but I'm sure it will work with all driving games. Only compatible with Play Station."}
{"product_id": "B007TYC8MI", "context": "the pass online doesn`t work bro :/ the game is in very good conditions but i need the pass online :/ please help i really need this", "response": "These are used games so the pass has been used, mine has been used too I was disappointed but the price for the game is okay"}
{"product_id": "B00002SANH", "context": "One of the reviewers mentioned having prostitutes at the end of the game. I am looking to buy this for my grandchildren. Are there prostitutes?", "response": "Never in any of my 15 years of playing this game have I ever even heard mention of prosititutes. It is educational and very fun!"}
{"product_id": "B0057S9SYY", "context": "do these headsets drop the sound every few seconds like the turtle beach x32's??", "response": "No they do not because the use the 5ghz band with. The problem with your X32's is more likely an issue with your internet connection...or some frequency interference."}
{"product_id": "B00DLRLDBO", "context": "does it work perfectly with xbox 360 controller do I have to do anything special and can I use it for a PS3 IPhone and PC??", "response": "It comes with all the connections you need. For 360/PS3. Not for iPhone though. I actually didn't try it for my iPhone."}
{"product_id": "B001DPZE84", "context": "I have never played a flight simulator game before, and i am not a pilot. Could i still learn to play this game?", "response": "Tom see my answer to Ms Blundell"}
{"product_id": "B000096L71", "context": "will it run properly on window 7", "response": "If it comes in a DVD form it will run on Windows 7.  If it is the older version on 4 CD's it might not.  It will not run on Windows 8"}
{"product_id": "B0001BR9Q6", "context": "will the 2005 version play on Window 7?thank you", "response": "Yes it works great. Only problem I have is no speech on characters but everything else seems to work fine."}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "It comes with the game and its better using because it tells you how many calories u lose because of ur movement and it shows u if ur  doing it right."}
{"product_id": "B00I9GZZGG", "context": "Does the microphone fold up?", "response": "Yes the microphone folds up"}
{"product_id": "B0087OZ5FG", "context": "can you hear own voice", "response": "Yes, you can. It has sidetone.  You have to hold the mute button down for two seconds to switch between low and high sidetone.  The sidetone on high sounds very low though."}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "yes it does i seen someone demoing it on youtube some time ago"}
{"product_id": "B005M0KSIM", "context": "Does this game have a multiplayer option?", "response": "Yes one grandson was in our office on the main computer, and the other grandson was in the living room on his laptop and they were playing together.  They did use Steam to do this."}
{"product_id": "B00BZOBE78", "context": "When I look at the system requirements, it asks for 8 gb of hard drive space, is that for both the platform and expansion or just for the expansion?", "response": "The expansion rewrites over the game data so the expansion needs all 8 gb. To answer your question it is just for the expansion."}
{"product_id": "B001AI7CF2", "context": "Is there any lag input?", "response": "My teenage kids use them and have not reported any issues at all."}
{"product_id": "B001ELWMHI", "context": "Hi! i'm in Ireland but I'm going back to Brazil soon. Can you tell me whether this console is 110v or 220v?", "response": "110 thanks for your question Mj"}
{"product_id": "B00CHGYUE2", "context": "Does this game come as disk media or is it a game case with an online download code inside?", "response": "The game is on a disc, while the dlc is a code"}
{"product_id": "B003VAHYQY", "context": "DOES IT WORKS WITH A MAC???", "response": "Does not work with MAC, I just checked Logitech site, and they only have Windows listed for this controller. It say if you OS is not listed, nothing is available for it. So that means it wont work! For MAC"}
{"product_id": "B00HWMP0OU", "context": "Could a child who cannot read yet play this game? Or would it just be frustrating?", "response": "Reading is required to play this game."}
{"product_id": "B00FM5IY38", "context": "Can this game be played entirely with Kinect? I saw a trailer advertising it as a Kinect game but all gameplay video show the player using a remote.", "response": "Heck no it can't"}
{"product_id": "B00IP0H4GA", "context": "so it definitely plays on us ps3's?", "response": "Yes it does play on American ps3s. I myself have been playing for 2 months now."}
{"product_id": "B008BGXYBM", "context": "Is this mouse good if I do not use claw grip.", "response": "i don't use a claw grip and i feel fine with it. I have the Bf4 version of this, so the top is sort of slippery, but the regular taipan has rubber over the center so it clings well to your hand."}
{"product_id": "B00ACMM9BO", "context": "Does it work with turtle beaches?", "response": "Yes . I used x12 on mine. And it was excellent. Don't run tactical setup if you want to drop sho . It won't wor . Run default."}
{"product_id": "B003JVF728", "context": "if i buy pc disk will it let me download it to", "response": "Yes if u have steam u just put the serial number and u can download it from steam"}
{"product_id": "B00D6PTMB4", "context": "When I am playing with my friend (on the same console but with 2 cables) can I play left handed while they play right?", "response": "YES EACH GUITAR IS SET UP SEPARATELY."}
{"product_id": "B007C3E5WM", "context": "Does it work with windows 8?", "response": "There's no reason it shouldn't."}
{"product_id": "B00I14395A", "context": "Is there any noticeable latency when using the keyboard?", "response": "No latency noticed. I use the mouse to play games such as battlefield 4 with no latency."}
{"product_id": "B0018YXM3Y", "context": "does this game work on windows xp", "response": "Im not sure but u should try it, i have a windows 8 and it works perfectly so give it a try :)"}
{"product_id": "B00G6YJ60E", "context": "Is it a steam code or another DRM?", "response": "Its a steam code. You purchase it here on amazon, go figure lol. But this game though lol. This game i dont recommend for the faint hearted."}
{"product_id": "B006QRMR4S", "context": "Can this product change language from English to Chinese and get chinese game?", "response": "Yes I believe it can. Jenny"}
{"product_id": "B003G6ISRC", "context": "what do you play this game on? Is this delivered on a disk? thanks", "response": "This game comes a CD ROM and loads on your hard drive.  PvZ digital download on Amazon acts like a virus and will not let you download it a second time if something goes wrong. Amazon did reimburse me for the digital download and I bought this CD version."}
{"product_id": "B00BQZ5EWW", "context": "If I don't have a disc drive and I get the disc version, does it come with a steam activation code in the case so I don't need to use the disc?", "response": "Steam activation codes and physical copies are two different things so if you want a steam code you should buy one that specifically states that.  Thank you for your inquire."}
{"product_id": "B004UJNN5G", "context": "can a 11 year old play it?", "response": "Yes. It's great for all ages. They just have to make sure they're responsible enough to keep their sims alive."}
{"product_id": "B003O6CB6S", "context": "Does this game have any requirements like the downloadable version?", "response": "......a DVD drive maybe?"}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "there are conflicting answers here... please confirm once and for all... This Charging base - does it include battery packs for 4 controllers (3?2?1?) - or does it come with rechargeable batteries for 4 controllers (3?2?1?) - or do you have to have Microsoft Battery Packs already (about $12 each sold separately)?"}
{"product_id": "B00IRHE892", "context": "why does it say \"Batteries 2 AA batteries required.\"? never seen a wired mouse that needs batteries, could that be a mistake?", "response": "No batteries required, most likely a typo if you see it."}
{"product_id": "B005VA5D24", "context": "Is this hard drive compatible with the Xbox 360 Original Console?", "response": "No its only for the slim"}
{"product_id": "B0050SX7BQ", "context": "I just received this game today and found out there is no game manual. Am I the only one who is missing it?", "response": "I bought this game a while back and mine didn't have any either! I found it a bit strange myself but good to know I'm not the only one."}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "yes, a gas and a break pedal but not clutch"}
{"product_id": "B005J37I4Y", "context": "I have Beats Wireless bluetooth headphones.  With this device, will they output in-game sound and also allow me to chat? The Beats have a microphone.", "response": "Not even chat. They are MADE for Turtle Beach headphones, and the connection is poor. It cuts out a lot."}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "In my experience, unless the game description specifically says that it will arrive on the release date, then Amazon will ship it on the day that it releases and it won't arrive until a few days later."}
{"product_id": "B002I0J5CO", "context": "is it good for hearing the steps in black ops? please be honest", "response": "Not really i would get the p21"}
{"product_id": "B00FEOR4MY", "context": "Will the DS fit in this?", "response": "It's made for the 2ds. The other styles of ds would be awkward since the actual device opens and closes. I would look for a different option unless you have the 2ds. It's an awesome case though if you have a 2ds."}
{"product_id": "B001AI7CF2", "context": "Is there any lag input?", "response": "I have not noticed any"}
{"product_id": "B000056SPM", "context": "What are the default assignments to the buttons and levers in Flight Simulator X?", "response": "I can't remember but then again, who cares! You can and should customize them yourself and it is very easily done! One thing for sure, calibrate your yoke as otherwise it will not work properly! It's also very easily to do, takes 1 min at most!"}
{"product_id": "B00GZ9ESEE", "context": "is this Kinect compatible", "response": "Yes, just buy the sensor kit.http://www.amazon.com/gp/aw/d/B002BSA298/ref=mp_s_a_1_1?qid=1398218765&sr;=8-1π=SX200_QL40"}
{"product_id": "B001E93IWI", "context": "do  you here game sound and not just other people's voices", "response": "It sounds really weird like loud and echoey"}
{"product_id": "B000FP0K0U", "context": "can I make calendars from this????", "response": "Yes you can and it's a fairly simple process.  Instead, however, I would recommend going to this site and it is magnificent at creating calendars with various that you may want or need:   http://www.calendarlabs.com/printable-calendar.php?template=tL1mA W Radle"}
{"product_id": "B0081Q58AW", "context": "What is the difference between this one and Skyrim?", "response": "Skyrim was an awesome single player game...ESO is an MMO, and is sadly rather poorly executed at that."}
{"product_id": "B00ATF5YZM", "context": "Do you redeem this on Steam?", "response": "Yes. Don't waste time downloading this from Amazon, just use the code on steam to add the game."}
{"product_id": "B000VRCNLG", "context": "is Logic Tech extreme 3D Joystick compatible with this game? If it is any special setup?", "response": "yes it is,but logitech attack 3 is what i use and it works better with all microsoft flight sims"}
{"product_id": "B009LWQ0H0", "context": "Is this a point and click game or do you have to use the keyboard to perform specific tasks such as walk, jump, fight etc", "response": "Keyboard, keyboard, keyboard ..."}
{"product_id": "B007JM8ULS", "context": "can i play destiny", "response": "Yes, we got this hard drive to be able to play Destiny!"}
{"product_id": "B000M6DHA2", "context": "good for project m ?", "response": "Excellent for Project M."}
{"product_id": "B0012DPHKW", "context": "Does the CD have to be in the computer for the game to run?", "response": "Yes... I have not found a way to copy the contents to the hard drive and have it run."}
{"product_id": "B00821ME4O", "context": "it weight really 5 pounds?", "response": "nope not even close and not recommended for any sort of shooter"}
{"product_id": "B00FATRKWM", "context": "Where do you send it for repairs when it stops reading discs only 9 months later??? Says it has a year warranty on the console?", "response": "you need write to amazon or shop were you buy the console. i beleave this the solution"}
{"product_id": "B00EZKNSTQ", "context": "Does this controller have the same in hand feeling as a normal Xbox 360 controller?", "response": "Hi my friend, yes Thank you"}
{"product_id": "B00I5LMSBK", "context": "my copy of the game did not come with a playing manual, is this normal ?", "response": "Sadly it doesnt. Thing is I was not that surprised because this is the norm now. Most games dont bring a booklet."}
{"product_id": "B006JSY3MI", "context": "Can it run on any version of Windows after Windows 2000?", "response": "I'm pretty sure it can but then again I have it threw steam so may the odds be ever in your favor xD"}
{"product_id": "B0007U2CX6", "context": "What PSP's will this work on? I think mine is either 3000 or 3001. Thanks", "response": "It should be compatible for those models."}
{"product_id": "B002RYLG4Q", "context": "Can this play and use every game and controller made for the original nes?", "response": "I have Mario bros the first 1 and the 2nd and the 3rd. Along with duck hunt and Dr mario. They all play great. I don't know about being able to use the original game controllers. The ones that come with the system are great."}
{"product_id": "B00A0EPNPI", "context": "Does it have a mic?", "response": "No, it does not have a mic, but it has a mic plug-in port, and it has an microphone app on the eye where you can control the volume."}
{"product_id": "B009GSX0A4", "context": "Does this version have English subtitles or just the limited edition", "response": "The one I bought here was all Japanese, though I do know there is a American limited edition."}
{"product_id": "B0053BCO00", "context": "Is this the Greatest Hits version? I don't want the red box.", "response": "I don't think so...I bought it for my son...."}
{"product_id": "B0057S9SYY", "context": "Why is the microphone so weak? I have to almost move the microphone into my mouth for it to register my voice.", "response": "Make sure the mic is pushed in all the way. I thought I had mine pushed in completely, and had the same problem. I realized later it needed to be pushed in a little further. Just push the mic into the port until it clicks."}
{"product_id": "B008EZ3PBY", "context": "Will this work with the xbox 360 pro?", "response": "It should work with every xbox 360. I have the newer version. (the slim black with built in wifi) I'm not entirely sure which model is the \"pro\". The adapter to plug in to the console is the standard component port."}
{"product_id": "B00CXI0BPG", "context": "can i turn off the led all of THEM", "response": "You can turn off the LED in the logo near the bottom, but the ones near the scroll wheel are always on, it's a listing of the current DPS setting."}
{"product_id": "B006NU6HAS", "context": "will it run on windows 8 or 8.1", "response": "Absolutely!  I run it on mine (8.1)."}
{"product_id": "B003VH5Z2C", "context": "Does this work with Famicom (Japanese) carts?", "response": "No, this Retro Bit NES clone console works with NES carts, but you can play Famicom carts on it if you have an NES to Famicom convertor cart that enables you to play Famicom carts on any NES console, including clone consoles."}
{"product_id": "B00DJYK9L4", "context": "Does this include the belt?", "response": "Yes the belt comes with it"}
{"product_id": "B0000512IE", "context": "I don't need 7 feet of USB cable.  If I replaced the cable with a different, shorter one, would the pedals still work?", "response": "You can't easily replace the USB Cable, and I'm sure doing so would void the warranty. Why don't you simply tie up the extra cable with a zip tie or simple twist tie?"}
{"product_id": "B00C710AT6", "context": "Does this game allow split screen mode?", "response": "Yes if you have 2 controllers (or someone wants to use mouse and keyboard.) you could easily play play multiplayer (splitscreen)."}
{"product_id": "B000R0SRNU", "context": "Does this work on an xbox kinect?", "response": "Yes if you have controllers"}
{"product_id": "B00AJXEYOG", "context": "can you down load miss red on windows 8", "response": "Yes and it was very easy !................Suzanne"}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "If it's that new 3dsxl with the right thumb stud then yes. It's the same size as a regular 3dsxl."}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "Yes it does,  you get 8 per server plus awesome mounts,  gear etc.  Well worth it."}
{"product_id": "B001GROEEO", "context": "delivery is online, for email?", "response": "No they send it to me by mail."}
{"product_id": "B00ENFVS5Y", "context": "How is this wheel mounted? Example I have the  Microsoft 360 Wheel & it has a clamp to attach it to a desk.", "response": "It also has a clamp to attach to a desk! Very happy with the control of the steering, gas and brake pedals!"}
{"product_id": "B002I090AG", "context": "can nintendo dsl 3d games be played on the nintendo 3d system?", "response": "Yeah, ds/dsi games can be played on the 3ds, but they won't be able to be played using the 3D feature, only in 2D, only 3DS games will be able to play using the 3D feature. Hope this helps"}
{"product_id": "B00F27JGVA", "context": "is it a good idea to format the mamory card 64 gb when you get it new?", "response": "Not need to. I have used mine for months without formating it and I have not had any problems."}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "Amazon uses a placeholder date for the end of the year until they know the official date. It will be updated when they know more. If you preorder now, it will ship on the official release date. We will probably find out more about it at the Tokyo Game Show this fall."}
{"product_id": "B00FYMTUQY", "context": "Will this fit on a Seiki SE24FE01-W 24-Inch Tv heres the link for pics Seiki SE24FE01-W 24-Inch 1080p 60Hz LED TV (2014 Model)", "response": "I don't see why not. I have a 55\" led Samsung TV an it fit fine. It adjust in the back. I love it!"}
{"product_id": "B00B5QLS4A", "context": "How does it compare to the Logitech G600? I own a G600 and my fat thumb has a hard time finding the 12 side buttons. I end up only using 3 or 4", "response": "I had the g600 before i got this.The buttons take some getting used to when you first get it but the build material and quality is a lot higher than the logitech. The buttons are easier to press on the corsair one once you get used to where they are at also."}
{"product_id": "B00CHGYUE2", "context": "Is the Map pack included within the game or is there a code included?", "response": "How do I find that out?  I play multi most of the time and don't play online at all."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "I did not use the controller I just returned it, it was not the controller pictured or the controller I ordered! I would not buy from this seller!"}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "No it does not. It is basically a player loaded down with a bunch of my favorite old games."}
{"product_id": "B00DUARBTA", "context": "Can this game handle 1 - 4 players using 4 shock controllers?", "response": "I believe it's only up to 2 players at a time."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "Mine did when I had xp because it was 32 bit.  Wont run on my widow 7 64bit."}
{"product_id": "B00DE2W5XG", "context": "If this is a launch day bundle, is the ps4 a first day ps4 which has problems?", "response": "I'm not sure if I understood the question, but if you are asking if the PS4 has problems, I would say that not all of them have."}
{"product_id": "B000035Y6D", "context": "What all does your system come with, The wire hook up for the tv, controllers? anything?", "response": "Mine came with the wires for the tv and no controllers. I bought a 2 pack of controllers from a separate buyer for really cheap. Hope this helps!"}
{"product_id": "B00A1Y2STQ", "context": "Is this a quiet keyboard or are the keys noisy when you strike them?   Thanks.", "response": "I would say this keyboard is right in the middle of the two, because it is not loud, or quiet when i \"strike\" the keys. I have had this keyboard for about 2 months now, and i still love it."}
{"product_id": "B009YKVRYA", "context": "does it work with windows 8", "response": "Yes it works on Windows 8."}
{"product_id": "B00EM5UFF4", "context": "Is this game 4 player split-screen or 2?", "response": "Sadly, it's only 2 player local only splitscreen. And you can only use one profile at a time, so the 2 player is limited to player 1's progress. Kinda lame."}
{"product_id": "B006IOAHPK", "context": "Does this game contain a printed manual? Does it have any insert in the box?", "response": "No manual really needed, pretty easy learning curve for a game such as this. Only insert was the code for the bonus \"Fellowship Pack\" in my edition..."}
{"product_id": "B00F27JNGS", "context": "would this work with the version 2000?", "response": "Vita tv has nothing to do with vita 2000. All the later games will work on vita tv."}
{"product_id": "B005D5M1P4", "context": "Should I get it? I have the wireless mic I use but I mean is this worth the money? Is it wireless?", "response": "Alright thanks for the insight! Helped me a lot! -Cameron"}
{"product_id": "B003VAHYQY", "context": "How long is the length of the cable?", "response": "6 feet 1 inch, that's longer than I am tall."}
{"product_id": "B006IR6NH8", "context": "Does it work on the iMac? I want something to use with F1 2013   My PC flight yoke works for steering, but I also need analog gas/brake.", "response": "I actually have a Mac, but it works as a standard device (it's kind of crappy actually on it), I don't own F1 2013 on MAC (i do on Windows). But I would recommend you to launch BootCam and run this wheel on Windows natively, if you can."}
{"product_id": "B004NRN5EO", "context": "This version includes Korean subtitles?", "response": "I don't believe it does."}
{"product_id": "B004RMK4BC", "context": "does it work for Mexican accounts?", "response": "I'm sure it do Lol, if you can type in English you can order it as well."}
{"product_id": "B00FFL0T46", "context": "I wanted to purchase this game but I do have a Steam account will this game will be able to be played through Steam?", "response": "No, if you buy it here, you'll have to play it through Telltale's website."}
{"product_id": "B00009W5WB", "context": "What is that cable used for?", "response": "The one I got was 6ft or there abouts, used for sitting further from the xbox. I had hoped it would allow me use a 360 controller with the original xbox but this was not the case."}
{"product_id": "B00A1AQJAO", "context": "Will this work with the New Nintendo 3DSXL?", "response": "Hey, it's should. I never got mine but the game slot is the same size in the 3Ds and XL."}
{"product_id": "B00GZ1GUSY", "context": "Is it normal to see this annoying white flash between screens a camp fire?  Not sure if mine is defective because it's irritating/annoying. TYIA.", "response": "Yeah i've noticed the same. There is often a pause as well like it's loading or something. Pretty odd."}
{"product_id": "B007MJSZDQ", "context": ". 1.Does this work for any Batter pack or is it just the 2 given to you?", "response": "it will charge other batteries but is very poor at it. Slow to charge other brands and charge doesn't last"}
{"product_id": "B00D6PTMB4", "context": "Does it come with the guitar?", "response": "Unfortunately, no. There was a bundle that did come with a guitar, but that has been sold out for a long time."}
