{"product_id": "B00DHUUTEM", "context": "How can I get the backlights to turn on? Fn + ESC does not do it?", "response": "which Fn key are you using? I'm using the right Fn key, right next to the right ALT key and it works just fine..."}
{"product_id": "B003NSLGW2", "context": "If the ps4 controller stock grips are completely torn off, will these fit snug and not slip off?", "response": "They shouldn't slip off. They'll be easier to take off, but won't slip while playing."}
{"product_id": "B0057WDBHA", "context": "How many buttons does this Stick have? To be more precise does this Stick have buttons for PPP and KKK?", "response": "It has a total of six buttons, each mapped to buttons on the PS3 controller. Has alternative setting that work off of switches. Great stick, for sure."}
{"product_id": "B002RYLG4Q", "context": "Is it a bad thing to buy?", "response": "This is a good thing to buy.  If you like playing nes games and have an extra $15-$20 its a no-brainer."}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "For me is very long lasting work more time versus wii u remote"}
{"product_id": "B003O6C0V4", "context": "can I add this to my current EA active 2 system so a friend can work out as well", "response": "You can yes. You need the arm band, leg band, and the 2nd USB dongle. I googled it and this is where I read it to http://www.nutwiisystem.com/two-players-and-ea-sports-active-2-exercising-with-a-friend.html.    hope this helps :-)"}
{"product_id": "B0029LJIFG", "context": "I have two grandsons. Do I need to get a card for each of them or will one card for the Xbox 360 work for both of them?", "response": "You will need 2 cards to have 2 gold accounts on the Xbox 360. With the Xbox One only one gold account would work for both accounts."}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "There are single-player version for playing alone without a net connection, multiplayer game is also present (LAN, battle.net and direct cable connection)."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay for online multiplayer or is it free?", "response": "It is free. It costs nothing to play online (multiplayer)."}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "they only certify their fip on msfsx.  they do not comment on other sim engine"}
{"product_id": "B0050SZ0SY", "context": "Is this the Hunters Edition like the image shows or just the normal Crysis 3 DvD?", "response": "normal im pretty sure"}
{"product_id": "B000IZAQD8", "context": "are the cables included", "response": "The ones we bought were bought used a few years ago and all cables required to play were included. The PS2 system is no longer made and good quality used units are harder to find now. Good luck!"}
{"product_id": "B00H3VJYD8", "context": "Will this controller work on windows 8.1? I am wanting a controller for Watch Dogs.", "response": "Yes, works fine on 8.1"}
{"product_id": "B003ESDQW4", "context": "is this a single player game or can two kids play?", "response": "From what I can remember, it was just a single player game."}
{"product_id": "B007Y7OP8K", "context": "what is storyline of this game and its windows 8 compitable?", "response": "I cant even open it it says its windows 7 down but it lets me change it up like I can swap what I wanna run it on yet same result every time"}
{"product_id": "B00178630A", "context": "does it work on a MAC?", "response": "Yes, yes it does. At least according to the box."}
{"product_id": "B00IYWV5HS", "context": "i hace a laptop dv6 i7 2.oo ghz, 8 gb ram, ati radeon hd 6770m, can play this game?", "response": "This game was purchased for the PS4, not playable on a laptop.  I am not sure if it comes for computer play.  Sorry."}
{"product_id": "B001CC8UBG", "context": "This have prop hunt or can you get prop hunt?", "response": "Didn't know it existed until you asked, but did a Google search.  It's available as a download and you can play on stream and others.  Check this out on  how to get it free: https://www.youtube.com/watch?v=vlQn434c0Xo"}
{"product_id": "B00F27JGVA", "context": "Approximately how long does the shipping take for it to arrive in the US? Just trying to get a rough idea.", "response": "Thank you asking.Normal shippng:(sal/small post) is about 10~14days to US ."}
{"product_id": "B007SRM5MO", "context": "So why does the box say Internet connection required if the DLC is on the disc? Or is it only required for the Harley Quinn content?", "response": "You only need internet connection to play online, Media Recovery"}
{"product_id": "B000A2R54M", "context": "Grandson has both Wii and DS. Already has this game for his Wii. Will this have different tracks, characters, etc?", "response": "Yes, it has 16 tracks exclusive to the DS version of Mario Kart and characters with different features."}
{"product_id": "B004N7IIQ4", "context": "Does it work with the PlayStation 4", "response": "Yes this will work with the PlayStation 4 it has a great cross platform structure that allows it to work with any system!"}
{"product_id": "B005HN5LKY", "context": "does it come with all the cords?", "response": "I never even got it...."}
{"product_id": "B007MJSZDQ", "context": "Does this also charge fully or is it like the charging cable where it says it is done charging and about 5 minutes later it dies on you?", "response": "It has been giving me a full charge."}
{"product_id": "B001COU9I6", "context": "how many controllers does it have come with?", "response": "1 and the controller is red"}
{"product_id": "B00005QEFD", "context": "Will this be able to hook up to an HDTV? Specifially a Samsung Smart TV?", "response": "No.If you want hook it up to HDTV,HDTV cable is required but I don't have one."}
{"product_id": "B000VBFWAG", "context": "Can it work on windows 7?", "response": "Yup. Windows 8 as well."}
{"product_id": "B000BD1AFA", "context": "is this a downloadable thing or a disc??", "response": "You can choose which version you would like to buy. You can choose to buy the disc or the downloaded copy"}
{"product_id": "B001PO2BJI", "context": "I'm getting a wii mini.Will these work?", "response": "If the controllers are the same as the regular Wii, then they will work."}
{"product_id": "B00FQPQO4A", "context": "Do you have to buy the base game when you buy this, or is this pre-built in to the base game for the 27.99?", "response": "This is base game with add on in it."}
{"product_id": "B00GANWVJE", "context": "Which languages does it have? Is Spanish included?", "response": "This game can be played in Spanish, as well as English and French. To play in Spanish, first you would need to make sure your system language is set to Spanish in System Settings on your 3DS console (or 3DS XL, 2DS, whichever console you have). Then, the game will automatically switch to Spanish."}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "As you should know all new console games don't work with the old one for example if I have a ps3 and I buy a ps4 game the game will not work on the ps3 so the answer is no"}
{"product_id": "B00009OY9U", "context": "Seems like this is the best \"bang for your buck\" is it a descent joystick for Elite Dangerous?", "response": "Yes it is an outstanding stick for Elite Dangerous, that's the reason I bought it, and couldn't be happier."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "I'm running it on a windows 8, but I don't see why it wouldn't work."}
{"product_id": "B00E0H5J8M", "context": "Does the scroll wheel click to intervals, or is it completely smooth?", "response": "Just like a regular office mouse, it will click to intervals. I really recommend this mouse, I never had a single problem yet!"}
{"product_id": "B002TLTBN0", "context": "The original 'Classic' controller can't be used with Super Mario Brothers for the Wii. Will this controller work with Super Mario Brothers Wii?", "response": "The Pro Controller can only be recognized by the WiiU, going into Wii mode literally turns the console into a Wii so it will not \"know\" what a Pro Controller is anymore. You have to use either Wiimote or the origical classic controller."}
{"product_id": "B00IYWV5HS", "context": "Is this just a code or will any portion of the game files be downloadable from amazon? I am having a great deal of trouble using NCsofts client.", "response": "No, all from NCsoft."}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "The title is just a play on words by Nintendo, it's basically saying its a 3 dimensional world."}
{"product_id": "B004XGN8W4", "context": "can you use the xbox 360 E with it.", "response": "Its pretty much a portable tv in a case.  You can hook up an x box 360"}
{"product_id": "B008HPAXZ2", "context": "Does this help with glare at all? Looking for a screen protector that will allow me to play it outside.", "response": "Nope, it doesn't do anything for glare. It has no effect on the screen."}
{"product_id": "B00GPH7Y8S", "context": "When you got this did it come with 2 CD's?? Mine only has 1.", "response": "mine came with 1. it works fine."}
{"product_id": "B0000AFQRR", "context": "Will this work in Windows 8.1?", "response": "I just finished a puzzle an hour ago and I can tell you that it works fine on Win8.0, I have not upgraded to 8.1 yet. I hope this answers your question."}
{"product_id": "B00BI83EVU", "context": "I was under the impression that games would be able to be delivered to arrive by the release date.  Is this correct?", "response": "If youre asking if you will obtain copy early, possible but dont hold your breath. Amazon gives a get it on dor option, which in most cases=release date, rare cases=early and late arrival"}
{"product_id": "B0056JPS84", "context": "I have the Lite-On drive and was manufactured JUL 2009.  Not sure of the exact model #, should I re-open and provide model prior to ordering?", "response": "Yea it'd be best to find out what model it is cause it will not work if you have the wrong model Good luck hope you get your xbox fixed"}
{"product_id": "B00F27JN8Q", "context": "If I buy the US version, do I have access to compatible digital vita titles I purchased in the PSN store? If so, must I stream them?", "response": "Yes if you purchased the titles on the US PSN store.  No you do not stream the title, you download them to the memory card."}
{"product_id": "B00292OW1U", "context": "What are the overall dimensions ?", "response": "I'm measuring about 21.5\" x 7.75\" (about 55cm x 20cm).  Height depends on the position of the adjustable feet, being about 1.75\" (4.5cm) high with the feet at max height to make it angled."}
{"product_id": "B002XLR0JI", "context": "Which version is this, mirror or regular?", "response": "It is the regular version I believe"}
{"product_id": "B00GU4F4OM", "context": "Is the Red Dragon Mammoth the same as a MSI Interceptor DS200? If not, what are the differences?", "response": "I can't say much about the MSI one since I don't own one, but looking at both of them, I'd say they're both similar if not exactly the same minus the pricing. I got mines when it was on sale here for $28 instead of the original $90."}
{"product_id": "B002I098JE", "context": "Is good for 9 year old", "response": "The game is recommended for mature 17+ but im sure a  9yr old has seen the type of violence portrayed in video game.  I would say it would best if a parent monitored the child while playing. I dont see any reason why not. Im sure there are kids younger than 9 with this game."}
{"product_id": "B0000512IE", "context": "Does anyone use these for Elite Dangerous? If so, how are they?", "response": "Yes.  They work extremely well."}
{"product_id": "B0091A3AHA", "context": "Are there big diferences between the models in size, or all of them can cary next gen console? (ps4 and x-one)", "response": "Hi, actually a bug difference in size. Don't know if have other mayor difference in function. I do recommend to buy a battle bag, because the mine was difficult to close and don't fit well and yes, I have a PS4 and it fit"}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "With the \"Reel 'em In\" game I can play without the DVD in the drive. I use a laptop for my games. I also purchased the \"Zeus II\" game and I have to have the disc in the computer to run it."}
{"product_id": "B00D6PTMHI", "context": "When you use Rocksmith, is the guitar plugged into the amp at all, or just the computere?", "response": "In order to use your guitar with Rocksmith, you do not use an amp at all. You plug the guitar to the computer with the Ubisoft Rocksmith Real Tone Cable."}
{"product_id": "B00ARD5410", "context": "how long is the mouse cord?", "response": "It's around 6 feet long."}
{"product_id": "B00FC1UH82", "context": "does it work on ps2", "response": "If you can find a USB to ps2 adapter, it would."}
{"product_id": "B003Y5AHPG", "context": "Do you have to buy the controllers for all 3 platforms or will the SNES old controllers work for all three platforms (nes/snes/genesis)?", "response": "Not necessarily. It comes with wireless controllers that are suppose to be compatible with all 3 systems. You just have to have them pointed directly at the console. The console does work with original controllers, if you have them. The snes controller will only work for the snes games, sega for sega, etc"}
{"product_id": "B0045FEEAS", "context": "Is this internet accessable for Netflix download and movies?", "response": "Yes it is wifi capable and you can download netflix and Hulu and watch either as long as you have a subscription"}
{"product_id": "B004XGN8W4", "context": "does it need to be plugged into an outlet to work", "response": "Yes the case needs to be plugged into an outlet to work"}
{"product_id": "B000ND3XXA", "context": "does it work with mac?", "response": "Yes it does, I have a mac osx snow leopard. Make sure you plug the controller in the adapter first, before you plug the adapter in the mac."}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "I am not sure -- It works well with Vista"}
{"product_id": "B0053BCML6", "context": "what ages is it for?", "response": "Anyone that can read or is learning to read~"}
{"product_id": "B000P46NMA", "context": "is this 1st person or 3rd? >.<", "response": "it is in 3rd person."}
{"product_id": "B002BRZ9G0", "context": "can a 5 year old play this game?", "response": "A 5 years old may play it, but I would say It would be better for a 7 years old"}
{"product_id": "B002DUCF7Q", "context": "If i add alot of these like half a cockpit do i need to upgrade my Power supply?", "response": "I use a powered usb hub. So I can plug many things into the hub and it has it's own power pack. Then I don't overload the onboard power from the pc."}
{"product_id": "B007JDMPOK", "context": "Is it worth buying this when I already am playing for free? I have heard buying this gets you founder's status, but will i have to start over again?", "response": "You will not have to start over. You get the founder status and the many features with it to your exsisting account ( you put in a code for it). Worth it in my opinion."}
{"product_id": "B00GS6A6V8", "context": "so to use the codes you go to the playstation store?", "response": "It gives you a code after you purchase it. After you log in to PSN there is an option (I believe at the bottom left) that says \"Redeem Code\", once you select that you just put in the code and it will let you download all three DLCs."}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "Yes, all DS games are compatible with the 3DS, but DS games wont be 3D. I use this game on my 3DS"}
{"product_id": "B00G6CLZPA", "context": "Is this the same basic story as the other Hakuoki games?", "response": "I don't know.  It started about a village having a strange vibe to it."}
{"product_id": "B008X73CE8", "context": "Where's the manual?  I purchased/downloaded the game, but no user's guide?", "response": "Open your files for the game and then open the support file and you will see the manual"}
{"product_id": "B009GZX49Y", "context": "good morning I wanted to know if this trilogy are video games or play 3 games .... if they would make the purchase ... excuse my English I am from Ven", "response": "I am sorry I don't understand the question. Feel free to explain!"}
{"product_id": "B00GJXMRX0", "context": "if I have widows 8 will it still work?", "response": "Of course it works on Windows 8. In fact, it works best on Windows 8."}
{"product_id": "B00EFFVZP0", "context": "does the bf4 game box still have the $10 code for ps4 in  the box in october 2014?", "response": "Yes it does but I'm not sure when it expires"}
{"product_id": "B00B3PDH5G", "context": "If connected to PS4 with a cable, can you control chat volume and Mute by button which on the headset?", "response": "From my understanding and my testing its the same exactly, only difference is the mic works by plugging it in via cable."}
{"product_id": "B00D5WDI3G", "context": "Can I install the software in several computers ?", "response": "With the purchase of Chess King 2, you receive four licenses, meaning that you can install it in up to four computers."}
{"product_id": "B007WPM9GO", "context": "does it fit the original ds", "response": "No, it doesn't fit the original DS. It does fit a DS lite though....hope that helps you out."}
{"product_id": "B00HVBPRUO", "context": "Can I use 2 headset while on my playstation3?", "response": "Yes, I do and it works fantastic"}
{"product_id": "B00IIHU44E", "context": "I want to know if NSA could spy inside my home thanks to the Kinnecht apparatus. Thanks.", "response": "o ya no daubt lol"}
{"product_id": "B004N7HSGU", "context": "So if i were to buy these Astros, What EXACTLY would i need to buy extra to work with my Xbox One?", "response": "Xbox one stereo headset adapter"}
{"product_id": "B0050SY77E", "context": "does this game have a multi player mode", "response": "Nope. The game its self is 1 player only.But you can do 2-12 if you run xbox live. Which I dont."}
{"product_id": "B001Q24UAM", "context": "Is it only in English? I would like to get it for my mother in law, and she does not know English.", "response": "I think that it is only in English but it is very easy to understand and follow."}
{"product_id": "B002P35JMO", "context": "Can this be used simultaneously alongside an HDMI cable? (Can I have this plugged into my Xbox SLIM at the same time as an HDMI cable)", "response": "Yes I used it for my older turtle beach headset. And used the hdmi for picture and sound on my tv."}
{"product_id": "B00I9GARIM", "context": "Does this require software, and is it compatible with Mac?", "response": "Hi works in mac but not the software"}
{"product_id": "B00FM5IY38", "context": "Can this game be played entirely with Kinect? I saw a trailer advertising it as a Kinect game but all gameplay video show the player using a remote.", "response": "no, you need a controller to play, Kinect voice is an option for gameplay."}
{"product_id": "B0076DO5A0", "context": "what are the system requirments on this game?", "response": "Windows XP (SP3)Vista/7/8~ Intel PentiumCore2Duo2GHZ~AMDAthlon64x2 or better~ 2GBRam(XP)~3GBRAM(Vista/7/8)~ 512MBgraphic card, Nvida8800GT512Mb~9GBof free Hard Drive space~Sound card compatible with DirectX 9.0c~ DVD-Rom,mouse,keyboard~Internet connection required. There are the exact system requirements from the back of the CD box. _> Sniper Ghost Warrior 2"}
{"product_id": "B0050SX4CI", "context": "Compatible with MotoGP 14? Is possible to use 2 together to play Split Screen?", "response": "Hey man, I dont know for that game. Actually I use the wheel for play little big planet karting and I use two. One for me and one for my daughter and works great. Sorry if i dont answer your exactly question."}
{"product_id": "B0076DO5A0", "context": "Do I have to have Steam to play this game?", "response": "I believe so, Bob!  Cool game! You would like it, even better than Ghost Warrior (original version)"}
{"product_id": "B0050SWBAE", "context": "Should I have played other Pikmin games before playing Pikmin 3?", "response": "No, they guide you through the first section how to play. Very easy to play beat the game in a month for a girl who's in her early 20s."}
{"product_id": "B008HPAXZ2", "context": "It's only one screed protector filter?", "response": "One for top one for bottom"}
{"product_id": "B00BCEK2LA", "context": "Can the \"+\" and \"-\" buttons be programmed", "response": "+ / - I'm not suremouse3 (wheel click)mouse4 (back on internet)mouse5 (forward on internet)I know those work.The others might with the Logitech driver stuff installed. I just PnP mine."}
{"product_id": "B00000K4MC", "context": "Will this game work on a windows 7 laptop?", "response": "Yes. I installed it on a windows 7 ultimate laptop just a few months ago. It does get a bit pixely at times just because its an old game, but it corrects itself quickly and I've never had any issues with playback."}
{"product_id": "B004X56PWK", "context": "Can you play the game on PS4?", "response": "only on ps3/ 360"}
{"product_id": "B000J18SR2", "context": "Is this compatible with windows 8?!", "response": "Yes. I am running it on Windows 8."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "you can give the code to someone else, but now i would like to know HOW WILL THEY CONTACT ME?.... email? amazon email? and how they know my email?"}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "No, Hense why the game is clearly labeled WII U. The only way for backward capability.. is only Wii Games can be played both on wii and Wii U.. it does not work the other way around. This is only possible because the Wii U within itself has a Wii mode, basically two in one console."}
{"product_id": "B00ESN8YGW", "context": "Where do I enter the code it gives me?", "response": "You need to set up a Steam account. Look up steam on the internet, it will guide you through."}
{"product_id": "B001COU9I6", "context": "Does it play PS2 games?", "response": "This tells it all!  https://support.us.playstation.com/app/answers/detail/a_id/232"}
{"product_id": "B003O3EFY2", "context": "Are you able to save your games?", "response": "If the game cartridges allow it, then yes."}
{"product_id": "B00AJZNUUI", "context": "what is the difference between a wii and a wii mini?", "response": "The wii mini has no internet connection, it's just for playing games.  It uses the original Wii games, not the new Wii U games."}
{"product_id": "B008BGXYBM", "context": "Can you change the color of the lights on this, or is it only green?", "response": "Does this have tilt wheel?"}
{"product_id": "B003XNU1JQ", "context": "Do these codes actually work?", "response": "Yes they do mine worked just fine"}
{"product_id": "B000VRCNLG", "context": "Can anyone tell me if this game works with Logitech extreme 3D pro joystick on windows 7?", "response": "Yes It will work!"}
{"product_id": "B008O510Y8", "context": "My computer doesn't have a microphone jack, so I'll need an adapter. Any recommendations? Should I be looking at 3.5 mm (female) to USB adapters?", "response": "It works great with this: SYBA external USB Stereo Sound Adapter for Windows, Mac, Linux Extra Audio Source with Microphone SD-CM-UAUD"}
{"product_id": "B00005QEFD", "context": "I'm sorry, I've looked at all the questions and answers but I thought I should ask again: Does it come with all the necessary wires and one controller", "response": "Yes, it comes with all necessary wires and a controller."}
{"product_id": "B00EZKNT5O", "context": "How is the quality on these? I'm aware it's a licensed controller, but I'm still curious. PC gamer, have had Logitch F310 fail on me in under a year.", "response": "Its a sturdy controller"}
{"product_id": "B00AQ2BLI2", "context": "Do I need to be connected to the Internet like in Empite or can I play offline?", "response": "You only need to connect to the internet for the initial install. After it is installed you can play online or offline."}
{"product_id": "B00E1L78N6", "context": "I use the Xbox One to watch TV, when I use the TV app does it play through the headsets?", "response": "I believe it will I've watched movies and Netflix with them the only problem is the controller shuts off if you don't move the joystick or press a button every 5 min or so and if that happens you will not have sound."}
{"product_id": "B00886XQO0", "context": "Can I use this on PS4", "response": "I don't see why not. It has analog (yellow RCA) plug and digital (optical) plug. I have the TV optical passing thru to the stereo so anything plugged into my TV (DVR, XBOX, DVD) plays thru the headphones without the stereo on."}
{"product_id": "B0053BCML6", "context": "Does this game work with a 3ds xl?", "response": "yes, that's what I play it on."}
{"product_id": "B005Q1YA5O", "context": "Is PC Download including Windows 7 for it to work?", "response": "I have Windows 7 and it works, if that answers your question.  It's phrased a little funny so I'm not too sure what you mean."}
{"product_id": "B00GV0LR64", "context": "How do you take it off the tv after playing? Does it lose its suction when you put it back on?", "response": "It's just a typical suction cup. I've got two. One of them I have been using for over a year and it hasn't lost suction yet. Still works like the day I got it."}
{"product_id": "B00GU4F4OM", "context": "Does this last through the daily beatings of a WoW player?", "response": "I believe this is a great mouse for WoW"}
{"product_id": "B0036VO4XO", "context": "Hello, a straightforward question: I have a Win 8.1 laptop with no mic-in jack. Will the Amigo II enable me to record the audio from the mic?", "response": "I am unsure. I've used this mainly with my headset for my ps4, not at all for my laptop."}
{"product_id": "B00D2EGWDA", "context": "Hello , Does it include the original game + A free map pack ?", "response": "It includes the game, with a code for the digital download. Yes."}
{"product_id": "B007C3E5WM", "context": "Is this mouse compatible with a macbook pro?", "response": "Yes! Not only does it not have a driver, you can change everything easily through your system preferences, as th DPI is directly associated with the mouse."}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "Neither. It is powered by your controller. It is not a stand alone headset. If you wanted to watch TV or a BluRay using your headset, you have to have it connected to your controller and the controller has to be on."}
{"product_id": "B003XNU1JQ", "context": "do you have to have that controller or can you use the one that comes with the system", "response": "You can use the Wii remote or the classic controller. Either one will work for this game."}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "It will start as soon as you plug it in."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "US layout is normal. Nothing different at all."}
{"product_id": "B00CJD4HD2", "context": "Is there any REAL problems with the mouse right now? because i heard of problems back in early 2013 about this mouse and I want to know if it's fixed.", "response": "I have used the mouse for able 3 months and have not ran into any problems."}
{"product_id": "B0094H8H7I", "context": "can you save your game", "response": "Unfortunatley not it's the only drawback besides the wireless controllers"}
{"product_id": "B006IOAHPK", "context": "this version is censored?? thanks", "response": "Not even remotely. I wouldn't play the game when my 13yr old nephew was over due to both language and content."}
{"product_id": "B0006HHI3E", "context": "Can you run this game on Windows 7?", "response": "Yes.  It is on my home theatre PC attached to a 55\" screen. Running win7 pro.  Good luck and have fun."}
{"product_id": "B00001IVRD", "context": "My current Starcraft and Starcraft expansion look grainy on my Windows 7 -  is this updated to work properly?", "response": "I play mine on windows 8.1 right click your desktop icon and go into properties and than comparability, go down the windows list and find which one looks best on your computer. Might also be an in game graphics setting and might be on Low, check that first."}
{"product_id": "B003O6JKLC", "context": "Is everything here to start playing (other than a game)?  Would I have to purchase anything else?", "response": "I am not the person using it. But I guess, in addition you need monitor and hand held control if not come with the box, you can get it in local store."}
{"product_id": "B00FB45YFQ", "context": "Do these completely cancel out all noise?", "response": "Well, I would say if you want complete noise cancellation go with BOSE, but these do a pretty good job if you already have something playing, it's really hard to hear anything outside of your headset."}
{"product_id": "B00CPKUV7K", "context": "What is the area code for the game? Is there a PAL region code?", "response": "Mine is the nsta USA version. I've heard the one in Germany removed all references to Nazi's. I think that's a PAL region. But mine is for the US and think it has regional restrictions."}
{"product_id": "B00GJ2HZ7E", "context": "Is there gamepad support?", "response": "I haven't played every game but I know that adventure 1 & 2 , generations, and both racing games support gamepads"}
{"product_id": "B00FE8WKPQ", "context": "I own the Wii U and no Wii Remote controllers. Will I have to purchase one for use with the Wii Balance Board?", "response": "Some games do require a Wii Remote with motion plus,  and a few games require 2 Wii remotes with motion plus. A lot of games just require the balance board"}
{"product_id": "B004RMK4BC", "context": "Do i have to have a real  US address to purchase this item ?  Thank you ..", "response": "need not have real U.S. address, will send the code to your email address."}
{"product_id": "B00BDS415I", "context": "How long is the cable, is there any way to lengthen it?", "response": "The cable is about 17 feet with the amp attached and there is no way to lengthen jt"}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "No.  It comes with one already and witth proper instructions on updating the controller which takes seconds."}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Yessiree. Runs just fine on 7.  And 8 as well"}
{"product_id": "B008SBZF4Y", "context": "does this work with swap force", "response": "I'm sorry, i'm not even sure what they are.  My grandson requested it for an Easter present."}
{"product_id": "B002I0HJG8", "context": "few records come from? to buy the game is installed with your disks and then I guess updates and patches are downloaded ?", "response": "Yes updates and patches are downloaded once you create an account and log in. Expect at least a few hours of patching on your first login since there have been quite a few big updates since the original release."}
{"product_id": "B007MM9E42", "context": "Does this game require two players?", "response": "no. 1 player is fine."}
{"product_id": "B001FBHT34", "context": "does it work with ps3", "response": "Regrets, but I cannot help there ... I bought it for PC/Skype, not gaming.  All it is is basically a set of speakers (headphones) and a microphone, so I'd imagine it would work with your game system, but it won't do anything like vibrate or whatever game-specific headgear might do."}
{"product_id": "B00EVWZHLK", "context": "Are they all on one disc or 3 separate discs?", "response": "3 disks. They have a 3 disk case"}
{"product_id": "B005LUUWL6", "context": "So it will work on any ds game that you have or does it just work on top of the Line games?", "response": "there are tons of codes both on the device and searchable online. I'm sure the games you have are coded in either place."}
{"product_id": "B00IYWV852", "context": "How do you get theThree Guest Passes with seven days of play time that come with this edition?", "response": "I received them via email from Carbine"}
{"product_id": "B00BGAA3S2", "context": "Is this just an upgraded version of the Playstation Eye? I play the champions game, will this work better than the eye?", "response": "No the PlayStation eye was a full game experience but this is kind of a short game. I am not saying it's bad but if you have no one to play with then you'll probably won't spend much time on it."}
{"product_id": "B002CZ7P04", "context": "is is appropriate for children?", "response": "Yes it would be appropriate for children.   It is like walking thru a park and you even have a track to walk around."}
{"product_id": "B006NU6F28", "context": "Can I use a joystick with this game", "response": "yea you can, you can use any controller also"}
{"product_id": "B007XVTR12", "context": "Is this played on Uplay and/or linked with Steam?", "response": "It only works on Steam."}
{"product_id": "B0050SVHZO", "context": "Is the Wii U backwards compatible with Gamecube Games and the Wavebird Wireless Gamecube controller?", "response": "The system is backwards compatible and the new smash bros game is releasing a pack with a type of compatible gamecube controller but you need to get the game in order to get the controller cause I haven't seen them sold separately"}
{"product_id": "B002DUCF7Q", "context": "Does this work with X-Plane?", "response": "Yes. Use the xsaitekpanels plug-in available on the X plane.org site. I have had no problem switching the radio channels or the navigation channels. I haven't tried the ADF or DME function."}
{"product_id": "B007VPZR5U", "context": "can this mouse make macros for GW2?", "response": "Yes, you have to download synapse. But there you can make every button a macro if you want"}
{"product_id": "B00DC9T2J6", "context": "My son really wants this game but M rating isn't going to fly with Mom. Is there a way to turn off blood / gore for PC version?", "response": "Hi i did not see a way to turn off the blood or gore but other then a few curse words the game is not to bad, i would recommend watching a few youtube videos of some game play and see what you think."}
{"product_id": "B00HG0B8NA", "context": "There is a statement that you can see others \"high\" scores to compare, is this an online game?", "response": "My all-in-one game is not at online game.   But, I have seen before that you can see others scores.   Good luck with yours...!  :)"}
{"product_id": "B000ZBZK7C", "context": "will this run on mac", "response": "I have a mac, but I have to run it on the windows application thru vmware fusion"}
{"product_id": "B0041RR0TW", "context": "Has anyone used the 710 Gamepad on a windows 8.1 system?", "response": "I have. I plugged the little transmitter or how ever its called and worked fine. I only play two games with it: Call of Juarez Gunslinger and Metro 2033. I'm not a savvy computer person, so I haven't use the other x-mode."}
{"product_id": "B0017Q4DGI", "context": "do you need the motion attachment to use with remote plus for these games?", "response": "I've only just used the rechargable remotes that came with my Wii package. I did have to buy a new CD as we wore out our original game CD"}
{"product_id": "B00E8JZILA", "context": "Any download codes included with this game or is the entire experience in the cartridge?", "response": "All of the content is included on the cartridge, no need to download episodes. It is, however, also available in a digital form."}
{"product_id": "B005M2KSLC", "context": "I'm looking for a mouse with a middle-mouse button that's very easy to press. I heard Kana has a low pressure one. Is it?", "response": "I'd say it's pretty easy to press."}
{"product_id": "B005THAX5Q", "context": "Is it couch co-op?", "response": "Do not buy this game-only if you like games from 1994."}
{"product_id": "B00BCEK2LA", "context": "Is the G 400 S the same size as the G400?", "response": "Although i can't speak to the size of the g400,it is the exact same size as my old mx518."}
{"product_id": "B009DYCTY4", "context": "What is the model of this console? Does this still have the original firmware version?", "response": "Yes it has the original firmware and it's also the lastest model, slime with try slider on top for games. I just don't know the model number"}
{"product_id": "B0097CUREG", "context": "Does anyone notice that the Kaboom slot is missing the button with a \"$\" that is used to load in more credits during game play? Or is it just mine?", "response": "Mine works fine, but there are patches to all the games available on the website of the company that makes these."}
{"product_id": "B00BDS415I", "context": "Will this work on the Wii U?", "response": "I don't know if it works on the Wii U because it says X Box and PS3 so I would suggest looking for a headset that tells u what it works on."}
{"product_id": "B00EOUL7T0", "context": "can i control game volume?", "response": "This item is garbage...do not purchase!"}
{"product_id": "B0096L2SJ0", "context": "Can the controller be charged?", "response": "no it need 2 AAA batterys"}
{"product_id": "B004RMK5QG", "context": "How do I receive the code? Will be via email or snail mail to my billing address? Cos the address belongs to my friend not mine.", "response": "Amazon send you an email with the code in minutes."}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "Oh yeah thats the best part, what ever your tv plays, be it music, a show, a game you can hear it with no set up what so ever,  they awesome, hell I'm using it right now just watching a show."}
{"product_id": "B008SBZF4Y", "context": "does this work with swap force", "response": "Yes. All Skylander characters from the original Skylanders Spyro's Adventure and Skylanders Giants games work with Skylanders Swap Force."}
{"product_id": "B00GHTP7SS", "context": "do i need game controller to play or can i use a keyboard", "response": "As with most pc games these days, either will do.  I've found having a game controller helpful in general, but not usually necessary.  Good luck."}
{"product_id": "B00BCEK2LU", "context": "How long does the back light stay on? Can you customize it?", "response": "Stays on unless you cut it off. You can change the color of the backlight to whatever you wish. Three presets. Cannot change color of individual keys."}
{"product_id": "B00ATF5YYI", "context": "Is this the complete version (just like the one on Steam) that has all DLC? I'm pretty sure the DLC isn't even sold separately anymore for downloads.", "response": "Is the complete version"}
{"product_id": "B00BGA9YZK", "context": "Is this just another graphical showcase like Ryse was for the X1 or is there an actual game hidden in here?", "response": "There is an actual storyline that makes sense. It gets pretty intense through the campaign and multiplayer is good once you figure out weapon combos"}
{"product_id": "B00E6OLJ88", "context": "does it have rapid fire for the ballista and dsr 50 from black ops 2", "response": "Yes it does but it doesn't fire rapidly if you hold down the trigger it will fire after the bullet cock's back into the chamber. You do not have to keep pressing the trigger, just spot your enemy and hold down the trigger."}
{"product_id": "B00B5QLS4A", "context": "I have a SteelSeries 4HD mouse pad,would this work well with a plastic coated pad? I currently have a Naos 5000 that's getting worn out.", "response": "Yes, the Corsair M95 will work perfectly on most surfaces. After you download software for the M95 off the Corsair website, you can run a test and the M95 will detect the quality of the mouse mat. That will make the mouse be able to be more accurate on the mouse mat you are using."}
{"product_id": "B0002XJBGE", "context": "I bought this, along with the Special Edition Doom DVD, to play on my Asus laptop.  Game plays okay, but does not recognize pad.", "response": "Doom might not be compatible with it.  Are you on a Mac or PC?"}
{"product_id": "B002I090AG", "context": "Is an SD card really necessary for the 3DS?", "response": "do not know bought it as a christmas gift for my grandaughter. all she has told me is that it is auesome and loves it. p.beecher"}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "No, its not. I received a cheap no name knockoff one that has the same look, but with no branding."}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "It means the Skylander is not in the original packaging."}
{"product_id": "B00B3PDHBU", "context": "Is it possible to use one set of headphones with an XBox 360, PS3, PS4, and XBox 1?", "response": "If I'm not mistaken, it works with all of them but needs a special connection for the Xbox One."}
{"product_id": "B00886XQNQ", "context": "can i hear the game and the people in a xbox party?", "response": "My son loves them he plays on line call of duty with his friends on his ps3. He talks to his friends and hears the game fine"}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "I have windows 7 64 and it works.if you use the joystick to do keystrokes wsad to move you will have to disassemble and file case to move in a square not a circle .sthe silver housing is not molded correctly.look at a pik of the rumblepad,its squarearound the joystick"}
{"product_id": "B009SJR28W", "context": "What do the LED lights C, 1 and S represent?", "response": "C = Caps Lock 1 = NumLock S = Scroll Lock I own the keyboard and love it! Perfect for me! xD"}
{"product_id": "B003O3EFY2", "context": "I know there are ports for all three types of controllers. I'm curious, could I play NES games with an SNES controller?", "response": "No , but I've found that the retron 3 doesn't play alot of games. It won't play any of my super nint. Roleplaying games."}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "Oh dang the price must of gone up. I paid around 2 or 3 dollars"}
{"product_id": "B0088MVODE", "context": "Is this edition fully physical or just download codes?", "response": "Resident evil 6 is on disc. The additional games the come with it are download codes."}
{"product_id": "B001V9PTVE", "context": "can i play these with just 1 hand (the mouse)?", "response": "Yes you can. But still have the option to use letter and numbers keys and sometimes it makes it easier. For example, when you want to give someone $250, you would have to click the up arrow 250 times unless you type in \"250\". This is the only time I really used the keyboard rather than the mouse."}
{"product_id": "B00BGAA3S2", "context": "Is this just an upgraded version of the Playstation Eye? I play the champions game, will this work better than the eye?", "response": "Only for the ps4. Will not fit ps3. Two different plugs and they are not switchable. It works with the joysticks."}
{"product_id": "B00B1N07QM", "context": "I have small hands and I'm used to three rows of buttons (nostromo). Are 4 rows doable for most people?", "response": "You can adjust the palm rest's tilt and how far the wrist rest moves out on this to suit your hand size."}
{"product_id": "B00AFYAUYW", "context": "Is this version backwards compatible with GameCube games?", "response": "I think so you will need a different control for the game cube"}
{"product_id": "B0058GMO0A", "context": "is it compatible for windows 8?", "response": "we're not using it on our W8 machines so cannot directly answer...   definitely check the compatibility requirements before you buy...   there does seem to be various \"generations\" of the program for sale..."}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "I bought this for my nephew. He has a PS4. So, I am guessing so. But not positive. This is the product he asked for."}
{"product_id": "B0085VIILY", "context": "does this flight stick work with all other flying games on xbox 360?", "response": "The buttons will work as a controller, but you may have to reconfigure other games button assignments if they do not match Damage Inc."}
{"product_id": "B00E447L8C", "context": "Can I use both ports to charge devices, or I have to use one or the other one at a time?", "response": "You can use both ports ... I have had 2 phones charging before at the same time"}
