{"product_id": "B003XNU1JQ", "context": "Do these codes actually work?", "response": "Yes! I puchased my code about a year ago and altjough I found it difficult at first to install, (read the reviews, my instructions on how-to are there if you need help) it has worked perfectly. The game is still on my Wii, has never ever crashed and I still happily play occassionally."}
{"product_id": "B003Q9RGRW", "context": "Is the end of the head set only for xbox or could you use it for a computer too?? Thanks for your answers!!!!!", "response": "The manual says it's only for the xbox 360."}
{"product_id": "B00FQFFPZO", "context": "Can you list the track locations -- other than the Daytona, Sonoma, Talladega?", "response": "Charlotte, Las Vegas, Atlanta, Kentucky, Bristol, New Hampshire, Texas, auto club, Michigan, Chicago, Kansas, darlington, martinsville, Richmond, homestead, Watkins glen, Phoenix, Dover, pocono. Indianapolis."}
{"product_id": "B001O3066U", "context": "Will this game work with Windows 8?", "response": "I believe so. but if it doesn't, you can return it."}
{"product_id": "B00I4BGNVM", "context": "can you use a controller?", "response": "I think so but not sure what type can be used."}
{"product_id": "B00BXE4W4C", "context": "How do I get the pic axe in the shed....it won't open...is there a patch for this game?  Someone else has the same problem!", "response": "I haven't played the game for awhile so I can't remember how to get the pick axe there is a walkthrough on line you can download but i'm not sure if it cost money or not"}
{"product_id": "B00GPH7Y8S", "context": "How does it compare with the old Panzer General?", "response": "I do not have \"Panzer General\".....but \"Blitzkrieg: TCA\" doesn't run right on my Windows 8.1."}
{"product_id": "B0006PJAZU", "context": "Will Suite 8 work on a XP computer?", "response": "Yes, according to the published specifications, it should work on an XP computer."}
{"product_id": "B004RMK4BC", "context": "when you put in the credit card is it taking off your credit card or your amazon credit", "response": "on your credit card. Dont worry about being stolen, its from the PlayStation."}
{"product_id": "B0061PAZUS", "context": "can I play this on the xbox one?", "response": "Yes, but you need a Kinect as well, to read body movements..."}
{"product_id": "B007TMFD7C", "context": "What brand and model of joystick would you recommend with this game? i.e. for MAC. All the ones I've been finding are for PC.", "response": "I'm using an old school Microsoft Force Feedback 2, with no issues. The stick twist which works for rudder. Imac 27 inch 2013."}
{"product_id": "B00GZ1GUSY", "context": "Is Ps4 game region locked? Will i be able to play this game on Indian PS4 (PAL)?", "response": "As stated before PS4 games aren't region locked by default. Game makers still reserve the right to region lock their games (but most will not. Only one did on record for PS3). The DLC IS region locked though."}
{"product_id": "B002LMX5ZW", "context": "Will this run on Windows XP?", "response": "I'm running it on Windows 7 - But the jewel case DOES list Windows XP (and not Windows 7 - imagine that) - So I assume it will run on your XP machine just fine."}
{"product_id": "B00CMQTVK0", "context": "Are these Day One Edition just manufactured or are they from Nov. ?", "response": "Only from November. You can't get them today. You aren't missing anything other than the Day One delivery and a little achievement. Other than that, the current XBO's on the market are the same thing."}
{"product_id": "B002RYLG4Q", "context": "Dose it play all Nes games are is it it wierd with them", "response": "I have several old games that do not play on it or they quit working after 15 minutes of playing. I am not sure if it is the games or the system, though."}
{"product_id": "B00DBRM3G8", "context": "what difficulty mode is best to play on?", "response": "the difficulty depends on your your ability honestly-- I think superstar is a good measuring stick."}
{"product_id": "B005BLAIGE", "context": "this will not run on my windows 8 20013 your tech said it would", "response": "Try right clicking on the shortcut or executable, go to compatibility mode and run it as Windows 7 or one of the earlier versions of Windows."}
{"product_id": "B008M4BNQG", "context": "does this head set also work with a PC", "response": "Yes, it works with PC. The chat volume wheel controls the sound from the computer. All you have to do is plug in the headset, the drivers automatically install. Just make sure that the headset is set to be your default device in the sound settings."}
{"product_id": "B007SO6USW", "context": "will this work with a wall charger for a phone like say an htc one?", "response": "Not sure but  it never  hurt to try it"}
{"product_id": "B00D9EPI38", "context": "do you have to pay for internet?", "response": "Yes, you can share the existing network to xbox, but most of the features are blocked if you don't have gold membership."}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "It certainly is a hassle to set up!!! Thank you Cobus for your directions!!!!"}
{"product_id": "B00HGLLRV2", "context": "which is the best standard edition or limited edition?", "response": "If you're buying used, the limited edition will most likely be useless as any DLC codes will have been redeemed already. If there is no price difference, I would say get the limited edition for the heck of it. As far as the actual game goes though, there is no difference that I'm aware of."}
{"product_id": "B00475AYUA", "context": "If we get a download code, where do we download it?  Don't want to use steam if possible?", "response": "When I bought it I auto installed it on my pc. I don't remember a code.  Come to think of it I've put it on 3 pc's and don't remember a code.  So I guess my answer is I don't know."}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "No you can not. It has just enough room for the vita.  I would still get this to protect your system."}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "The slo-mo piddle pad feature is AWESOME.  My Level 12 Yorkie was about to go yellow alert on my girlfriend's white rug when I slo-moed (down + left trigger) a piddle pad in there just in time.  Gives you a real feel for preventing dog urine stains in a new, unique way!"}
{"product_id": "B00CPKUV9I", "context": "what is steam drm ?", "response": "Digital Restrictions Management is technology that controls what you can do with the digital media and devices you own. When a program doesn't let you share a song, read an ebook on another device, or play a single-player game without an internet connection, you are being restricted by DRM."}
{"product_id": "B008XHCLFO", "context": "Can the top part be taken off? I simply want the grips not the whole protection part (though that isn't bad, but i think it's ugly)", "response": "This comes in two pieces. You can take the top part off."}
{"product_id": "B00EWEHI5K", "context": "Is it compatible with mac ?", "response": "I don't think so"}
{"product_id": "B00FYMTUQY", "context": "I have a tv mounted above my fireplace. Is 7' off the ground too high for this sensor to be placed?", "response": "You can point the mount down if the kinect is not catching everything. You should be ok"}
{"product_id": "B00B3FIXJQ", "context": "How do u use this control", "response": "U don't don't hold LT and sync button it LT and and back button"}
{"product_id": "B00FXOP1MU", "context": "Is this dual voltage, or do you need a voltage converter if you need to charge it outside the US?", "response": "No, its single, you wi need a converter"}
{"product_id": "B00FM5IY0Q", "context": "I havent played the prior Dead Rising's. Should I play them for any story knowledge or can I jump right into this game?", "response": "You can jump right into the game. It contains start-up tutorial assistance as the story begins. It also fills you in on the back-story along the way. Of course, the previous games are great fun, too - and are recommended just for the fun."}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "It's 1 in 1 out"}
{"product_id": "B00FXOP1JI", "context": "Is it touch screen display?", "response": "Bottom screen of the Nintendo 3DS XL is indeed touchscreen top screen is not"}
{"product_id": "B00F27JGVA", "context": "Is this PS Vita card in sealed original packaging?", "response": "We received in original packaging and it has worked GREAT"}
{"product_id": "B00IYWV852", "context": "I was thinking about buying a couple of this game as gifts, it won't be an issue will it? The recipients won't have any problem using the game codes?", "response": "No issues. I created an account and redeemed the code (somehow similar to Steam)The keys are region locked."}
{"product_id": "B00E8JZILA", "context": "What is the sexual content in this game?", "response": "There is a very brief scene in the game where you see a woman button her shirt and a man zip up his pants in an attempt to imply that she was trading sexual favors for medical supplies. There is no nudity."}
{"product_id": "B00FLLFJ68", "context": "Is there a way to hang it or attach it to the wall?", "response": "I would not recommend it. Thank you for asking."}
{"product_id": "B000BU0F5Y", "context": "Is it a analog stick or a 4/8 way hat. also do you know what type of keyboard switches do it use Mx, alps or membrane. thanks", "response": "i believe its an 8 way hat button but i dont use it much and i think its a membrane type keyboard...if you want a really good controller i suggest you spend the extra money and go with the nostromo n52...its alot better"}
{"product_id": "B00BCEK2LA", "context": "Does this have adjustable weights? If not does it feel too heavy or too light in your opinion. Does this come with a warranty in case it breaks?", "response": "No adjustable weights on the G400s, you'd have to go up to the G500 line to get that unless you're comfortable modding the G400s. For me, it's the perfect weight--but you might have an entirely different opinion, so it's hard to say. Logitech provides a 3-year limited hardware warranty as detailed here: http://www.logitech.com/en-us/footer/terms-of-use?id=3101&wt.mc;_id=usym_redirect_/warranty"}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "Mine was a normal QWERTY keyboard layout. Awesome keyboard BTW."}
{"product_id": "B0072HYRNK", "context": "Does it work with PS4?", "response": "Yes the Move Motion Controller does work on the PS4 and PS3. Tested with Just Dance on the PS4"}
{"product_id": "B003R783IY", "context": "Do you need a separate wireless steering wheel?", "response": "I play with the regular xbox controller and I love it. Why would you need a steering wheel? Just use your normal controller..."}
{"product_id": "B00FEOR4MY", "context": "Will the DS fit in this?", "response": "Yes, DS fits as well (my kids have both DS and 2DS) And use the same case."}
{"product_id": "B00GD962OA", "context": "Our Wii just died on us & we have a lot of games for it.  Are the Wii games compatible with the Wii U console?", "response": "Yes of course. I cant remember any wii games cant play on wiiu,Btw get mario kart bundle better"}
{"product_id": "B00004XRBB", "context": "does it work on Windows 7?", "response": "Works great on Windows 7"}
{"product_id": "B0083H4NG4", "context": "Hi, i dont understood if thisa mouse had wheel tilting or not, i rly hope there is no tilt wheel function. i hate it on my precision mx.. if i need to", "response": "no, this mouse wheel does not tilt"}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "is Corel wordperfect suite 8 compatible with windows 10"}
{"product_id": "B000BD9PBQ", "context": "Palm Tungsten E2 Compatiblility Is this item good for a Palm Tungsten E2?I need to know before ordering it.Thank you", "response": "did yu ever find out?"}
{"product_id": "B00F8W9SWQ", "context": "how many keys can you press simultaneously and have the correct response? I ask this specifically for gaming.", "response": "its a little weird to be honest. I am able to push up to 3 buttons if i remember right, however i cant be pushing any of the F(1-12) keys before doing so. its not the best keyboard in terms of function, but it is a nice one for when you find yourself without a light to see with."}
{"product_id": "B00BMFIXOW", "context": "I played AS3 It was my first AS game. I loved every thing about it, it litterly amezed me. I Played it on Wii U. do you recommend BF on PS4 or Wii U?", "response": "The PS4 is more powerful than the WiiU but if you like the gamepad better it doesn't really matter"}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "I was never offered a warranty I could buy with this mouse. There is the one year standard warranty by the company of the Razor Naga mouse. The other Razor Naga 2014, I was offered a warranty I could buy with the mouse separately."}
{"product_id": "B00BXE4W4C", "context": "How do I get the pic axe in the shed....it won't open...is there a patch for this game?  Someone else has the same problem!", "response": "I used the walkthrough when I had trouble. It does not cost anything to use."}
{"product_id": "B00FB4BXGA", "context": "Anyone having the problem with key malfunctioning? I only use the arrow keys for driving & without touching a right or left car will suddenly turn.", "response": "yes. it happens to me too rarely though. I suspect is the software and not the keyboard it self. I also use the arrows to drive."}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "The one that I purchased you only had to open the side panel on the right back side(I think that's the side its on) or the panel may slide, the slip the hard drive in......I needed no cables"}
{"product_id": "B00D96BNGM", "context": "I have had this headset for almost a year now, but all of a sudden i cannot talk through my mic, is something broken??", "response": "hi lauren have you tried updating the softwear for the headset ??? its avalible on turtle beach website if you download the headset softwear to your pc then run it and plug you headset into your pc and there should be an update if your stuck add me on xbox.  s cooper 1987"}
{"product_id": "B00J6DLPLK", "context": "What is required to get Branch A in Drakengard 3?", "response": "You must purchase all weapons in the game"}
{"product_id": "B00GQTZ8TM", "context": "I bought one a while ago for my brother and it didn't come with a charger. I'm assuming that this one does, correct?", "response": "This 2DS comes with a grey wall charger, stylus, directions and a preloaded game.  Basically everything you need to start playing right out of the box."}
{"product_id": "B00JF2FFR2", "context": "What type of Grip? Palm, Fingertip, or Claw?", "response": "I use the Palm grip on this. Well I guess technically a hybrid palm since I use 3 fingers (Index - Left Click, Middle - Scroll, Ring Right Click)."}
{"product_id": "B009Q8PP16", "context": "does this controller use sync to change mode or is there a separate button thanks", "response": "You use the sync button real easy."}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the Wii?", "response": "it works on all gaming systems."}
{"product_id": "B00HPU96FI", "context": "I know that light gun games do not work with HDTV's. But...becase this is connected through VGA has anyone tried to see if light gun games work?", "response": "light guns will not work on newer tvs. wish there was a way to get them to work."}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "I have only ever played offline; as far as I know you can only download the game (no disk copy)"}
{"product_id": "B000TLU67W", "context": "can it play the ps1 games like the ps2 original did?", "response": "I'm not sure...will ask grandkids."}
{"product_id": "B002B9XB0E", "context": "can this work on Windows 8 and is this only intended to be used for the SNES emulator or can I play other games I have on my pc via Steam?", "response": "I can confirm that it works on windows 8, and if you use a program like joy to key you can very easily make it work with steam. My only complaint is that one of the buttons began sticking after only a few hours."}
{"product_id": "B00B3PDH5G", "context": "If connected to PS4 with a cable, can you control chat volume and Mute by button which on the headset?", "response": "The chat volume +/- are mute button are all located on the side of the headset.  So, to answer your question, yes."}
{"product_id": "B00H8NS1K8", "context": "with the open back, I'm concerned about audio bleed into the mic. can anyone comment?", "response": "My friends haven't noticed anything during gaming sessions. There was this one time I had extremely loud volume when my friend was able to hear himself, but that wasn't a comfortable volume level anyways. Note that I don't even have any echoing or noise cancellation activated, so it's probably not going to be any problem."}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "it should as long as it has about 4-5 inches in clearance between the front of the TV and the wall"}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "I put the Wii remote in my shorts pocket and it tracked the moves fine, without the belt."}
{"product_id": "B00ENFVS5Y", "context": "How is this wheel mounted? Example I have the  Microsoft 360 Wheel & it has a clamp to attach it to a desk.", "response": "It clamps to the desk or table. Just like the 360 wheel."}
{"product_id": "B008NMPSEU", "context": "What games are on the disk?", "response": "The games on the disk are Big Bad Spins, Goddess of the Sea, Red, Spiderweb, Wild Stallions, Gnaughty Gnomes, Luckiest Catch, Sparkle, Tumtum, Wild Virus, Four Seasons, Girl's Night Out, Stone Age Spins, Treasures of the Pharaohs, Water World, Dueces Wild, Jacks or Better, Double Premium Poker, Triple Premium Poker and Jokers Wild.  Hope this helps."}
{"product_id": "B00D3RBYM0", "context": "I see there is a new version of this game which is more expensive.  I wanted to get this for my 6 year old, would the original version be sufficient?", "response": "I think the original would be ok as long as your 6 year old isn't going to be devastated by the loss of an earned vehicle. The open road and easy controls do provide an excellent means of entertainment."}
{"product_id": "B006POYBUA", "context": "Does it works with the white Xbox 360 (non slim)?", "response": "Yes, my xbox 360 is one of the original white ones, and it works fine."}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Yes..  32 bit only though."}
{"product_id": "B0057SDCLY", "context": "Will this headset plug into a cordless phone handset.  Does it have a 2.5mm plug", "response": "Hello, This headset comes equipped with an internal 3.5mm audio jack so you can connect a 3.5 to 3.5 cable or a xbox 360 chat cable which is 3.5 to 2.5mm"}
{"product_id": "B001E93IWI", "context": "How do you use the headset part, it doesn't work i can't hear anything", "response": "It has a pretty simple interface you just move the slider at the base of the jack to adjust volume if that doesnt work go to the xbox guide go to settings, preferences, then voice and check your volume settings"}
{"product_id": "B0038MVFYC", "context": "Is it possible to catch the following?:    Tympole,Venipede,Chimchar,  Please respond and tell me if I can catch these pokemon. Thanks!", "response": "You can get Chimchar if you trade with someone who has it in Diamond, Pearl, or Platinum.  You cannot get the other two in Heart Gold or Soul Silver.  They are in Black and White or later only."}
{"product_id": "B004GINKNQ", "context": "How do I install the 60gb hard disk drive for Xbox 360?:", "response": "make sure that your system is a 360 slim. look on the right side of the system, near the back is a panel with a button you push, popping out a plate and revealing the slot in which you install the hard drive in"}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "The DRM says - Steam DRM - , so YES , this is a steam version , you have a code , you can activate at STEAM !"}
{"product_id": "B00HEX8TA4", "context": "Can this just be a plug and play?", "response": "Yes. It's an awesome product!"}
{"product_id": "B00EVWZHLK", "context": "Must I install the games or can I directly play them from disc?", "response": "Each game is on a different disc, 3 discs in total, so no."}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "It will be sent by email.  Should be good as long as you are using it on a US account."}
{"product_id": "B0087ZMAUS", "context": "Is this a USB headset, or does it have 2 x 3.5mm TRS connectors (Audio and Microphone)?", "response": "It is a USB headset with 3.5mm connectors for audio and mic."}
{"product_id": "B003NSLGW2", "context": "Will these still fit snugly and not slip off easily if the original joystick cover has completely come off?", "response": "No. At least not for an Xbox 360 controller. If the original joystick cover has torn completely off, these fit fairly loosely and rub against the analog stick housing and make the stick harder to move."}
{"product_id": "B00DVEJA7G", "context": "Odd question, I use Spotify instead of iTunes on my iPod Touch...is this ok or must music run through iTunes?", "response": "These hook up with Bluetooth and will play anything including telephone conversations and they also have a microphone. It doesn't matter what you play through them."}
{"product_id": "B00CJD4HD2", "context": "Odd question but how loud are the button clicks for this mouse? I.e. would it annoy anyone sleeping in the same room as you? Or one room over?", "response": "The mouse is very quiet, however if you are running Win7 64 bit I would advise getting another mouse.  The scroll wheel quits and stutters endlessly which Logitech had no fix other than try to reinstall software and try other usb ports."}
{"product_id": "B00FQFFPZO", "context": "do you need the steering wheel and foot controls to operate this game?", "response": "It's a fun game just very hard"}
{"product_id": "B00CHYOP80", "context": "is the material on the earcups synthetic leather?", "response": "Yes it was - they were returned because of the mic"}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "Yes we use it it navigate all aspect of the PS3."}
{"product_id": "B001BZ2F56", "context": "Does this work with a new windows 8 computer? Would like to know before i buy it.", "response": "No problems at all. Just be sure you have an optical drive (CD, DVDS, or BD). You can't run the game without the disc in the drive."}
{"product_id": "B002YVD3KM", "context": "Good for GBA emulation?", "response": "Yes, perfect for just that. We specifically use it for GBA, NES, SNES, & SEGA roms."}
{"product_id": "B00BGGIWZM", "context": "I just downloaded sims 3 Island paradise but I cannot run it because it says I need to download Sims 3 first. Does any one know if this is the case?", "response": "Island Paradise is an expansion pack which means you need to install the base game (Sims 3) first."}
{"product_id": "B002J9GDXI", "context": "Hey guys I was wondering how quiet this mouse is? Are the clicks very loud at night? thx", "response": "You can hear the clicks with this mouse. I use headphones, so I don't hear it.  Hope this helps!"}
{"product_id": "B00BI83EVU", "context": "I was under the impression that games would be able to be delivered to arrive by the release date.  Is this correct?", "response": "i pre-ordered and mine is on the truck 'out for delivery'."}
{"product_id": "B00EF1OGOG", "context": "Can you charge the battery and a phone simultaneously by connecting them in series?", "response": "With the battery pack being charge from a wall socket it would not charge my phone. Once it was unplugged from the wall it started charging the phone."}
{"product_id": "B0002GTXDM", "context": "Is this compatible with the DS lite?", "response": "No. It plugs into the same port as a wired GBA link cable, so it only works with Game Boy Advance, Game Boy Advance SP and Game Boy Player. If you want to access multiplayer functions of Game Boy Advance games, you'll need those systems or a Game Boy Micro with a special adaptor."}
{"product_id": "B002I0HJG8", "context": "Does the PC download version come with the codes? or do you actually have to purchase the physical copy which requires waiting for the shipping?", "response": "I believe that the code in question only works with the physical copy, but if u are really in a hurry u could try and get the vendor to send you the code by email while you wait for the said physical copy.Hope it enlights you."}
{"product_id": "B00ARD5410", "context": "Does the scroll wheel scroll left & right?", "response": "Unfortunately, it doesn't. It can only be scrolled up or down, just like other typical mouse."}
{"product_id": "B00CXCCH1I", "context": "Can I play this game with someone else not online? like with a second controller (ex. Fifa, COD, NHL)", "response": "Yes its two players locally"}
{"product_id": "B0058GMO0A", "context": "will this work on windows 7.1", "response": "My wife is running it on Windows 7, so far no problems"}
{"product_id": "B005VA5D24", "context": "Do you need a cable to plug it in to the Xbox, or does it plug in directly?", "response": "No cable needed.  There is a hidden compartment,  where the hard drive slides in and sets into place. Lay the xbox 360 flat and it will be on the right side, there is a tab to push in, this will allow the side to pop out exposing the hard drive slot."}
{"product_id": "B00IAVDPSA", "context": "Can you use the remote to change the source input on your receiver?", "response": "No, not that I am aware of.  And with the lack of CEC-HDMI capability, it is doubtful.  The current IR blaster support for receivers is very basic."}
{"product_id": "B000H1V56U", "context": "Does this fan have a four pin connection?", "response": "It comes with two connectors...1- for early model 360s2- for the later years before the slims came out"}
{"product_id": "B00C2B2Y9A", "context": "What's the durability? I am very careful with my electronics. How long do these last?", "response": "I haven't had my set for a long time, but I use them a lot. Seem durable to me"}
{"product_id": "B009AFLXZM", "context": "does it work with just dance2015", "response": "No.  Just Dance is not a singing game.  Players just try to match the dance moves of the on screen dancers.  The microphones work with The Voice.  Up to 7 players can play at once.  Even though the game comes with one microphone, you can add more."}
{"product_id": "B000BD1AFA", "context": "Does this work on windows vista?", "response": "I don't know to be honest but vista is enough of an advanced system to take most of the remote games out there... but I'm a natural already played the game naturally. It shouldn't be a problem."}
{"product_id": "B00IYWV852", "context": "Is the extra 20 buck for the deluxe edition of the game worth it?", "response": "I think it is but I am big into the housing and it comes with some neat stuff for it. If you're into cosmetics then you should pick it up"}
{"product_id": "B00BGA9V2Q", "context": "does this version include the crusader class", "response": "No it does not you should just get reaper of souls version it's almost out"}
{"product_id": "B00DE2W4PK", "context": "Is the ps plus code they provide good for a free year subscription?", "response": "I love PlayStation Plus, I always will subscribe and I love everything having to do with SONY"}
{"product_id": "B00BGHUS58", "context": "Is the game worth it to buy it new, or is used a better deal? Also, does it have any istallation issues?", "response": "Hi Julian, I bought my new for two reasons first the new cost about as much as a used one and second if u buy new u are getting a warrenty I had no probs w/ the installation it's fast and simple"}
{"product_id": "B0005PHYPO", "context": "Will this load on Windows 7?", "response": "I didn't use Windows 7, so I don't know. I know that when I used it on versions earlier than that, it sometimes crashed and didn't work at all. Best way to find out is to try, but I can offer no help at all."}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "no, go get BF4 on PC instead, best game imho !"}
{"product_id": "B004L6C6BK", "context": "Is this the 2013 version because the review pictures show it as a 2011 version?", "response": "This is the 2013 version of the Astro Mixamp Pro"}
{"product_id": "B0042J7I3C", "context": "How long is the cord?", "response": "Two feet. It plugs directly into your controller so it's not meant to be long."}
{"product_id": "B00DJYK8XS", "context": "How does this game compare to the Zumba workout DVDs? If you're a total beginner, which would you recommend trying first?", "response": "They all take practice to learn the dance/routine. I like the fact that it tells you how many songs left. \"I can do 4 more\""}
{"product_id": "B00IVHQ0KI", "context": "can i drift on that in forza horizon 2 ?", "response": "Yes, providing you use a setup that allow you to use the E brake. Some guys can do it without using  the E brake so I guess it is really up to the individuals ability."}
{"product_id": "B005S0KHIC", "context": "does this work with windows 8?", "response": "Of course. It's not like it's a piece of legacy equipment. It's a mouse."}
{"product_id": "B00DLDEKOK", "context": "Can you hear the game sounds rather than using tv volume? I am new to this and hope gran kids can play quietly", "response": "The game sounds still come from the TV. The only thing you can hear are friends your playing with in the headset"}
{"product_id": "B005EQE0YM", "context": "Do these plug into the 360 controller or into the xbox 360 itself?", "response": "It plugs into both the Controller and the Xbox these Headphones have a lot of wires but for the price and sound quality they are hard to beat,As long as you don't mind a lot of wires."}
{"product_id": "B00D2EGWDA", "context": "is nuketown on it", "response": "Yes, the Nuketown 2025 map was installed on mine. If you don't get it, you can download it for free from the Playstation Store."}
{"product_id": "B007TFOO6K", "context": "I wanted to find out, is the blue switch keyboard BLUE led? they are showing red, it doesn't say on the description.", "response": "This keyboard only comes with Red LED's the switch is only indicative of the Cherry Brand."}
{"product_id": "B00BCEK2LU", "context": "Can you change the color and/or turn off the key lights for specific keys or is it all or nothing? ie. only light up WASD and a few others in games?", "response": "It's all or nothingThe software is downloaded from the logitech site and you can choose any shade of color you wantThe keys are not individually colored, it's the whole keyboard and display or nothing, I still find it pretty cool.WASD keys are light gray as are the arrow keys."}
{"product_id": "B004W1IX1G", "context": "is it good to buy used wii games or not?", "response": "We have only bought a used controller from a store called Game Stop and had no problems.  I have not bought used games from individuals.  If it is on ebay or Amazon, they usually have a good return policy.  Just be sure to read it carefully before you purchase."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "Ps3 to ps4 only, so if u order the ps3 version, u get the ps4 version for free with the upgrade option and u can carry over all your ps3 stats and characters too"}
{"product_id": "B005BLAJRC", "context": "Do we need a \"joystick\" type device or will the games work with just a mouse?", "response": "I no longer have this puzzle and no you don't need a \"joystick\"."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "They take 2 double a batteries."}
{"product_id": "B00EM5UFEK", "context": "i have xbox gold live but still cant log on to play garden war fare", "response": "did your xbox fully download the software?"}
{"product_id": "B00CX8VY4S", "context": "Can you jump in this game?", "response": "Nope, but why would you? It's not a FPS where jumping is strategy to avoid being shot. If jumping is all you want then Titanfall is the game for you."}
{"product_id": "B00EPZ8POY", "context": "will this work on ntsc ps3", "response": "Yes it should my game still works fine"}
{"product_id": "B00BCEK2LU", "context": "How does the backlighting compare to the venerable G11? Dimmer, brighter, same?", "response": "yes, it is brighter but you also have different colors to choose from as well."}
{"product_id": "B008YA9BVC", "context": "Can you actually hear audio? From videos and even the game? or we can only use this to chat?", "response": "Yeah u can hear in the game and video or use it with ur phone"}
{"product_id": "B000O5DY0E", "context": "how do u get these games to work on windows 7 ...", "response": "I just installed it and it works fine."}
{"product_id": "B00FATRKOK", "context": "Do you need internet connection to use xBox 360?", "response": "No you do not need it unless you want Xbox live."}
{"product_id": "B00D96BNGM", "context": "Is there a port mic jack wher I can plug my mp3 up to it and play music while I game..Thanks??", "response": "yes there is a port mic jack on it so you can listen to music while you game. There is also Bluetooth if you wanted to use that to listen to music through your phone."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "There is no noise whatsoever. I have good hearing and I've asked a few other people that were over last night and can hear nothing."}
{"product_id": "B006JKARP8", "context": "Can this be used to charge other devices via USB?", "response": "absolutely! Just check The needed voltage and the charger's maximum. But it will work with almost everything"}
{"product_id": "B006IOAHPK", "context": "this version is censored?? thanks", "response": "Nope, I anal probed and did abortion on Randy way too many times"}
{"product_id": "B004QRKWLA", "context": "does it work with steam games?", "response": "it works with games that say they have controller support if you want to use it with a game that does not you can set what the buttons do with programs like xpadder"}
{"product_id": "B00ECOBFA4", "context": "- Does this game have multiplayer mode?", "response": "yes  it does"}
{"product_id": "B00BMFIXEW", "context": "can i play with the wii plus control like a sword?? i mean if i have to move  like if i were figthing??", "response": "No. It only uses the game pad and the Wii U Pro controller. Unfortunately most third party publishers don't make use of Wii Remotes any more. They also don't use Move on Playstation or Kinect on Xbox unless they make a game around Wii motes, Move or Kinect."}
{"product_id": "B003O6E986", "context": "would this be appropriate for younger kids too? Does it use trashy animation or bikini girls in the game? I am looking for a fun family friendly game", "response": "Nothing dirty here. But it is complicated for most youngsters."}
{"product_id": "B00B67ZTUW", "context": "How does this series compare to final fantasy?", "response": "Far better. Final fantasy is a dying breed, and the tales series is perfect in every way final fantasy isn't."}
{"product_id": "B003ESDQW4", "context": "Is Black cat in this game?", "response": "No she is in Edge Of Time"}
{"product_id": "B001GROEEO", "context": "delivery is online, for email?", "response": "No, delivery is through the postal system. It is a physical card with a code on it. The picture is an actual picture of the card."}
{"product_id": "B003O6EE4U", "context": "Is this the slim model? How do I tell if my xbox, which came in a box just like this, is slim or not? Thanks!", "response": "I googled 'xbox slimline' and it shows a silver model that is slimmer. It looks to be approximately 3/4 slimmer as to the one shown on this box. That is the same one I have that you have. According to the photo I found. Just google it."}
{"product_id": "B007W8S2MG", "context": "is it region free?", "response": "It's the English version of the game. So, yes."}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "I don't know why it says $90 atm. They were around $5 when I bought them through amazon. They are worth the $5 but not $90 lol."}
{"product_id": "B007SO6USW", "context": "Does it work with the ps3 slim?", "response": "yes I have one"}
{"product_id": "B00EV4O7B4", "context": "Does this come with X & Y games as well as the 3DS?", "response": "No. Its just the console.  Games are separate"}
{"product_id": "B002I0IIPY", "context": "What controllers the sonic colors use", "response": "The regular hand held controllers."}
{"product_id": "B00DJYTGYU", "context": "can this controller be used for all ps3 games", "response": "Yes it can be used for all controller. Be warn That the joysticks are small. And the triggers are super sentive so you have to push all the way down on them."}
{"product_id": "B009M72E5Q", "context": "My friend has a Wii that is 4 or 5 years old.  Would her remote and nunchuck work on this system if I bought it?  Thanks!!", "response": "Yes Nintendo did not change compatibility with wii models."}
{"product_id": "B00DRKJBC8", "context": "Is this the whole game or just a code for items?", "response": "It's the entire game."}
{"product_id": "B0080RAT42", "context": "I would like to know if there is any lag? I play Ultra Street Fighter IV and a game like that requires quick response time.", "response": "Hey, Sorry for the long delay, your email was in a messy inbox ;) There is no lag at all. We played few games and none of us complained."}
{"product_id": "B008XHCLFO", "context": "I'm sure it won't but will this fit with a plastic case already around a 3DS XL? Please only answer if you know. Thank you.", "response": "The Dreamgear fits skin-tight so, no, it won't fit over a protective plastic case without stretching too much and possibly tearing."}
{"product_id": "B00FYIXMHQ", "context": "Does the game used $ 83 brings beanie of Delsin?", "response": "It should, it would be rude for the seller not to include it. I got my copy at gamestop. I'd check there and other places before buying it used."}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "Hey I had the same thing and I was worried about opening it, but it's started in English and has a ton of language options which was cool cause I can work on my Spanish while playing around"}
{"product_id": "B00D4WTO1M", "context": "Does this game includes the season pass to download the 4 new maps?", "response": "No. You must be able to buy the season pass seperatley or buy the dlc packs individually. There 15$ a piece. They all have 4 maps and a new extinction map. A couple come with guns. I bought this and had to buy them as well."}
{"product_id": "B00BFOEY3Y", "context": "does the scroll wheel have a page forward, page back left and right thing?", "response": "Yes, the scroll wheel allows you to scroll up/down and left/right"}
{"product_id": "B000K9Q5NW", "context": "Do you have to use two feet to gas/brake because there's a post going down the middle?", "response": "I had to use both feet.  Unless you find a way to turn it more one way than the other."}
{"product_id": "B00475AYUA", "context": "is there a way to get this installed through steam?", "response": "I have no idea."}
{"product_id": "B005Q1YA5O", "context": "Is this the one that includes the base game sims 3 and sims 3 pets? I saw a cover just like this but this doesn't say it includes both", "response": "No. This is just an expansion pack. You still need the base game for this to work."}
{"product_id": "B001GROEEO", "context": "May I use it in Guatemala?", "response": "The new PSN prepaid game cards only need a valid Amazon Account and your email address. You buy the card on line via your Amazon Account and you will get the code in your email address, regardless where you are."}
{"product_id": "B00EV4O7B4", "context": "Which game cartridges will play on this ds??  Will ds xl work?", "response": "This gaming system can play DS games as well as 3DS games.  All DS games should work in this system."}
{"product_id": "B00EH5V1IO", "context": "Can one headphone be removed to leave one ear open while using the headphones?", "response": "You could, but you'll have problems keeping the headset on properly. I usually just put the cup behind my ear if I want to keep one uncovered."}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "Yes, MGS3; Snake Eater is on there. It's a great game, too."}
{"product_id": "B005M0KSIM", "context": "I am thinking of buying the physical copy (since the pc download feature seems unavailable.) If i get the physical copy can i use it on steam?", "response": "ON the occasions Steam is available, and after Steam spends five minutes or so loading 'updates' and various malware. Avoid this game."}
{"product_id": "B00BZOBE78", "context": "Can I use this without redeeming it on steam? Will it still unlock on my local computer?", "response": "It is a download and because the game uses steam to save to your computer, you will need to use steam in order to download it. Sorry if this is not a good thing for you:("}
{"product_id": "B00G6YJ60E", "context": "Does the PC version of the game support manual saves or is it checkpoint only?", "response": "You can click to save, but I don't believe it will save it right there, I do believe it will just return you to the checkpoint. I could be wrong though, I usually just use the checkpoints haha"}
{"product_id": "B000ND3XXA", "context": "I have a macbook and heard this would work on a mac...it has a mini disk. does not work. is there a driver i can install/donwload?", "response": "yes. my computer actually auto-downloaded the drivers(windows, sorry). google 3 in 1 magic joy box drivers and you should get there."}
{"product_id": "B003O6JJKY", "context": "wait does this have 250gb on it", "response": "Yes it does although roughly 30gb or so is used for the xbox operating system, etc"}
{"product_id": "B004RMK4P8", "context": "MAN IT DOESN WORK THE CODE", "response": "It works with my USA PSN account"}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "Yea it's ok it's very rare for it to have sexual or language scenes plus it shows historical events of the pirate era"}
{"product_id": "B0002DKTY2", "context": "will this work with windows 7?", "response": "I DON'T KNOW               BUT IT DOES NOT WORK WITH WINDOWS 8"}
{"product_id": "B008M4BNQG", "context": "How long is the Cord on this Headset, I sit about 10 feet away from My TV ..is it long enough to reach 10ft??", "response": "Just measured it and it's a bit over 12 feet so you're good to go."}
{"product_id": "B00CPS59CE", "context": "Would it work on a Xbox One?", "response": "I think you need to buy an Xbox one adapter. I only used this for my xbox 360."}
{"product_id": "B000YMQGWU", "context": "Would this work with a Macbook Air?", "response": "I do not know"}
{"product_id": "B00BV72X1U", "context": "How can I extend cable length? Standard 2.0 usb extension won't work. Won't let controller connect, only when plugged direct", "response": "Make sure you have a proper cable with a repeater on it. I am a side photographer and get my cables from tether tools on amazon. I'm able to use it and keep the adapter high on my house for best conection."}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "You mean the gifts inside? The product came with a lot of gifts such as USB flash drive, phone decorative stickers, and so on. It also contained a white rubber fish, but I didn't know how could it be used."}
{"product_id": "B002L93F0A", "context": "Am I right when I see that there are two (2) controlers for $12.50 price?", "response": "Yes, there are two of them for that price!"}
{"product_id": "B00DC7O77A", "context": "Is this game easier or harder than the wii's Donkey Kong?", "response": "I personally think its about the same maybe a little more easy. you get to choose between more characters to utilize their special powers. But all in all its another fun donkey kong game. I really like it."}
{"product_id": "B00E1L78N6", "context": "Is Polk Audio 4Shot Headphone - Black - Xbox One wireless?", "response": "No it is not. It connects to the Xbox Stereo headset adapter. It is however, only wired by a small headphone jack and no power cables or batteries."}
{"product_id": "B00IVHQ0KI", "context": "will this clamp to a desk?", "response": "Yes, it does clamp to a desk. It's pretty easy after you figure out how you need to do it. It's very stable as well."}
{"product_id": "B00FYAQUPU", "context": "Can you buy the dark characters seperate from the starter pack? I have the Swap Force game and portal but want to buy the dark characters?", "response": "I haven't seen any of the dark characters sold separately."}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "It does work but you will need to purchase the xbox one chat adapter to be able to use the microphone."}
{"product_id": "B002J9GDXI", "context": "How long is the cable? Is it braided?", "response": "The cable is 2 meters (6.6 ft) long, and is braided.  It looks nice."}
{"product_id": "B008SBZF2Q", "context": "WIll this work with xbox?", "response": "My kids use it on their ps3 but I believe they work with xbox and wii. You just need the right portal for your console"}
{"product_id": "B00EOI2MRS", "context": "Does the controller have the gyroscope feature?", "response": "Not sure about that unless you mean the two thumb controllers that rotate sorta like a gyroscope. It also has a turbo feature."}
