{"product_id": "B002I0JJ2U", "context": "does this game still work and can you play it on windows", "response": "The answer is yes and no. You can you use that disc to download the new version of the game, but the classic version no longer exists.I made a mistake before and said you cannot use the code that comes with it to play, but you can. You also get the free thirty day trial."}
{"product_id": "B0065NP6NC", "context": "Do i need a Microsoft HDD to install this or can I install to the flash drives I use for extra storage?", "response": "Its best to install it on the hard drive"}
{"product_id": "B00I4BGNVM", "context": "can I only use the code on steam or can I enter it on the ESO website? How big is the download size for this game?", "response": "you can use the code on the ESO website or steamthe game requires 75 gb free space on HDD to unpack and installand my game takes up 41.6 gb total when finished"}
{"product_id": "B0073QM45I", "context": "This cable works without having a battery? I mean, It will charge my controller without a battery inside?", "response": "Then why did I buy it? And how would it charger your controller without batteries it doesn't make sense I want my money back full refund"}
{"product_id": "B009S4JZKK", "context": "Does this work in Windows 8?", "response": "Yes, I have windows 8 and it works fine. Good luck"}
{"product_id": "B00A378L10", "context": "There have been people having problems with which cherry mx switch they ordered. Did the people that ordered brown cherry mx keys receive that?", "response": "No problems with mine -yet-!"}
{"product_id": "B003O6CBIG", "context": "will online work or do i have to buy it myself, because online is the best part of Cod games", "response": "sure, Online will work."}
{"product_id": "B00EI4V3FU", "context": "Can you hear game sound through this headset, or do I still have to have my TV volume turned up?", "response": "You can hear game sound through this headset, but the sound depends on your tv volume I believe. Like if your tv is muted, there is no sound."}
{"product_id": "B003JVF728", "context": "Does this game have bad reviews because of physical problems, or are people just one starring this because they don't  like the in game features?", "response": "Not sure about others. I like it for the action scenarios. The story is not all that well done."}
{"product_id": "B002AQNT96", "context": "is this redeemable on steam or do i just get the game and thats it i boot it from the disk", "response": "It boots from the disk, you don't need steam to play this game."}
{"product_id": "B0009VXBAQ", "context": "does this wii model read gamecube games?", "response": "yes it does. if the wii comes with gamecube controller ports on the top flaps and gamecube memory card slots, then it definitely can read gamecube games"}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "Its a one stage trigger."}
{"product_id": "B000A0IBLK", "context": "are you able to plat with 360?", "response": "No, you'll need an original Xbox to play it"}
{"product_id": "B002I0IIPY", "context": "is this a two player game?", "response": "The main game is single player.  However there are special stages that can be played two player outside the main game.  These two player stages are unlocked in single player, and consist of side scrolling platforming that gets challenging fast."}
{"product_id": "B0002FGFHU", "context": "Hi, I am from Germany. Is this the US Version? I have the German an UK version, but theres no Honda Civic. Is here on this the Honda?", "response": "Yes, this is the US version. Yes, there is Hondas and Acuras in this version!"}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "Yes it does it works for every call of duty"}
{"product_id": "B0057SDCLY", "context": "Can I hook up the Tritton Trigger Headset to my PC?", "response": "I haven't tried, but I believe so... it uses USB for power, and then red & white RCAs for signal... if your soundcard has RCA outs, or a converter, you should be fine..."}
{"product_id": "B002I0H2G0", "context": "can it play two players", "response": "nope, one player only"}
{"product_id": "B00CTKHXFO", "context": "I see it has MGS 3 HD. Is that snake eater or subsistence?", "response": "I believe just Snake Eater."}
{"product_id": "B00002SANH", "context": "This game will not install because I have a 64 bit processor and this game is for a 32 bit processor only. How can I install this game on my computer?", "response": "There is a solution for 64bit processors that works perfectly. You can find the tutorial here. It only involves the disc and editing a single file. https://www.youtube.com/watch?v=QKan-FbCfVM"}
{"product_id": "B006SVUQNQ", "context": "My current hard drive keeps saving corrupt data and slowing the xbox down, for some reason my xbox wont read any game that has the corrupt data on it. Will this happen with this hard drive?", "response": "I've been using this drive for months and have had no issues with corrupt data.  How can you know the data is corrupt?"}
{"product_id": "B00FM5IY38", "context": "Is there any sexual content or obsene language in this game.", "response": "not as far as I can tell"}
{"product_id": "B00F8W9SWQ", "context": "Is this a USB Keyboard?", "response": "Yes it is a USB keyboard."}
{"product_id": "B00AK4QB22", "context": "The game comes in multilanguage? I want it in Spanish?", "response": "That's nice for you.I want Moody 1 but you don't get everything you want all the time,so you'll just have to get over it."}
{"product_id": "B00G6YJ60E", "context": "Does the PC version of the game support manual saves or is it checkpoint only?", "response": "I haven't played it for awhile, but if I remember right, it's manual"}
{"product_id": "B00B23MO9Y", "context": "i have the 2008 version which does not have the 6 add-ons and the this expansion, if I buy this expansion and the 6 add-on codes what disc will need to be inserted?", "response": "Any xbox 360 ffxi disc will work aslong as you have the game installed and the codes registered."}
{"product_id": "B00002JXBC", "context": "this product works for xbox 360 F1 Racing?", "response": "It should if xbox has usb port, but we are not sure."}
{"product_id": "B00BI9MDSO", "context": "it is good protection but i afriad it will make damage or breaking ps slim or not because it is very very fit to push push and push even take off also", "response": "My son takes his ps vita in and out of this case 2 or 3 times a day. It is a snug fit but the case does not damage the game system but protects it when he is not using it."}
{"product_id": "B009RXUNZI", "context": "When you \"stash\" the mic, does it mute? I would like this to act like PTT during games.", "response": "I have not experienced this, so no."}
{"product_id": "B00IVHQ0KI", "context": "Has anyone had any problems with the gas pedal? Ours is not responding. Any tips? I am about to return it. So frustrating.", "response": "No problems here. My husband loves it and he has gone thru 2 other brands because he is so hard on them. He has had no problems with pedals."}
{"product_id": "B003O6CB6S", "context": "Will this work on windows 7??", "response": "Yes it will.  My husband uses Windows 7 to play it."}
{"product_id": "B00FOGFP0A", "context": "I have heard that PS3 games are not region locked? This game only came out in the UK and i have a US PS3, will it work?", "response": "yes this game should work on a US PS3"}
{"product_id": "B00F27JDY0", "context": "A friend of mine said that the materials used for the Japan version are \" less reliable\", is this true?", "response": "Yes it is. I'd advise you buy from the U.K or U.S if you want to enjoy durability and quality. It's not like the Japan versions aren't good...they are, but they just aren't at their best yet."}
{"product_id": "B00GO4PTR0", "context": "I wanted to know if you can send me the code to my email because I would need to use it as soon as possible. Thanks.", "response": "11403 NW 89st Apt 216 Doral, FL Send me an email so i can answer you, emille_cotes@hotmail.com"}
{"product_id": "B0050SY77E", "context": "does this game have a multi player mode", "response": "Yes it does just that the lobbies are pretty empty now. Not a lot of people play the multiplayer anymore but you can get lucky to meet a few players there. You can also arrange games with your friends who have the game too. Hope it helps."}
{"product_id": "B00ERDGMT4", "context": "hi, does this game come with everything offered by gamestop?", "response": "Yes, but you should know going into it in 2015 the online community is a mere shadow of what it was when the DLC came out, most have moved on to pre sequel and/or other consoles"}
{"product_id": "B002Q4U5DK", "context": "Does the LED light always stay on? Is there a way to turn it off?", "response": "It always stays on as long as your computer is on. To turn it off, you would have to turn off your computer. I would know as I always leave my computer on and sometimes have to restart it. I don't use Razer Synapse so I don't know if you can turn it off through there."}
{"product_id": "B0091A3AHA", "context": "is a tv or what ever that screen is included", "response": "It is built into the case, all you need is a wall outlet and your game system."}
{"product_id": "B00FFL0T46", "context": "\" This installation package could not be opened. Contact the application vendor to verify that this is a valid Windows installer package.\" How to fix?", "response": "Go to teltale website and tell them to give you a steam key."}
{"product_id": "B00ERDGMSA", "context": "wait so does this come with all dlcs and skins for pc?", "response": "The game comes with all of the dlcs, exept for two, I don't know the name of them though, and so far I have not found one skin missing"}
{"product_id": "B00EFFVZP0", "context": "does the bf4 game box still have the $10 code for ps4 in  the box in october 2014?", "response": "Mine did, but the code has expired and I don't know that it will work anymore. I may have just gotten an older copy of the game, though. So I can't say for sure."}
{"product_id": "B009ZDPYKO", "context": "Does he work with swap force?", "response": "Yes, they will all work with swap force."}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "Yes, you have to pay if you want the Japanese voice package tho (which is heavy, kinda expensive but very good and much better than the English voice acting)."}
{"product_id": "B00FATRKWM", "context": "Which voltage does xbox 360 use? 220V or 110V or dual-voltage?", "response": "The xbox uses 110 volts."}
{"product_id": "B00D96BMV8", "context": "Can you hear your voice in the headphones during chat, so you do not begin to shout?", "response": "Yes you can hear your voice when you talk into the XO Four Headset."}
{"product_id": "B00HHUSNPU", "context": "Will I be able to keep this case on while using this charging kit?", "response": "Definetely no need for removal"}
{"product_id": "B006W41X1S", "context": "Can I just play my games offline and hear game sound on headphones or do I need to play online?", "response": "You will be able to hear the games sounds no matter if you are playing on or off line."}
{"product_id": "B006NU6HAS", "context": "Does this stand on its own or is this an addition to Flight simulator X", "response": "This is an add on for Flight Simulator X.  It is not stand alone."}
{"product_id": "B001GIOGBY", "context": "Has anyone tried it with Windows 8? Does it work like in Windows 7?", "response": "Although I did not set up the yoke, it is working and uses Windows 8."}
{"product_id": "B008X73CE8", "context": "What is the difference between SH4 and SH4 gold edition?", "response": "I believe SH4 Gold is the final edition containing all the addons and correction that SH4 doesn't have."}
{"product_id": "B008O510Y8", "context": "Is the adjustment band made out of metal?", "response": "The adjustment band metal with a plastic guide piece attached to it. Who ever thinks it is entirely made out of plastic needs glasses."}
{"product_id": "B00J128FPA", "context": "do you need to pay any fees to play online?", "response": "It's 12.99$ a month for 1 character and seeing how 1 character can level up all jobs/craft there no need to pay for 14.99$ to have access to 8 character."}
{"product_id": "B0061PAZUS", "context": "Is this easy for beginners to follow?", "response": "Yes. It's easy. You learn all the moves in no time."}
{"product_id": "B004RMK5QG", "context": "hello, a question if I buy it now comes to me today by email the code ?", "response": "Yes, comes to you today by email"}
{"product_id": "B000PT18OS", "context": "Is this is 100-240v. Is this works for Xbox 360 pro.", "response": "Not sure, this one works on my old xbox360, the original first generation, not the newer slim type."}
{"product_id": "B00E1DMWBM", "context": "does this model have Megaman willey wars ?", "response": "It's not a built in game, no."}
{"product_id": "B003NSLGW2", "context": "Will these still fit snugly and not slip off easily if the original joystick cover has completely come off?", "response": "They fit very snug, almost too tight. But once on they don't have much slippage off the joystick."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "Once you complete your purchase you can view the code in your browser."}
{"product_id": "B002672Z80", "context": "I bought two of these remote, pink and blue, as Easter gifts for my kids.  Any hints on how to get them to sync with the Wii system?", "response": "no mine did sync i think my kids pulled the batteries out one or two times thought but they thought is was something they did"}
{"product_id": "B005MQ3BSK", "context": "Does this work on Windows 8?", "response": "I am currently using Fritz 13 with Windows 7 and have no experience with Windows 8."}
{"product_id": "B007JDMPOK", "context": "Is the Regal Frostlion Mount available for all the characters in the account or can only use it on one character?", "response": "It is available for all characters across all servers."}
{"product_id": "B002RYLG4Q", "context": "how well would it work on a samsung flat screen tv?", "response": "My experience using it on a flatscreen wasn't very good. The color was different than the original and the sound wasn't as good. The retro nes only last me about 2 weeks and then it stopped working."}
{"product_id": "B00FOGFP0A", "context": "I have already purchased the dlc for these games us region, the only think i want to know is if i purchase this game will i be able to use the dlc?", "response": "Hola Luis, Sorry... only single player in América and latín america"}
{"product_id": "B00FA6YFTQ", "context": "Do this game or another one on the series has a history co-op mode?", "response": "No. Both Metro 2033 and Last Light are solo only."}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "yes. It is mapped to a function key and the seven and eight number keys"}
{"product_id": "B0081Q58AW", "context": "Does the game come with the typical initial 1st month free?", "response": "Yes, but... you have to supply a credit card and sign up for a monthly subscription to get the 30 days."}
{"product_id": "B00E447L8C", "context": "1) How long does it take to fully charge this on the computer?2) How long does it then take to fully charge an iphone?", "response": "I have only charged it up once and it took several hour only but it was from new waiting to take on holiday it has stayed fully charger for the last two months .haven't used it to charge phone or tablet yet. have full faith in it."}
{"product_id": "B001O3066U", "context": "will it work in windows 8?", "response": "While I don't have Windows 8 on my own computer, my husband does and he uses this game nightly so can't see why you'd have any problems."}
{"product_id": "B00DBDPOZ4", "context": "How long is the cable?", "response": "According to the official Xbox website, this product contains the following: \"Contents: Rechargeable Lithium Ion Battery Pack and Charging Cable (9 foot USB to Micro-USB).\" Hope this helps."}
{"product_id": "B00H72EMP8", "context": "Can I connect these to my PS4 so I can use the inline controller?  It is a must-have for me to have a quick mute for my headset.", "response": "You can connect it to the controller to have the option to mute you need to connect the cable"}
{"product_id": "B007W8S2MG", "context": "Does the have a tutorial to explain the mechanics?", "response": "The game has a tutorial but it will explain everything to you once to discover things, for example it will explain to you the fight mechanics once you get to the first fight and is the same with all game mechanics."}
{"product_id": "B00D6PTMHI", "context": "Can I install the PC version on multiple computers ?  I spend weekdays at my home and weekends at my girlfriends.   Will I have to buy a separate licence to run on my pc and also on hers ?", "response": "Not if you have steam.  Just activate it on there and you can download steam to your GFs computer.  JUst bring your cable."}
{"product_id": "B00BRA9T5Y", "context": "What are the buttons on the side of the mouse for and how do I program them? I would read the instructions... but I don't speak japaneese", "response": "Those buttons are used to navigate forwards and backwards (on webpages, windows explorer, etc.). I'm not sure about programming them, worked for me once the dongle was plugged in and never felt the need to dive deeper into that."}
{"product_id": "B00001IVRD", "context": "Does this battle chest version come with a map editor?", "response": "Yes it does. Thanks for your interest."}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "It's cross save only between the ps vita and ps3 so what ever u saved on your ps3 u can then transfer save over to your vita and start where you left off"}
{"product_id": "B008RA5AWS", "context": "Once i purchase the Quickbooks Pro 2013 with Enhanced Payroll, will i still need to purchase a year subscription ??", "response": "Only if you want to upgrade to unlimited employees.  The Enhanced will only allow you to pay up to three employees. If you process more than three you will be charged by Quickbooks per employee."}
{"product_id": "B00F47ZNP6", "context": "compatible with macbook pro?", "response": "I've been using it with a MacBook Pro with no issues. Cheers..."}
{"product_id": "B00ATHFLZS", "context": "what the design on it called?", "response": "The design looks a lot like the contact patterns of a circuit board. The light will change through a sequence of colors. The best part is the fact there is a switch to turn off the light on the bottom of the mouse."}
{"product_id": "B00AYBKQRW", "context": "Will this remote work with a LG Window Air Conditioner Model LW1210HR?  It looks the same as the original except for missing the Energy Saver button", "response": "It works on LG Window Air conditioners  with remote."}
{"product_id": "B00AAS88K6", "context": "How well does this work with Nvidia SHIELD tablet? I've heard of stuttering and lag. should I pick up that $13 BT mouse on Amazon instead?", "response": "Yes this works with the Shield Tablet. I've used this and 90% of the time it worked flawlessly, occasionally, when connecting a bluetooth keyboard such as the Logitech K810 they would interfere with each other and cause stuttering. Disconnecting and reconnecting the keyboard would usually solve this issue. You can play games and operate the tablet with this though."}
{"product_id": "B00EFFW0HC", "context": "Does this come with the China Rising pack?", "response": "no you have to buy that on Xbox live"}
{"product_id": "B00FB5R3XQ", "context": "Now, I've had many people say that PS3 sticks don't work as well as Xbox 360 sticks for PC, can anyone confirm or deny this?", "response": "I have this stick and mainly play on PC, all I did was plug it in, dowload drivers, go into control panel > devices> game controllers checked it at RAP.N3. Went to my game and configured it and was ready to go."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "4player is only available online my friend but offline locally you are only able to play with one other person no matter how you decide being in story mode or versus against each other or on teams"}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "Don't know but just to advise:  Game is very, very boring and difficult to play. Look up comments on google about it.  I wouldn't have bought it knowing what I know now about it."}
{"product_id": "B00CPKUV9I", "context": "Is a persistent Internet connection required for the game?", "response": "Probably not the developer is owned Zenimax Media(Bethesda company, the markers of Falout 3, New Vegas, Skyrim etc.) they don't usually usually do online DRM as far as I have seen in any of their games."}
{"product_id": "B001Q24UAM", "context": "Will it work on windows 8?", "response": "I do not know? My computer uses Windows XP. I wish I could help. Sorry."}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "110 only according to the box"}
{"product_id": "B006W3ZXEW", "context": "Can the buttons be used to bind any sort of macros (shift+F1, etc) or can they only switch between 1-6 and numpad 1-6?", "response": "Yes u can, u just have to intall synapse 2.0 and go to the mouse, the click side view and u can edit it there"}
{"product_id": "B0053B66KE", "context": "Do they ship the correct version based on ur region? Eg PAL to NZ and Europe, Or do they only ship American NTSC version?", "response": "I live in Argentina and it works pefect in my daughter's Nintendo 3D. I really don't know the version... but she can play it in Spanish. I hope this would help you :)"}
{"product_id": "B00CTKHXFO", "context": "I thought that older games, such as MGS2, were not backward compatible with the PS3. Will ALL these games work on the PS3 Super Slim?", "response": "These are re-release versions made for ps3 these will not run on a ps2"}
{"product_id": "B003Q9RGRW", "context": "does it come with the headset", "response": "I would say no this is listed as only chat pad, but read the seller description if it doesn't say anything about the headset assume it isn't included."}
{"product_id": "B0095C0I4W", "context": "does this work on windows 8.1?", "response": "Don't know for sure, but most of the games in the bundle did not/not work without major system tweaks for Windows 7... and they don't seem interested at all in fixing it.  I would not recommend buying it."}
{"product_id": "B001DPZE84", "context": "I have never played a flight simulator game before, and i am not a pilot. Could i still learn to play this game?", "response": "Yes, absolutely.  Just remember this is intended to be a flight simulator, not just a flying game.  Be prepared to invest some learning time to get the most out of it."}
{"product_id": "B004C34D2M", "context": "Do these work alright?", "response": "They are not OEM but work pretty good"}
{"product_id": "B00D9EPI38", "context": "will the 320GB hard drives for the XBOX 360 slim fit in this model? are they the same?", "response": "don't do it an"}
{"product_id": "B001DNGCN2", "context": "I'm Not a Big Wiz-Kid on This Stuff, but My PS3 is a CECH-2001B Model. Will This Cooling Fan Fit My PS3, Properly? Will It Run Any Different?", "response": "I honestly wouldnt recommend buying, made no difference in my opinion"}
{"product_id": "B00BCEK2LU", "context": "I have an old G15 keyboard and love it, but the keys are way too loud and \"clacky\". Are he G510's keys loud or quiet?", "response": "The keys in my opinion are not as loud but I think if you are looking for silence you might want to look elsewhereIt is a nice keyboard"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game.", "response": "Yes, different figures and sets unlock different parts of the game."}
{"product_id": "B002JTWODG", "context": "come with blue tooth dongle Does this mouse come with a blue tooth dongle?", "response": "NO! It's for BlueTooth equipped devices."}
{"product_id": "B004YC4NN0", "context": "Does it work on a Macbook Pro?", "response": "My experience with it is that it doesn't work..period. I would go with a different controller."}
{"product_id": "B003O6JKLC", "context": "is this the old version,or the slim new one? cause the picture on the box show the new one but the description on top says that it is the old version", "response": "The photo's and listing specify the S (slim) version, which is the second model of the XBOX 360. Then the \"newer\" model E came out just before release of the XBOX One. I ordered one of these from Amz Warehouse and received an E model which I returned. Trying again for an S...."}
{"product_id": "B00BHSTXV6", "context": "Is the space bar much louder than any other key?", "response": "The space bar is louder but still very quiet compared to a mechanical keyboard"}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "Yes, It works on Windows 8 & 7."}
{"product_id": "B002JTWODG", "context": "Is this the 6400dpi found on the Razer website?", "response": "What everyone else said is correct - this one is 2000dpi when connected wireless and 4000 when connected via usb."}
{"product_id": "B001EIA2LY", "context": "Do I need a joy stick to use it on my laptop?", "response": "it is possible to use a keyboard only, but you won't enjoy it unless you have a joystick."}
{"product_id": "B00IAVDQCK", "context": "Can I use this headset for voice chat only?  (Game Sounds still coming out of the tv.)", "response": "You will hear the game through the headsets and the left side of the headsets is your mic! So you can game & chat at the same time. When you receive the box there will NO MIC it's in the headset. Sounds crazy but it does work.Good luck gaming!!"}
{"product_id": "B009K7QB8O", "context": "WIll this increase my no scope abilities?", "response": "This adds a +3 to your no scope ability, only if you have added to that ability through a decade or more of intense gameplay."}
{"product_id": "B00E88G054", "context": "Will this work on ubuntu?", "response": "As long you use a computer with a USB port, and mouse compatable then yes."}
{"product_id": "B0040UAYI4", "context": "does it work with PS4 ?", "response": "I doubt it. The software you need to configure it doesn't even work with a 64 bit version of Windows. Don't buy this product."}
{"product_id": "B0056JPS84", "context": "I have the Lite-On drive and was manufactured JUL 2009.  Not sure of the exact model #, should I re-open and provide model prior to ordering?", "response": "It will provide you with a 100% sure answer, so yes."}
{"product_id": "B008O510Y8", "context": "How long are the audio/mic jack wires?", "response": "They are 3 meters so about 9 feet plenty long enough"}
{"product_id": "B004JKZUJI", "context": "i have recently downloaded the classic game of mario golf on my wii. Do you know if this wii classic controller works with my wii mario golf 64?", "response": "The classic controller should work with all downloaded 64 games. However, if you have a Wii that has Gamecube controller ports, you are much better off getting a Gamecube controller to use."}
{"product_id": "B008WZRZJY", "context": "A great game, especially the graphics. Does anybody else have blurry pictures in the strategy guide?", "response": "I don't remember using the strategy guide. Sorry!"}
{"product_id": "B00I14395A", "context": "Is there any noticeable latency when using the keyboard?", "response": "I have used the Logitech system for over a month and have found no problems. The key is to make sure it is fully charged the first time used and monitor the charge indicators on the keyboard and mouse."}
{"product_id": "B007MM9E42", "context": "Can you play this game with two paintbrush controllers ? The clicker is very expensive and not very good.", "response": "According to this it may work\"The controller functions as a Nunchuk when playing Epic Mickey: The Power of Two.\" [http://www.amazon.com/Epic-Mickey-Mickeys-Paintbrush-Wii-Nintendo/dp/B008FHHT1S]"}
{"product_id": "B00FYIXMHQ", "context": "Does the Collector's Edition have spanish audio/subtitles?", "response": "Yes it does you have to change it in the settings."}
{"product_id": "B00B5GZORW", "context": "What is the name of the other bonus games?", "response": "Girls with secrets, Judge Dee the city God Case and Night in the opera."}
{"product_id": "B006KYYOSO", "context": "Can you play as the ogre on this one?", "response": "Yes.  Ogre is playable when you start the game."}
{"product_id": "B000ZBZK7C", "context": "Has this been upgraded to run on Windows 8....64 bit  ?", "response": "I have Windows 7 and a 64 bit machine. I can't install WinPoker, but I can play from the disk with no problem. I bought it less than a year ago so assume it's the latest version."}
{"product_id": "B005M2KSLC", "context": "does it have a DPI switch up AND down???", "response": "it has a switch that toggles between two DPI settings you can pick from, low medium or high, and you can pick two and set the light strength for each setting.  button is located right udner the scrollwheel."}
{"product_id": "B00CHGYUE2", "context": "Does this game come as disk media or is it a game case with an online download code inside?", "response": "If this is the same one I got then its a disk."}
{"product_id": "B007C3E5WM", "context": "does it work for windows 7", "response": "I've had it working on Windows xp/Vista/7/8/8.1 so far. Unsure about Linux at this point."}
{"product_id": "B0081GA50U", "context": "Does this work for the PS Vita 1000 series?", "response": "Well I got the ps vita that came with assassins creed liberation the first ps vita design so yes. I don think it works with the NEW ps vita"}
{"product_id": "B008SBZD9G", "context": "Hi, Does this product includes the CD-Key needed to register and play?", "response": "yes it does contain a CD-key so you can play for one month, then you need to pay the monthly subscription"}
{"product_id": "B007TFOO6K", "context": "Can you change the cherry mx keys out? I'd rather have brown D:", "response": "They only come in red and blue switches. :c"}
{"product_id": "B000SOYG8U", "context": "support for Saitek JOYSTICK?", "response": "I don't know if there's any such support, but since this game is essentially a spaceship RTS and not a flight simulator, I really, really doubt it."}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "I use the xbox 360 controller! It's the best on my ppint of view."}
{"product_id": "B00FXOP1MU", "context": "can you play regular ds games on this unit?", "response": "yes you can play regular ds games"}
{"product_id": "B007Y7OP8K", "context": "Is it in english?", "response": "The voices are in Japanese but the subtleties and choices are in English."}
{"product_id": "B00DBRM3G8", "context": "According to what iam reading you can't create a new team and create players and put them on it,is that correct?can someone answer this queation for me.", "response": "I'm not sure I've only gotten nba 2k games because of my player mode"}
{"product_id": "B001O3066U", "context": "Does this game work on windows 8.1", "response": "Yes you can make it work but it took some time. Not sure how my son got it to work"}
{"product_id": "B002CZ7P04", "context": "I was addicted to the Island Cycling game on Wii Fit Plus.  Is this game as fun in your opinion?", "response": "Oh, I never did the Cycling game. But I thought this is really fun, especially if you're trying to lose weight, etc. I have COPD and have to walk every day--this is a lot more fun than the treadmill. Hope that helps!"}
{"product_id": "B0096L2SJ0", "context": "where are the games stored", "response": "In my galaxy s3"}
{"product_id": "B0054JGGGY", "context": "How is the mamba's tracking while wired? I don't intend to use the wireless at all. I currently use a 3500 Deathadder", "response": "Its perfect. No drama at all. It works at Its best when wired."}
{"product_id": "B00FOHP8XI", "context": "Is this PS3 Console only a vertical stand or can it be horizontal stand?", "response": "It can rest horizontally."}
{"product_id": "B00BZOBE78", "context": "do you need the original Civ V to play this?", "response": "Yes you need the Original Civ 5"}
{"product_id": "B00F9RGFEY", "context": "Does having the lights on eat the battery?", "response": "Having the lights on does take a lil from the battery without sacrificing allot of power. Note these are led lights and do not consume not as m much power as you think. But having them off will give you  about 30 minutes of extra use after a full charge"}
{"product_id": "B00D7UHT0E", "context": "Will this work on a Wii from Europe PAL ?", "response": "I don't know, I have NTSC"}
{"product_id": "B0015PHMFU", "context": "Has anyone tried this with Blazblue or Skullgirls? Let me know if it works on those.", "response": "Yes, I have on both. Works fine!"}
{"product_id": "B000YMQGWU", "context": "can this work on a ps2 logitech wireless controller?", "response": "I don't know for sure, but I would guess yes."}
{"product_id": "B00FATRKLI", "context": "Does the kinect sports season two games include bowling, table tennis, and boxing?", "response": "football, baseball,, regular tennis, boxing, darts"}
{"product_id": "B00ATF5YYI", "context": "So if I buy this, I can put this code into steam, correct? and then it will be in my games library?", "response": "Yes, if you buy the one that says (download) amazon will send you a code within seconds to redeem it on steam. (Sent to your email)"}
{"product_id": "B0057SDCLY", "context": "will the tritton trigger work on a mobil phone or tablet?", "response": "Yes. You can remove the Mic if you're just listening to music and the cable coming from the headset is a 3.5 mm standard for most regular audio services. So again short answer yes for sure."}
{"product_id": "B001DPZE84", "context": "Can you make your own missions?  Can you get unlimited fuel?", "response": "yes you can get unlimited fuel. as far as missions go, you can fly out of any airport in the system, and so far that includes all the active ones in my area, and you can fly anywhere you want. I hope this answers your questions. vic"}
{"product_id": "B00009OY9U", "context": "Does it have a throttle lever?", "response": "Yes. For the flight simulator, the lever in the front is the throttle."}
{"product_id": "B004IK24MU", "context": "Does it work with control with silicon case??", "response": "it did at first then totally stopped working after about 6 or 8 weeks"}
{"product_id": "B00DJYK8XS", "context": "If you don't want to play the game, but just use it as a Zumba video, will it still play?  (For example, no one is holding a remote.)", "response": "They'll have to interact via remote as they suggested."}
{"product_id": "B00965WK8K", "context": "Is this mouse wired or wireless? I can't quite tell from the pictures.", "response": "It is a wired mouse."}
{"product_id": "B008J16AP6", "context": "Is this a multiplayer?", "response": "No this not a multiplayer game"}
{"product_id": "B00CPKUV7K", "context": "Why is it rated M?", "response": "Graphic violence and possibly strong language."}
{"product_id": "B009NQPGOW", "context": "hi, is the game also in italian language?", "response": "Sorry,this game is Japanese version."}
{"product_id": "B0087N222Q", "context": "can someone tell me if I connect this bluetooth to my ps4", "response": "It did not connect with my PS3"}
{"product_id": "B0050SVHZO", "context": "Is this an upgraded version of the Wii U that comes with Sylanders Swap Force Limited Edition or is it the same.", "response": "It is not \"upgraded\" it has a bigger memory. But, still, those limited editions will go for a lot one day."}
{"product_id": "B004XGN8W4", "context": "can you use the xbox 360 E with it.", "response": "I think it should, the E should be the same sizes also the g155 comes with a pad for the older or slim model. Hope this helps."}
{"product_id": "B009GWLSFY", "context": "Does it have gauntlet?", "response": "Yes, Gauntlet and Gauntlet II."}
{"product_id": "B00FC1UH82", "context": "does it work on ps2", "response": "No. It has a USB connection, which is the standard connector for PS3. PS2 uses a proprietary connector."}
{"product_id": "B00EM5UFEK", "context": "i have xbox gold live but still cant log on to play garden war fare", "response": "My son said u have to make a origin acct. on xbox. He said he has the play station 3 version so playstation auto made one. U can prob go on you tube to see how u make an origin on xbox for plants vs zombies garden warfare. Good luck!"}
{"product_id": "B007A7K60A", "context": "Do you need Internet. Connection to play these games?", "response": "This game will work offline, however it's strongly suggested that you do have an internet connection to update these games as the build installed is a little outdated and the updater updates all the files for the smoothest gaming experience."}
{"product_id": "B00GPH7Y8S", "context": "Hi. Where can I see the system requirements for this game ?? Like processor, GPU and etc.?", "response": "All of the systemrequirements are listed on the game box."}
{"product_id": "B009WI7V9E", "context": "Is the game still worth getting?", "response": "Yes it's still worth playing. Graphics are obviously a bit old but consider that it's got a great story and the combat in the game is great. I do recommend playing these games. Totally worth it."}
{"product_id": "B003Q9RGRW", "context": "can I use the pad with Netflix or Pandora or internet explorer? as if it was a pc keyboard?", "response": "yes, its a easier way of typing  in xbox"}
{"product_id": "B00008J7NZ", "context": "Do these copies contain version 1.0 or the updated ones that deleted all of the glitches.", "response": "Dont buy halo 2 in amazon.com Dont work on xbox 360. And they dont answer me why dont work. Ill never buy again in amazon"}
{"product_id": "B004QRKWKQ", "context": "This product comes with the Wireless Gaming Receiver Xbox? este producto viene con el Receptor de juegos inalámbrico Xbox 360?", "response": "comes with wireless receiver, controller and driver disk. Worked good on a 32 bit system. I couldn't get to work on a 64 bit system."}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "I have played all three games on my current computer which has Windows 7 64 bit and did not have any trouble, except not being able to use a 360 controller. I do not know if it will run on Windows 8/8.1"}
{"product_id": "B004HYK8Y8", "context": "is this game a mmorpg", "response": "no its just an RPG. But if you're interested in an online RPG there's Elder Scrolls online. You should check it out."}
{"product_id": "B00FE8WKMO", "context": "will this game work on the regular wii?", "response": "I am not sure , i know the regular games will work on the wii u , you may want to go to ninetendo page and ask them directly."}
{"product_id": "B002I096AA", "context": "is it a ok product for kids", "response": "I would say get a 2DS for kids if under say the age of 10. The 3DS can open and close therefor making it more likely to break if it gets bent too far back when opening."}
{"product_id": "B00G0OYHCW", "context": "If I paid to download old games on my Wii, can I download them again on the WiiU for free?", "response": "I don't know but I seen a feature in the settings that allows you to transfer data from Wii to Wii U."}
{"product_id": "B006IR6NH8", "context": "How does this thing steer? does it attach to something or does it use an accelerometer? and will it work with most racing games?", "response": "It uses an accelerometer that maps the rotation axis. It will work with most racing games but you will have to set up the controllers manually on most.  There is a download available that let's the rpm leds work with games that supports them."}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "NO PROBLEM! Though on a side note, I have had better luck using the windows update drivers for these things than the provided software. fwiw"}
{"product_id": "B00DTWES6I", "context": "does this code work on steam   or will splinter cell be stored in a separate game library on amazon.", "response": "It does not work for Stream, only uPlau. You will have to create an uPlay account if you don't currently have one."}
{"product_id": "B00B15EXJC", "context": "does the home button work on this contoller with the PS3? i know it wont turn it on and off but can i still go through the PS menu??", "response": "Yes the home button work like regluar ps3 controller"}
{"product_id": "B00005B8G1", "context": "Does this include a charger?", "response": "No, it uses AA batteries. It will work with rechargeable batteries though, but you need an external AA charger."}
{"product_id": "B006W41W3M", "context": "it is compatible with ps4 and pc?", "response": "Yes it is - I use it with my PS4 daily. Just connect the optical connector to the PS4, run the USB to a USB plug (or a USB charger) and you can hear everything. You can then get a separate"}
{"product_id": "B003BKWEHS", "context": "What does Jewel Quest 3 JC mean? Can I play this game on my PC Windows 7?", "response": "I don't know what the JC means--but yes, you can play it on your windows 7--that is what I have."}
{"product_id": "B00D3RBYM0", "context": "Have the bugs been fixed yet?", "response": "I don't know what bugs you mean. I finished the game without issue. The only bug I found was a random pause menu appearing. I just press the menu button and continue on."}
{"product_id": "B004X56PWK", "context": "Playing the classic games, up to what title can you play? Does it include Sonic & Knuckles?", "response": "You play through the game experiencing classic levels remade in 2D and 3D platform. But sadly you can't play as knuckles."}
{"product_id": "B002I0H79C", "context": "is this game a third person shooter?", "response": "4 player on line 2 player off line"}
{"product_id": "B00B312UDU", "context": "how many clicks does this have?", "response": "Not sure if I understand what you are asking here.  Clicks where and on what?   The scroll wheel, do the buttons click?  Just not sure what to answer here."}
{"product_id": "B00GZ1GUSY", "context": "Is it normal to see this annoying white flash between screens a camp fire?  Not sure if mine is defective because it's irritating/annoying. TYIA.", "response": "Ya it's part of the cinematics in the camp fire scenes."}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "There is no blood and no body parts coming off"}
{"product_id": "B00CQ9L1Z6", "context": "Does this work on 3ds games on the 2ds system?", "response": "Yes, all games that the 2ds can play are compatible with the 3ds, thus it will edit if the game is supported."}
{"product_id": "B008SBZF2Q", "context": "WIll this work with xbox?", "response": "I bought it for WII 2 but I have been told it will work with either.  It did work on the WII."}
{"product_id": "B00HN9LS48", "context": "Would the Xbox 360 Kinect clip work for the Xbox One Kinect?", "response": "I dont think so .... The xbox 1 kinect has a different design than the 360 kinect and It clips into the bottom of the xbox 1 kinect"}
{"product_id": "B0015PHMFU", "context": "Has anyone tried this with Blazblue or Skullgirls? Let me know if it works on those.", "response": "I know it works with ps3, I havent tried those game specifically, but it works with Marvel vs Capcom 1 and 2."}
{"product_id": "B009S4JZKK", "context": "Does this work on Mac?", "response": "If you are running at least Windows 7 as well on your Mac, than I would say yes. I don't run BootCamp or Windows on my Mac so can't be sure if that's a fact."}
{"product_id": "B002L93F0A", "context": "Do you get two controllers from this order or one?", "response": "I received two controllers. They were in two separate packages as seen on the picture."}
{"product_id": "B00DC7G0GG", "context": "Can you play the campaign with two players? Or is it just one..?", "response": "You can with up to four players simotaneously!"}
{"product_id": "B005DKZSVS", "context": "Has anyone ever had an issue with the amBX control panel not adding software automatically?", "response": "Yes, often.  To fix it, I have to restart the service, open the control panel for AMBX in admin mode, restart the game, then quit it once it has reached the main menu.  These are the worst, most buggy and least user friendly drivers I have ever seen."}
