{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "Yes I love it great volume and all"}
{"product_id": "B00886XQNQ", "context": "My PS3 has a DAC to my home theater for SurroundSound and an HDMI to my TV for normal sound at night. How do I pair these to get the SurroundSound", "response": "The wireless transmitter will pass through digital optical -- it has both an in and out port for optical -- so you should be able to daisy-chain, plugging the transmitter into the PS3, and the DAC into the transmitter."}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "Yes as far as i know. I bought the mouse and love it. I know it's cheaper in price but not in quality :)"}
{"product_id": "B006SVUQNQ", "context": "is this compatible with an xbox 360 S console?", "response": "Yes. There is a door on the side of the Xbox 360 S that you remove and just slide this HDD in until it clicks. Very easy install."}
{"product_id": "B004ASOLLM", "context": "is it just chat", "response": "Yeah that's all it is for. You have to turn your TV up for the game volume."}
{"product_id": "B001BZ2F56", "context": "Do you need Internet access to play this game?", "response": "Our grandkids usually play it on a computer NOT connected to the Internet and it works just fine.  However, having Internet access is helpful for upgrades."}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "Yes, it will come with everything you need to open the box, set it up and start playing. If anything is missing or if something is not working, let us know right away and we'll help you out. You get the same one year limited warranty and the same 30 day return period as all other ASTRO products.Regards,ASTRO Gaming"}
{"product_id": "B004HYIAPM", "context": "Is this game appropriate for a 12yr old? What are the \"sexual themes and alcohol\" content in here like the rating says?", "response": "could i change the language of game to chinese"}
{"product_id": "B00B98HF1O", "context": "Is this just for kids or can adults enjoy the game?", "response": "Adults can enjoy it too. Is fun and I as an adult like to play it with them specially when we have a family night n"}
{"product_id": "B007VFHIHA", "context": "I have a desktop windows 7 thats been upgraded from XP will this game work on it?", "response": "It depends of the cpu, vga and ram of your computer. Check the minimum requeriments of the game and compare them with your machine."}
{"product_id": "B00JC9SWSC", "context": "Can you play playstation 2 games on it?", "response": "nO i'M AFRAID NOT"}
{"product_id": "B00D3RBZHY", "context": "Is this game open world?", "response": "Yes, it is open world"}
{"product_id": "B000056SPM", "context": "Will this work with Microsoft X on Windows 8 ?", "response": "The yoke worked with fly sin x and windows 7.  I don,t know anything about win 8"}
{"product_id": "B0086UK7IQ", "context": "Is this mouse ok for smaller hands? Mine are, and though it's hard to tell from the photos, it looks rather large...", "response": "The mouse is larger then your standard mouse. I have smaller hands as well, so it took me awhile to get comfortable with it. I can use it well now,  though it is more suited to someone with larger hands."}
{"product_id": "B00DVEJA7G", "context": "So, can you listen to music you've downloaded but can you just listen to a radio station?", "response": "The headphones do NOT have any sort of radio tuner built in, so listening to the radio with just the headphones is a definite NO.With that said, if the device the headphones are synched to has a tuner, then you can, but remember, it is the device and not the headphones that is picking up the FM signal."}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "Yes! But not all of the new Win8 functions work. Not a problem though. The game plays better on Win8 than the older platforms."}
{"product_id": "B00KAI3KW2", "context": "how many gig on the hard drive", "response": "It is a 500gb hard drive but after the operating system and such it is a 362gb hard drive to play with."}
{"product_id": "B00I4BGNVM", "context": "explorers pack still come with this?", "response": "You buy the Explorers pack after you buy the game. This is the game only but, they do give you 500 crowns to your account when you buy the game but the pack is somewhere in the 1000 something range."}
{"product_id": "B00IPTUJ8G", "context": "Will the dlc from the Vita version carry on to the PS3 version if I don't have any of the dlc on it?", "response": "no. your levels and weapons that you receive while playing in the DLC on either console will but the DLC themselves do not transfer"}
{"product_id": "B004XGN8W4", "context": "Does this work with a PS4?", "response": "yes, if it fit, but you can always put the PS4 on the side"}
{"product_id": "B00166N6SA", "context": "Is this the one you need to buy to install in computer before you can play any other Sims3 games?", "response": "Yes, this is the base game and then once it is installed you can install expansion packs."}
{"product_id": "B000B78F72", "context": "1) does the freecell have a timer?  If so, can it be turned off?", "response": "My husband is the one that plays these games and he said there was no timer."}
{"product_id": "B002HH9TUG", "context": "How do the triggers feel? They look flat, maybe like Wii U triggers. I like springy triggers more.", "response": "the triggers are very good and have lots of spring to them, I love this gamepad for my laptop when im on the road"}
{"product_id": "B00FM5IY0Q", "context": "I havent played the prior Dead Rising's. Should I play them for any story knowledge or can I jump right into this game?", "response": "Yes you can jump right into this game as I did too, great game !!!"}
{"product_id": "B00FXOP1JI", "context": "Does this come with the ac adapter?", "response": "when bought brand new? Yes. if bought used, then it may or may not. But, the point is if it's brand new, then it should come with everything it's supposed to."}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "English sub Japanese dubbed"}
{"product_id": "B003VH5Z2C", "context": "Can you use original NES controllers?", "response": "Yes. I I remember correctly you can use the original nes controllers an I like them better."}
{"product_id": "B00G237L7Y", "context": "this game is multilanguage??", "response": "Si por supuesto Yes of course"}
{"product_id": "B00FATRKWM", "context": "Which is the frabrication year?? Do you have 2013?", "response": "No the MFR date is 10/06/2012. Thanks for asking."}
{"product_id": "B002Q4U5DK", "context": "Is it eligible for a laptop?", "response": "Yup shouldn't have any issues."}
{"product_id": "B000M6DHA2", "context": "What is bulk packaging?", "response": "Mine came in that hard-to-open, melted-together, too-big-for-the-product plastic packaging."}
{"product_id": "B000R0SRNU", "context": "can you play with 2 people without xbox live?", "response": "Yes you can. You just need two controllers. Have fun!"}
{"product_id": "B00IRHE892", "context": "Is this compatible with Mac?", "response": "The logitech software that the G600, G702 and G15 keypad uses works fine on a mac so unless the G502 is a special case, yes, it should be fully compatible"}
{"product_id": "B00DPQ6GPO", "context": "Works with COD Ghost ?", "response": "Yes it those drop shot  jump SHOT exc"}
{"product_id": "B00EOI2MRS", "context": "Does the controller have the gyroscope feature?", "response": "No, it doesn't have the motion function. Accidentally clicked yes in the Email, but I just tested it and no."}
{"product_id": "B00C7103DO", "context": "Do this one comes with the Deathstroke dlc?", "response": "Nope that was a preorder bonus. Any copies of that doc came with the game box. And that game box may already have run out. You might still get it. But it depends on how old the dick cop and game box are."}
{"product_id": "B00IRHE892", "context": "Can you reprogram all the buttons or are some of the buttons fixed so they only control the DPI or switch the profile?", "response": "All buttons are re-programmable except the mouse wheel toggle."}
{"product_id": "B00ATHFLZS", "context": "can different keystrokes be assigned to the programmable buttons for different programs? How many?", "response": "Yes they can. Currently only the amount of buttons can be keybound, without adding shift or cntl. But the amount is almost endless. I have all button bound, and again with holdin shift, and again for holdin cntl just for wow. It's very customizable."}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "Sorry,not sure about xbox 1"}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "I use a regular corded keyboard and a wireless mouse. Most of the key bindings will be on the keyboard. Other than the shooting, and aiming clickers on the mouse."}
{"product_id": "B0086UK7IQ", "context": "Did they iron out the firmware on this mouse, eliminating the weird motion skipping it suffered from?", "response": "I have not had problems with skipping. It is smoothe and awesome"}
{"product_id": "B00562O78S", "context": "normal tv functions? for example, can i also have my xbox360/wii hooked up to this?", "response": "You can hook up anything to it that can be done so via HDTV or component cables.  However, in regards to your title asking if it has \"normal tv functions\", it does NOT have a built in tuner.  This is why Tretton called it a monitor, rather than a TV."}
{"product_id": "B0050SYK44", "context": "Should I buy Borderlands 1 first or go straight to Borderlands 2?", "response": "You should buy Borderlands 1 first other wise most of the story in 2 will be confusing due to it is tied very well together to the first one."}
{"product_id": "B000VLNXRU", "context": "Is there a max power/current rating on these?  My USB hub is already stressed out.  Looking at buying this & another hub to support multiple devices.", "response": "I know they require a lot of power, I can't tell you the exact amount. I would definitely buy a powered USB hub."}
{"product_id": "B00DC7O3K6", "context": "What winter games does it have? Also again can I play wii games on my wii u console", "response": "It has skiing, figure skating, curling, snowboarding, bobsled and some combo games. Yes my kid plays it on our WII U, it takes you back to the old WII format."}
{"product_id": "B00FLLFGO8", "context": "Can be used for sony Z2 tablet?", "response": "I am not sure of the exact dimensions of that tablet but the arm stretches 6 inches long. I am able to use my Note 3 vertically or my Note 8 Tablet Horizontally."}
{"product_id": "B0017HLYNC", "context": "Is this for adults or would it be appropriate (language, content, scariness, etc) for a 10 yr old? We've enjoyed the Nancy Drew games.", "response": "in addition (just remembered) Sherlock Holmes would be a good choice for the 10yr old...those were pretty mild. I played one of Agatha Christies games and thought it was pretty pg...only a couple parts where there is a storm outside that feels spooky like halloween a little...."}
{"product_id": "B00HKCKA0G", "context": "My laptop has a joint audio/mic 3.5mm jack, so theoretically, even the mic should work for my laptop, correct?", "response": "yes theoretically that should work just fine but if u buy it and it doesn't i am sure amazon would give you a refund"}
{"product_id": "B00EFFVZP0", "context": "Im planning to purchase this game CD in US amazon store, will it work on an asian console? i also have an american account BTW", "response": "It should work. PS3 games are not region locked but I think some movies are."}
{"product_id": "B001AH8YSW", "context": "Is the \"Enhanced\" physical copy the same as the download \" Enhanced directors cut\" version?", "response": "Yes, they are the same thing.  If not it would update for free to be the same, but if I remember right, when I bought it it was all up to date. It's totally worth the buy imo"}
{"product_id": "B00FKV8AK6", "context": "Why is it rated m", "response": "It is rated M mainly for violence. I didn't notice any language while playing."}
{"product_id": "B004N7HSGU", "context": "Does this work with the XBone?", "response": "Yes its working with xbox 360, xbox one, ps3 and ps4.."}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "It takes a little bit of force, but as long as you don't put all of the force on one part, it shouldn't break.Look at the picture on Amazon to see how it is supposed to drop down."}
{"product_id": "B001TOQ8X4", "context": "Physical copy? If so, can I download the game and play while the game is shipping?", "response": "If you download you can play as soon as it finishes installing. But you don't get a physical copy. If you buy a physical copy you don't get to download it AND get a physical copy. You have to wait for it to arrive before you can install/play."}
{"product_id": "B0006PJAZU", "context": "How do you activate the Word Perfect Suite 8 ob a Windows XP computer?", "response": "Ie either click on the icon or click on Start an click on word perfect."}
{"product_id": "B0050SXKU4", "context": "Is this US version? like will it work on a ps3 from usa?", "response": "Yes it's the us version and yes it works for ps3"}
{"product_id": "B0032MO77U", "context": "will these work on windows 8?", "response": "yes, but Jewel Quest I has a clumsy pointer and the game moves slowly. You can't move blocks into some empty spaces.  Jewel Quest II is great!  But they work on windows 8.  That's what I have."}
{"product_id": "B007MM9E42", "context": "Does this game require two players?", "response": "No it does not although 2 can play."}
{"product_id": "B0085VIILY", "context": "Can the joystick be used with other games like HAWX or Ace Combat?", "response": "I've never played with those games, but I can't see why not. I've used the joystick with other flight simulators without any problems."}
{"product_id": "B008OQTR3S", "context": "does it have offline multiplayer?", "response": "I haven't played it much due to the gas/brake system but as I can recall, it does have offline multiplayer similar to the first"}
{"product_id": "B002ZS6Y64", "context": "will these headphones work on my  hp envy  pc running windows 8.1  ..will i need any more cables or adapters", "response": "It should work whitout any adapters. I use mine on the 360 but the box says it works with pc"}
{"product_id": "B005VA5D24", "context": "Do you need a cable to plug it in to the Xbox, or does it plug in directly?", "response": "I'm honestly not sure.  My son ordered it and we ended up returning it because it turns out it wasn't what we needed.  I don't think I even touched the hard drive.  Sorry."}
{"product_id": "B00HGLLRV2", "context": "Out of all these editions, which is the better one with many bonus features and such?", "response": "Probably just the standard edition. The collector's edition just brings the DLC, Delsin's hat, and some pins. If you are really into inFAMOUS, and the price isn't $80, I'd say go for it. But otherwise, it doesn't seem to be worth it."}
{"product_id": "B0088MVODO", "context": "How are the graphics for RE 1,2,3? Are they at least like the Game Cube versions?", "response": "The graphics for Resident Evil 1-3 are exactly the same as they were when the games were originally released. (PlayStation One type graphics.) Resident Evil 4 was released on the PS2, and that game hosts the graphics of the PS2 system. The Game Cube versions were beefed up graphically for their exclusive release on that system."}
{"product_id": "B009RXUNZI", "context": "How do you set this up to work with a PS4? The PS4 has HDMI connection....", "response": "I just connect the headset straight to the ps4 controller with the 3.5 mm plug ..I don't know how to plug up the mixer though"}
{"product_id": "B00CD90R4K", "context": "how many players can play at a time?", "response": "I believe you can have six players at a time."}
{"product_id": "B00BGD6LMG", "context": "can you block the sexual situations like you can on some m games", "response": "Answer here...I am unsure, because it was a gift to somone.  Sorry ."}
{"product_id": "B00IRHE892", "context": "Does the middle mouse button (scroll wheel) depress easily? That's the one thing I didn't like about my MX518, it felt mushy at times.", "response": "It is not as easy as it should be. It is one of the worst middle click actions Ive ever used. I think the tilting action of the wheel makes up for this though."}
{"product_id": "B002BSA298", "context": "This items comes with the power supply cable for the old console?", "response": "No it does not"}
{"product_id": "B008X73CE8", "context": "what version will i be downloading", "response": "I've got version 1.5.0.0, but it's been awhile since I purchased so I may have patched since then.  I do have the U-boat expansion, and that was not from a patch."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "No this is not for an actual Nintendo 64. This is for a computer that plays n64 games on an emulator."}
{"product_id": "B000VRCNLG", "context": "Is this program compatible with Windows Vista?", "response": "It works with w7 though poorly.I would not purchase it again."}
{"product_id": "B000TT2D2A", "context": "can you use theese with rock band 5", "response": "Yes, they also work with rock band 7!"}
{"product_id": "B00HWMP0OU", "context": "Will this work on 2DS?", "response": "yes,but it won't be 3d"}
{"product_id": "B0002XJBGE", "context": "I tried to play Call of Duty 4 on my MacBook Pro with this controller.  Plugged it into my USB & it doesn't seem to control anything.  Any suggestion?", "response": "Make sure the Logitech software is mapped to the game. Check your game profiles and add CoD to the list.Also, it doesn't hurt to check your controller batteries."}
{"product_id": "B00H8NS1K8", "context": "with the open back, I'm concerned about audio bleed into the mic. can anyone comment?", "response": "The mic is unidirectional (meaning that it has to be facing your mouth to pick up your voice properly) so it does a pretty good job at not picking up background noise. I've never had that problem while I had the headset, so in all you should be safe from the audio leaking over to the mic."}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "Yes it does. This copy its for steam code to download waw .....steam its good.it already has all the patches for the game."}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes. It has a battle mode and training mode that you can choose a vs fight for two players. Enjoy."}
{"product_id": "B004QRKWKQ", "context": "Does it work well with the XBOX 360?", "response": "Yup. This controller works with the Xbox 360 and Windows computers. This controller will not work with the Xbox One, however."}
{"product_id": "B001PO2BJI", "context": "I'm getting a wii mini.Will these work?", "response": "The buttons and levers on the wheel stick and drag. The wheel didn't work well at all and we were not able to use it."}
{"product_id": "B002I0J4VQ", "context": "Does it come with all the cords needed?", "response": "Yes. It comes with an HDMI and a power cable. It also includes the controller USB charging cable."}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "If I remember correctly there's some sort of pull lever to allow it to unlock and slide down."}
{"product_id": "B00BS520SG", "context": "Will this work while playing Project M?", "response": "Yes sir it will. You also need to make sure you have the older models of the wii remote, preferably the ones that came with the original Nintendo wii.  The newer ones don't work with project M or while using this converter. Hope that helped!"}
{"product_id": "B00KAI3KW2", "context": "how many gig on the hard drive", "response": "does the xbox one have built in wifi"}
{"product_id": "B003ZSP0WW", "context": "the controllers come with the battery and charging cable? and come in black color?", "response": "The ones in question here are black though. They're just old controllers, if you're buying them for little kids, they'll never know the difference. If you're buying for a teen or older they won't be happy."}
{"product_id": "B0017Q4DGI", "context": "Is this game compatible with wii U?", "response": "Not sure but i dont think so"}
{"product_id": "B00IVJ1M7M", "context": "Does this work with the New 3DS XL?", "response": "Yes it does, you don't attach the device to your system at all."}
{"product_id": "B00C71034I", "context": "i sit two player", "response": "I don't think it has splitscreen"}
{"product_id": "B008MI7MWQ", "context": "Can you list all the games in this pack? Thank you in advance.", "response": "It has in it Cleopatra 2, Coyote Moon, Triple Stars, Siberian Storm, Aztec Temple, Bombay, Three Kings, Lotus Flower, Glitter Kitty, Wild Wolf It includes other less popular machines.Hope this helps."}
{"product_id": "B002RRLQIO", "context": "Does the keyboard come in the original box sealed, with everything in it like the software?", "response": "It did for me. But I  downloaded the driver from Logitech's site directly to get the latest version."}
{"product_id": "B009SJR28W", "context": "Can you toggle the backlighting? I think it's a feature that could come in handy, but I want to be able to turn it off.", "response": "the lighting on the keyboard is fully customisable, going from off to bright and everywhere in between."}
{"product_id": "B00FE8WKPQ", "context": "How much space do you need to use this effectively? Thanks!", "response": "at least 5 foot circle around it"}
{"product_id": "B006RJ373K", "context": "I just ordered X-Plane 10 Global Flight Simulator (PC & MAC).  Would you make sure that you send me the 64-bit version?  Thank you!!", "response": "You need to contact the vendor directly. This is for questions about how to use the product or its features."}
{"product_id": "B005EQE0YM", "context": "Do these plug into the 360 controller or into the xbox 360 itself?", "response": "The headset plugs to the 360 but the power source for them plugs to the USB on the 360 which doesn't get in the way of your game play. Amazing sound best investment, worth buying"}
{"product_id": "B00C7103DO", "context": "Can you play this on PS4?", "response": "Nope no game for the ps3 can be played on the ps4 also goes for the xbox 360"}
{"product_id": "B00ECOBFA4", "context": "Will this play on the Kinect?", "response": "if you read  the game systems dnttink it will play on kenect"}
{"product_id": "B004S5TDUQ", "context": "I just installed it today and it seems to be fully working, but says it is the demo. Did I get robbed or is this a developer oversight? Anyone else's PC version say it's the demo?", "response": "Can I use product key from this to activate on and install from steam? I need the cable (obviously) but the laptop I want to use for practice doesn't have a DVD drive."}
{"product_id": "B00FRESQYG", "context": "Will this game work with Microsoft xbox 360 controller for windows", "response": "No. It is PC/Mac only."}
{"product_id": "B00FAN4LRA", "context": "can I use these with xbox one ? someone please answer", "response": "Probably not pretty sure they are only for pc use. Also doesn't say they are compatiable with xbox in the description so I doubt they are."}
{"product_id": "B0015PHMFU", "context": "Does this work out of the box for PC or do I need to buy the \"Universal Adapter\"?", "response": "Yes works out of the box. Installation cd is included, but I didn't need it. PC recognized it right away."}
{"product_id": "B007A7K60A", "context": "will it work with HP touch screen?", "response": "sorry I have no answer for you"}
{"product_id": "B00E369SDM", "context": "does the controller come with the usb charging cable?", "response": "I do not know."}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "Will x box one play ps 4 games"}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "YES    perfect with no problems of any kind"}
{"product_id": "B000YMQGWU", "context": "Would this work with a Macbook Air?", "response": "Yes it uses the universal HID codec for usb. Works on my iMac should work on your macbook pro"}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "You get to create your own power saves on the pro version. The bad part is that they both don't play a lot of games unless try were update recently. I tried pokemon x, animal crossing new leaf, and donkey kong. Only donkey kong workerd."}
{"product_id": "B0076HD2W8", "context": "Does this connect more than 1 controller or do I need to buy multiple one?", "response": "It's supposed to connect 4 controllers AND headsets but I haven't needed to test it yet"}
{"product_id": "B0072A4JVW", "context": "Does it work well with the PS Vita Slim?", "response": "Yes. It works really good with the slim. It also bulks it up so you can grab it and hold onto it better."}
{"product_id": "B0044DJZ0A", "context": "Ok, thanks for response, I want to buy the Shift Keyboard in order to put my Starcraft Key set. Do you sell this Shift Keyboard? New or Used? thanks.", "response": "Yes, its manufacturer refurbished but works like new in the original packaging."}
{"product_id": "B00BHSTXV6", "context": "How does this thing handle dust, Are there any piano glossy black parts? If so I'm not buying it because I live in an EXTREMELY dusty area", "response": "I haven't had any problems with dust affecting the functionality, but it's black, and it has gloss black parts, so it shows dust. Any dust."}
{"product_id": "B007XVTR12", "context": "Can you play multiplayer, online, local, and zombies?", "response": "Yes, although not many play multiplayer on PC"}
{"product_id": "B007Y7OP8K", "context": "what is storyline of this game and its windows 8 compitable?", "response": "It's exactly what it says for once and no the disc version isnt."}
{"product_id": "B0098F1Y3K", "context": "will this game run on Nintendo DS XL?", "response": "Yes.  I use it all the time"}
{"product_id": "B000SOYG8U", "context": "I place the game in my DVD RW drive and it doesnt run at all even when i go into my computer and start it that way no luck any answers guys?", "response": "Dear Lee,could it be your graphic card, you must looking for the info if your pc support the game."}
{"product_id": "B000B9RI00", "context": "Hello, are these cards still valid? Because there is a newer version (the green one) Thank you.", "response": "as long as there is a code on the back it is, it's either 16 or 20 digits use edge of coin to reveal it. Good luck!"}
{"product_id": "B0072A4JVW", "context": "Does it come with l2/r2 buttons because I am trying to play ff8", "response": "The triggers as show operates l1andR2"}
{"product_id": "B000BT4CF4", "context": "Are these wired mouse controllers, genuine Microsoft controllers or knockoffs ?", "response": "They're the real deal, no worries."}
{"product_id": "B00ARD5410", "context": "how long is the mouse cord?", "response": "It's over 6 and a half feet! 6.75' to be exact!"}
{"product_id": "B009RHEBWA", "context": "Does it handle Trad IRA to Roth conversion in TY 2012?  I know it did for TY 2010.  TurboTax 2012 does not handle Roth conversion", "response": "IRS Form 8606 is included in the forms provided with the 2012 Deluxe + State + E-file version of \"H&R; Block At Home.\" Instructions are provided as well although, not having a neeed for the form, I can't speak to its ease of use or utility."}
{"product_id": "B0053B66KE", "context": "does it play on a new 2ds?", "response": "Yes, this game is playable on the 2DS. The 3D mode is just not available with the 2DS."}
{"product_id": "B00286BZ4Y", "context": "will this work on widows 7?", "response": "Yes.  Bought it for my GF and she has windows 7"}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "the red button default wise does nothing. but in the software you can program it to be like f3 or etc. so yes i can be re programmed"}
{"product_id": "B006W41X1S", "context": "Does it work with Xbox One?", "response": "If you purchase a Xbox One headset adapter you can use the X32 with an Xbox One and you won't need to use your Kinect for chat. For chat you would run a cord from the headset to the adapter, which lugs into the Xbox One wireless game controller. http://www.turtlebeach.com/products/accessories/xbox-one-adapters."}
{"product_id": "B005VA5D24", "context": "Dose I fit in the Xbox 360 E E", "response": "It fits on the latest xboxes that have the compartment door for HD hope this helps"}
{"product_id": "B003O6EE4U", "context": "Is this the slim model? How do I tell if my xbox, which came in a box just like this, is slim or not? Thanks!", "response": "This is the latest model of XBOX 360, other than the XBOX ONE, The size of the unit is about the same size a a Direct TV cable box."}
{"product_id": "B00GPH7Y8S", "context": "Do each of these games have single player options? I ask because IE 5 is required to play each of them?", "response": "Yes. There is a single player setting."}
{"product_id": "B00B3PDH5G", "context": "Just To be clear it can be used with a pc and how would I connect it to my pc?", "response": "Yes you are able to here is a link that should help you.  http://www.turtlebeach.com/support/entry/830517463/"}
{"product_id": "B00A2WP4UC", "context": "Does it include the sensor bar?", "response": "It does include a sensor bar that connects with a wire. However, the wire is super thin. I ended up breaking it by shutting it in a cabinet door.  But a wireless one will only run you about $20"}
{"product_id": "B00CH923NE", "context": "Is this game appropriate for a 7 year old boy?", "response": "I don't see why not."}
{"product_id": "B00I4BGNVM", "context": "If i buy this do i get a gamecode for the tamiel unlimited edition on steam or should i buy a different version", "response": "It's not a steam version but they have no difference between them. You can setup to have this game open in your steam library."}
{"product_id": "B00AJZNUUI", "context": "WIll I need to purchase any additional remotes so that more than one person can play at a time?", "response": "Yes, the Red Will Mini only comes with one remote."}
{"product_id": "B00AJILG1K", "context": "Is it possible to change the color of the profile LED indicator, thumbster keys, and LEDs in the upper right hand corner or are they always blue?", "response": "Those ones are always blue unfortunately"}
{"product_id": "B00F27JN8Q", "context": "If I buy the US version, do I have access to compatible digital vita titles I purchased in the PSN store? If so, must I stream them?", "response": "You don't stream the compatible versions. You just download an play. Everything else you stream."}
{"product_id": "B00D96BO7K", "context": "can this be used wirelessly to watch movies from my xbox 360? thanks", "response": "It is not a wireless headset but it is awesome nonetheless"}
{"product_id": "B009AGXH64", "context": "Can this stream netflix and amazon prime videos?", "response": "We use ours for Netflix.  Amazon Prime?  I don't know."}
{"product_id": "B003O6EDSM", "context": "Is this a hard copy, or just a psn download? I'd prefer to just have it as a hard copy instead of downloading a terrabyte!!", "response": "It is a hard copy. Nothing special. Just the three disk and 2 papers, propaganda. The manuals are digital inside the disks."}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "If memeory serves me right, yes, it opens up all 8 slots."}
{"product_id": "B004C4U1VI", "context": "am I doing something wrong? the cable doesn't work", "response": "Hi, the only suggestion I have is to make sure you have it set to the correct source. Otherwise you should send it back for a refund or exchange."}
{"product_id": "B009AFLXQQ", "context": "Never had a Wii, so I plan to use the Wii U to also play a few Wii games (via back compat). Can I use this controller or do I need something else? TIA", "response": "Not sure, most wii games does not use wii pro controller. You will have check the software's company. Sorry, can't help much. But from what I've read, the Wii U pro controller can't be used on older wii games."}
{"product_id": "B00I9GARIM", "context": "Hey, sorry, I couldn't find this answer in the description... does this headset come with extra ear cushions?", "response": "Yes, it comes with two sets.  A leatherette and foam set."}
{"product_id": "B00BT71S4K", "context": "Will it fit a small tablet like a Nexus 7?", "response": "Unfortunately no, I have two 5 inch phones it fits perfectly ( galaxy s4 and nexus 5) it will fit anything smaller and maybe even a galaxy note but I have a nexus 7 and it won't fit across the width. Although the controller works great not physically attached to any computer or tablet none the less"}
{"product_id": "B005EQE0YM", "context": "Do I need to buy a audio RCA cable", "response": "If you want to simultaneously hear game sounds and people talking to you at the same time for consoles, then yes. On PC, no."}
{"product_id": "B005LUUWL6", "context": "Does this work for 3DS games, or is it just a ARDS that works on the 3DS?", "response": "it only works on the 3ds until you go on the internet. after that it wont register whats so ever. it only works with regular ds games too. and you can manually put codes in the AR device too."}
{"product_id": "B007WPM9GO", "context": "Can this case be used for the DS Lite system?", "response": "I don't know and I would hate to tell it could."}
{"product_id": "B00E3667XQ", "context": "I have two question: is it able to play offline any game? does support steam application?", "response": "I believe there were some offline games on it but I can't be sure. It does support Steam."}
{"product_id": "B000K9Q5NW", "context": "I'm 5'3 with short legs, will this be a problem?", "response": "My daughters are less than 5,3 and the seat adjusts to their height without a problem.  It also supports me at 6,1.  Easily adjustable for us."}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "Yes, you can play without live"}
{"product_id": "B006JKARP8", "context": "Can I charge the charger itself using iPad adapter (any other USB power supply) or Vita adapter only?", "response": "Nope, you need the vita charger."}
{"product_id": "B002I08UGQ", "context": "Does this use the same charger as the regular dsi?", "response": "Yes it's the same charger. I had the old one now I'm tired of this one."}
{"product_id": "B000SOYG8U", "context": "will this work on windows 7 64-bit system", "response": "Easily, yes. I've run it on a windows XP, 7, and 8, and it has always run smoothly."}
{"product_id": "B0045FEEAS", "context": "Is this internet accessable for Netflix download and movies?", "response": "Every Wii (apart from the mini) has the ability to use hulu & youtube & netflix with built in wifi"}
{"product_id": "B000FRU1UM", "context": "what is different from this one and the other one bellow it?", "response": "i got this for a friend for his birthday so am not sure of the difference, sorry i couldn't help"}
{"product_id": "B005THAX5Q", "context": "Why is this game is this game so horrible", "response": "If you grew up watching Alien & Aliens. You'll find some things you really enjoy here. The game got way too much bandwagon hate, if you picked it up for $10, and gave it a chance. You'll probably enjoy it. Especially if you co-opted the campaign"}
{"product_id": "B006QRMR4S", "context": "So..  I'm not going to have to move to Japan and learn how to read and speak Japanese in order to play this system right??", "response": "Yes you are, book your flight a month before you buy it."}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "According to yahoo answers it might since the PS4 isn't region locked(when an electronic can only use items produced for its home country) but I'm not sure. Its probably best to buy the code from the country you're going to to be safe"}
{"product_id": "B0094X28J0", "context": "Does this come with the nunchuk as well?", "response": "No, you have to buy nunchuk separately."}
{"product_id": "B004RMK57U", "context": "i'm from Portugal , and i have a portuguese psn account , if i buy it ,will it work for me?", "response": "Sadly no. The one you're looking at will only work for PSN accounts based on the USA."}
{"product_id": "B000266786", "context": "Will it run on OSX 10.6 without classic?", "response": "It didn't run for me and I'm on an iMac running OS 10.6.8, without classic."}
{"product_id": "B00BMFIXKQ", "context": "Is this NTSC or region free?Thanks in adcance.", "response": "I believe the PS3 is a region free console.  So any PS3 game should be able to play on any PS3"}
{"product_id": "B00CXI0BPG", "context": "Is this Mouse for palm handed grips or Claw handed grips?", "response": "I use it palm grip"}
{"product_id": "B0018XWLKA", "context": "Will GTR EV. run on Windows 7, with a MOMO wheel? i have been burned before, buying games , then finding out they will not run on  windows 7... please help!", "response": "I use v 5.01  that came with the wheel.What one did you use because when I went to profiler i n the top left hand corner  select a device at top, select a game middle, play gtr evolution bottom and it still doesn't play"}
{"product_id": "B001PO2BJI", "context": "Do you have to take the remote out of the sleeve to use the wheel?", "response": "Purchased this as a gift for our grandkids, so cannot answer that question"}
{"product_id": "B00475AYUA", "context": "can anyone tell me why it said it downloaded everything for it then only downloaded colonization? bc everytime i go to open it up it says civ. comple", "response": "It downloads everything, but launches Colonization by default.  Kinda silly, but all you have to do is navigate to the folder and all the versions will be there to create shortcuts from."}
{"product_id": "B000TT2D2A", "context": "Is this a wireless drum set?", "response": "No, the Rock Band 2/3 drum set is wireless."}
{"product_id": "B00CTKHXFO", "context": "Do you need to download patches for both of the included discs?", "response": "im not sure. the game has been tested and it does work."}
{"product_id": "B000GCJ6MK", "context": "Does it work on Mac?", "response": "You would have to partition the drive of your mac in order to allow for this. I am going to attempt that. I love this game."}
{"product_id": "B00FATRKOK", "context": "Does this come with, or already have inside of it, a wireless adapter or will I need to buy a separate one?", "response": "If you read It has a WI-FI adapter already built into it"}
{"product_id": "B00ARD5410", "context": "Which is better M60 or M65? I heard some complaints about M65 acceleration,iso I want to know which one you recommend, especially for gaming?", "response": "I don't play game. But I usually use powerpoint program by M65 mice"}
{"product_id": "B00519C7JC", "context": "What does the \"Standard LTO\" edition come with and what does \"Standard LTO\" mean?", "response": "Standard Edition - Limited Time Offer"}
{"product_id": "B00CD1FC6G", "context": "Does this board still have the LED Issues? (Them dying off after a month or two)", "response": "Had keyboard for 4 months with no problems."}
{"product_id": "B002QHDKE8", "context": "Is their a difference with skate 3 platinum hits and regular skate 3, besides the price?", "response": "Platinum hits has an extra video or a special skater to unlock. Not really worth it.  Skate 3 is just about the same ."}
{"product_id": "B003ZMF26W", "context": "is comfortable this mouse with a claw grip?", "response": "Yes,although the back of the mouse is a little bulky claw grip can get tired after a good while of playing also depends on size of your hand."}
{"product_id": "B0057S9SYY", "context": "does it work with the xbox one console?", "response": "I play on the XBOX One with these all the time.However the MIC will not work with the XBOX One Chat Adapter because these are truly Wireless for the 360.No cord between the controller and headset.Amazing headphones and nothing on the market can beat them.These kill the best Turtle Beach headphones. Trust me I tried them all."}
{"product_id": "B0094H8H7I", "context": "can you save your game", "response": "What about games with password saves(like Gauntlet 4)?  Instead of battery saves?(which obvious don't work like Sonic 3).  What if the cartridge still has a good battery in it?  I understand the 40 Genesis games within the system won't save... but you can't save Cart games with a battery?  or a password feature?"}
{"product_id": "B007MJSZDQ", "context": "is this product junk?", "response": "Even when fully charged the battery packs would give maybe 3 hours or less of battery to your controller. However this product did keep me from buying batteries every so often...."}
{"product_id": "B00292OW1U", "context": "Do the Home/End buttons require additional keys to be pressed (aka Function key)? What about F-keys (F1, F2, etc)? Location of Home/End?", "response": "Yes all of the home/end. Arrow keys, etc are on the number pad, you have to press nmu lock to switch them. And the F keys require no activation that I've noticed, I'm always able to use them without any other key toggling them."}
{"product_id": "B00ACMM9BO", "context": "I lost my instructions.. Where can I get a digital copy?", "response": "Or give me phone # I can send digital pic? :)"}
{"product_id": "B001Q55D5K", "context": "Window XP/Vista? Would a PC game with a Windows XP symbol still work on a PC Windows Vista computer. Thanks", "response": "I have an Intel Mac running XP on a partition using VMware Fusion. Has anyone tried this and how did it work?"}
{"product_id": "B007Y7OP8K", "context": "Does this work on American Windows 7?", "response": "Yes it does. It is a US publication of the game all in English and everything so it works with English systems fine. I run it on American Windows 7 myself."}
{"product_id": "B00EEMLRTS", "context": "Is the actual game included in this pack?", "response": "yes it's included with the other goodies..."}
{"product_id": "B00005LBHM", "context": "The game comes with the all box stuff?", "response": "No, mine came just with the game. I think Gameboy color boxes are pretty rare nowadays. It'll probably jack up the price too."}
{"product_id": "B005YR1VP2", "context": "have it all cable which connect on tv?", "response": "yes it does! :)"}
{"product_id": "B00D96BMV8", "context": "This product brings Stereo Headset Adapter?", "response": "Yeah it comes with an adapter"}
{"product_id": "B007WPM9GO", "context": "I just want to confirm this works with the regular nintendo 3ds?", "response": "YES... It fits the regular 3ds perfectly......  looks great and really protects the DS.."}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "Yes tom it does...plus if there were ever issues there's compatibility settings so it will work with whatever programs"}
{"product_id": "B000056SPM", "context": "Does it use external power or just the usb? If it does use external power does it work on 240V?", "response": "Works on USB only."}
{"product_id": "B009XZ1CTQ", "context": "my grandson is 5 - can he do this game?", "response": "I checked with my 12 year old and he said the game might be too challenging for a 5 year old, can be done with lots of parental help.  He thinks 8 might be a better age but if your grandson is really good on the computer he may be able to have some fun with this."}
{"product_id": "B00CPKUV9I", "context": "Is a persistent Internet connection required for the game?", "response": "Is the minimum specs like an core 2 duo? Jw"}
{"product_id": "B0076DO5A0", "context": "If I load from disc will I still have to use Steam?", "response": "yes plus they auto update each time you start the game"}
{"product_id": "B009S4JZKK", "context": "Does this work on Mac?", "response": "Don't know! But it doesn't work that well on Windows - I would look for an alternative program, very disappointing"}
