{"product_id": "B000LQ4HTS", "context": "what are the box dimmensions?", "response": "I no longer have the box the system came in."}
{"product_id": "B001NXDBI6", "context": "Is there anyway to use the usb 2.0 ports to make this a wireless keyboard?", "response": "Negative, the USB 2.0 ports are simply for add on's. I use one for my mouse, and a second for my wireless air mouse when I'm reclining on my sofa in the office."}
{"product_id": "B00A2WP4UC", "context": "Does this system play Game Cube games?Does this system have the Game Cube controller ports on the side?", "response": "Yes it plays gamecube games"}
{"product_id": "B00D96BMV8", "context": "can i use with iphone", "response": "Yes, it has a 3.5mm 4-pole jack that goes right into the iPhone headset jack. You will be able to use it for audio and for chat/phone calls if you leave the microphone in."}
{"product_id": "B006W41X36", "context": "can you pair wireless headphones to it", "response": "I don't think so - but check with Turtle Beach!"}
{"product_id": "B0036VO4XO", "context": "will this work with a 32 bit os?", "response": "Mine is used on two multiboot laptops.  It 'just works' on WinXPpro64, WinVista64, several Linux distros Mint9(32&64), Mint12, Mint13, Fedora15, Sabayon, and all without loading any special drivers.  The package comes with windows drivers for optical output, but never installed or attempted optical connection.  It probably works ok on any reasonably recent OS."}
{"product_id": "B002L93F0A", "context": "Does it still come with two?", "response": "Yes they are supposed to"}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "http://www.gamerevolution.com/news/pc-version-of-titanfall-will-have-controller-aim-assist-23843 Controller support is there but if you want a controller, buy it for xbox. Keyboard and mouse is what's best."}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "It doesn't say so one way or the other at this time on their (Saitek) site.I would call the manufacturer to be sure.Better safe than sorry.I would contact them.Mad Catz, Inc.7480 Mission Valley RoadSuite 101San Diego, CA 92108Phone: (619)683-9830Fax: (619)683-9839"}
{"product_id": "B002RRLQIO", "context": "Is the Palm rest removable?", "response": "Usually. In my case I didn't get one because it was used, but if you get it new it should come with a removable palm rest."}
{"product_id": "B006KYYOSO", "context": "Does this game offer anything to single players/non-online gamers?", "response": "Good co-op and local play. So yes, yes it does."}
{"product_id": "B005FMLZQQ", "context": "Does this remote only control volume and power on a TV, or can it be used like any universal remote and change the channel, as well?", "response": "It controls our whole tv once we programmed it to the tv. Which wasn't too difficult. I don't even use my tv remote any more, I just use this one."}
{"product_id": "B002DOC93C", "context": "i have bought my first Nintendo, it is DSi XL. This classic games work in DSi XL??", "response": "Yes, it will work on the DSi XL, just not on the 3D models."}
{"product_id": "B00DCBDNW6", "context": "Monthly Fee???!!! u mean besides the PlayStation Plus Subscription and the Game Disk's actual price (37.58$) there is still a monthly fee?", "response": "Yes, 14.95 a month, here is a link that explains the fee pricing.http://www.gamefaqs.com/boards/678051-final-fantasy-xiv-online-a-realm-reborn/66951354"}
{"product_id": "B0001BR9Q6", "context": "will it download in Window 7?", "response": "Yes..downloaded onto Windows 7 on all three of my computers and had no problems."}
{"product_id": "B00B98HDNO", "context": "after i insert the disk and the game starts installing, it asks for a product code. Where can I find it?", "response": "It should be on the back of the box it came in. Good luck!"}
{"product_id": "B00006C2HA", "context": "Are there only 3 discs in this game?", "response": "I don't remember. I gave the game away after playing it.  The game kind of sucked. Sorry"}
{"product_id": "B00BZOBE78", "context": "do you need the original Civ V to play this?", "response": "Yes. This is just an expansion pack."}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "Not game console specific. Works on all game consoles."}
{"product_id": "B001IYR53W", "context": "I have the 2005 version but it does not have SPIDER,a  solitaire game..does this version have it.  Thanks", "response": "Yes, the 2008 version does have Spider solitaiee."}
{"product_id": "B00FENJVOE", "context": "Is the entire \"expansion\" really just one additional Act V?", "response": "Yes, it's just one act. A bit pricey for that but I thought was some cool gameplay."}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "Personally I play Off-Line. I don't care for Multi-Player.  Because I am 100% Solar Powered, the Wild Blue Satellite Internet drains my batteries. So, the answer is \"YES\"."}
{"product_id": "B0086UK7I6", "context": "Can you use fingertip or claw grip with this mouse?", "response": "Have never tried as I have really small hands. I use a palm grip. But, I love this mouse. It has really improved my game."}
{"product_id": "B004GINKNQ", "context": "can you use it on the xbox 360 E?", "response": "I uses it in my xbox 360"}
{"product_id": "B00BMFIXOW", "context": "Are there many sessions going on in MP in general? And how is the support? MP in the PS3 version is dismal at best.", "response": "Yeah pretty much. The support can be kinda confusing. But I don't play mp."}
{"product_id": "B001DNGCN2", "context": "does this fan fit the 60 gig ps3 or the 40 gig ?", "response": "does it fit 80 gig ps3???"}
{"product_id": "B00AU80ZSY", "context": "Once Ticket to Ride has been downloaded, will I be able to play without an internet connection?", "response": "I would not download it... I did and was NEVER able to play it...buy the box game you'll have more fun,."}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "It just plugs into your controller. No extra batteries needed"}
{"product_id": "B002BSA20M", "context": "can this be played online with friends", "response": "this depends in what context, the campaign is only coop (two players), and multiple online gametype in multiplayer matchmaking can only have specific party sizes. However, any custom gametypes (local) can have a party of 16 players, whether it be on xbox live or LAN connection."}
{"product_id": "B002I0H2G0", "context": "the game is a physical cd? or is a code to download it?", "response": "Phisycal cd and it never left buenos Aires,"}
{"product_id": "B002I090AG", "context": "would the charger and pen be included with the console/", "response": "It was in mine.  I expect it would be in others as well"}
{"product_id": "B001BYMZ5W", "context": "Is there an inline mute for the mic?", "response": "If you're using the USB, yes.  If you're using the headphone jack on your computer for them, no."}
{"product_id": "B00BGAA3S2", "context": "Does the camera come with a mount? I've read and watched reviews and they show a mount included. I just want to make sure it comes with one or not.", "response": "Yes, its a nice mount too."}
{"product_id": "B00ATHFLZS", "context": "Does this product have a warranty", "response": "3 years manufacturer warranty"}
{"product_id": "B00HEX8TA4", "context": "Can you change to any color without the dpi changing? Or is each color locked into a dpi preset? Thanks!", "response": "The colors are locked to the 4 presets as far as I can tell, but you can change the sensitivity of each preset. Usually the most sensitive preset is this weird pink color, but I changed it so that the green color was the most sensitive because I like it more."}
{"product_id": "B00CTKHXFO", "context": "I see it has MGS 3 HD. Is that snake eater or subsistence?", "response": "It's the same ass the metal gear HD COLLECTION BUT INCLUDES A code for mgs1 and the disk for mgs4"}
{"product_id": "B005J37I4Y", "context": "Will this make my sons current Bluetooth earpiece for Xbox 360 work with Xbox one?", "response": "That wont even fit properly into the controller. I have both systems, and sure wish it worked that way! The connections on the bottom of the remote are very different."}
{"product_id": "B00CJ7IUI6", "context": "Is there any nudity in this game ? (this is the only problem I have against getting the game) please reply-thank you", "response": "There is no extreme nudity as the characters, when stripped of their armor (or clothing), is covered up by undergarments."}
{"product_id": "B00I4A751U", "context": "Does it has a black label or is it greates hits (Red Label)?", "response": "Got ripped off by buying it second hand from a mohammed in Thailand (in turns out). Never came. Had to ask for money back."}
{"product_id": "B00BQZ5EWW", "context": "if i buy Total War: Rome 2 will the Imperator Augustus be add or do i have to buy Total War: Rome II - Emperor's Edition to get it ?", "response": "It says that its not on steam, but isn't that the mode where you are rome in three different areas?"}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "Yep...I'm responding to this on the keyboard, and it is indeed QWERTY."}
{"product_id": "B00GZ9ESEE", "context": "is this Kinect compatible", "response": "Yes, it is!! :-)"}
{"product_id": "B003VH5Z2C", "context": "is it hard to hook up", "response": "It function very good like any other video games."}
{"product_id": "B00ARD5410", "context": "is this mouse for right or left hand??", "response": "Right by default.  Not sure if there's a left hand version."}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "You need to go to SETTINGS using your PS3 controller and configure the ACCESSORIES. You can't just use your remote out of the box."}
{"product_id": "B004L6C6BK", "context": "do i need any other cords to hook this up with my a40s to use on 360?", "response": "No other cords needed."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "Yes you need internet connection for your ps3 to download the update. It takes around 45 minutes to install."}
{"product_id": "B0038MVFYC", "context": "Is it possible to catch the following?:    Tympole,Venipede,Chimchar,  Please respond and tell me if I can catch these pokemon. Thanks!", "response": "Chimchar is the only one in that game. The others will have to be traded or hatched I believe."}
{"product_id": "B005FMLZQQ", "context": "How does it communicate with the XBOX 360?  Is it IR, RF, or Bluetooth?  I need to know because my XBOX is kept in a component rack.", "response": "I believe it uses IR or RF. It does not require Bluetooth. But it does work either way with the xbox 360"}
{"product_id": "B002I0JZIS", "context": "does it have nuketown", "response": "Not really, it has some miliraries, and also eauropean"}
{"product_id": "B0091WIOJ2", "context": "Its campatible with windows 8?", "response": "Yes, as long as you have optical output."}
{"product_id": "B004W1IX1G", "context": "Does this deal come with the \"Wii Motion Plus Adapter?\"", "response": "No u need to buy them in less your remote control has it built in"}
{"product_id": "B0050SYILE", "context": "Why it is only 29$?", "response": "It's listed at $29.99 for the standard Xbox 360; I paid 39.99 & had free shipping.  I see this game is offered for trade in or used at $12.00 which means supply is high and demand is less, therefore, the price is reduced to sell the product."}
{"product_id": "B00BY0G0YU", "context": "What's the difference between the Standard edition, the Special edition, and the Collector's edition? I have an American PS3 and I'm trying to decide", "response": "Game play wise, there is no difference at all. The only difference is what the Special & Collector's editions come with, (which is explained in the description) and what you are willing to pay for."}
{"product_id": "B004RMK4P8", "context": "So my PSN account is registered as US but the problem is in amazon because I need an address. but if I try to put my address outside US it wont let me", "response": "You must hace a US address in order to buy it"}
{"product_id": "B00012YI14", "context": "I have a Xbox 360. Will this adpater work with the Logitech G27 Racing Wheel  system?", "response": "No, it will not work ."}
{"product_id": "B00CPKUV98", "context": "Is this 720p or 1080p resolution?", "response": "The game is 720p on the PS3."}
{"product_id": "B00009ECGK", "context": "Can I use this game on Windows 7 Ultimate, and will I be able to install this game and play it without the CD?", "response": "It should work on windows 7 and i don't remember if mine has to use discs. I think you can make it so you don't have to."}
{"product_id": "B0058FAEAS", "context": "Can you trim the plane with this product or do you need the trim wheel and can you use a rutter function without buying the peddles", "response": "You can trim it by configuring some buttons. But it is far better to buy the trim wheel (what I did)."}
{"product_id": "B00EPZ8POY", "context": "does this game works with any ps3 console(usa)?", "response": "Yes it does , you will love this game :)"}
{"product_id": "B0058GMO0A", "context": "will it run on windows 8?", "response": "I have Windows 7 Pro. So should be O.K."}
{"product_id": "B001UIG6M2", "context": "is this for European consoles or US consoles?", "response": "it actually has codes for both EU and US, you can even put in your own codes you find online :)"}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "YES SIR MINE DOES HAVE FUN."}
{"product_id": "B00EPC3PY2", "context": "What language are the dialogues, subtitles, and the game menu?", "response": "English, only the audio is in japanese"}
{"product_id": "B004J6KRD6", "context": "Is this the gt5 or gt6 version, and what if anything is different?", "response": "GT6 version when I got mine. There is no difference except packaging and different cooling vents on top."}
{"product_id": "B00ARD5410", "context": "Is it compatible with windows 8?", "response": "Yes I use it with 8.1 with no problems."}
{"product_id": "B005OSFUZI", "context": "Can this cable be used for software other then Rocksmith/Rocksmith 2014? (like garage band or some other sound recording software)", "response": "Not entirely sure, but it's possible. Just do some digging and there might be a way to make it work with other programs."}
{"product_id": "B0002EAA36", "context": "Is this windows 8.1 compatible?", "response": "I wish I could help you, I am using mine with Windows XP and it works fine with XP."}
{"product_id": "B00F27JN8Q", "context": "Can the Japanese Vita TV's AC adapter plug into a US wall socket without problems?", "response": "Yup! Comes with a U.S. plug"}
{"product_id": "B0050SYR74", "context": "is this for just the head set or dose everthing come with it", "response": "It come wit everything. It is good for the price (:"}
{"product_id": "B00HHUSNPU", "context": "Where do you ship from?", "response": "We Are Ships From China,shipping by USPS with tracking number from China 7-14 business days delivery."}
{"product_id": "B002672Z80", "context": "I bought two of these remote, pink and blue, as Easter gifts for my kids.  Any hints on how to get them to sync with the Wii system?", "response": "I had a very hard time. I held the sync buttons down for a while and it worked once then never would sync again. If you want your money back , contact customer service (Amazon) immediately"}
{"product_id": "B00656HLGO", "context": "It says 320 GB yet only has 293 GB available, what happened to the other 27 GB?", "response": "They usually have certain amount for software just as in pc you get 1000gb its still only 950 or so... works great tho.. had to change the name since its a non manufactured hard drive from xbox"}
{"product_id": "B000ZKA0J6", "context": "Is this the base game?", "response": "Yes. This is the first release for the Starcraft 2 series."}
{"product_id": "B0045ZB66I", "context": "can you use a mouse to play this game?", "response": "Yes! I wouldn't recommend to play this game any other way."}
{"product_id": "B003JVF728", "context": "It may be a stupid question, but if I buy the disc version does it still use Steam?", "response": "Yes. All PC version of CoD Black Ops must lunch through Steam. And to play this games the code in the disc box is necessary and sometimes the discs are unnecessary."}
{"product_id": "B00EVWZHLK", "context": "Is it a multiplayer game?", "response": "I saw a multiplayer option in the games, i haven't played them."}
{"product_id": "B00D2EGWDA", "context": "Unlike the launch version, does this version include a separate code for the 1st DLC or is it included the PS3 disc?  Expiration date for code?", "response": "include a separate code"}
{"product_id": "B00919RM1Q", "context": "Can this verison be used on Windows8?", "response": "I'm using it, although seems to effect speed on internet"}
{"product_id": "B000B78F72", "context": "Does this cd have the ORIGINAL CLASSIC SOLITAIRE????    I already purchased a cd that had 100's but did NOT have the classic game I wanted.....", "response": "Since I don't know what the \"Original Classic Solitaire\" is, I suggest you contact the creator @ www.goodsol.com for the answer!"}
{"product_id": "B006POYBUA", "context": "Does it works with the white Xbox 360 (non slim)?", "response": "Yes it will.. That's what it was made for."}
{"product_id": "B00519C7CE", "context": "Call of duty black ops LTO Edition x box is it  black ops 1", "response": "Yes. This comes with a free DLC code as we'll."}
{"product_id": "B0036WTVNG", "context": "Is this compatible with Android devices?", "response": "Do not buy it. It is not well made."}
{"product_id": "B005761IOY", "context": "i bought one of these controllers and like it doesn't turn on without being plugged in to the charger is there a way to fix that", "response": "My husband's does same thing. Amazon ripped you and I both off."}
{"product_id": "B00EPC3PY2", "context": "GameSeek has this game listed twice for 2 different prices. Can you tell me how they are different?", "response": "Most of the higher priced one piece games are the English games and Japanese ones sell for less"}
{"product_id": "B00FXOP1MU", "context": "Does this come with charger (meaning that I don't need to buy things other than this)?", "response": "Hi Filipe. Yes, it comes with a charger. Mine did not come with an SD card as advertised, so I contacted customer service and they were very quick to send me one :)"}
{"product_id": "B00B312UDU", "context": "Can someone please tell me the battery life on this mouse before I buy? (I use the comp 6-8 hrs a day with some Diablo 2 and 3)", "response": "I generally do not turn the mouse off when it is not in use, so that wastes battery a little, but I'v had it for eight months and I have only replaced the batteries once. I use it maybe 15 hours a week for gaming and I also use it instead of my laptop's trackpad for daily use."}
{"product_id": "B004J6KRD6", "context": "Is this the gt5 or gt6 version, and what if anything is different?", "response": "Same thing. I play GT5, and 6 with it. Best experience in my life lol"}
{"product_id": "B00ESN8YGW", "context": "do i need steam to play this? what if i don't have it? can't play?", "response": "yes, i can't active it"}
{"product_id": "B002I0J5CO", "context": "If I plug the green cable in to my iPod touch, will I get sound?", "response": "these headphones will work in any headphone jack as long as you have the USB plug into an outlet. (IPod, phone, computer. ..)"}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "christine sorry but i cold not get it to work on my windows 7 64 bit os.  thought i solved the problem using the compatibility tool but no go.  if you find out how to get it to load and work on a 64bit system i would be very happy.bob p"}
{"product_id": "B00IRHE892", "context": "Does the middle mouse button (scroll wheel) depress easily? That's the one thing I didn't like about my MX518, it felt mushy at times.", "response": "it's a bit too easy for me. mainly due to the wheel itself rolls too easily. as a result, often times i intend to \"click\" the wheel, but instead end up click and scroll at the same time. you have to becareful when you click and not scroll."}
{"product_id": "B00BGAA3S2", "context": "Is there an extension cord for the camera available?", "response": "Not yet, I'm gonna need an extension too. My Ps4 is 10 feet from my TV. I'm gonna wait until there are better games before I purchase one."}
{"product_id": "B008EZ3PBY", "context": "Does the xbox reset if you switch your tv to cable or something else with these aftermarket adapters. Do you have that problem with this one?", "response": "The one I bought hasn't done that to me yet. It seems like a pretty quality product."}
{"product_id": "B0040UAYI4", "context": "How is it compared to keymander?", "response": "I don't know as I've never heard of Keymander until now. Only thing I can suggest is to find reviews on both. I will say the Eagle Eye works well and is configurable for all the PS3 buttons and sensitivity, so it gets a thumbs up from me. ;) Hope that helps."}
{"product_id": "B00919RM1Q", "context": "Does this game work with Windows 7?", "response": "Yes, I have it installed on Windows 7!"}
{"product_id": "B000I10PY2", "context": "Does this come with a charger?", "response": "They almost always come with the charger. It is very rare that the system is sold without one. Styli and GBA port covers are often the only thing missing from this purchase."}
{"product_id": "B00IAVDQCK", "context": "Does the set come with a mic monitor (or the ability to hear yourself speak from the mic)", "response": "It does not come with a mic monitor and you cannot hear yourself thru the mic when you speak. Sorry."}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "You cannot set individual key colors"}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "No the card doesn't expire until you enter the code then it is like a normal membership after a year is up then you need a new one and they are stackable so you could buy it now and save it till the last day of your membership then add it and it would combine them"}
{"product_id": "B00E1L786S", "context": "What is frequency responce?", "response": "Check this link out:http://en.m.wikipedia.org/wiki/Frequency_response"}
{"product_id": "B002HH9TUG", "context": "Has anyone ever tried to remap the R1 and R2, L1 and L2 buttons on the PS3 and get that to work? (do not use CAN in your answer; only DID)", "response": "Yes you can. Press and hold middle button(glowing blue) then wait for it to blink then press the two buttons you want to swap one after another."}
{"product_id": "B00D96BNGM", "context": "Does it come with OEM Box?", "response": "mine did. in origional box brand new.if you have a playstation 4 go to turtlebeach.com there is a cable that goes from the controller to the headphones 9.00this was my 3rd turtle beach headphones, I passed them down to my niece and nephew. turtle beach are awsome"}
{"product_id": "B00B1N07QM", "context": "DOES A GAMING KEYPAD REPLACE A GAMING KEY BOARD?", "response": "No. I use my Razer for SolidWorks 3D modeling and also Final Fantasy XI (mmorpg). I also use a 3D Connexion Space Pilot in parallel in SolidWorks.Interaction with other players is done via typed messages in FFXI, for that reason alone a gaming keypad would not replace a keyboard. Logins are another reason."}
{"product_id": "B00B98HDNO", "context": "Any chance I could get this to work in Linux?", "response": "No, Linux is not a listed operating system on this version."}
{"product_id": "B001O3066U", "context": "can i download this edition", "response": "I had the CD sent to me from Amazon, don't know if this can be downloaded.   Sorry."}
{"product_id": "B00012YI14", "context": "I have a Xbox 360. Will this adpater work with the Logitech G27 Racing Wheel  system?", "response": "This only works with Xbox original and  the GameCube/Wii there are no USB adapters on it so it will not work for your 360"}
{"product_id": "B009AFLXJS", "context": "Does it works in wii games at the Wii u's wii mode?", "response": "No it does not,  It's made for Wii U only."}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "I haven't had an issue with it. it will act a a \"back\" button by default when surfing the web so if you do it that might be annoying but the side buttons are much more likely to get accidental presses"}
{"product_id": "B002I0H2AG", "context": "Can I still enjoy it as a purely single player experience (for the price)?", "response": "Yes. Good story line. Kicks butt as much as others."}
{"product_id": "B009AFLXZM", "context": "does it work with just dance2015", "response": "I'm not sure as I ordered the incorrect microphone. Our kids just have the regular Wii system. will have to figure out what to do with this WiiU microphone."}
{"product_id": "B00BU3ZLJQ", "context": "can this game and others be played without signing up for xbox live?", "response": "I'm sure almost every Xbox game can be played in at least some way without having an Xbox Live account, just depends on what you want to do. As for Minecraft in particular, you can absolutely play without an account alone or with 1-4 players on the same system."}
{"product_id": "B00BDX1M00", "context": "Is there a way to set this up with the ps4?", "response": "Yes works on ps4 pc and xbox 360 just fine"}
{"product_id": "B006LVZEN0", "context": "Is it good for Large and Wide hands?", "response": "yess, it has a plate that you can put on the right side that you can rest all your fingers on, and the pam rest goes out almost liek 2 and a half inches max, but there is also a 2ndary palm rest that is higher up that will fit even larger hands"}
{"product_id": "B00BGAA29M", "context": "Good day, the game has the Spanish language.", "response": "According to my son, you can change the settings in Playstation 4 so that everything is in Spanish. You also need to set Knack to Spanish."}
{"product_id": "B0000A2TPE", "context": "Do you have to have a cd drive to play it?", "response": "Yup! You do. It's a physical copy with three discs."}
{"product_id": "B000B6MLPU", "context": "I have the new xbox model. It's called the Xbox E . With this model it only has a hdmi port. The picture makes i look like it will fit. Will it work?", "response": "No this has a component out to original 360 receiving end. This dose not work with an hdmi output."}
{"product_id": "B00EZKNT5O", "context": "what am i doing wrong? my computer registers that this controller is present and what it specifically is, but is unresponsive in 2 different games...", "response": "usually it is the game where you have to enable controller use"}
{"product_id": "B00B23MO9Y", "context": "Hello, I ordered this game and when i tried registering for my playonline account it said the Registration code was invalid/used.", "response": "I have no idea. I never unwrapped the game when I got it. I do not have Final Fantasy XI Base so I was unable to use the game. The game was listed as new when I bought it so that seems strange to me. Contact Microsoft about it and ask them...that's all I can think of."}
{"product_id": "B0050SVHZO", "context": "the old wii remote works with wii U?", "response": "I don't think so. This was a gift for my nephews but they are happy with it as an upgrade."}
{"product_id": "B00CMC6HCY", "context": "Is Ultimate Warrior on this game, and can you play as him? I've read contradictory-sounding things...", "response": "he is in the game but you cant use him unless you pay $2"}
{"product_id": "B00GU4F4OM", "context": "How big is this thing?  I have large hands and FPS gaming can be a pain because my thumb and pinky usually drag on the mouse pad causing my shots to..", "response": "It's huge. Trust me. Also very lengthy."}
{"product_id": "B00IP0H4GA", "context": "so it definitely plays on us ps3's?", "response": "si yo vivo en colombia y lo juego muchisimo de hecho ya me lo pase en dos modos diferentes"}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yes, mine hooked up right away"}
{"product_id": "B00JFPO7JG", "context": "Can tropico 5 play off line?", "response": "Yes it can, it is mostly offline but you choose to play onkine"}
{"product_id": "B00E9I1FPI", "context": "Does it works in w8.1?", "response": "Yes, I have 8.1 as well and all the games run fine."}
{"product_id": "B00GJSUUC0", "context": "Is Phantom Pain included? What does unlock bonus MGS V Phantom Pain with Ground Zeroes means?", "response": "Not sure but game takes an hour to beat. so kinda sucks that don't last long. but its fun game for the hour lol"}
{"product_id": "B00B5QLS4A", "context": "can you turn led off", "response": "Actually yes, the software allows you to turn it on and off.I have had the M95 and K95 for some time now and still love them both."}
{"product_id": "B004L6C6BK", "context": "Is the 2013 version (this one) experiencing the same mic sound degradation issues as users of the 2014 version are reporting, particularly for PS4?", "response": "I use the model pictured and have no issues. Owned it for a few months,...used daily at least 4 hours to10 hours per session. Any issues it may have had out the box I never dealt with. I upgrade the firmware upon receipt of the product."}
{"product_id": "B009DYCTY4", "context": "what is the Quantity of weight of console", "response": "2.1 kg just the console, 2.5 kg the bundle. (Aprox.)"}
{"product_id": "B000YQ639M", "context": "do i need steam to install Medieval Total War II Gold Edition?", "response": "If you're going to purchase it from Steam, then obviousy yes. If you purchase it from Amazon, no. I purchased the download version of MTW II . No Steam required, even in disk format."}
{"product_id": "B007SRM5MO", "context": "are this games safe for kid 14 yrs old", "response": "It has violence, but no blood. I think it would be okay, no killing involved."}
{"product_id": "B002I0GF72", "context": "What controllers are supported?", "response": "Gamepad and Wii U Pro Controller"}
{"product_id": "B00ENFVJJO", "context": "Does this charging stand require that you attach some type of receiver to the actual controller?", "response": "No, you just push down on the controller once set in the cradle and it \"clicks\" into place and starts charging.  It's instant."}
{"product_id": "B002672Z80", "context": "is it user friendly?", "response": "Yes, it was easy to set up. It worked perfect."}
{"product_id": "B00BHSTXV6", "context": "Can the macro keys activate AutoHotKey scripts?", "response": "I haven't tried it - but I don't see why not. You can run anything"}
{"product_id": "B00AJZNUUI", "context": "do the regular wii controllers work with the mini?", "response": "Yes, you can use use the same controller."}
{"product_id": "B00IYWV5HS", "context": "Is this just a code or will any portion of the game files be downloadable from amazon? I am having a great deal of trouble using NCsofts client.", "response": "this just the code. you make a Ncsoft account and enter the code there and thats where you download it from."}
{"product_id": "B001NT9TK4", "context": "does this wheel work for consoles mainly the Xbox 360 or PS3?", "response": "Ps3  and PC only, XBOX 360 does not accept this wheel, only Microsoft branded wheels can be used on XBOX"}
{"product_id": "B0050SVHZO", "context": "the old wii remote works with wii U?", "response": "they work like a charm"}
{"product_id": "B00BCEK2LA", "context": "I currently have the MX 518. Anyone have a comparison in both use and size?  I have smaller hands and have a heck of time finding a gaming mouse.", "response": "From the images I looked at of the mx518, the g400s looks the same size. The g400s is exactly like the old mx510. This is a great mouse."}
{"product_id": "B00D6PTMHI", "context": "Does it work on a macbook air?", "response": "I have had no luck on my mac and the customer service is not helpful."}
{"product_id": "B00005QEFD", "context": "does it comes in with the original box", "response": "Mine did not; however it was used and it came with an original GameCube card and control. That's about it. I guess it depends who you get it from new or used."}
{"product_id": "B0086UK7I6", "context": "What is the texture like on this mouse? Is it slick like Razer mice, or lightly textured like most other mice?", "response": "it has a matte finish plastic. not really any texture to it"}
{"product_id": "B00EWEHI5K", "context": "How well does the Ouroboros perform on non-traditional surfaces, such as cloth?", "response": "How about a steelseries glass pad (i2)?"}
{"product_id": "B003N3HEU0", "context": "Does this game have robots to play with in an offline mode? I do not plan to go online with my wii.", "response": "the online servers for game are still up youtube it saw someone play it 6 days ago online mw3 and stuff are still online"}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "Much more details in this one with a lot more definition.  Plays the same so controls are familiar, plus all doc is there."}
{"product_id": "B0080RAT42", "context": "I would like to know if there is any lag? I play Ultra Street Fighter IV and a game like that requires quick response time.", "response": "i have used  mortal kombat on a genesis emulator, which is similar to street fighter. response time is fast and never laggy or unresponsive. however i used the official genesis controller, i don't know about a gamepad"}
{"product_id": "B000WCCURW", "context": "Does this game have multiplayer mode?", "response": "Multiplayer feature allows for 2-6 players to play on the same server. This uses a centralized pairing system run by Gamespy"}
{"product_id": "B0087N222Q", "context": "How do i plug this pair of headphones To the ps3 so y can speak With my friends(black OPS 2)?", "response": "When I had question as to how to use with ps3, I contacted the seller and he sent me directions on how to set up. I just printed them and handed them to my son. He had no problems."}
{"product_id": "B00GZ1H07Y", "context": "Does this game have 3D capability?", "response": "I find myself missing shots watching the great visuals."}
{"product_id": "B00FYMTUQY", "context": "My TV is curved and is mounted about 8' off of the ground.  Are you able to adjust the direction the Kinect points while on the stand?", "response": "It requires the top to be flat even surface to mount. and yes my tv it mounted pretty high on the wall and you can adjust the kinect mount to point more down or up"}
{"product_id": "B00562O8U0", "context": "my tv is a Samsung and infrared / shutter/ battery glasses. one of the first 3d tv. will they work ? I really want them for mulitplayer", "response": "Yes they will work but they wouldn't look all that cool, it's barely 3D if anything it'd probably look more HD"}
{"product_id": "B000B6MLPU", "context": "the cable does not seem to fit into the x box anywhere.  Do I have the wrong cable? Or is there somewhere it should connect?", "response": "There are different versions of the Xbox 360, the earlier version has the proprietary connector which is the same as on this cable, the newer version of the Xbox 360 has the HDMI port. I made the same mistake and suspect the cable that you have is no good for your application. Sorry!"}
{"product_id": "B00IAVDPSA", "context": "Can you use the remote to change the source input on your receiver?", "response": "Nope. It ain't got it in it."}
{"product_id": "B00000K4MC", "context": "Will it work with Windows 8?", "response": "I do not have it, sorry I can try my mom's computer but not til sunday"}
{"product_id": "B00DLDEKOK", "context": "is it compatable with xbox 360 slim?", "response": "Hello Tena, Im not sure, but my Son's friend has the  Slim and when his headset broke my son let him use his so i will assume they work, his mother bought him his own. SO FAR SO GOOD!!"}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "Where can I get the drivers for this? i have windows 7 64 bit and can not get it to update or find any drivers online and I already tried Windows.com"}
{"product_id": "B004RMK4BC", "context": "How do I get my code", "response": "If you are using Amazon app you will get an email if not there will be a pop up with your code"}
{"product_id": "B0081Q58AW", "context": "Is it all strictly PvP or is there some PvE as well?", "response": "Alot of PVE mainly but it does support a decent amount of pvp so far."}
{"product_id": "B000OPOCFU", "context": "Will this work with Windows 8.1 64 bit?", "response": "I don't know for sure - I was using windows 7., 64 bit and it seemed to work ok.  There were some bugs and hang ups but it eventually worked ok"}
{"product_id": "B00EADTVL2", "context": "What happens if i leave the dualshock 4 on the charging station while it is plugged it even when the battery of the dualshock 4 is fully charged", "response": "You get sent back to 1988."}
{"product_id": "B00B5QLS4A", "context": "How does it compare to the Logitech G600? I own a G600 and my fat thumb has a hard time finding the 12 side buttons. I end up only using 3 or 4", "response": "I never used a G600 but just by looking at comparison pictures of the two I would imagine it would be a lot easier to use the M95. I'm gradually increasing the number of buttons I am using with my thumb, so far I'm up to 5 okay with no real issues ergonomic wise."}
{"product_id": "B00DWXUYN0", "context": "Can you fit the charger in the case as well ?", "response": "No you can not."}
{"product_id": "B00FLLFJE0", "context": "How does the base recharge the batteries? Does it plug in? Or does it have to have batteries in it?", "response": "That's the thing, no more batteries!"}
{"product_id": "B00E1L786S", "context": "will this work on a lg smart tv? thanks", "response": "yes, it comes with various connections. Best with an xbox 1."}
{"product_id": "B00BV72X1U", "context": "how does this work i got this in mail and disc wont read i think its too small", "response": "Try this link: http://www.microsoft.com/hardware/en-us/d/xbox-360-wireless-controller-for-windows This video should also be helpful: http://www.youtube.com/watch?v=qY8PIGO_li8"}
{"product_id": "B006IR6NH8", "context": "Is the item durable?", "response": "The wheel is very solid.  When you feel it you know it will last for a really long time.  I use mine all the time and have had no issues at all with anything breaking or even showing signs of wear.  It is a well built piece."}
{"product_id": "B000LQ4HTS", "context": "Is there preset button mapping for Elite Dangerous available? Has anyone used this particular HOTAS in Elite Dangerous, and how well does it function?", "response": "Yes, Elite;Dangerous has a preset in its settings. It works well, but I use pedals for yaw."}
{"product_id": "B00JM3R6M6", "context": "If I'm an adult and I play this game, should I be publicly executed or just shunned from all society?", "response": "Hope not. I am 57 and having a blast playing it."}
{"product_id": "B00E1L786S", "context": "26.5 pounds ? but other webside said it just 4kg,are you sure about this?", "response": "Lol, it's definitely not 26.5 pounds. Can't tell you the exact weight but it's not that."}
{"product_id": "B0002XJBG4", "context": "Is it for Windows 7", "response": "Like everyone else said, it works fine on Win7, which is what I am using right now."}
{"product_id": "B003OZOAKY", "context": "Will Rome Gold Edition work with Windows 8 ?", "response": "I don't know for sure, but I'll check. We gave the game to my mom since it was too hard and complicated for us, I'll find out from her. I would think that it should work with Windows 8 though."}
{"product_id": "B00D96BMV8", "context": "Is the mic detachable?", "response": "Yes it is detachable"}
{"product_id": "B00292OW1U", "context": "Does it have volume controls on it and a mute button? The picture does not zoom in so I can't see.", "response": "Yes, just above the gaming panel on the left there are a series of buttons, an up and down arrow, and a speaker with an x. These are your volume controls."}
{"product_id": "B00GOOSORM", "context": "I'm currently stationed in Japan right now but I have an account registered in the NA region. Would I be able to use this to add days to my account?", "response": "You can only use a time card based on your account so if its an american account only american card will work and vice versa"}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "page 14  of master guide  included with the box is information on the 2 year limited warrantyyou can view details here http://www.razerzone.com/warranty"}
{"product_id": "B00DCDZM2I", "context": "is this compatible with xbox 360?", "response": "This was not complicated at all. The graphics are brilliant. . . my six year old loves it to pieces!!!"}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "No, it is not necessary. The game has a 3d perspective."}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "No, it is not. It is a very nice roll and not hard to move at all, though."}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "No, it plugs into an adapter that plugs into the Xbox controller"}
{"product_id": "B00BQWTGIS", "context": "Does the PC version on disc also come with a steam code?  I'm guessing no because of UPlay but figured wouldn't hurt to ask.  Thx! :)", "response": "I have the retail version, and it is for Uplay only."}
{"product_id": "B008X73CE8", "context": "What is the difference between SH4 and SH4 gold edition?", "response": "I believe the gold edition contains the expansion pack it is on the box says: all new u-boat missions"}
{"product_id": "B009CEM332", "context": "Is this game compatible with an Xbox 360 controller? Many PC games are.", "response": "Yes it is, I used it many times with this game (I have a wired controller)."}
{"product_id": "B003O3EFY2", "context": "Are you able to save your games?", "response": "Yes, I have had no problem doing it so far."}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "Yes they will work and they work very well"}
{"product_id": "B000TK99PS", "context": "Rummikub Does anyone know if this includes Rummikub?", "response": "yes, but under the name \"rummy squares.\""}
{"product_id": "B002LARYGA", "context": "Does it require my original tv remote or can I program it to my tv using codes?", "response": "Does not require your original TV remote unless you need to program specific buttons to your universal remote."}
