{"product_id": "B00F27JNGS", "context": "I can play with my PSN of united states?", "response": "Yes as of patch 3.30 u can but come oct 15th will be released in us. Psn store is not fully updated yet but will be soon."}
{"product_id": "B002FY0CM0", "context": "Will this fit the Sega Genesis system model number MK-1631 9 pin?", "response": "For the regular genesis master system, the regular sega master system too, meaning the very first game systems of both of these, I tried it out, and I get a more sharper picture as well!"}
{"product_id": "B005FMLZQQ", "context": "Can you set the volume button to control your surround sound? Also can this turn on/off your surround sound box?", "response": "I don't have a surround sound but to be honest, I don't think you can. It works the tv volume just fine but I'm sure that if you programmed it to work the SS then you would lose the function of the tv."}
{"product_id": "B005M0KSIM", "context": "Without expansion packs, does this game includethings like greek gods?", "response": "no the dlc for game of the year includes new factions such as the Inca and Polynesians and a few more and the explorers map pack"}
{"product_id": "B0096DMDXY", "context": "Is this compatible with iMacs", "response": "not really ... they say it is, but it is not programmable. So you will have to get extra software or conversion software to hook it up on most games."}
{"product_id": "B002DUCF8A", "context": "Is the flap control a 3-way rotating lever, or an up/middle/down switch? I currently use one of the levers from a throttle quadrant as a flap control.", "response": "It is just and up and down switch, thus if you press three times down, then you'll have flap 3 position. Either way, I prefer one of the levers from the throttle quadrant as a flap control just as you are doing."}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "No it is an updated version that is completely different shaped."}
{"product_id": "B0002L88HE", "context": "Is game compatible with Windows 8.1?", "response": "I have windows 7 which plays without problems  so it probably plays ok.  but I don t know but I have always enjoyed the game and would consider it worth the risk."}
{"product_id": "B008CP6MA2", "context": "Is this really only 3 games now? Or will they renew the vouchers for Origins?", "response": "I bought the game almost 2 months ago and everything worked ,On the disc's cover it says the vouchers would expire on march,2013 but luckily it didn't but that was two months ago I don't know about now."}
{"product_id": "B00FEOR4MY", "context": "Does this help with falling impact? I tend to drop my case from time to time.", "response": "No it won't. It is a soft case to carry several things. I have a skin cover plus this case"}
{"product_id": "B004CFASL0", "context": "will they play on Windows 7?", "response": "Yes, they play on Windows 7"}
{"product_id": "B006IR6NH8", "context": "Is the item durable?", "response": "I have owned mine for about 8 months now and subject it to constant travel in my laptop backpack along with everything else. It has not failed me thus far."}
{"product_id": "B005CELN8W", "context": "What else is included on this DVD...possibly Money to Burn?  I can't find the complete list", "response": "You earn enough money to unlock the slots ...14 plus one bonus one."}
{"product_id": "B002BRZ79E", "context": "Looks like a good game, just not into monthly subscriptions. Is that the only way to play this?", "response": "Yup you get a free trial but in the end it's all pay to play"}
{"product_id": "B00012YI14", "context": "I am trying to get this joystick at http://amzn.to/UkGz6n to work with my orginal XBox (XBox before XBox 360 and One).  Will this adapter work?", "response": "yes it wil it has better response with a ps1 controller because the buttons aren't pressure sensitive with a ps2 controller i find you have to press a bit harded for response but if you get a ps1 controller it does work percectly it also works well with ps2 arcade sticks and wheels"}
{"product_id": "B003ZSHN0O", "context": "will this work on windows 8.1", "response": "Look for Youda games that make the game.I don't have windows 8.1 yet. It works great on our computers.Hope that helps!Mary"}
{"product_id": "B003VANOFY", "context": "Can this headset be used while charging?", "response": "Yes, for a little while, until the headset decides to start cutting in and out. After a few months of use, now whenever the cord moves because it brushes against my shoulder, the headset will cut out and I have to jiggle the cord until it turns back on."}
{"product_id": "B0015PHMFU", "context": "Hello, do I need to buy a universal adapter as well... for this univeral controller to work with my PS3? Thank you!!! :)", "response": "no need to adapter cause it has 2 cap. one is for pc usb and second one is for ps3"}
{"product_id": "B005G4CXPK", "context": "Am I able to use a keyboard and mouse to play or do i specifically need an Xbox controller that plugs into the USB port", "response": "You can definitely use the keyboard and mouse.  I did that for most of the game until I finally bought a controller."}
{"product_id": "B00INUME3K", "context": "Is this game in English?", "response": "I am from the U.S. and if i was to purchase this game i would be able to play it on my PS3 here?"}
{"product_id": "B00F27JDY0", "context": "Can you change it to American or is it only in japanese?", "response": "Mmhmm! Right from the get-go, it asks you what language you speak, and English shows up, simply, as 'English' ^-^"}
{"product_id": "B00FXOP1JI", "context": "Is it touch screen display?", "response": "The bottom screen is touch-enabled, and generally it works really well, even without the stylus.  A lot of 3DS games make use of the bottom screen in all sorts of novel ways, and some of that requires a finer point than just your finger can offer."}
{"product_id": "B00DLDEKOK", "context": "Where do you plug in the headsets for xbox 360?  To the controller?  I don't see a place for plug in on it.", "response": "Small hole at bottom of controller. Under the bottom of where battery pack plugs in."}
{"product_id": "B007VTVRFA", "context": "My 10 yr old wants to play this game, but he doesnt have an e-mail address... does he need one to play this game?", "response": "You need one to sign in to origin. There is an offline mode though. I am not sure that he will have fun with it. I haven't played it in some time due to difficulty with new interface. Simcity 4 if you want fun."}
{"product_id": "B00005QEFD", "context": "Does your system come with all the cords and controller?", "response": "I depends on the seller. I bought one used, and was very lucky to have the person say it included all cords, and 1 controller. But it depends what listing you look at."}
{"product_id": "B00BGAA0SU", "context": "if i bought a used copy of this game would i still be able to get all the limited editions features? or is it only redeemable once?", "response": "I think its only useable once"}
{"product_id": "B00GOOSTFE", "context": "How likely is this game to be sold out/out of stock if I want to pre-order it later since I still want to be able to get the pre-order bonus?", "response": "Recieved the game today, May 16, 2014. It was the game only. No Soundtrack disc. No additional artwork."}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "I believe that no matter what version you install from, that you always use the Steam SW engine to run the game."}
{"product_id": "B00D6LPE2E", "context": "Does the used version of this bundle guaranteed come with the model depicted in the picture? Also, will all accessories come with it for sure?", "response": "My console came with an already used PS+ membership but Amazon replaced. Everything else was Good."}
{"product_id": "B008NMPSEU", "context": "Can you please tell me all the games in this slot. Thank you.", "response": "I'm sorry, but I can't answer this for you.  This game is a Christmas gift for my Dad, and he hasn't used it yet."}
{"product_id": "B00BKF5IXS", "context": "Good day. Does it include also the original PlayStation controller?", "response": "yes, one dual shock controller, one move controller,and the camera as well"}
{"product_id": "B001E27DLM", "context": "it works on Nintendo 3ds?", "response": "Yes of course man. I have a normal 3ds And I play it there, of course it wont be having 3D."}
{"product_id": "B00GOOSORM", "context": "Do I need to have the correct billing information or an address in my Square Enix account to be able to use this?", "response": "My son said yes u do he's the one who mastered the game"}
{"product_id": "B00GV0LR64", "context": "(Any Ideas?)This will be my Review: I cant fix ist on any screens. I tried with LG 42\", LG 50\", Samsung 21\", LG 23\" and some other screens in a store.", "response": "If you're using a more porous screen, you may need to lick it first... age old suction cup trick."}
{"product_id": "B00IU3MSF4", "context": "can this play original xbox games", "response": "certain games are backwards compatible but in my opinion it doesn't work that well."}
{"product_id": "B0086V5UF0", "context": "I want to use this with a group of girls.  Do I need a remote controller for each of them or can they just follow the choreographer on the screen?", "response": "The game is for 4 players or have the on line option if they want to play it each need a control, to see if they do the steps in the right way and the points on the screan."}
{"product_id": "B008HPAXZ2", "context": "Would this work for the \"new\" 3ds xl?", "response": "I cannot say for certain, but the New 3DS XL is supposed to have the same sized screens as the current 3DS XL, so I expect it will."}
{"product_id": "B00HVBPRUO", "context": "is there a separate volume button for chat sound and game sound?", "response": "I have no answer for him because I have the same problem, you can't hear the game at all only chat, I would like to return them if a resolution cannot be found"}
{"product_id": "B00GZ1H07Y", "context": "To play in multiplayer mode can all players use one controller or does each player need a controller?", "response": "Hi joy sorry but there no online multiplayer mode but you can play up for people in the game and yes you can use 1 controller it's great game for the price you get 22 tables lots fun"}
{"product_id": "B004W1IX1G", "context": "Does it work for a wii mini?", "response": "Am sorry not sure what a wii mini is i use on the regular wii"}
{"product_id": "B00562O78S", "context": "Why is the Playstation 3DTV only have 5000 for contrast ratio? Shouldn't LED be in the \"millions\" contrast ratio?", "response": "Because this Display Monitor is LCD and Edge LED technology backlit."}
{"product_id": "B00AQ2BLI2", "context": "when recruiting units is it like Rome 1 that is 1 unit per turn or can it be multiple?", "response": "Multiple units can be recruited or scheduled to move in each term. The number that actually enter the army is depended upon the cost, training necessary and advanced level of the clan."}
{"product_id": "B007XVTR12", "context": "Is this played on Uplay and/or linked with Steam?", "response": "no just steam pretty sure uplay is just for ubisoft games"}
{"product_id": "B008OQTUKS", "context": "does single player mode require internet connection?  thanks", "response": "Yes, because you use battlelog for launching sp campaign"}
{"product_id": "B00A1Y2STQ", "context": "How long is the usb cable?", "response": "With all the cables tied up, I can't accurately measure, but I'd guess about 6', which is pretty standard"}
{"product_id": "B00D6PTMHI", "context": "Does the cable plug into USB? My laptop does not have audio-in", "response": "Yes, it is a great cable. USB to guitar or bass."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "No it installs when you put the game in you need the Internet if you want to play online. Not WiFi the hardline"}
{"product_id": "B00FFL0T46", "context": "I wanted to purchase this game but I do have a Steam account will this game will be able to be played through Steam?", "response": "Yeah, but i am not sure about achievement s."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "'Bout 4-5 hours, I'd say. It has a decent battery life."}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "Yes it does.  Which is actually kind of nice, because you can double them as standard headphones....as long as you take off the microphone boom."}
{"product_id": "B0050SZBP6", "context": "does the game only last for 30 days and then you have to pay like 10$ dollers every month or is it permanent?", "response": "Basically, this just unlocks additional game play for the WoW series, you'll still need the starter pack and pay for gameplay either with a credit card attached to your battle.net account or with game cards purchased at a store. It is $30 every two months for gameplay access (so basically $15 per month to play)."}
{"product_id": "B000VBFWAG", "context": "Is this a physical copy or a download?", "response": "It is a physical copy"}
{"product_id": "B00BXONG7G", "context": "Can you activate this via: Steam?", "response": "I don't believe so.  You are stuck signing up and downloading origin,  their version of steam."}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "The included mouse grip and mouse pad both have \"Call of Duty - Modern Warfare 3\" graphics on them. Unless your son is a big fan of this computer game series, he would probably prefer the version of this mouse without the game branding on them."}
{"product_id": "B0058FAEAS", "context": "Hi does the yoke comes with  the power cable or ti's sold apart", "response": "The yoke uses usb power from the computer.     If you have your usb running many devices in addition to the yoke you could need additional power."}
{"product_id": "B006NU6HAS", "context": "will it run on windows 8 or 8.1", "response": "Yes Iit will run just fine"}
{"product_id": "B002BSA20M", "context": "How does this game differ from Halo 4? Is it better?", "response": "Reach is the best of the Halo games, much better than Halo 4."}
{"product_id": "B00GPH7Y8S", "context": "This item includes Spanish language?", "response": "As far as I can tell it seems to be English only. I checked the options section and there are no buttons to change language settings. Maybe the developer might have info I could not find. Hope this helps."}
{"product_id": "B008KH7NZA", "context": "Does this work with the Xbox One? I bought the Chat adapter and I get game audio but no chat. I also updated the controller.", "response": "Yes this will work however you may need a 4 pole to 3 pole 3.5mm aux cable for the chat and audio to work on separate channels."}
{"product_id": "B0097CUREG", "context": "Does anyone notice that the Kaboom slot is missing the button with a \"$\" that is used to load in more credits during game play? Or is it just mine?", "response": "Yes, mine is missing too!"}
{"product_id": "B004HYIAPM", "context": "Do you have to continue buying subscriptions if you buy the CD or does buying the CD give you unlimited time to play?", "response": "No subscription.  Just pay for the CD or download and you are good to go!"}
{"product_id": "B0006PJAZU", "context": "How do you activate the Word Perfect Suite 8 ob a Windows XP computer?", "response": "You need to install the word perfect 8 with the disc.  That takes you through several steps.  Then click on the icon that comes up and you should be ready to go.  By the way it doesn't work on Windows 7 and above."}
{"product_id": "B004RMK4P8", "context": "What do I do if I'm buying the playstation card for someone do you give me a code to give them..I'm older and don't know anything about this.", "response": "This will automatically populate your screen with the code that you can copy down after purchase. The code will also be available to view in your account if you ever want to see it again."}
{"product_id": "B00BQZ5EWW", "context": "if u buy the download can you download it to more than one pc?", "response": "once its in your steam library, just log into your steam account on any computer  and you can download it on as may computers as you like"}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "The joystick isn't as smooth, but that's the only difference I feel. It's been awhile since I actually held an n64 controller though."}
{"product_id": "B002BSA20M", "context": "can i multiplayer on halo reach", "response": "Yes, it has co-op and online multiplayer"}
{"product_id": "B0094H8H78", "context": "can it be plugged to tv?", "response": "Yes, with AV cable sold separately -- go to Radio Shack with unit would be best way"}
{"product_id": "B000NJBD90", "context": "Would it work for a Guitar Hero 2 controller for the PS3 Guitar Hero and Rock Band games?", "response": "NO! I have two PS2 guitars I was hoping to use with my PS3. I tried several different games, and none of them worked properly. It's strange because two buttons work, but that's it."}
{"product_id": "B00F27JE1C", "context": "Does this model come with a memory card?", "response": "No, but it has 1gb of memory built in."}
{"product_id": "B00HN9LS48", "context": "Would the Xbox 360 Kinect clip work for the Xbox One Kinect?", "response": "No they are two different set-ups, one won't work for the other"}
{"product_id": "B008GEH9HO", "context": "can you use old games that were purchased for a DS and a DSi?", "response": "Yes you can. Although you cannot play GBA games, and so with DS games that sometimes have the feature to connect to a GBA game and get goodies, like Harvest Moon DS or Castlevania: Dawn of Sorrow, you won't be able to do so. Otherwise, you can play the games just fine."}
{"product_id": "B005J37I4Y", "context": "Has anyone got this to work with the Turtle Beach PX4?", "response": "Yes. Mine worked perfectly with the xbox 360."}
{"product_id": "B00CX7FQ4I", "context": "So I preordered this game but I never received a code or anything to unlock Bruce Lee. Any suggestions??", "response": "Was there an expiration date for receiving this code? We ordered the game January 2015 but the Bruce Lee code part was written in the description the day I bought it... but I have not seen a code yet."}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "All the answers that say this is an official controller are old. Mine, received 12/1/15, is a cheap knockoff."}
{"product_id": "B0086UK7I6", "context": "What is the texture like on this mouse? Is it slick like Razer mice, or lightly textured like most other mice?", "response": "For the most part it is not textured. It has a sort of matte paint feel, kind of like gamepads (xbox 360, ps3). On the right side of the mouse it is textured with a rubber material to help you keep your grip."}
{"product_id": "B0098EVZZ8", "context": "Do these work with the skylander giants battle arena?", "response": "Yes they do!  As they come out with new game the old skylanders still work even with the new game.  The new one just don't work with the old games.  Example you can't use a swapforce with the giants game but you can use and skylander on the swapforce game.  Hope that helps."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "I use it for only Netflix and it works for that."}
{"product_id": "B00D3TRMD8", "context": "is this the full version game or is this just the online code that I need to play this game.", "response": "You need a Steam account to play. You always have to be online to be able to pay"}
{"product_id": "B00BFOEY3Y", "context": "Dose this mouse have a \"middle click\", usually the action of pressing the mouse wheel down? The wheel has left/right, but dose it click down?", "response": "yes, and you can assign it to be a different command as well as well as standard middle click."}
{"product_id": "B00E1L78N6", "context": "Can you plug an iPhone etc (3.5) jack into the headset and listen to xbox audio and iPhone audio simultaneously?", "response": "No you cannot. The headset plugs into the controller via a 3.5 cable to get the game audio."}
{"product_id": "B00FNNQREC", "context": "whats so great about this game?", "response": "Simulation of farming.  Raising and selling crops and livestock.  Satisfaction similar to what a farmer can obtain after a successful season"}
{"product_id": "B00H1FCUBY", "context": "Do these work well for playing video games? Plan to use Bluetooth for music and the 3.5mm jack from the PS4 controller for gaming.", "response": "I don't see why not. They have a built in Mic. The 3.5mm cable is a bit short though (Like 2 feet) so you may need to pick up a longer one. Shouldn't cost much if you decide to do so."}
{"product_id": "B003JETPHS", "context": "Does this work with ps3?", "response": "I believe it does, I use Wii U but it should work with PS3. I am unsure so I r"}
{"product_id": "B00CMQTVK0", "context": "can it be turned on its side like the xbox 360 can. or does it have to be kept flat like in th pictures", "response": "The Xbox One console is designed to remain horizontal. Vertical positioning of the console is not supported - (Xbox website)"}
{"product_id": "B002RYLG4Q", "context": "Does this hook up directly to a TV via coaxial cable, or does it require an RF converter box?", "response": "I cannot figure out where to plug the av cables into my flatscreen?? nothing I have tried works, PLEASE HELP"}
{"product_id": "B004G5TUJM", "context": "does it work with midnight club", "response": "yes and perfectly I should add,you might have to customise your controller in settings I dont rember"}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "The disc MUST remain in the drive,kind of stinks...also you can only play certain games until you get enough points,careful...the disc needs a password and its only good for the original purchaser,also it crashed my computer....TERRIBLE experience!!"}
{"product_id": "B00BGAA29M", "context": "I´ve got two kids. Can they play it together?", "response": "no its a single player game"}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "It all depends on the parents level of strictness"}
{"product_id": "B00FB5R3XQ", "context": "I know the reviewers have stated that they use this stick for PC, but can I get a confirmation that this will work great on Windows 7 64-bit?", "response": "Yes works for Windows 7 64-bit"}
{"product_id": "B0097CUREG", "context": "Will this work on a windows 8.1 pc?", "response": "Definitely It is a very good slots game"}
{"product_id": "B002AQNT96", "context": "Will this run on XP SP3????", "response": "oh yes I play on windows 7."}
{"product_id": "B0038MVFYC", "context": "Does it work with pokemon bank?", "response": "No only Pokemon Black and White and Pokemon Black 2 and White 2 can use Pokebank. You can still trade locally via wifi in friend plaza or by infrared on the DS and 3DS. You can not trade on GPS because the servers are shut down."}
{"product_id": "B002B9XB0E", "context": "If I buy two of them and plug each one into a usb port, I should be able to play 2 player games like this, correct?", "response": "I now own four, and I use a USB multi adapter. I can play Bomberman with 4 players no problem :D"}
{"product_id": "B004N7IIQ4", "context": "Are the wires very long", "response": "Yes the caple running to from the amp to the head set is around 5' and the other cables are about the same length."}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Yes, but you will need to set it to run in XP compatibility mode."}
{"product_id": "B000WCCURW", "context": "Does this game play on windows 8?", "response": "I have been playing it on Windows 8 and Windows 8.1 since Windows 8 was released. I did not have to run it in compatibility mode, e.g., Win XP SP3."}
{"product_id": "B00BGD6LMG", "context": "How many gigs is this game and can I install it to a flash drive?", "response": "Not sure but the game is horrible!!! Save your money"}
{"product_id": "B0016HG4H4", "context": "Would this work with AC/DC Live Rock Band?? And with The Beatles?", "response": "I have not tried it with the AD/DC game but I have played The Beatles Rockband with it and it works fine. The Beatles was actually my primary reason for getting a rockband instrument set."}
{"product_id": "B004RMK4P8", "context": "So my PSN account is registered as US but the problem is in amazon because I need an address. but if I try to put my address outside US it wont let me", "response": "You need to add the address with the card you are going to use for the purchase (you need to go to the bank to add it)"}
{"product_id": "B001IYR53W", "context": "Does this game have gin rummy included?", "response": "Yes, it has Gin and 26 more games."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "Yes, you can give it as gift."}
{"product_id": "B00FQFFQ2Q", "context": "Is this a multi player game?", "response": "Yes it you can play offline multiplayer and online multiplayer"}
{"product_id": "B000OYMYZQ", "context": "Will this work with PC?", "response": "I havent tried to connect to a PC but it will not work with phone chargers that use usb"}
{"product_id": "B004NRN5EO", "context": "This version includes Korean subtitles?", "response": "I do not know the answer to this. I had it with English subtitles.  Great game, though.  You'd really like it !!"}
{"product_id": "B00D96BNGM", "context": "will this work with xbox one", "response": "Diane, you would also need to purchase an Xbox One Headset Adapter made by Microsoft to use this with an Xbox One. With the adapter it willwork perfectly with the Xbox One."}
{"product_id": "B007WPM9GO", "context": "Does this fit the DS XL?", "response": "No. It's too narrow for the XL and will not go on it."}
{"product_id": "B008RA5AWS", "context": "how do you know if software processes 0-3 employees versus unlimited ?", "response": "The answer is on your payroll key. It  says unlimited or 0-3 employees"}
{"product_id": "B00DHF39KS", "context": "Just getting into these games; are there levels of difficulty on this game so a newbee can learn easily???", "response": "Yes!  There is a \"Newbie\" difficulty setting.  In the menu, the main character is wearing a baby bonnett and sucking a pacifier ;-)  You'll like this game and as you get better, play it on the next higher difficulty.  Have fun!!"}
{"product_id": "B001H4NMNA", "context": "Does it come with the chargable batterypack for the controller ?", "response": "No, the dualshock 3™ controller doesn't have a removable battery. It has an internal battery that can be charged via a USB cord while the PS3™ is on. This is where this item comes in. While you are no using the system, simply plug the controller into the device and it will charge while you're away."}
{"product_id": "B00GS6A6V8", "context": "How would this work if buying as a gift?", "response": "You'd have to give them codes wrap up a peice of paper with the codes on it it will trick the kid it's funny my mom did that to me"}
{"product_id": "B00FZ12F34", "context": "this Exclusive Amazon DISNEY INFINITY Infinite Bundle, with Sorcerer's Apprentice Mickey Figure is for PS3?", "response": "These are add on pieces. In order to play you need the starter pack which includes three characters, game and activation base. These work for every game system that you have the base and game for."}
{"product_id": "B00CJ7IUGS", "context": "Do I have to start a fresh game to play the DLC? I have a level 12 character and I don't want to start from scratch.", "response": "No  ,  But  my  game  started  freezing   up  1  ,  Or   2  times  almost  every time  I  play  since  I  added  the  add-on  ."}
{"product_id": "B004JKZUJI", "context": "Does it work with wii u?", "response": "Sadly, no. Not yet anyway.  However,  Nintendo has announced they plan to release an adapter for game cube controllers in time for Super Smash Bros."}
{"product_id": "B0088MVODE", "context": "Is this edition fully physical or just download codes?", "response": "This edition has both physical discs and download codes.Resident Evil 6, Resident Evil 6 Language Pack and Resident Evil Degeneration are physical discs.Resident Evil 4, Resident Evil Code Veronica X and Resident Evil 5 Gold Edition are download codes."}
{"product_id": "B00DRKJBC8", "context": "Is this the whole game or just a code for items?", "response": "It's a digit game code for Steam to download the entire game."}
{"product_id": "B00BGA9V2Q", "context": "Does Diablo III on PS3 allow offline(Local) multiplay? In the other word, can 2 people play D3 on one PS3 at the same time?", "response": "Yes. There is a miltiplayer offline mode. U can play 4 players at the same time is really great"}
{"product_id": "B003O6C0V4", "context": "So does it come with everything?", "response": "It comes with everything other than the Wii console.  It works really well tracking both movements and heart rate.  One strap goes on the right leg and the other goes goes on the left arm. The DVD and batteries are also included."}
{"product_id": "B00GO4PTR0", "context": "I wanted to know if you can send me the code to my email because I would need to use it as soon as possible. Thanks.", "response": "You could have gotten the option to get it online, this one actually comes to your house."}
{"product_id": "B00GOOSORM", "context": "Do I need to have the correct billing information or an address in my Square Enix account to be able to use this?", "response": "No just log into your square enix account and put the code on the card in at the mog station redeem code tab and that's it."}
{"product_id": "B000266786", "context": "Will this work with a mac, specifically OS X version 10?", "response": "No. It doesn't even work on newer Windows 7 or 8. Don't buy this crap."}
{"product_id": "B00FE8WKPQ", "context": "How much space do you need to use this effectively? Thanks!", "response": "Well, basically the space it takes for the board, and the space for one person standing with the board in front of them (for stepping on and off exercises. 4 square feet? Obviously more would be better."}
{"product_id": "B000NJBD90", "context": "I know it says PS2 to PS3, but it's a USB, do you think it'll work if i plugged it into my Xbox 360?", "response": "The ps2 or ps3 controller won't work. I'm pretty sure a USB computer controller won't work either. Yes, u cud plug it in but u won't be able to play games with it"}
{"product_id": "B0087ZMATE", "context": "I am wondering if the mic volume is very good or not. I have a cheaper headset and the mic is almost inaudible, even when boosted from the PC", "response": "This is perfect for gaming and talking... mic works great... can't go wrong with this headset...."}
{"product_id": "B003O6JKLC", "context": "is this the old version,or the slim new one? cause the picture on the box show the new one but the description on top says that it is the old version", "response": "This is the old version but is very nice machine!"}
{"product_id": "B00FNNQREC", "context": "Is this Farming Simulator 2015", "response": "No its not its farming simulator2013 2015 hasn't come out for 360 yet"}
{"product_id": "B00DJYK8XS", "context": "Is this for the original wii or for the wiiu?", "response": "I have the original wii."}
{"product_id": "B001AI7CF2", "context": "$ 7.99 is the price for each extension? or for the package of four extensions? Please clarify", "response": "I received all 4 extensions for a very low price and they work perfectly."}
{"product_id": "B00GBCLG0E", "context": "does it play ps1, and ps2 games", "response": "I have a lot of ps2 games and I have a ps3 video game system  and I want to know what ps3 system will I have to buy so I can play ps2 games on the ps3 thanks charlotte coach"}
{"product_id": "B004GINKNQ", "context": "How do I install the 60gb hard disk drive for Xbox 360?:", "response": "Pull off the top. With a little force the top will just pop off and you will be able to place the hard drive inside. You are probably going to get the red ring of death using this cheap hard drive. There is a reason it's cheap. Good luck"}
{"product_id": "B0087NHQRC", "context": "What are the graphics requirements of this game?  Will I even be able to play this game without getting a newer graphics card?  Thanks", "response": "Hello Luke. Simply go on the internet and type in ALAN WAKE AMERICAN NIGHTMARE SYSTEM REQUIREMENTS and the information will be provided.You can do this for any game you need requirements for.Good luck.Dennis"}
{"product_id": "B006JSY3MI", "context": "Do you need internet when using this game?", "response": "Not when playing, but need Steam to start it."}
{"product_id": "B00DH1KRQQ", "context": "does it have the rumble feature?", "response": "if you mean vibration, yes it does"}
{"product_id": "B0096DMDXY", "context": "Is this compatible with my HP notebook pc with Windows 7?", "response": "Im not sure but I think it will work. I purchased it to use with a Mac and it is not compatible. Want to buy a used one, I plugged it in, used it once and now i'm stuck with it."}
{"product_id": "B000B6MLSM", "context": "I have a receiver to use my 360 controller on my PC.  Will I be able to use this for my PC also?", "response": "I'm honestly not sure... Haven't tried it...  If you find out, let me know... I'm intrigued..."}
{"product_id": "B002QHDKE8", "context": "It is rated T for language.  What words are used that are inappropriate for kids?  Thanks.", "response": "This was a Christmas gift for my grandson and so far my daughter-in-law would be the one I need to ask.  If you want I can ask her."}
{"product_id": "B00EZKNT18", "context": "How long is the usb cable?", "response": "If I remember correctly anywhere from 9' to 11'"}
{"product_id": "B001KMRN0M", "context": "does this plug into ps3 console?", "response": "Mm I don't know, I have not tried, sorry"}
{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "Yes it does work since the ps vita is region free any game from any where for the vita can work on it"}
{"product_id": "B0033WFJFS", "context": "how do I get the instructions to use this control", "response": "Return it the product does not work. I returned it and got a Logitech controller instead which works perfectly without any headaches. The controller you bought is a hunk of junk!"}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "Nope, sorry. It's playable on 3DS, 3DS XL, and 2DS. :/"}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "Someone must really be making an artificial demand"}
{"product_id": "B005764CWO", "context": "I have this controller and was wondering if anyone had the same problem with the left analog stick not responding, if so, what do i do to fix it?", "response": "The controller is a piece of junk.  STep 1: throw away.  Step 2: buy a regular ps3 controller. Step 3: smile until the end of your days."}
{"product_id": "B00475AYUA", "context": "I am buying for a Christmas gift.  Does it have to be downloaded when purchased or can I purchase now for my grandson to download after Christmas?", "response": "I think if you purchase it as a gift you can. Not sure, though."}
{"product_id": "B0007MZWQS", "context": "Why is almost every genesis not have the cords and controller(s)", "response": "Probably bc they have been lost along the way... the model 1 came out in 1989... gone with the wind I guess... or broke at some point"}
{"product_id": "B00F27JDY0", "context": "What games might be affected by the change with X and O buttons?", "response": "Games usually stay the same.  The only difference is in the Vita menus."}
{"product_id": "B002I0JZIS", "context": "does it have nuketown", "response": "Unfortunately this game is nothing really like all of the call of duty's you've played on the PlayStation 3 or Xbox 360."}
{"product_id": "B00ATF5YYI", "context": "if I buy the PC Download, (I just want to make sure so I get my money's worth), I can download this on steam, im still a bit confused", "response": "Yes, You will recieve a code to download it from steam"}
{"product_id": "B00D6PTMHI", "context": "Has anyone learned to play guitar proficiently with no instruction other than this game?", "response": "Probably not, just due to the fact that the Rocksmith titles have only been out a couple of years.  What you may find is that Rocksmith gets you \"up and running\" relatively quickly thereby encouraging you to play more.  That's where proficiency comes from.  Practice."}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "no it is wired for both keyboard and headset functionality"}
{"product_id": "B007W8S2MG", "context": "Does the have a tutorial to explain the mechanics?", "response": "Yes I am pretty sure it does have a tutorial for game mechanics. This is a great game! I finished it in a couple days. :)"}
{"product_id": "B00CJ7IUI6", "context": "Is there a difference between the game if I buy it new or i can just buy a used?", "response": "Not at all. The only thing would be is if you buy the game used & it is in bad condition."}
{"product_id": "B00FATRKOK", "context": "Does this come with, or already have inside of it, a wireless adapter or will I need to buy a separate one?", "response": "It has one - we were able to use it with our wireless router immediately."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "I have not personally tested it out on Windows 8 since I do not have a machine with it, but from what I read it should work fine. I know it works on Windows 7 x64 and Linux Mint 13 x64."}
{"product_id": "B000FQ9R4E", "context": "My son is 5, will be this game easy to play for his age ?", "response": "He should be able to but the one I purchased doesn't work had to buy from gamestop it's fun if he's like mine he will learn game fast"}
{"product_id": "B001NT9TK4", "context": "Will this wheel work with windows 7 ultimate 64 bit os?", "response": "I use Windows 7...Home Premium (I think), 64 bits and both the wheel and the driver that comes with it work just fine."}
{"product_id": "B006JKARP8", "context": "where is the other cable for the portable charger", "response": "Which one do you want me to send cause I was mixed up"}
{"product_id": "B005L38QK2", "context": "Are there more buttons on the right-hand side of the mouse or just the two on the left that are next to where the thumb rests?", "response": "Both sides have two buttons."}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "Not even a little. All wii games can be played on wii u but not the other way around."}
{"product_id": "B002I0KP4G", "context": "I have a Mac Mini i5 2.3. It's ok to play it?", "response": "It looks like it should work fine."}
{"product_id": "B002I0GF72", "context": "Does this game come with the gold foil cover or was that only upon release or preorder?", "response": "It comes with the gold foil. I just bought mine a week ago"}
{"product_id": "B008SBZD9G", "context": "Can I use a Xbox 360 game controller for the PC version?", "response": "It shouldn't be a problem as long as you are already hooked up with the computer for the controller.   The controller requires a receiver for it to work on the pc"}
{"product_id": "B00DBKSN8M", "context": "this console has bluray?", "response": "Yes. The PS3 plays PS3 Blu-Ray games, DVDs, PS1 Games, Blu-Ray movies, and CDs."}
{"product_id": "B00F4GSAYI", "context": "i now know that there is a separate disc for the dlcs, but do i need xbox live to download and play them?", "response": "Your XBox needs to be connected to internet and have a standard XBox Live account (free) only to do online purchases or download any free games or DLC's.  If you have game and DLC disc, you are ready to play it."}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "This package is not steel, however it is a nice, fold out style case. So in short, yes, the case is not just a bundle of the game boxes, rather all of them rolled into a nice three disk case with a sleeve."}
{"product_id": "B003NVMEVQ", "context": "Do you offer international shipping? (More precisely for Macedonia)", "response": "Dear customer: we are international express delivery to your country. Rest assured that you in your country show. USPS we shipped quickly."}
{"product_id": "B009DL2TBA", "context": "Is compatible with move?", "response": "I honestly don't remember I haven't use it since 2010"}
{"product_id": "B009SJR278", "context": "Could this be used on Xbox 360? If not, can I buy an adapter?", "response": "Yes with a simple adapter for 2-5$ US called 3D sound card for the mic part, but for the audio it wont work with that adapter You kinda need two and the other one which for audio adapter called 2 x RCA Male, 1 x 3.5mm Stereo Female, Y-Cable for 1-5$ US Hope this helped ! :)"}
{"product_id": "B00D6PTMB4", "context": "rocksmith 2012 or 2014, $40 price difference.  Is it worth the cash to get the newer version?", "response": "I have never played the 2012 version but I can tell you I LOVE 2014!!!"}
{"product_id": "B00DC7G2W8", "context": "Will I be able to play this game on my regular Wii?  Or do I have to have the Wii U console?", "response": "Wii U only.  Will not work in original Wii."}
{"product_id": "B00DJYTGYU", "context": "can this controller be used for all ps3 games", "response": "Yes, as long as the game doesn't require you to use sixaxis motion controls. This dose not have motion controls like the standard ps3 controller so you might have trouble playing games like sly4"}
{"product_id": "B008L3UUPS", "context": "Does this work with other games? Not just the retro emulator games?", "response": "I've used it a bit to try it out. My copy of Halo: CE (the first one) responds to it (although there's less buttons than on the XBox Controller) so I suppose it's possible it would work for other games."}
{"product_id": "B000OPOCFU", "context": "Since it's used can it be installed and play by someone else?", "response": "The item doesn't require registration so can be used again."}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "It's the port at the bottom of any Galaxy S4 or Note 4 or HTC One M8 or Nexus"}
{"product_id": "B005BLAJ68", "context": "i just bought a new computer think it was windows 8.1 will this work for my system", "response": "Hi Nicole,My husband has a new 8.1 computer and the Hoyle card games works fine, no problems.Hope you enjoy all the games it has to play.Bye, Mary"}
{"product_id": "B00ERDGMSA", "context": "For BL2 GOTY PC, disc version: Once I install the game and the DLC, do need to leave the disc in the drive to be able to play like BL1 GOTY?", "response": "The game provides a Steam Code. There is no DVD required to play the game."}
{"product_id": "B009DYOPK0", "context": "Does Roccat have a warranty? I've read horror stories about not honoring warranty?", "response": "I don't not know but I have never had a problem with mine and I love it."}
{"product_id": "B000TLU67W", "context": "Does this PS2 have a HDMI output or is it just AV cables?", "response": "AV component cabels only"}
{"product_id": "B00A2WP4UC", "context": "Does it include the sensor bar?", "response": "Yes, it did! It was a great investment. My stepson loves Skylanders... Maybe a little too much!"}
{"product_id": "B00BU3ZLJQ", "context": "can i play 4 player on the original 360 that doesn't have hdmi?", "response": "yes but you will need the av/component cable to play"}
{"product_id": "B000096L71", "context": "What type accessories (yoke vs joystick, etc.) do people recommend?  Any recommendations on particular (older, cheaper) models of them?", "response": "I use the C.H.products flight sim yoke and rudder pedals.But my logitec extreme 3D pro joystick works well too.its is really what you personally prefer.joystick or flight yoke and pedals."}
{"product_id": "B00JB4WHWU", "context": "Can i try this code if i play on my Mac?", "response": "The code is redeemed on their website www.elderscrollsonline.com, but the game can be run on either PC or Mac."}
{"product_id": "B00CD1FCAC", "context": "Why is there two usb cords?", "response": "one is for the keyboard power and the other is for the build in usb that the keyboard has, this acts as an extension cord so you can plug your mouse into the keyboard or your phone charger or anything else you plug into a usb port."}
{"product_id": "B002I0H2G0", "context": "the game is a physical cd? or is a code to download it?", "response": "This one is a physical copy of the game, it can also be purchased from PSN Store digitally."}
{"product_id": "B002I0H09Y", "context": "does this have campaign", "response": "My apoligizes it does but it is very short."}
{"product_id": "B00H4BBVZQ", "context": "Is this game the same as the definitive edition, content wise?", "response": "I dont know.  I haven't played either version.  Before I got a chance to play the GOTY edition my 360 died."}
{"product_id": "B000VRCNLG", "context": "is Logic Tech extreme 3D Joystick compatible with this game? If it is any special setup?", "response": "Yes it is, but to be honest I don't think combat flight SIM is that great of a game I would suggest IL2 instead"}
{"product_id": "B00D6PTMSW", "context": "Does anyone have both the original and 2014 versions know if the Lessons are better in the 2014 than the original?", "response": "We bought my son in law both. He likes this one a lot better"}
