{"product_id": "B005FMLZQQ", "context": "Does it work with XBOX ONE aswell ?", "response": "No this item only works with Xbox 360"}
{"product_id": "B0087OZ5FG", "context": "Honestly, what headset should I buy?  The Pulse Elite, or the Gold Wireless Headset?", "response": "I had 3 pairs of pulse and each lastest me 3 months now i have the gold and nothing broken and they are 6 months old :)"}
{"product_id": "B00DYAQHTQ", "context": "Is this a non-stop violence game?  I find most games to have too much story and that's boring.  I like just pure violence.", "response": "It's a pretty fun game, no boring parts, from what i played, i personal don't like the driving and there's one mission i couldn't be passed (because of the driving) so i can't tell you more."}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "You do have to shake it, but nothing serious, just a bump and you will see the light come on, and the charging begin."}
{"product_id": "B003O6JJKY", "context": "wait does this have 250gb on it", "response": "yes it has a 250 gb removable hard drive and the 4 gb internal."}
{"product_id": "B00BTOAFXS", "context": "Will it make me have a faster trigger finger then now? People say I have a mod?", "response": "Yes, it will make you have a faster trigger finger. Nobody should say that you have a mod since the variation between a fast trigger finger and a mod/rapid fire button are very different speeds."}
{"product_id": "B00D7UHT0E", "context": "What the system game, PAL or NTSC?", "response": "Game is ntsc. I don't think they have a pal version."}
{"product_id": "B00HN9LS48", "context": "how thick is the lip of it that grabs the tv's bezel? I'm worried this might not fit my tv with a pretty slim bezel and might cover some of my screen.", "response": "I own a zero edge TV and you can't even notice it."}
{"product_id": "B00GS6A6V8", "context": "so to use the codes you go to the playstation store?", "response": "PlayStation store  and redeem codes"}
{"product_id": "B004YC4NN0", "context": "Will this work on phones, for emulators? Is it wireless?", "response": "It does work on emulators on computers just fine. But it's not wireless and doesn't work on cell phones."}
{"product_id": "B008KE95UO", "context": "is is two player?", "response": "No. It's a single player game."}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "No not at all it just feels right. I can honestly say that I hate using regular mice now because they just don't feel as comfortable as this mouse does. The second right click is really the only way to go, and if you game you will definitely find a use for it while playing."}
{"product_id": "B00FQPQO4A", "context": "what is the difference between titanium for 27.99 and the other one for 19.99? and can we download this on to our android tablet", "response": "Well the 27.99 one proabley has more stuff and no you cant download this onto a tablet only pc or if you buy xbox kind then xbox there is farming simulator 2014 for tablet and farming simulator 2015 just came out for pc ad will be out for xbox in 2015"}
{"product_id": "B004MR3QY4", "context": "I am looking for a long lasting gaming mice, with high precision, control and speed for FPS, which one should I get?", "response": "Not this one. http://www.overclock.net/t/1139543/official-the-mouse-suggestion-thread/4350_50#post_23725979"}
{"product_id": "B0058FAEAS", "context": "Can you trim the plane with this product or do you need the trim wheel and can you use a rutter function without buying the peddles", "response": "The Yoke has multiple thumb rocker switches. One of those could certainly be mapped to \"trim up\" and \"trim down\", but it's push button trim and not a continuous function like a wheel. There's nothing that would logically or even remotely map to a rudder function."}
{"product_id": "B000FRU1UM", "context": "Hi, this could not be loaded in XBox360. It stated region code error. How can I fix it?", "response": "What country do you live in? Some of the games can not be played on other consoles made for UK and other regions."}
{"product_id": "B003ZJ1VD8", "context": "what color is the switches?", "response": "I believe the older versions used Cherry MX Blue switches. Razer's newest junk uses their own Razer Green switches."}
{"product_id": "B00E4MQODC", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "The scroll wheel has click stops and is not switchable. However, it is one of the better click stops, it feels very good and solid. I'd highly recommend this mouse."}
{"product_id": "B0050SYX8W", "context": "is there profanity and sexual content in this game? thank you", "response": "No there's no profanity or sexual content in the game."}
{"product_id": "B004XGN8W4", "context": "will the white xbox 360 fit?", "response": "yes any xbox 360 will fit"}
{"product_id": "B00GG4BBUM", "context": "Can i play this against a friend if he is playing the game on a PS3? I would be using a PS4?", "response": "I don't believe this or any other game has cross platform play at this time, not 100% sure though."}
{"product_id": "B00IAVDQCK", "context": "Can I use this headset for voice chat only?  (Game Sounds still coming out of the tv.)", "response": "I am 99% certain that this is possible.  The settings can be adjusted in the xbox menu.  If I recall correctly, I actually set this up when I had a friend over and we played online with a third friend.  Game sounds through the tv/monitor and chat through the headset."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "You can play cross server with PS3 and PC."}
{"product_id": "B00D6PTMSW", "context": "Is there a left mode? I'm left-handed and have been itching to learn guitar but don't know how to go about it.", "response": "Yes if you have a left handed guitar you can switch the settings"}
{"product_id": "B00ARCWQOO", "context": "So....MLB2k13 is the last in the series?  No version for 2014 for xbox 360?  Do they at least update rosters for 2013?", "response": "no, they pulled the plug on everything."}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "does it work with Xbox one,once i already have the portal.Thank you in advence for your help.Betty."}
{"product_id": "B00EWEHI5K", "context": "How well does the Ouroboros perform on non-traditional surfaces, such as cloth?", "response": "I use a steelseries (the big mouse pad) and it works really good.Try to find a mouse pad that is kinda soft cause the mouse feet (bottom of the mouse) can wear down quickly depending if you're hardcore gamer I say a good year our 2."}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game", "response": "Yes, different characters unlock different aspects of the game."}
{"product_id": "B008TP1OKI", "context": "I have the red ring of death now ever since inserting the hard drive. It fits perfectly and I hear the click it makes when I insert it.", "response": "ok I got it thank you"}
{"product_id": "B001Q24UAM", "context": "Will it work on windows 8?", "response": "This was given as a gift, so I don't know."}
{"product_id": "B00AAQRNQ8", "context": "Is this a good mouse for your money, or a good mouse overall? They actually mean two different things and the majority of reviews make it even more co", "response": "Its both a great mouse for the money and a fantastic overall mouse. You will be hard pressed to find anything that compares to what you get in this mouse at double or even triple its price."}
{"product_id": "B00EFFVZP0", "context": "does the ps3 version comes with free dlc?", "response": "Not at all.. Not worth it don't be fooled."}
{"product_id": "B002CZ7P04", "context": "Can I use the wii walk it out video game with the wii u", "response": "Yes you can.  I use my Walk It Out in my WiiU every day."}
{"product_id": "B004Q7CHCC", "context": "does this include the aulternat ending", "response": "yes  mine did"}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "It depends on what you are going for. My friends have played Super Smash Brothers Brawl with a third party adapter on the wii U. They were able to use this control to play on the wii U. I suggest looking up the, iirc, mayflash adapter for the wii U."}
{"product_id": "B008FHL56S", "context": "Does this work with Destiny?", "response": "Yes it does I purchased mine for the same reason!"}
{"product_id": "B00E9I1FPI", "context": "Do I have to download & install Steam or just create an account? Will the Steam Code be auto asked for after installing it?", "response": "You only need to download steam for skyrim i believe and once its downloaded it should ask for skyrims activation code"}
{"product_id": "B00EV4O8VS", "context": "Does this bundle come with a wii u Remote and nunchuck?", "response": "No, Wii U system and Gamepad only."}
{"product_id": "B00ERDGMSA", "context": "does it work with win8 or win 8.1", "response": "It would be, highly unlikely, if it did not. You can search a little with google, but I'm 99.99% you won't have any trouble."}
{"product_id": "B00FM5IY38", "context": "does this support chinese ?", "response": "Can you be more specific?Like subtitles or does it work in a asian region?"}
{"product_id": "B0098EVZZ8", "context": "Can Chop Chop be used for spyro's adventure, being that he was in the original spyro's adventure game? I understand that shroom boom wouldn't work.", "response": "The figure was a gift for my grandson and I know absolutely nothing about the characters or games.  I'm sorry I can't answer your question. You might Google the question to see if it will work.  Thanks."}
{"product_id": "B008M4BNQ6", "context": "does it come with every thing", "response": "Yes it does but if u want to use your home cord u will have to buy that special pie e or do what we did nd just shave down the back of the one that came with ur X box and you good to go saves ya 50 bucks too hope that was helpful"}
{"product_id": "B00E6OLJ88", "context": "does it work for all games?", "response": "Not every game but most cod games it does"}
{"product_id": "B008X73CE8", "context": "will silent hunter 4 wolfs of the pacific run on windows 8?", "response": "I'm running Windows 8.1 Pro and it runs great for me.... now after answering this Question I'm gonna go sink some Tankers!"}
{"product_id": "B0002XJBGE", "context": "I tried to play Call of Duty 4 on my MacBook Pro with this controller.  Plugged it into my USB & it doesn't seem to control anything.  Any suggestion?", "response": "You need the software disc for apple lioaded on your computer:)"}
{"product_id": "B00B1VJZO4", "context": "it says that i must download sims 3 do i have to?", "response": "Yes you must download Sims 3 before playing any of the expansion packs."}
{"product_id": "B00D78Q4UM", "context": "Does anyone suffer LED backlighting outage issues, like owners of the K70 do? It's an issue with the K70, so is it an issue with the K50?", "response": "I've had this for awhile and the only issue I've had was the color panels not responding to changes I make, but that was a driver issue."}
{"product_id": "B006JKARP8", "context": "Can I charge the charger itself using iPad adapter (any other USB power supply) or Vita adapter only?", "response": "What was previously stated, only can be charged using the vita charger. But it does hold a very large charge and can be used to charge any USB device."}
{"product_id": "B00G6IJ5QK", "context": "How is this mouse for Claw Grip?", "response": "if you have hands bigger than 7 inches, go for it."}
{"product_id": "B00BGAA0SU", "context": "if i bought a used copy of this game would i still be able to get all the limited editions features? or is it only redeemable once?", "response": "I think you only get it once bro bit moat likely can buy it in Playstation store"}
{"product_id": "B009DYCTY4", "context": "can I use my ps2 games in it", "response": "Unfortunately no, only the ones for ps3"}
{"product_id": "B00BDS415I", "context": "Can this headset be used on desk top computers as well? Also is this set good for listening to music with?", "response": "yes it works perfectly with my windows 8.1, and it comes with an attachable amplifier so you can control the musics treble and bass. Music comes out with nice bass and no outside noises."}
{"product_id": "B0086V5UF0", "context": "Where can the \"just dance 4\" be played? Because I can't play it on DVD/CD player.", "response": "A nintendo wii, it is a video game so you need a console"}
{"product_id": "B005F1ZUU4", "context": "Will it work with Fire TV?", "response": "The internet says yes:http://forum.xda-developers.com/fire-tv/help/fire-tv-xbox-360-wireless-receiver-party-t2871770"}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "It should fit. The New 3DS is about the same size with added buttons. Hope that helps!"}
{"product_id": "B000096L71", "context": "What type accessories (yoke vs joystick, etc.) do people recommend?  Any recommendations on particular (older, cheaper) models of them?", "response": "I use the x52 flight system, it works well"}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "Yes.  It is."}
{"product_id": "B0050SYILE", "context": "Is it safe to order a used one or better to buy a new one?", "response": "It's better to buy a new one"}
{"product_id": "B005FMLZQQ", "context": "Using for Netflix and Hulu, can thus be used to navigate from the dashboard to the apps and control the apps as well?", "response": "Yes. If I'm not paying a game on the Xbox, I'm using this remote to navigate just for convenience. If you can get around with the cursor you can do it with the remote."}
{"product_id": "B005BLAJ68", "context": "does it play pitch?", "response": "Sorry Larry, my encore hoyle does not play pitch."}
{"product_id": "B00GJSUUC0", "context": "Is this entire game just one level?!!!!!", "response": "Pretty much. It's an open world game that take about 20 minutes to complete."}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "English subtitles but Japanese vocal"}
{"product_id": "B009GZX49Y", "context": "So you have to download two of the games to the HD to play them but is that from the disc or online like a DLC?", "response": "Hi, the games are included in the disc, you should descompressed them to play that game. regards"}
{"product_id": "B00965WK8K", "context": "Can this mouse be put in rapid fire mode?", "response": "no very limited as far as programming I would look into a Logitech"}
{"product_id": "B00576U8CC", "context": "\"Free to Play\" just announced.  Does it still require XBox Live Gold paid subscription?", "response": "Yes it does. It is a online only game."}
{"product_id": "B00F9RGFEY", "context": "I just want some clarification. Some customers are saying it works on Xbox One. The advertisement does not. So, is it compatible or not?", "response": "The headset is compatible, for sound.  However, to voice chat using the PDP Dolby, you need to get this adapter:  Xbox One Stereo Headset Adapter"}
{"product_id": "B00009OY9U", "context": "whatl is best joystick for windows7?", "response": "Ive used this joystick since windows xp was out and its worked fine  on everything up to windows 8 on my laptop."}
{"product_id": "B00F47ZNP6", "context": "the mouse pointer wont move even though it says the drivers were installed. is there a way to fix this issue?", "response": "Can you try it on a different computer? That should tell you if it's the mouse or the computer."}
{"product_id": "B005761IOY", "context": "i bought one of these controllers and like it doesn't turn on without being plugged in to the charger is there a way to fix that", "response": "I ordered this controller twice and neither worked without being plugged in.  They're mostly defective and I suggest you submit a return."}
{"product_id": "B00656HLGO", "context": "Just to confirm, will this work with the Xbox 360 Arcade console?", "response": "it will work with the xbox 360 that has the hard drive on the outside of the xbox. Not the newer xbox 360."}
{"product_id": "B00G6IJ5QK", "context": "How is this mouse for Claw Grip?", "response": "I have very small hands, and I claw grip this mouse. It's not a problem really."}
{"product_id": "B00D4WTO1M", "context": "is the dlc packs multiplayer only or is  onslaught and devestation packs a new game within the game single player mode?", "response": "The DLC aré multiplayer packs. They contain new mp maps and new episodes of extinction cooperative game. There are 2 more packs coming."}
{"product_id": "B000NJBD90", "context": "Would it work for a Guitar Hero 2 controller for the PS3 Guitar Hero and Rock Band games?", "response": "I doesn't work for me"}
{"product_id": "B000I10PY2", "context": "What types of games can you play on this?", "response": "Ds games and games boy advance sp games. The ds games go on top in the back the small slot and the Gameboy advance games go on the bottom."}
{"product_id": "B0050SXKU4", "context": "any guarantee the game works? it´s not frozen when playing?", "response": "I have not had any problems. It works great. Is yours freezing?"}
{"product_id": "B009S4JZKK", "context": "is this a game on a disk you can put into a dvd rom", "response": "Hi, I got mine through steam but here's a link to amazon where you can buy the disk.Train Simulator 2013hope link works."}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "Just move it a little and you will see the circle light up and it will start charging"}
{"product_id": "B007MM9E42", "context": "What ages can play this game?", "response": "My son is 6 and is hard for him. He can play all Mario's games , galaxy, galaxy 2, paper, bros, but not this one."}
{"product_id": "B0050SVMYA", "context": "Is the \"virtual console\" or eShop available on this version of the 3DS? I wanna play and download the original Gameboy classics", "response": "I believe the eShop is part of the 3DS. I have a different color, but it still has the application that lets me go into the eShop."}
{"product_id": "B009WI7V9E", "context": "Does this game come with all of the DLC stuff for the first two games?", "response": "Yes, but it comes on desperate disks so you have to download it first. It's worth it trust me"}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "I have Windows 7 and played it fine."}
{"product_id": "B00DVEJA7G", "context": "does it come with a charger", "response": "Yes ,USB cable come with Headphones and u charge from usb computer port , easy"}
{"product_id": "B00CPS59CE", "context": "How would I connect the xp400 transmitter to the XBOX 360 e console since it does not have an optical audio port?", "response": "You can run the audio through your TV..use the optical out on the TV."}
{"product_id": "B00CMQTVUA", "context": "How long until they fix (patch-update) the backwards compatibility to allow xbox 360 discs ?", "response": "so far they have not released anything about making the games backwards compatible. Sadly to say I am pretty sure they aren't going to make them backwards compatible."}
{"product_id": "B00HVBPRUO", "context": "Can this headset be used by jacking into the (PS4) controller instead of the wireless option? And if it can work, is there any drop in sound quality via the 3.5mm?", "response": "I don't know 100% if you can. I say yes Because it does come with a 3.5mm jack you can plug into the headphones and controller. I never tried it. I think I will now lol"}
{"product_id": "B00EZKNT18", "context": "How long is the usb cable?", "response": "Seems to be just over 7 feet."}
{"product_id": "B006YDPU48", "context": "IS THIS GAME ONLINE ONLY?", "response": "no its a single player game, but there is a lot of features that require an internet connection. caps lock is cruise control for cool"}
{"product_id": "B00GJXMRX0", "context": "if I have widows 8 will it still work?", "response": "Yep. I am on windows 8.  After having a few things solved I went though ok to almost the end, where I was not able to point my guy in the right direction to make a jump. :-) So I haven't played for a while, but I did enjoy it."}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "Yes it has bridge and it does works on Window 7, thats what I use. I have had no problems"}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "No first month is free"}
{"product_id": "B007TMFD7C", "context": "Obviously for adults but what age would you recommend in youth?", "response": "Until Amazon ends it's campaign against book publishers, I refuse to spend any money here."}
{"product_id": "B00D5WDI3G", "context": "will this work with windows 7", "response": "My husband plays on an older windows XP and the box says it will play on windows 7.  Check out picture of the front of the package.  If you zoom in you can see what systems it is compatible with."}
{"product_id": "B003VUNWG0", "context": "Will it actually work with Windows 7 now?", "response": "I don't think that  I transferred it to my newer computer that has windows 7 as the program itself was not VERY GOOD.  I was disappointed that it was something that Hoyle put out.  Not worth the  money"}
{"product_id": "B000096L71", "context": "will it run properly on window 7", "response": "yes runs fine -minor glitches which you can live with ."}
{"product_id": "B003VH5Z2C", "context": "I have a 21 inch all in one. Can I hook it up to it?", "response": "Yes, it shouldn't be a problem as long as you have a video/audio input."}
{"product_id": "B004FS8LYK", "context": "Hi, is this compatible with ps4 console?", "response": "Sadly no, PS3 games cannot be played on PS4. Its the whole no backwards compatibility thing."}
{"product_id": "B00DCBDNW6", "context": "How much is the monthly fee", "response": "i believe its 15 a month"}
{"product_id": "B002P35JMO", "context": "Is this a special 360 HDMI connector or would this work with other devices that have HDMI?", "response": "It is specific to the 360."}
{"product_id": "B00B312UDU", "context": "Hey my mouse isn't working. Does anybody know where i can download a driver for it?", "response": "That's weird, my mouse worked right when I plugged it in. Make sure its on (switch on the bottom), plugged in (wireless USB reciever), and the light on your mouse is on. If all of those are working, then I have no idea."}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "No it is the stand alone code, BUT u enter your serial key into Steam and it will recognize the key and like any game like that Steam will add it to your list and it can be installed via Steam."}
{"product_id": "B002I0GF72", "context": "How bad is the violence and \"Blood\"? I have a 6 yr old dying to get this game, but I want to make sure it's appropriate. Please help.", "response": "Like most Zelda games, the violence is cartoony and the monsters are stylized and not human-like. That being said, there's still sword slashing, arrow shooting and boomerang throwing, but all still cartoony."}
{"product_id": "B007LQG9A6", "context": "is this remote fake or really from microsoft?", "response": "Fake. The guide button does not have the \"X\" in the middle, it has no markings that say microsoft, the analog sticks are inaccurate junk, the triggers scrape, and it feels cheaper than a ps2 dualshock. Oh, and the wires will pull out of the usb connector with ease."}
{"product_id": "B009K7QB8O", "context": "Is it compatible with Mac? or Windows 8?", "response": "In my experience, Mac OS X will recognize most keyboards with no issue, regardless of whether they officially support Mac."}
{"product_id": "B00EI4V3X2", "context": "When you connect the Headset to your PS4 controller in order for chat to work, is the in-game sound still 5.1 Surround Sound or not anymore?", "response": "Yes, chat is on a separate audio channel."}
{"product_id": "B009Q5XGO2", "context": "So when you charge the gamepad this charges with it? You don't need to charge them seperatly right?", "response": "Yeah, everything charges together. :)"}
{"product_id": "B002672Z80", "context": "I bought two of these remote, pink and blue, as Easter gifts for my kids.  Any hints on how to get them to sync with the Wii system?", "response": "it sync but doesn,t stay we hafta keep doing it every time"}
{"product_id": "B00EADTVL2", "context": "do the lights turn off when no controller is attached, or are they constantly on when the unit is plugged into the wall?", "response": "The lights go off when not charging."}
{"product_id": "B00FYAQUPU", "context": "can you use other swap force figures on the black portal", "response": "Absolutely, the portal is the same as any other Swap Force starter set."}
{"product_id": "B003O6CBIG", "context": "how many maps on multiplayer are their without dlc maps.", "response": "14 maps with out the dlc."}
{"product_id": "B0009VXBAQ", "context": "Does this Wii console have the ports to insert the Dance Revolution (DDR) mats like the original Wii console?", "response": "This is the original wii console. This console has 4 GameCube slot and two USB slot"}
{"product_id": "B00H1FCUBE", "context": "Can they connect wireless with PS4", "response": "Ravetouch Blutooth version is3.0 and PS4 bluetooth version is 2.1, and they can connected with each other"}
{"product_id": "B00AYBKQRW", "context": "work with LG Model  6711A20111L?", "response": "The instructions said any LG  a/c  window unit will use this remote"}
{"product_id": "B00DC7G2W8", "context": "Is the Mario Kart 8 Wii U bundle not being sold by Amazon?", "response": "Amazon sellers sell the Bundle, but most buyers say they have gotten their bundle opened. I recommend buying a Wii U from GameStop, Target, Best Buy, or Walmart. GameStop has the most bundles, though."}
{"product_id": "B0050SYILE", "context": "Is this o.k. for asia region  (vs u.s.a / canada", "response": "I'm sorry, I am only willing to ship it within the U.S.A / Canada."}
{"product_id": "B00503EAG2", "context": "Does it work flawlessly on Window 8.1, 64 Bit ?", "response": "According to Steam the game will play on OS's Windows 7 and 8. I play mine on windows 7 and have not had one bit of trouble"}
{"product_id": "B00CMSCTA2", "context": "Is there a way that I can play offline, against just the computer?", "response": "No.  I was very disappointed about that.  I purchased this version because of supposedly we did not have to play online.  I am sorry, but it is getting harder and hard to find games that are not online."}
{"product_id": "B00B0QONB0", "context": "My Xbox 360 4GB will not recognize it. What do I do??", "response": "Return it.  Mine didn't work either"}
{"product_id": "B00DH1KRQQ", "context": "does this controller work with Steam games?", "response": "I Sent Mine Back Because I Got It For My Computer And It Didn't Work."}
{"product_id": "B0053B66KE", "context": "Can you use a DS or DSI?", "response": "No u cant its strictly fir 3ds but u can use a 3ds action replay to get u the edg if thats y ur ssking u csn buy it in target ganestop wall mart or here on amazon same with pokemon"}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "One is for the wireless drive and the other is for charging both the mouse and/or the keyboard"}
{"product_id": "B002I0F5I2", "context": "When the DLC content codes game expired?", "response": "Hi Edgar, the code expires on 10-12-2010"}
{"product_id": "B006YDPU48", "context": "Is there a lot of repetitive grinding in this game?  I prefer games like The Last of Us...", "response": "Yes, Yes, Yes.I played the game for 3 hours, saved and turned the console off. When I turned the game back on all my \"money\" or souls were gone and I was back to the beginning. So unless you have time to kill, F this game."}
{"product_id": "B008OQTR3S", "context": "I dont want to use the analog sticks, how can i switch to d-pad?", "response": "when going through the option in the game the control only has 2 options and the both option are using the analog stick to steer, the d-pad is to look back ... so it looks like you can't switch it to d-pad."}
{"product_id": "B005G4CXPK", "context": "Will the keys activate on steam?", "response": "No, it runs on Uplay I believe."}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "Hi Kristina, in the listing on Amazon, it says you can \"stack\" up to 3 years of Live membership."}
{"product_id": "B006QRMR4S", "context": "Can you play regular ds games on the 3ds?", "response": "Sadly you can not. But the new 2DS can, although it does not have the 3D feature.( I am not sure if the 2DS is still in the making or if it was just a joke )"}
{"product_id": "B00027CXEM", "context": "Free roam? Do you have to be jedi/sith?", "response": "I'm not sure what you mean my \"free roam\" but you do have to be a jedi or a sith.  You can also be a \"gray jedi\" which is basically in-between, and you'll get some different dialog and benefits/penalties for that as well."}
{"product_id": "B00HS5FETM", "context": "I have turtle beach earforce x31s will this cord work with that so that i can use my headset i already have with my system?", "response": "I have the xp400s and it works fine for me, if you headset has the 2.5mm plug on it and your controller/ adapter has the 3.5mm plug, then yes, it will work. I have an Xbox One and the chat headset adapter"}
{"product_id": "B008VQ68C4", "context": "Is it Xbox One compatible?", "response": "Sadly no, I bought it with the same thing in mind"}
{"product_id": "B0098F1Y3K", "context": "Will this work with a plain old ds player?", "response": "No.  This game works on a 2DS and 3DS.  From my understanding you can play older games on the new consoles but not the other way around."}
{"product_id": "B003XNU1JQ", "context": "Is this the same game as the original, or is it a remake?", "response": "It appears to be exactly the same!  Complete even with the same response times as the original.  One note...if you have the 5-cord HD component hookup this will not work on your screen.  You will need to use the original 3-cord component hookup which originally came with the game system.  I love playing this!"}
{"product_id": "B008TXMPJE", "context": "Why do i have to buy the first orginal sims 3 to be able to play sims 3 pets? also is sims 3 seasons a substitute for the sims 3(the first game)?", "response": "All of The Sims 3 games, ie seasons, are expansion games of the original game. They add new features to the original game play.If you want to wait, Sims 4 is planned for release at the end of the year."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "yes. I am using 8.1"}
{"product_id": "B0094X28J0", "context": "I have an older Wii console, will the new Plus remote work with it?", "response": "I believe so....all the rest of my hardware is the same as any other Wii owner."}
{"product_id": "B0017HLYNC", "context": "is this the orginal syberia or a cut up version", "response": "I think this is the original"}
{"product_id": "B00BGAA0SU", "context": "What is the difference between the inFamous:  Second Son Limited Edition and the Standard Edition?", "response": "You get Cole's Legacy DLC which is like 3 side missions and if you complete you get Cole's yellow jacket from first Infamous.  Also some extra SonyRewards pts but I didn't redeem them. That's it."}
{"product_id": "B00BM7NXMW", "context": "does it need batteries? Mine just \"Went off\" and I don't know what to do", "response": "NO. It doesn't need batteries. It's wired. Please try another computer if it is still not working, please contact info Perixx, thank you."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "Yes.   1080p Blu ray quality vs 760 for much crisper look but most importantly its the physics and lighting engines that are much better.  I love both platforms but Tombraider shows u the future of games to come on PS4.  U might play in 1080 on ps3 on your tv but its stepped up."}
{"product_id": "B004NRN5EO", "context": "Does this come with the DLC?", "response": "No, it does not have the DLC automatically included."}
{"product_id": "B00919RM1Q", "context": "cards large enough for vision impaired viewer?", "response": "Yes, I'd say that the large size card faces are good enough for those who have vision issues. We actually increased the size of the cards awhile back starting in version 2009 I believe and have carried them over since."}
{"product_id": "B00CJ7IUI6", "context": "If I already have Skyrim and just wanted to add the expansions, would I be able to continue with my game if I got this or have to start over?", "response": "You can continue with your saved game. No problem.I started over just for fun."}
{"product_id": "B002AQNT96", "context": "Will this run on XP SP3????", "response": "If you are playing as a single player XP is fine, but I would recommend having very good graphics card, 2gigs of RAM or more, and a dual core processor or better. If you want to play multiplayer, I would have Vista or Win7 and a good online connection along with the good hardware."}
{"product_id": "B00JFPO7JG", "context": "Can tropico 5 play off line?", "response": "You need to go online to register and patch the game but you play offline."}
{"product_id": "B008WZRZJY", "context": "Does this game run on Windows 8.1? Thank you for an answer", "response": "I have Windows Vista and it didn't work so I sent it back to ya'll.It's a older game & I really wouldn't think it will work on Windows 8."}
{"product_id": "B00CJ7IUGS", "context": "do i need internet connection to download dlc content onto my xbox?", "response": "I don't have my Xbox connected and all the add-ons were included on the disc."}
{"product_id": "B00CJD4HD2", "context": "Odd question but how loud are the button clicks for this mouse? I.e. would it annoy anyone sleeping in the same room as you? Or one room over?", "response": "Same room possibly they are softer clicks than a normal mouse, yet still audible, one room over they'd never even know you are clicking. Even if your walls were made of cardboard."}
{"product_id": "B00BTOAFXS", "context": "Will it make me have a faster trigger finger then now? People say I have a mod?", "response": "Yes it makes u shoot much faster"}
{"product_id": "B00A378L10", "context": "Can the LED lights be turned off?", "response": "Yes. You can toggle the light settings by using the function key on your keyboard with f4."}
{"product_id": "B00A8HIGSS", "context": "will it play on sony ps3 north america?", "response": "Yes, since I used it on that system."}
{"product_id": "B000B6MLTG", "context": "Has anyone experienced any display ghosting with this product?", "response": "no, is perfect, buy the official cable vga of microsoft.. its perfect to play.."}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "5 FREE federal e-files included.  1 state program download included, and you can e-file state return for $19.95/return.  If you need additional states, they can be purchased at $39.95."}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "Yes you can! All you have to do is switch up the region to we're you live then you're good to go! It's very easy! Good luck!"}
{"product_id": "B00DJYK9L4", "context": "How much room do I need to move around in? I have a tiny living room area :-) Thx!", "response": "I do this in my bedroom and its small. I have no problem. Sometimes I have to modify the motions but its only in travelling moves"}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "Language is in Japanese, and subs are in English as well as the UI"}
{"product_id": "B00FLZ4FS2", "context": "code for xbox because one does not work? I feel cheated", "response": "Once you redeem it on 360. Search for the game on the xbone store. Should be a free download"}
{"product_id": "B001GIUWX0", "context": "Can I use my Wii Classic Remote with this game?", "response": "Yes. The plastic wheel is a holder that you put the Wii classic remote into. The plastic holder is optional and really is only a piece of plastic with no technical function."}
{"product_id": "B000266786", "context": "is it    a c.d or        dvd", "response": "It is a CD"}
{"product_id": "B00EV4O7B4", "context": "is this include Pokemon x y", "response": "No..we assumed it did include the games.  VeryDisappointed as it was very unclear.  And, it cost more money."}
{"product_id": "B002I08UGQ", "context": "How can I just get the stylus in the picture. thats all I need. not the normal got to target get a stylus, but that fat one in the picture.", "response": "I bought a stylus at K Mart and since then I've seen them at Walmart and even Dollar Tree and my daughter-in-law bought one at Toys R Us I think.Julia"}
{"product_id": "B0050SZBP6", "context": "is it playeble on EU servers?", "response": "Yes, they have it separated by region (US, Euro, Asian/Pacific, etc.) so that people can play w/the same languages and time zones."}
{"product_id": "B0000AFQRR", "context": "Will it work on Windows 7?", "response": "Yes it will wook on windows 7"}
{"product_id": "B008U5ZNIG", "context": "can you use this with windows 8", "response": "Yeah, I'm using windows 8.1 right now..."}
{"product_id": "B0054JGGGY", "context": "Does it work with a MAC computer", "response": "If your Mac takes USB then \"yes\" it works."}
{"product_id": "B001KMRN0M", "context": "Can u play PS VITA games on this because I don't See any other games that come with this HELP", "response": "Go to the playstation site via wifi and u can purchase a lot including demo now i loaded over 40 to my memory stick"}
{"product_id": "B00D78Q4UM", "context": "Do the keys have the tactile click? My K95 with cherry red switches don't have the click and I hate it. I need the click for my typing style.", "response": "No they do not. If you have any cheap keyboard sitting around (rubber dome), the key press feels the same."}
{"product_id": "B00FZ12F34", "context": "Will this Infinity Bundle work with the Infinity 2.0 that comes w/ the super heros?", "response": "While the characters work in the \"toy box\" portion of the game, you can not use the levels in 1. you need to keep 1.0 to play the original games."}
{"product_id": "B00ENFVJJO", "context": "does it charge one controller at a time even if you dock both at the same time, and automatically charge the second after the first?", "response": "It charge both at the same time"}
{"product_id": "B009GZX49Y", "context": "good morning I wanted to know if this trilogy are video games or play 3 games .... if they would make the purchase ... excuse my English I am from Ven", "response": "THIS IS ONE DISC AND THEY ARE 3 GAMES PS3 FOR ONE"}
{"product_id": "B002L6HJCI", "context": "Is it a reductions version of all 3 AOEIIIs, or a better and expansion of AOEIIIs?", "response": "A reduction version? Im not sure what you mean by that, but it is an amazing expansion for AOE3. I highly recommend them if you are a Age of Empires fan."}
{"product_id": "B00886XQNQ", "context": "does it work on PC/Mac? and is this wireless?", "response": "Don't know I had bad experience with them"}
{"product_id": "B00B1MXGDO", "context": "Does it come with the carrying case?", "response": "It should come with a very nice case with green bumpers and a screw driver to put on or remove the underneath triggers."}
{"product_id": "B00F2ENJY8", "context": "does wii mini use regular memory cards or hard drive or both?", "response": "It has only a built in hard drive. Not sure of capacity, seems pretty big. No memory cards"}
{"product_id": "B00A1Y2STQ", "context": "Does this keyboard have stands in the back that will arch it up? I can't really type with the keyboard flat. :c", "response": "Yes it does. It doesn't tilt up a lot but its better than flat."}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "There should be a thinner wire that came with the headset that enables you to connect to your Xbox 360 controller."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "You will not get it on release day.  From Amazon release day shipping info \"Note: Release-Date Delivery isn't available to Amazon Lockers, Alaska, Hawaii, international destinations, P.O. Boxes, or APO/FPO addresses.\"  Link - http://www.amazon.com/gp/help/customer/display.html?nodeId=201117710"}
{"product_id": "B001V9PTVE", "context": "do these games work on windows 8?", "response": "As far as I can tell, no.  But I,m still trying... Hope this helps."}
{"product_id": "B00DPQ6GPO", "context": "Works with COD Ghost ?", "response": "A bit but not satisfied with the mods and specially the price!!!"}
{"product_id": "B0086UK7I6", "context": "What is the texture like on this mouse? Is it slick like Razer mice, or lightly textured like most other mice?", "response": "The buttons feel like rubber and do not get slippery like the razer Naga the button design if far superior to the naga"}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "It installed fine on my laptop. I have Windows 7. Took a long time to install though and takes up a lot of space on the computer because of all the graphics."}
{"product_id": "B000ZKA0J6", "context": "Is this the base game?", "response": "Yes and a good buy"}
{"product_id": "B000A2R54M", "context": "Grandson has both Wii and DS. Already has this game for his Wii. Will this have different tracks, characters, etc?", "response": "No I believe its all the same so if he loves it on his Wii he will love it on his DS = )"}
{"product_id": "B007W8S2MG", "context": "is this in English speaking when played? or English subtitles?", "response": "Yes, it is in English."}
{"product_id": "B009GTV5HS", "context": "Does the \"intelligent software\" work on Mac OS?", "response": "No it doesn't.  None of the extra buttons work, so you can only use it like a \"regular\" mouse.  That didn't stop me from buying it though :)"}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "Absolutely not, the second right click is actually very comfortable. The primary clicking fingers are your index and middle finger and the ring finger, which lies on the second right click, is only pressed if you truly make a  conscious decision to click it."}
{"product_id": "B004774724", "context": "When I hit buy/download I see it says it is for vista/xp.  I have windows 7- will it work on that?", "response": "Yes it will work on that format."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "the battery life is very good, the duration is 7 hours or more. I charge every 2 days."}
{"product_id": "B006W41X1S", "context": "can you sound whore with these?", "response": "Yea you hear everything..which side from behind...youll love the way it sounds when you become the predator or Michael Meyers"}
{"product_id": "B008WZRZJY", "context": "Does this game run on Windows 8.1? Thank you for an answer", "response": "i don't know, but i had trouble loading it on my windows vista... i now have a 8.1   i might have to try it and see!"}
{"product_id": "B000R9A9JG", "context": "Is this only one battery and cover for one remote? Or two for two remotes?", "response": "this was not my best buy it's for one very poor quality"}
