{"product_id": "B00ERDGMT4", "context": "Is the DLC included on the disc or does it have to be downloaded?", "response": "Its on the disc it just installs it to your harddrive just make sure you have enough room on it."}
{"product_id": "B00001LDBZ", "context": "Does it play on a Windows 7 OS?", "response": "Yes , That is the  system I use."}
{"product_id": "B00965WK8K", "context": "How is this mouse for fingertip grip? Isn't the thumb area too narrow of a space with the buttons and the rest taking too much space?", "response": "My fingers not too thick so feels comfortable enough"}
{"product_id": "B000PD0HQE", "context": "what games will this xbox 360 come with?", "response": "they will be random games mostly sports"}
{"product_id": "B003Q9RGRW", "context": "does it come with the headset", "response": "Yes, wires into the keypad, controller and headset still work if controller is wireless too. Good buy IMO."}
{"product_id": "B00FOHP8XI", "context": "can this be hooked up via hdmi to home theatre  system///or does it just have rca plugs tks cj", "response": "Yes, it can be hooked up using an HDMI cable. I have mine currently hooked up with an HDMI cable."}
{"product_id": "B00FRESQYG", "context": "What does this come with? Is this the same as the digital download of WoW on Blizzard's website?", "response": "This comes with World of Warcraft, World of Warcraft: The Burning Crusade, World of Warcraft: Wrath of the Lich King, and World of Warcraft: Cataclysm. The only current expansion it doesn't have is World of Warcraft: Mists of Pandaria."}
{"product_id": "B000GP8448", "context": "what games does this product work with", "response": "You can use it for just about any game you wish. I use it for GTR2 and rfactor. Its the best wheel for the money IMO."}
{"product_id": "B00BI4VVGY", "context": "Is it a 2 or 3 pin fan controller?", "response": "The way it's made it will work for both though"}
{"product_id": "B004HYK8Y8", "context": "I see all reviews are from 2011. It's 2015 Have they fixed the bugs in this game yet? Considering purchasing but sounds risk.", "response": "I recently bought this for my husband. He hasn't complained of any bugs. This is definitely worth buying."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "The code is valid on any account, it simply emails you the details and you can choose where to input it. It's best to go to Account Management > Redeem Codes and input it there."}
{"product_id": "B0091WIOJ2", "context": "Do i need a 7.1 Surround sound card for these to be fully functional.", "response": "They work just fine right out of the box. Sound quality is excellent, no complaint here"}
{"product_id": "B00DPJBTM6", "context": "what cables have to be connected to the pc itself?", "response": "There is a pink one for the microphone and the green one for your headset sound."}
{"product_id": "B006YDPU48", "context": "Can you dodge, block, and counter? Do you get health regain rings and necklace, and do you get health steal per hit armor?", "response": "You can dodge block and counter. You can get health regain rings."}
{"product_id": "B006YDPU48", "context": "I really want to play this game but I'm sort of leery of the difficulty level I keep hearing about. Is it so hard it's frustrating?", "response": "The difficulty isnt because its challenging and it doesnt come from a learning curve.  The difficulty in DS2 in contrast to DS1 is due to the lack of refinement in programing the controls, hit boxes and enemy A.I.  In other words, its cheap."}
{"product_id": "B00ATF5YYI", "context": "Do you know if it is the 1.7 patch?", "response": "It is automatically updated. Since it uses Steam."}
{"product_id": "B00HWMP0TU", "context": "Does the complete edition have all expansion packs included?", "response": "Yes that is what complete edition means"}
{"product_id": "B00C7103DO", "context": "Has anyone gotten this version for PS3 and gotten it on Vita free by Cross-Buy?", "response": "We did not, but we don't own a Vita so it is possible that it is available but we are unaware of this."}
{"product_id": "B008YRITPO", "context": "What is the size (Length and Width)? I was wondering if It could fit in the pull-out tray of my desk.", "response": "Sorry i have took so long in answering your question but i brought this keyboard for my son so have had to wait for him to measure it. Length:52cm-20inches, Width:22cm-8.5inches, Depth (back of keyboard) 4cm-1.5inches. Hope this is helpful."}
{"product_id": "B009JZ04BC", "context": "Does this mouse support free-scrolling scroll wheel?  (like when you spin a wheel on a skateboard, how it keeps spinning)", "response": "No it does not support this feature but as you may know the Logitech g500 mouse does. Good luck finding the right mouse for you!"}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "I haven't tried it with Windows 8, only Mac 10.9 and Windows 7 (both work fine by the way). If saitek makes a Windows 8 driver I suspect it will work fine. It's an excellent product."}
{"product_id": "B002I0F5I2", "context": "When the DLC content codes game expired?", "response": "Mine were already redeemed because I bought it used. If you look up the actual dlc content, you'll see that you aren't missing all that much. It is likely that the codes expired even if the game is new...considering it is several years old now."}
{"product_id": "B004IK24MU", "context": "How long does it take to fully charge the batteries? Also is there an indicator to let you knowthey're charged?", "response": "From low battery reminder to fully charged, I believe it's about an hour and a half. Red LEDs light up in the dock while charging, then go back to blue once complete. The LEDs are bright enough, I can see the status from across the room."}
{"product_id": "B0032MM2P4", "context": "Can I use this on Windows 8?", "response": "Yes you can, my neighbor uses windows 8 and he has no problems with it."}
{"product_id": "B00DGZDFO4", "context": "Is this a Steam game? Not just a game you can add to Steam, but an actual Steam game, as in Steam will acknowledge it has been purchased?", "response": "Yes it is an actual steam game, not a non-steam game. Achievements and all the other Steam related things work fine."}
{"product_id": "B00HKCKA0G", "context": "We plugged in theadset to controller for ps4 but in Settings, then Sound and Screen, then audio output settings, no \"output to headphones\"...help?", "response": "If you plug in you hold PS button goto setting adjust devices and set headphones to play all audio if that does work head phones are not being recognized and need to be returned"}
{"product_id": "B00B0QONB0", "context": "Can you tell me your  actual experience about this HDD, ? How many time do you have one ? And,  still working ?", "response": "just one time     still works perfect"}
{"product_id": "B009Q5XGO2", "context": "Just making sure here but, I don't think this can be on with a case right?", "response": "No my friend. But you can modify it as hinted by Kenneth D. Rich. The gain is well worth it anyways."}
{"product_id": "B007W8S2MG", "context": "is this in English speaking when played? or English subtitles?", "response": "The voices are in English. You might be able to change them to Japanese with English subtitles, but I haven't looked into it."}
{"product_id": "B00DC7O77A", "context": "Does this game have multiplayer mode?", "response": "Yes it does, my son and I enjoy playing together."}
{"product_id": "B00B67ZTUW", "context": "How does this series compare to final fantasy?", "response": "This series doesn't take itself quite as seriously as final fantasy does. I would say that besides ff7, ff6, and ff9 this game was much more enjoyable than the rest. I have played through it twice and each time racked up over 100 hours. Give it a try"}
{"product_id": "B0094H8H7I", "context": "can you save games that are part of the 80 original", "response": "no you can not save any of the games.... unless you leave the console on."}
{"product_id": "B005MQ3BSK", "context": "Does this work on Windows 8?", "response": "Yes, it works just fine on Windows 8."}
{"product_id": "B005F1ZUU4", "context": "Will this controller work for windows 8?", "response": "I don't have windows 8, (windows XP works well).  Sorry I can't answer your question."}
{"product_id": "B00EH5V1IO", "context": "Can one headphone be removed to leave one ear open while using the headphones?", "response": "Not really.  The ear piece disconnects at the headband, so while you could technically do it, the headset would not subsequently be comfortable to wear.  Hth."}
{"product_id": "B00D6PTMB4", "context": "Does it come with the guitar?", "response": "No, you have to purchase that separate."}
{"product_id": "B008BGXYBM", "context": "Why does my razer taipan has only one laser sensor(8200dpi) while other taipan has the 4G \"DUAL\" sensor (2 laser sensor) ?", "response": "Razer uses the \"4G\" advertising on a lot of sensors. There's optical, laser, and the optical/laser combo. Laser sensors have inherent acceleration, so I always stick with optical mice. eg, Deathadder, G400"}
{"product_id": "B00A7VK16A", "context": "Are there any issues with taking this as a carry on when flying?", "response": "Nope, its just electronics.  Zero issues, but you wouldn't be able to power it (requires two outlets)"}
{"product_id": "B0000512IE", "context": "How far are the pedals apart? i.e. the spacing distance.", "response": "It's 95 mm (3,74 in.)between inner side of pedals, that is #103mm (4,05 in) between inner side of your soles."}
{"product_id": "B00EWEHI5K", "context": "Should I get this or the Logitech G502 Proteus Core?", "response": "I'm not too familiar with the G502 but I know Logi makes great hardware and the Proteus looks ergonomically better overall. Plus a better price.My experience with the Ouroboros wasn't that good. It felt clunky and didn't provide a comfortable or good grip for fps or games that required frequent lifting.Go with the Proteus"}
{"product_id": "B00FLLFJE0", "context": "Charging Base doesn't light up. Battery is in correctly and controller is working. Battery came with charge so not sure if that's why no light on Nyko", "response": "If the battery had a charge when it arrived, he base won't light up. Once its drained and placed on the charger it should light up, and then turn off again when its fully charged."}
{"product_id": "B0076HD2W8", "context": "Will this still work without a CD Drive?", "response": "yeah you don't need one just head over to Microsoft site and download the required drive"}
{"product_id": "B0088MVODO", "context": "If this is true, I don't have high speed internet, can anyone download them for me to a memory card or should I give them my console so that they can", "response": "Hi, i Think u must lend your console to someone. Im not sure u can download any of the games to a memory card.Its easier to lend the console anyway."}
{"product_id": "B009LGO88E", "context": "I have the Newest 3DS XL with the new tiny right joystick that seems useless at its size. Will this device work as a supplement for that?", "response": "I do not believe that the CPP will clip onto the N3DS XD and us not compatible with it as of right now."}
{"product_id": "B005T3GSBS", "context": "does this game have English subtitles or is it only in Japanese", "response": "It does have English subtitles."}
{"product_id": "B004HYIAPM", "context": "Do you have to continue buying subscriptions if you buy the CD or does buying the CD give you unlimited time to play?", "response": "I bought this for my older granddaughter for Christmas.  She still plays, so I believe it is unlimited."}
{"product_id": "B00EZKNT5O", "context": "Is  this controller compatible  with 8.1 window deskttop pc", "response": "It is. I've been playing Dark Souls 2 with this controller on 8.1"}
{"product_id": "B00FC1UH82", "context": "Is this wired or wireless?", "response": "It's wired, and the chord is really long.Also, it has a compartment on the back so you can stock it."}
{"product_id": "B00GO4PTR0", "context": "could help me please my question is how I sent the code is by email or serious", "response": "they sent me an actual card"}
{"product_id": "B005G4CXPK", "context": "Am I able to use a keyboard and mouse to play or do i specifically need an Xbox controller that plugs into the USB port", "response": "I don't have an Xbox so I don't know about using the controllers, but you can play fine with just the keyboard and mouse!"}
{"product_id": "B00475AYUA", "context": "If we get a download code, where do we download it?  Don't want to use steam if possible?", "response": "This item is not a steam download. You will get a link to install and you install it independently as a stand alone game. You will have to look for the right folder to play the expansions as they are included in the download but are independent from the main game!!"}
{"product_id": "B0094H8H7I", "context": "Does it have Castlevania Bloodlines on it!", "response": "No, I wish it did!"}
{"product_id": "B00ACMM9BO", "context": "Does it work with turtle beaches?", "response": "Yes it works with any headset"}
{"product_id": "B00HVBPRUO", "context": "Does the sounds on the headset leak? if i were to play loud music on these, would other people around me hear the music as well?", "response": "Ignore the answer that says there's no audio leak. It leaks a ton."}
{"product_id": "B00E447L8C", "context": "How do u guys apply to iPhone 5? It is a micro USB port!", "response": "You would use your iphone 5 usb cable"}
{"product_id": "B002I0H09Y", "context": "it is a usa version?", "response": "Yes it's the USA version.. The game is amazing!!"}
{"product_id": "B00005B8G1", "context": "Is the backlit screen annoying?", "response": "Actually it has no lighting.  I recommend playing this outside on a sunny day.  The Game Boy Advance SP however, has a backlit screen for playing in the dark.  I chose the original design though because of nostalgia purposes and the Platinum color is limited edition."}
{"product_id": "B003ZSP0WW", "context": "Will this work on Amazon fire TV games", "response": "It only works for 360 console."}
{"product_id": "B005CELN8W", "context": "So this game does not work on Windows 8, I presume?", "response": "other windows 7 games I have work on my windows 8."}
{"product_id": "B00012YI14", "context": "I am trying to get this joystick at http://amzn.to/UkGz6n to work with my orginal XBox (XBox before XBox 360 and One).  Will this adapter work?", "response": "Yes, I have two of them that work fine with these joysticks."}
{"product_id": "B0000CNUUP", "context": "Does the physical copy of the game come with a map insert?", "response": "No, no instruction booklet either."}
{"product_id": "B003XNU1JQ", "context": "do you have to have that controller or can you use the one that comes with the system", "response": "You have to use the classic controller. It's a few bucks"}
{"product_id": "B00I14395A", "context": "Do the rechargeable batteries 'really' only last 48-hours? (if so, then it's not 'really' wireless)", "response": "I have four computers with is setup.  It's great. I get two-three weeks before having to charge either keyboard or mouse."}
{"product_id": "B009YKVRYA", "context": "Is there  skirmish mode in this version like in Stronghold Crushader?", "response": "yes but not as good"}
{"product_id": "B00G6CLZPA", "context": "Exactly what kind of game is this?", "response": "This is a reader game. You follow the story by reading and sometimes you have choices that change the progress of the story. Also this is considered an otome game so it is geared toward female players."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay an additional  membership for playing the game or is  it enough with buying the game?", "response": "Access is included with the game. But save your money,  because once it stops working it won't matter."}
{"product_id": "B0050SVNP8", "context": "Is Spanish languages included?", "response": "Unfortunately no.  There is nowhere to pick the language the game is in."}
{"product_id": "B0087ZMATE", "context": "Does it have a mute button for the mic?", "response": "No. There are no in-line controls for this headset. No mute and no volume control."}
{"product_id": "B003Y5AHPG", "context": "Where are the L & R buttons on the controller?", "response": "there are no L & R buttons on these controllers the games they play do not require these buttons please let me know if I can do anything else thanks"}
{"product_id": "B0016HG4H4", "context": "Does this drum set also work on the Xbox 360?", "response": "No longer have product."}
{"product_id": "B00A1AQJAO", "context": "I bought a used 3DS which did not come with any AR cards and the first thing the section would ask for is a \"?\" card; would this be included?", "response": "Yes.  If you buy this pack.  (Adaptor is include with an device code which you need to use it for verify and activation.)"}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "Yes it will, that's my current version of Windows.  Only reason I said bad platform was the hackers on the PC version"}
{"product_id": "B001AH8YSW", "context": "will this work with windows 7", "response": "Yes. I ran it on Windows 7 with no problems."}
{"product_id": "B00FM5IY0Q", "context": "Is this game exclusively for XBox One - or can it be played on an XBox?", "response": "You can only play DR3 on Xbox One and not on the Xbox 360.  This game takes full advantage of the Xbox One's new hardware, especially the Kinect."}
{"product_id": "B009AP23NI", "context": "Does this take AA batteries?", "response": "No. It has a built in battery that is charged via a USB cable that is included."}
{"product_id": "B007YLUCME", "context": "How do you turn it on after unplugging the usb?", "response": "Return that is the worst controller ever"}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "this was the \"test\" \"beta\" release, the \"pro\" model is the complete release. basically they released the beta to a few select locations to see if there was any complaints or noticeable bugs. to my knowledge the package is the only difference that can't be updated"}
{"product_id": "B003G6ISRC", "context": "Does the game install completely on the hard drive or does it need the cd to be in the computer to play the game?", "response": "Insert the CD, Install the game, then remove the CD, Sal"}
{"product_id": "B00I4A751U", "context": "What's the difference of the Prepare to Die Edition and US release Dark Souls?", "response": "ok the difference is its in English not Japanese and the Dark Souls prepare to die edition has all downloads that you need for it so you don't have to spend extra money by the $20 download I hope this answers your question thank you peace"}
{"product_id": "B00EPZ8POY", "context": "Hello, I want to know if if the cover looks like the one in the picture? also, does it have spanish subtitles? thanks", "response": "Is the same but not Spanish subtitles.."}
{"product_id": "B0053BCO00", "context": "will this work in the 3dsxl", "response": "Yes, its fully supported only difference is screen/unit size in 3DS-XL."}
{"product_id": "B00H8NS1K8", "context": "If you take the 3.5mm TRRS jack at the end of the short cable and plug it into an iPhone instead of to the extension cable, what happens?", "response": "It'll work like any other headset you'd plug into your iPhone, you get both audio and your mic."}
{"product_id": "B0057WDBHA", "context": "Will this stick work with a Win8 PC?", "response": "It would.  Mine ran on a Mac and Windows 7. It works well on everything."}
{"product_id": "B00DWXUYN0", "context": "Can you fit the charger in the case as well ?", "response": "You might be able to sneak it in if you have an original 3DS but an XL takes up all of the space in it."}
{"product_id": "B000NJBD90", "context": "Does it work for xbox 360 slim?", "response": "This is to convert a PS2 controller to a PS3 gaming counsel. You need to look for a product that is for Xbox not PS2 and PS3."}
{"product_id": "B00BA9AWTO", "context": "What are the 18 games on this game?", "response": "Christmas CaroleChameleonAliceBig Money ShowBlast ZoneBurnin LoveClover CashEngine no. 1Fairy TalesKilaueaMaraschinosRobin HoodShimmerThey Came From Outer Space3 WitchesTiger' RealmXerxes"}
{"product_id": "B00GG4BBUM", "context": "I received this for the PS4 on Tuesday via pre-order, but there is no book in the game case.  Is this normal, or was my game just missing it?", "response": "Its totally normal, the manual is online"}
{"product_id": "B00DGZDFLW", "context": "Got my code today on the 22nd.... But I wont be able to download until the 25th? Correct? thanks", "response": "You can download it right now, but won't be able to play it until the 25th."}
{"product_id": "B003NSLGW2", "context": "Do these work perfectly on PS3?", "response": "Yes, but again they are very thin rubber, can tear. Mine came off all the time."}
{"product_id": "B009JZ04BC", "context": "Does this mouse support free-scrolling scroll wheel?  (like when you spin a wheel on a skateboard, how it keeps spinning)", "response": "No, it does not have a free scroll wheel."}
{"product_id": "B00IU3MSF4", "context": "are the games downloads or disks, and does it need internet to play the games", "response": "Bring a game disc that you can play without internet, but you must download the other online to play. I still have not downloaded."}
{"product_id": "B00EZKNT5O", "context": "does it come with a cord", "response": "This is a wired controller.  It is permanently attached to the controller on one end and has a standard USB connector on the other end."}
{"product_id": "B007SRM5U6", "context": "Thist game have spanish sub?", "response": "According to the information that I got this model only has English Sub. I am sorry."}
{"product_id": "B005UI8V6C", "context": "How do you get all three games to download only the Traitor Soul will download?", "response": "It is actually when you travel to the middle world not through the dungeons but the middle world there is a table and that is where you access the other games. Kinda confusing but they all download though the main game"}
{"product_id": "B00I4C2EKA", "context": "Can I play this game on a non-gaming laptop that is just a couple years old, or will it run slowly?", "response": "The game itself wont run slowly, however in order to play the game you need Steam, and that combined with the game will run a bit slower if it's an older PC. But you can still play the game and it will work perfectly. It's a great buy."}
{"product_id": "B002I0H09Y", "context": "Is this any good?", "response": "Its ok but the controls are kind of needing to get use to"}
{"product_id": "B000R0SRNU", "context": "Do u need xbox live to play this?", "response": "No, You don\"t need Xbox Live to play this. It's really fun to play with a second player."}
{"product_id": "B00FENJVOE", "context": "i am using all 10 character slots already and im wondering if the xpac gives you more slots or will i have to delete a character to make a crusader?", "response": "There is no need to delete any character, there will be more character slots in the expansion pack"}
{"product_id": "B004RMK57U", "context": "if i purchase the digital code, do i log in on amazon with my email or the one for the playstation", "response": "To active it or just retrieve it...??"}
{"product_id": "B00CJ7IUGS", "context": "It says \"Better with Kinect Sensor\" but is it really necessary?", "response": "It allows you to say equip \" item\" or you can say a shout. But see if you can find anything on you tube!"}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "You can recharge the controller. It takes about 5 minutes to fully charge"}
{"product_id": "B000IZAQD8", "context": "Is this the latest version? The 90001?", "response": "SCPH 90001 CB / 97706"}
{"product_id": "B00ERDGMT4", "context": "hi, does this game come with everything offered by gamestop?", "response": "It comes with all the DLC. My copy did not come with any pre-order bonuses, if that is what you mean."}
{"product_id": "B00DE2W4PK", "context": "Friend apology, which contains the box exactly? playstation plus come with box or purchase, you send the code of playstation plus inside the box?", "response": "in the box code"}
{"product_id": "B0000CNUUP", "context": "Does this have to be installed through steam?  I don not have internet on my gaming computer.", "response": "Maybe the DVD version, but not the disc version."}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "of course u can. in this very moment i am in Argentina and i have my PS4 whit me, and i playing BF4."}
{"product_id": "B001GIUWX0", "context": "Does this $18 used Mario Cart Wii game come in the original packaging including instructions?", "response": "It came in the original case unsure if it came with Manual but was in good condition"}
{"product_id": "B00CD90R72", "context": "Im going to buy a fifa game, and dont want to pay a lot. I am an offline mode (franchise type mode) person, so is fifa 14,13, or 12 the best to get?", "response": "As a franchise player as well, if you are on a PS3 I would go with Fifa 13."}
{"product_id": "B005UI8V6C", "context": "can you play it offline?", "response": "They are disks, so in this case, no; I think they ask for you to register for an account but I do not think that it is necessary. Once you install once, it saves to your computer, adding an icon which as long as you save your progress, you should be fine. I hope this helps."}
{"product_id": "B00FAN4LRA", "context": "How sturdy are these headsets?", "response": "The headsets are very sturdy.  They are made of quality materials and because they are designed for gaming they are heavier than traditional sets.  The look and feel is outstanding and they are very comfortable (snug) on your ears.  Hope this helps."}
{"product_id": "B00BV72X1U", "context": "Will this work with Fire TV?", "response": "The official MS receiver works with FTV. www.youtube.com/watch?v=R95xmjEatZM. This is not an genuine MS receiver, genuine  comes with silver disk and has Microsoft on it. Not sure if this particular one works unless it's a exact clone."}
{"product_id": "B00G42KO0Y", "context": "can you charge your phone with the controller?", "response": "I don't think you can."}
{"product_id": "B004IK24MU", "context": "Does it work with control with silicon case??", "response": "No, you need to remove the sleeve to charge. But they batteries once charge do  fit with the controller in the silicon  sleeve"}
{"product_id": "B002LMX5ZW", "context": "Does the game fill the screen?  The version by another maker that I have does not. My resolution is 1366X758 on a lap top.", "response": "Hi, Ronald.  The game won't open at all on my laptop computer so don't know whether it would fill the screen.  I do have an older version installed on my desktop and it does fill the entire screen (resolution 1920 x 1080).Best regards,Sue Robertson"}
{"product_id": "B00D96BMV8", "context": "Is the mic detachable?", "response": "Yes, and it's fairly simple."}
{"product_id": "B004GINKNQ", "context": "will this work on the 4GB Xbox 360?", "response": "Yes.  My 4GB was acting up, I put this in...  No, problems."}
{"product_id": "B00IRHE892", "context": "If anybody plays CS:GO with this mouse ---- When flick-sniping or playing scoutzknives, is the scroll-wheel accurate? Does 1 notch switch ONE weapon?", "response": "If your hyperscroll mouse ever scrolls two in one click, you have a defective mouse and need to warranty it. My friend's G9X has this problem."}
{"product_id": "B003NSLGW2", "context": "how many are there", "response": "Hey Julia, 2 blue and 2 black, there is a slight adjustment in feeling at first, but after a day, it feels very natural, hope that just helps, God bless"}
{"product_id": "B006SVUQNQ", "context": "Is this product originally associated with Xbox?", "response": "It isn't associated with xbox but it works on xbox 360 slim great"}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay for online multiplayer or is it free?", "response": "just purchase the game then your set, you don't pay for multiplayer"}
{"product_id": "B003YC4D9A", "context": "does it have a usb", "response": "No it is meant to be used with the wiimote"}
{"product_id": "B007JM8ULS", "context": "what is the difference between this one and the one that cost $41 also made by generic?", "response": "I can't say, but I CAN say that this drive didn't work and upon asking to return it the company didn't even want it back. Buy a Microsoft drive. They cost more, but they'll work."}
{"product_id": "B008TP1OKI", "context": "do you need to have the transfer cable for this hard drive?", "response": "No you don't, you insert a flash drive to your Xbox move what items you want to the flash drive. After you done that install the new hard drive and then you can move what you have on the flash drive to the hard drive."}
{"product_id": "B00576U8CC", "context": "I hear everyone saying you need a XBOX Live Gold membership to play Defiance. Is there a XBOX Live and an XBOX Live Gold .Is there a difference?", "response": "Yes, XBox Live Gold is required to play this game online with other players."}
{"product_id": "B00DJYTGYU", "context": "can this controller be used for all ps3 games", "response": "Yes it should work on all ps3 games. I have played borderlands 2, tomb raider, and max payne 3 with it."}
{"product_id": "B00BU7WVG8", "context": "does this play 2 players", "response": "yes it's 1-2 player"}
{"product_id": "B000BIZR72", "context": "Does this include Galaxia?", "response": "It includes: Galaxian, Pac-man, Galaga,The Tower of Druaga, Mappy, Xevious, Dig dugII"}
{"product_id": "B00D96BORK", "context": "can i connect to my iphone 5c", "response": "Yes, using the 3.5mm jack it will work with any mobile device."}
{"product_id": "B001CXYMFS", "context": "How long is the USB cord?", "response": "Best stick for the money, hands down.....cord length has never been an issue for me; but it is approx 6-7 ft."}
{"product_id": "B005CELN8W", "context": "How well does it play on windows 7?", "response": "It plays well.  I have not had any problems."}
{"product_id": "B00CERXJNW", "context": "Is the wrist rest removable?", "response": "Yes it is. The rest it ships with screws onto the keyboard."}
{"product_id": "B00HKCKA0G", "context": "can you use this as a pc headset?", "response": "Well is it worth getting for a pc...."}
{"product_id": "B00CPKUV98", "context": "is this the full game for this price seems to low of price?", "response": "it's the full game, but the game is bad.  really bad.  that's probably why they've lowered the price after only being out for a week.  don't buy it.  you will be disappointed."}
{"product_id": "B0041G5SD8", "context": "will Empire and Napoleon Total War Collection - Game of the Year (PC DVD) [UK work in the us ?", "response": "I don't know if UK version will work in US or not. You might ask the manufacturer."}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine.", "response": "Hey bud, you may need to un install and re install the game. Sometimes updates delete cc files on accident."}
{"product_id": "B007VTVRFA", "context": "Are the reviews true?  Did EA destroy the Sim City franchise in the same manner they destroyed my beloved Command & Conquer?", "response": "If you have SC4, keep it. None of the upgrades to the new edition is worth while. Very limited in size of cities. I personally am not a fan and unhappy with it."}
{"product_id": "B00726ARTE", "context": "is this 4 xbox 360 or ps", "response": "It's not really for game consoles because it only has a regular jack. I just bought an Xbox controller adapter so i can use it. I don't reccomend this bec mine broke after 3 weeks, good thing Amazon support gave me a refund."}
{"product_id": "B00HHAIY72", "context": "Does it pay to get a used x52 pro. The Warthog is close to $500 and the less than stellar reviews for this item on Amazon and elsewhere are scary.", "response": "it is not $500, it is $200 and it is a very good flight stick for simulation and for recreational games."}
{"product_id": "B000FP0K0U", "context": "Will this work with Windows 7?", "response": "I am using it on 7 at this time. Works okay."}
{"product_id": "B00C2B2Y9A", "context": "I have a PC and a PS3  on one TV. Can I connect this to the TV via optical and get full surround and mic capabilities, or must it go into the devices?", "response": "As long as you have s/pdif out on your tv and use hdmi for your PS3 and PC it will work. The mic can work on both at with one usb plugin. However, for the mic to work on pc and PS3 simultaneously, make sure you connect the usb side to your PC for power to install drivers."}
{"product_id": "B000ND3XXA", "context": "Does this controller allow 2 players to use gamecube or ps2 controller at the same time?", "response": "No (At least, not as far as I could figure out), this only works for one player. You would need another one for another player."}
{"product_id": "B00EOPT5ZS", "context": "Is it possible to bind the Windows Volume control to this? One YouTube review said it cannot be done.", "response": "It can be set to any normal keys....so you can set it to do what ever you need IF you have a secondary program that allows you to, lets say, ctrl+U for volume up, then you set the footboard up switch to ctrl+up."}
{"product_id": "B002LMX5ZW", "context": "Will this run on Windows XP?", "response": "It says on the it can be installed in windows 98 and xp. I installed it on Windows 7."}
{"product_id": "B00E1L78N6", "context": "Does these include the boom mic?", "response": "I just ordered it on the 14th and received it today, and the packaging did not include the boom mic.  Waiting on that call..."}
{"product_id": "B003BKWEHS", "context": "does it work on window 7?", "response": "yes I have had no problem"}
{"product_id": "B000PT18OS", "context": "is this for the 110V or 220V ?", "response": "I wasn't sure myself, so i took a quick look at the power supply itself and it said \"85-130 V\". So I'm assuming that's it's for the 110V, hope this helped."}
{"product_id": "B007XVTR12", "context": "does it work with windows 8.1 ?", "response": "Windows 7 or higher as long as he meets these other requirements:CPU:\tIntel Core 2 Duo E8200 2.66 GHz or AMD Phenom X3 8750 2.4 GHzCPU Speed:\tInfoRAM:\t2GB for 32-bit OS or 4GB for 64-bit OSOS:\tWindows Vista SP2 or Windows 7 or higherVideo Card:\tNvidia GeForce 8800GT 512 MB or ATI Radeon HD 3870 512 MB"}
{"product_id": "B00BMFIXOW", "context": "what is the region ?", "response": "Hello! The region for this disc is ALL. Playable on all ps4 consoles.Thanks!"}
{"product_id": "B001DPZE84", "context": "How come these are so expensive when you can get FSX Steam for $4.99 on Steam", "response": "Hi, The Steam needs an internet download of upto 15 gb's. Regards"}
{"product_id": "B004C4U1VI", "context": "am I doing something wrong? the cable doesn't work", "response": "Are you using it for a ps2? If so, plug the original av cable back in, turn it on with no game in the disk drive, then go to system settings and change display out from rgb to y\\pb\\cr or something like that"}
{"product_id": "B00B77OKNI", "context": "The controller shows up on my FireTv stick but will not pair. Anyone else run in to this? Anyone figure out how to fix it?", "response": "Back in July I've tried most every platform that you could imagine... most probably it'll never work. You should return it to your vendor if you can."}
{"product_id": "B00IAVDPSA", "context": "Can I use this remote to instantly turn off the XBOX One when my son refuses to stop playing?", "response": "If it comes to that, keep in mind that the power supply can be disconnected from the rear of the console. If facing the console, it's the big plug on the far right. I wouldn't recommend it, but it can thrown out on the table as the \"nuclear option.\""}
{"product_id": "B002I098JE", "context": "Does this game have multiplayer mode", "response": "Yes in fact the multiplayer mode in COD has always been one of the best features of the game. You do need a stable internet connection though. Hope this helps."}
{"product_id": "B00DT55P94", "context": "Are all full games?", "response": "Yes, ALL FULL games, Jose. 2 cases, 4 discs and Mega Man 10 download, no demos or funny business. Go for it, brother!"}
{"product_id": "B00E8RVP0U", "context": "Can you use this game on a euopean wii player? Is it multi 5?", "response": "zumba kids states it is for use only in the USA, Canada, Mexico, and Latin America.I did not see any marking to indicate it  is a multi 5.I hope that helps."}
{"product_id": "B0041RR0TW", "context": "Has anyone used the 710 Gamepad on a windows 8.1 system?", "response": "Hey Thomas, are you currently using this gamepad on windows 8.1? Are you having any issues with that?"}
{"product_id": "B003O6EE4U", "context": "can you install without sensor", "response": "Do you mean the Kinect sensor? If so, then yes.  The Kinect is only required for Kinect games."}
{"product_id": "B001EYU1WS", "context": "If i wanted to use this to control something on another game besides FS, Could i use a program similar to \"Xpadder\" to map the controls?", "response": "All of Saitek's products are programmable and therefore can be modified in simulators such as FSX etc.  I am not familiar with your simulator or program but I am sure that you can obtain the map of the buttons and knobs and therefore change their functionality."}
{"product_id": "B00CD1FC6G", "context": "Is this worth it? I've never even considered getting a $100 keyboard before.", "response": "I absolutely love it. Typing or playing games, I love having the tactile feed back. It is a little noisy but I don't mind the clicks."}
{"product_id": "B002JTWODG", "context": "Is this the 6400dpi found on the Razer website?", "response": "I can't say for sure as it's been several months since I bought mine (which I did from here), but mine's not 6400 dpi."}
{"product_id": "B00CRL9TU2", "context": "is it better than GT5??does it has too much difference??please help me to choose..thnx", "response": "A lot better, way more car customization and a huge selection of cars."}
{"product_id": "B00GHTP4ZY", "context": "does this include the main game plus the expansion or just the expansion???", "response": "It includes both,  But don't buy it at $40.00 I got it for $20.00 and still consider it a waist of money."}
{"product_id": "B0011E4J7O", "context": "How long is the cord?", "response": "it´s about 6.6 feet..and it´s working fine..recommended"}
{"product_id": "B00BBUCCKO", "context": "The back light color, are there other color selections available, or is it stuck in the default blue as shown in the preview pictures?", "response": "If you download the software for it from Logitech, you can adjust the colors to almost any color you want."}
{"product_id": "B000UHE8YM", "context": "Does this keyboard work with WIN7?", "response": "Yes, the keyboard and the software that comes with it is compatible with windows 7 and 8."}
{"product_id": "B00DHF39KS", "context": "If i buy this now will it come with the doom beta?", "response": "I'm pretty sure.  I didn't pre-order and it was on there."}
{"product_id": "B0050SZ0SY", "context": "Can I play this game with an Xbox controller?", "response": "Yes You can with either xbox 360 or xbox one controller."}
{"product_id": "B009DYCTY4", "context": "Does it come with controllers?", "response": "Only one . all the game are great . your should buy it"}
{"product_id": "B004C4U1VI", "context": "It seems like the other 1 in 1 PS2 component cables don't play PS1 games if hooked up to a HDTV.  So does this one do the job?", "response": "Sadly this cable will not play PS1 games on the PS2. Plays PS2 games just fine though."}
{"product_id": "B009Q5XGO2", "context": "Just making sure here but, I don't think this can be on with a case right?", "response": "I don't think it does, unless the case is very thin and doesn't cover parts where the Uboost connects to."}
{"product_id": "B001NT9TK4", "context": "Is the gas pedal realistic? I mean, in real cars, there is a big difference if you floor the gas pedal or only press a little bit.", "response": "Yes, you can feather the pedal. Throttle control is excellent, especially compared to a controller button!"}
{"product_id": "B0089OBLDO", "context": "I would like to use a Logitech G27 to play Forza 5 on an XBOX One and this \"might\" be the ticket. Anybody who has tried this please advise... Thanks.", "response": "I don't think it would work. I just tried to get the process started (you need an original wired xbox controller to start) and it didn't work. so more than likely you won't be able to do this, however....google controller max! this might be able to help you or look up chronus max on amazon."}
{"product_id": "B0091WIOJ2", "context": "Its campatible with windows 8?", "response": "Yup..both windows 8 and 8.1"}
{"product_id": "B00009TW6R", "context": "does Game Spy still running the server", "response": "Was patched recently to operate without GameSpy, you can still play multiplayer online."}
{"product_id": "B00HWMP0TU", "context": "Can you download the game via Steam and then play it offline, or does it require you to be connected via steam to even play?", "response": "You can download the game via steam, and if i remember correctly you can play offline but you will have to sign in to steam, please don't take my word for this I'm not 100% sure."}
{"product_id": "B00005B8G1", "context": "Does it use batteries ?", "response": "Yes. To increase battery life, turn off color and volium"}
{"product_id": "B00292OW1U", "context": "DOES IT WORK WITH WINDOWS 8 AND 8.1?", "response": "I have never tested this keyboard on a portable os but usually if it runs on win xp/7 it will run on win 8"}
{"product_id": "B00D3RBZHY", "context": "Direction of car can be controlled by motion of joy stick ??", "response": "I think no, I tested and nothing."}
{"product_id": "B00DC7FWRE", "context": "I've read in the comments that this is best for 3-4 players.  Can only one person play?", "response": "I think you have to have at least two players.   I know they will have NPCs to fill in for the rest.....the game is most certainly meant for kids...I play it with my kid sometimes just as a bonding thing....my kid just checked and she says you must have 2 players"}
{"product_id": "B00GV0LR64", "context": "How do you take it off the tv after playing? Does it lose its suction when you put it back on?", "response": "You just pull it off the TV screen& it does loose its suction, just put saliva on it and it'll stick right back on. My husband said it works great it helps him practice on his aiming."}
{"product_id": "B003ZSHN0O", "context": "I have avg antivirus, does anyone else get the warning that gov of poker 2 contains the win32 heur virus?", "response": "NO. WHAT WINDOWS YOU HAVE? (95, 98, XP, VISTA, 7, 8.1)"}
{"product_id": "B005G4CXPK", "context": "Will this work on Windows 8 and 8.1?", "response": "Works on 8.1 also"}
{"product_id": "B00G237L7Y", "context": "this game is multilanguage??", "response": "It is in english but there are very few talks in the game."}
{"product_id": "B00DPJBTM6", "context": "Are these wireless? I read somewhere that there is something to make the A40's wireless", "response": "The a50's are what you want to look into for wireless connectivity"}
{"product_id": "B009LGO88E", "context": "Has anyone noticed any scratches on the system after using the Circle Pad?I have a Gold 3DS XL & have always used a protector so it's important to me.", "response": "I haven't had any problems with scratching from either my circle pad pro or my one for the xl. Sometimes dust and stuff can get into the CPP if not used for a bit but dust it out and you should be fine."}
{"product_id": "B003RS1A7Y", "context": "any way to plug it into an amp?", "response": "Its a midi controller, you could plug it into synth or computerno audio outputYou might try yourock guitar for that"}
{"product_id": "B00BGAA3S2", "context": "Is there an extension cord for the camera available?", "response": "I do not know if any extension cord for the PS4 Camera...I know its not that long of a cable but the best thing I could tell is to google for some kind of aftermarket part out there. Sorry I couldn't give you a better answer and hope you find something for it."}
{"product_id": "B003YC4D9A", "context": "Can I use this to play Zelda Hyrule Warriors?", "response": "No, You have to use the Wii U Pro Controller"}
{"product_id": "B004QRKWKQ", "context": "This product comes with the Wireless Gaming Receiver Xbox? este producto viene con el Receptor de juegos inalámbrico Xbox 360?", "response": "Yes it comes with the wireless receiver, the official one. It works perfectly, connecting within about 2 seconds after pressing the xbox button on the controller."}
