{"product_id": "B000LQ4HTS", "context": "Does the throttle work on it's own, since I'll be using a different stick?Thanks in advance.", "response": "I returned this product the program is difficult unless you are programer, the quality of stick awesome."}
{"product_id": "B009D3HSTG", "context": "Is it possible to use two of these at a time and play multiplayer games?", "response": "I believe it is possible. Just make sure you have two USB ports open. Go to controller settings and set up the other controller for player 2 and you should be good."}
{"product_id": "B00BGD6LMG", "context": "can you block the sexual situations like you can on some m games", "response": "not sure. i would not even buy the game i played it once and thought it was boring. i would pass and get something better"}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "NO...they're not exactly \"on ear\" headphones, but the earcups just barely fit over the average ear...and they get pretty uncomfortable after 2-3 hours of use."}
{"product_id": "B000IZAQD8", "context": "are the cables included", "response": "The Playstation 2 comes with a composite A/V cable. If you prefer a cable that works better on an HDTV, Game Stop has a universal cable that supports component video as well as the standard A/V connection. It can also be used for the Xbox 360 and Wii game platforms."}
{"product_id": "B0011E4J7O", "context": "How long is the cord?", "response": "mine is 5ft 5 inches,nothing wrong with it make sure the color matches controller.i bought my xbox used with a cord that didnt match and it used to act like it had a short all the time.i havent had any problems."}
{"product_id": "B00CMQTUY2", "context": "Can you use the battery pack from an Xbox 360 controller in the Xbox One controller?", "response": "I would say no b/c nothing with xbox one is backward compatible.   But I'm not 100 percent sure. Call game stop."}
{"product_id": "B00286BZ4Y", "context": "Do you have to type in your answers?", "response": "No, there are multiple choice selections."}
{"product_id": "B00IVHQ0KI", "context": "Can you change the gas and brake to the shifters behind the wheel in the controls options. I am in wheelchair and cant use pedals.", "response": "yes, you can in both forza 5 and forza horizon 2. in 5 it is located in the profile, control, option 5. in 2 it's in settings for controller. doing that there is no gradual increase or decrease in gas and brake. it is either on or off."}
{"product_id": "B001AWBYRA", "context": "Can u play modded zombie maps ?", "response": "Yes, just google them to find them. If you need any help on installing them, there are tons of videos on youtube. Also, if you have any trouble installing .exe maps, they install to the admin account so try checking there."}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "Online game code just gives you the code rather then shipping you the physical card, so if you want to play right now rather then wait 3 days or more then do that."}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "Thanks. I thought it was by the reviews, but saw no info on the DPI"}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "There is no sexual content and mild gore"}
{"product_id": "B00C7103DO", "context": "Have the season pass and/or DLC's been integrated in one single game/CD yet or do you still have purcahse them separately?", "response": "You still have to purchase them separately.  With as much time that has passed since the game came out I don't think we will get a Complete edition with all the DLC on disc."}
{"product_id": "B00DJYTGYU", "context": "How long is the wire?", "response": "It's roughly 6 ft."}
{"product_id": "B00F27JDUY", "context": "If you play a game where there is multiplier, would you be able to play with someone who is on an Xbox?", "response": "Nope. Only within the Playstation network."}
{"product_id": "B00GJXMRX0", "context": "has anyone else had there pc completely shut down while playing assissins creed 4? mine does after about 25min. it has happened 5 times so far.", "response": "I haven't had that happen to me. It could be an issue with your power supply not being able to distribute enough power while playing the game. Maybe try borrowing another high watt supply and test it?"}
{"product_id": "B00H4BBVZQ", "context": "Is this game the same as the definitive edition, content wise?", "response": "It does not have all the DLCs available."}
{"product_id": "B00GOOSORM", "context": "Is pc game time and ps4 game time on the same account?", "response": "Yes, you can have the same account with the two platforms- time would be shared."}
{"product_id": "B003BKWEHS", "context": "What does Jewel Quest 3 JC mean? Can I play this game on my PC Windows 7?", "response": "don't have a clue about the jc. but just to let u know, I bought this on disc to use with a PC format in mind. over the years i've had several copies of this game. Amazon has many, many games at such a great value. some of them downloadable."}
{"product_id": "B00B98HBTA", "context": "Has anyone had problems with this game locking up? Mine seems to do it about once every mission.", "response": "Yes, not quite that often but more than any other Lego game I've played, so annoying"}
{"product_id": "B002HH9TUG", "context": "Does it work on a mac?", "response": "If you can find the drivers for the Mac o's then probably. I'm on a custom built windows machine so I've never tried looking.  Sorry I couldn't be more help."}
{"product_id": "B0050SY77E", "context": "Will I have to have played 1 & 2 in order to follow the story?", "response": "I picked up the story after a few minutes. They pretty much flash back the entirety of the first two games. The story however isn't really that relevant to the game play."}
{"product_id": "B008SBZD9G", "context": "can i play offline just a story line type single player, or is it online only?", "response": "Sorry, it is online only, no counsel only single player story."}
{"product_id": "B0002DQUH2", "context": "are the function keys separated in groups of four?  I am blind and that is easier to use", "response": "Louis, I do not have an HP so I can't help you. Current keyboard is a Microsoft from amazon and it tuned out to be very good. I hope that is of some assistance. Andrew"}
{"product_id": "B001H4NMNA", "context": "Does this come with multi-voltage support?", "response": "Yes, but i am use it in 110 Volts"}
{"product_id": "B003ZSN600", "context": "Does this work on a xbox 360", "response": "Don't know. We're using it for a pc. Should work,  though."}
{"product_id": "B0015PHMFU", "context": "does this work with mame?", "response": "I have not used it with MAME. But the documentation included in MAME should provide instructions on how to make it work. Good Luck."}
{"product_id": "B001DNGCN2", "context": "I'm Not a Big Wiz-Kid on This Stuff, but My PS3 is a CECH-2001B Model. Will This Cooling Fan Fit My PS3, Properly? Will It Run Any Different?", "response": "Yeah it will fit on that model, I like this cooling fan much better then the front ones cuhz it's much quieter. Work great man. Worth it!!"}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "If you mean discs, it has 1."}
{"product_id": "B001DPZE84", "context": "work with windows 8.1?", "response": "Works fine with my Windows 7; but don't know about W-8."}
{"product_id": "B0009PRCNO", "context": "Is it backwards compatible?", "response": "If you get the CECH 01A then yes. Anything after, no."}
{"product_id": "B00AR1LX9O", "context": "So can you use these with an Aux. cord with you Ipad/Phone?", "response": "Yes, if you use the Auxiliary cable port on the wireless base."}
{"product_id": "B00IVJ1M7M", "context": "Does this work with the New 3DS XL?", "response": "you don't connect it to the system. You connect your cartridge in the device and plug the device in your computer. So, yes it will work."}
{"product_id": "B003O3EFY2", "context": "i need some type of adaptor to connect this unit to my TV,  saw some on you tube but don't want to waste any more money, any solutions??????", "response": "Depends on TV you have.we thought we had to but the color coded lines hook in different. The yellow hooks into the green on our tv"}
{"product_id": "B00CD1FCAC", "context": "A key's light already went out after a month. Is this a normal problem or i there a way to get a new one from the warranty?", "response": "Mine dont had that problem, and obviously is not \"normal\"  You should use your warranty."}
{"product_id": "B00AQ2BLI2", "context": "Does this come with an install disk? Yes I have a steam account but cannot buy content for some reason.", "response": "Yes it comes with a disk, but I still think that's inconsequential because the entire install is done through Steam"}
{"product_id": "B0029M6VKA", "context": "What is the shipping weight and size?", "response": "The package as shown above is about eight inches tall and only a couple of ounces. It arrived in a box that was like 4\" x 6\" x 8\". I don't have it in front of me, but the above are fairly close."}
{"product_id": "B00BM7NXMW", "context": "Can you customize the +/- buttons for the right thumb? I want them to be customized for certain actions during games, is it possible?", "response": "Yes, you can give every button on the mouse programmable commands"}
{"product_id": "B00BGHUS58", "context": "i got a used copy theres no scrathes but wen i play the gamplay is very silent only wen i drive i hear car i meen i turn the sound up it so silent", "response": "Try resyncing your PlayStation to the tv"}
{"product_id": "B002I0J5CO", "context": "Will this work for MacBook Pro (2014)?", "response": "http://support.turtlebeach.com/entry/830517537/?View=entry&EntryID;=830517537&Msg;=That is a guide I found on how to set it up on Mac. Let me know if you have anymore questions."}
{"product_id": "B00CERXJNW", "context": "So could this be a nice replacement for the good old Logitech G15?  Or not yet?  I hope those 18 keys on the side can be set up just as fast.", "response": "It's a perfect replacement, K95 is very neat keyboard. I've switched from G15 to K95. I miss a little screen at first, but I used it as clock most of the time."}
{"product_id": "B0049B2FP4", "context": "How do you make the mod installer work for this game?", "response": "when you down load the mod if its a rar file or a zip file you must extract it then go into the properties of the game click and drag it into the mod folder for 911 first responder! You must restart the computer after it has been done! if you need more help I an help you!"}
{"product_id": "B000B78F72", "context": "Do you have to download this game to play or can you take the cd and use it on another computer?", "response": "I think since you have the cd you can put it on any computer you want."}
{"product_id": "B006SVUQNQ", "context": "is this compatible with an xbox 360 S console?", "response": "Yes! Its also very simple to install!!"}
{"product_id": "B002J9GDXI", "context": "Hey guys I was wondering how quiet this mouse is? Are the clicks very loud at night? thx", "response": "No, the clicks are not loud, as long as you are not using the mouse right next to a sleeping person's head. Ha ha."}
{"product_id": "B00EPZ8POY", "context": "will this work on ntsc ps3", "response": "I own an NTSC PS3 and a PAL version of this game and it works just fine."}
{"product_id": "B000R0SRNU", "context": "Is this a 4 player offline game?", "response": "Yes. You can play offline with it"}
{"product_id": "B00D78Q4UM", "context": "Is the palm rest removeable?", "response": "Yes.  You just bend it in an upwardly direction and it clicks right out of the keyboard.  To put it back, you just slide it in."}
{"product_id": "B001EYU1WS", "context": "Is this compatible with an X52 system? I mainly use it for Elite Dangerous", "response": "Yes as your X52 is an integrated flight stick system. Consisting of a throttle and a stick similar to a fighter jet set up in theory. This will add more to it as it also is Saitek and it allows functions not capable of the X52. This will be a nice addition to your setup."}
{"product_id": "B000BU0F5Y", "context": "how would u rate this against the razer game pad ?", "response": "It's flimsy, mine broke real quick, some of the buttons started sticking. I got a Belkin n52te to replace it and 4 years later it still works perfectly, and I have put it trough it's paces!"}
{"product_id": "B005LUUWL6", "context": "Does it work on Pokemon ORAS", "response": "No. it only works with the black cartridge NDS games. not the white ads games."}
{"product_id": "B0050SYX8W", "context": "Can I play in online mode, if I buy a pre-owned game?", "response": "This is a christmas gift,  I have no idea..sorry."}
{"product_id": "B007FTE2VW", "context": "does it work with windows 7?", "response": "yes it does work with Windows 7"}
{"product_id": "B00D84DRNC", "context": "Which section of the case is best suited to carry the 3DS XL, the large middle pouch or the more snug fitting inner pouch?", "response": "I use the snug inner pouch; fits fine and makes it so it doesn't jostle around when you carry it with you."}
{"product_id": "B001NT9TK4", "context": "Will this wheel work with windows 7 ultimate 64 bit os?", "response": "Yes I have used it with 64 bit windows 7 and 8."}
{"product_id": "B00BV72X1U", "context": "can i connect more then one Xbox 360 controller (2) at the same time??", "response": "Yes it supports up to 4"}
{"product_id": "B00GPH7Y8S", "context": "Hi. Where can I see the system requirements for this game ?? Like processor, GPU and etc.?", "response": "On the box in small print."}
{"product_id": "B008CXTW5G", "context": "How is the key cap quality? How is the surface? is it touching silky or roughly? How is the letter painting on the caps?", "response": "Key caps are nice. Not silky like a K 70 but not super rough. My wasd keys are only slightly faded after 1.5 years or so"}
{"product_id": "B00CD90R72", "context": "Regarding FIFA 2014, does the game require the MOVE controller or can 1 or 2 players use the standard game controller to play with maximum enjoyment?", "response": "HI doesn't Need a move control i like play With te dual shock control (standard control). The max players are 8."}
{"product_id": "B00BQWTGIS", "context": "cn you play this game with an xbox 360/pc controller", "response": "Yes, absolutely. This video shows someone playing watch dogs on pc with an xbox one controller and compares it to his experience using an xbox 360 controller on the same game"}
{"product_id": "B002I0HJG8", "context": "If i get a brand new edition will it come with the founder's code?", "response": "That it does. Additionally, you can enter the code backwards to get some additional goodies after you register your copy."}
{"product_id": "B00FLLFJE0", "context": "Is it worth it", "response": "Yes, you don't have to keep buying batteries all the time."}
{"product_id": "B00292OW1U", "context": "DOES IT WORK WITH WINDOWS 8 AND 8.1?", "response": "I dont see why it would not."}
{"product_id": "B0096PLB9O", "context": "Does this work with Windows 8.1?", "response": "Yes, it does. See other comments/instructions on how to install the drivers. The same steps apply to 7, 8, 8.1."}
{"product_id": "B0076DO5A0", "context": "If I load from disc will I still have to use Steam?", "response": "Yes, I believe so.  It uses Steam as an authentication method.There are some companies (I think Ubisoft is one) where you can do Steam or their own DRM, but I think Sniper, even if you have the DVD media, requires Steam."}
{"product_id": "B00DBDPOZ4", "context": "The description claims 30 hours of battery life, but how much did you get out of it before having to charge it?", "response": "When mine was new(september 2014), it would go for around 30 hours of use. Now, I get about 2 or 3 hours out of it. I am very disappointed in it. I don't know if I just got a dud, or if they are just lower quality and wear out fast."}
{"product_id": "B00BGAA29M", "context": "Hello. How many players can play?", "response": "Up to 2 at a time. It's a co-op mode"}
{"product_id": "B006IR6NH8", "context": "Does it work with any driving or racing game, even simulators?", "response": "Yes, it works with many, most or all simulators. Using standard wheel and pedal USB drivers. Works with NFS, SRW and F1 so far. Should work for most othets. Takes up very little desk space, which was a major selling point for me."}
{"product_id": "B00006B84X", "context": "where can I download an operating manual", "response": "Manuals are now here :ftp://ftp.chproducts.com/pub/CHProducts_Game_Controller_Files/pdf/There's also a useful Control Manager Guide here : http://www.boostair.com/file/CH_Products_Control_Manager_Tutorial.pdf"}
{"product_id": "B003XNU1JQ", "context": "Do these codes actually work?", "response": "yes they work just fine"}
{"product_id": "B00F4GSAYI", "context": "i now know that there is a separate disc for the dlcs, but do i need xbox live to download and play them?", "response": "Nope, just download from the disc and play"}
{"product_id": "B0056JPS84", "context": "My XBOX 360 drive is the DG-16D2S-09C and does not work, if I order the same model, I just have to switch it and my XBOX will work without any problem", "response": "Oh heck no there is some weenie circuit board on the original drive that needs to match the your xbox.  Read up on this for sure.  I just sold the old xbox 360 and got the new xbox 360e which is real nice."}
{"product_id": "B0017HLYNC", "context": "Does this game work with Windows seven or just XP?", "response": "hmm... I think only XP bcz it was so  long ago, far before windows 7 but I dont know for sure.  All I kinow is this was one of my favorite games, ever!  That and Darkfall"}
{"product_id": "B00009ECGK", "context": "Is this an RTS or similar to the current WoW?", "response": "its before the mmo its a build your army and win type of game"}
{"product_id": "B00GP0HQ3S", "context": "Does this come with a rechargeable battery pack? and can it be used on the nyko charger base", "response": "It does not come with one. There are special controller bundles that come with rechargeable packs. Otherwise you would need to buy a separate rechargeable battery pack for it."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 8", "response": "Sorry, but I don't have windows 8."}
{"product_id": "B001E27DLM", "context": "Does this version include the animated cut scenes by Akira Toriyama that were added in the PS1 re-release of the game?", "response": "A few cut scenes were added that were not included in the Super Nintendo version."}
{"product_id": "B00D6NPFDK", "context": "What language is this game in? I recently purchased a differnt one in Spanish accidentally and I need an English version.", "response": "This is an English version"}
{"product_id": "B00BBUCCKO", "context": "How big is it? Some of the gaming keyboards seem to be made for huge hands and mine are probably pretty average woman hands.", "response": "This is a standard size keyboard, with standard size keys.I don't use it for gaming - I wanted the backlighting for using the computer at night. It is great for this!"}
{"product_id": "B004N7HSGU", "context": "Can you have at fairly loud volume without disturbing someone nearby? How much \"bleed?\" I'm used to noise isolation earbuds.", "response": "Like all headsets there is some bleed if you have it loud enough. However the ear pieces themselves are very dense, so from personal experience, there is very little bleed compared to other headsets. I have not had a single complaint towards that issue, something i pride myself on because I hate hearing someone else's music."}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "You can play it two person. The screen does split when you are not in the same location, just like it does on the XBox. ENJOY!!!"}
{"product_id": "B00EF1OGOG", "context": "When used to charge an Android (Nexus 5, in particular), does it show up as \"Charging (AC)\" or \"Charging (USB)\" in the Battery menu?", "response": "I do not know"}
{"product_id": "B0061PAZUS", "context": "I currently have the Zumba Core DVD, does this DVD (Zumba Rush) have workouts that are different from Zumba Core?", "response": "The Zumba Rush is a full body dance workout. It focus more on dance technique. I have not tried Zumba Core."}
{"product_id": "B00GPH7Y8S", "context": "Does this game require online subscription?", "response": "No it does not."}
{"product_id": "B001DPZE84", "context": "Will this run okay on Windows 7 with a 32 bit system?", "response": "Yes this will run perfectly well on a Windows 7 32-bit system."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "sorry I have no idea  I purchased it for a friend  who lives out of the country"}
{"product_id": "B00IAVDPSA", "context": "Do the up and down arrows to the right of the volume change the channel?", "response": "Yes, the remote works quite well with controlling your TV.  I've heard there are some limitations with 3rd party apps, but so far I've been very happy with it."}
{"product_id": "B00GJ2HZ7E", "context": "it doesn't say windows 8.1 compatible but if it's all steam based doesn't it only matter on what OS you can run steam on?", "response": "I can confirm it does work"}
{"product_id": "B001GIUWX0", "context": "If you have more than one player, do you need to have more than one steering wheel for them to play at the same time?", "response": "You do not need the steering wheel at all to play. You can use the Wii mote by itself, or the wii more + chuck combination"}
{"product_id": "B00BQMGW4Y", "context": "Is this the official Xbox controller S (made by microsoft)?", "response": "No, they aren't, and mine already broke, so the quality is questionable as well."}
{"product_id": "B00DJYK9L4", "context": "does the game require wii motion plus", "response": "unfortunately i never got a chance to use it as i din't realised it is not good for Australia so i just wasted money .. sorry :( can't help you"}
{"product_id": "B000QJ1NS8", "context": "Does this come with the tri point screw driver? I ordered one that came w/ a Philips that doesn't fit.", "response": "Yes mine did and it fit perfectly, did you contact the seller about it?"}
{"product_id": "B00H45K6KS", "context": "Do I have to play any other Atelier games to understand this one?", "response": "Technically it is a sequel to Ayesha and features a few characters from that game, but you do not need to play it in order to understand this one. It's a completely new storyline with new protagonists."}
{"product_id": "B003O6JJKY", "context": "I have a 360, can I use the cables and plugs from mine to use on a slim? Or are they different sizes?Thanks", "response": "yes, but you will need a hdmi cable for your high def- tv."}
{"product_id": "B00C71034I", "context": "Have all the glitches been fixed(Nov 2014)? Do I need to download any patch? Or is the game  good to go right out of the package?  Thank", "response": "The game is great...it come with 2 CDs.. The 2 one u have to play it in xbox live .."}
{"product_id": "B002ZS6Y64", "context": "Does ths have a cord that will plug in to an xbox 360 controller", "response": "Yes. The inline adapter has a port for a 3.5 mm to 2.5 mm chat cable."}
{"product_id": "B00EZPCX1A", "context": "why does the blue 2ds cost more than the red 2ds", "response": "its supply and demand. The blue one is more popular then the red so some try to sell the blue for more. Most stores sell them both for the same price."}
{"product_id": "B00CJ7IUGS", "context": "Do I need to have played Oblivion to understand Skyrim?", "response": "Not at all, the game does have some history based on the previous game but that doesn't matter to how you play at all and there it no character carry over like in mass effect.  It will take you weeks to play all of the quests and find everything.  Have fun!"}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "Yes, my 7 year old and my 9 year old play this game."}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "I believe so. I don't see why not."}
{"product_id": "B0029LJIFG", "context": "I received this and it has English and Chinese written on package. Is this product in English???", "response": "Yes if it has both languages just incase you dont know one of them. It could be the product was made in China but no big deal you use it and disgard or recycle once used the pin. Enjoy."}
{"product_id": "B00002JXBC", "context": "does this work on windows 2000", "response": "Yes this product is compatible with Windows 2000"}
{"product_id": "B0000AFQRR", "context": "Will this work in Windows 8.1?", "response": "It works in WinXP and Win7, it will probably work in Win8"}
{"product_id": "B00FQFFQ2Q", "context": "can you use this on xbox 1?", "response": "Only if if says xbox 1 on the top of the box."}
{"product_id": "B00CMC6HCY", "context": "Is this game easy enough to pick up and play? My son is 6, loves WWE, but I'm not sure if this is too advanced for him.", "response": "This game is easy for anyone to play. I'm sure he will love it once he plays the game."}
{"product_id": "B004RMK4P8", "context": "Hello, i Have trouble with the code... the code is USED! how can you help me with this...", "response": "They scammed you, they scammed me too."}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "It recharges like any other PS3 Controller"}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "Teen more than marure"}
{"product_id": "B008U5ZNIG", "context": "Is this the cherry MX blue keyboard?", "response": "Yes, the Ultimate uses Cherry MX Blue key switches. The Stealth - which is quieter - uses Cherry MX Brown."}
{"product_id": "B00DC7O77A", "context": "Is this a Gamepad only game or can a Wiimote be used with it?", "response": "Yes... the Wiimote and the nunchuck can be used to play. Personally, I think it's easier to play with them and not use the Gamepad due to the motion commands and button layout."}
{"product_id": "B00E8RVP0U", "context": "Does this work on wii mini?", "response": "Yes it does work on the Wii mini."}
{"product_id": "B005BLAJRC", "context": "Do we need a \"joystick\" type device or will the games work with just a mouse?", "response": "A mouse works just fine. I have never used a \"joystick\" so I don't know if it would work or not."}
{"product_id": "B00EZKNSTQ", "context": "Does this controller have the same in hand feeling as a normal Xbox 360 controller?", "response": "The feel is a little different than the \"Official\" Microsoft controllers. However, this is NOT a bad thing in my opinion. I think it feels better in the hand."}
{"product_id": "B009YKVRYA", "context": "Is there  skirmish mode in this version like in Stronghold Crushader?", "response": "It's not quite the same.  There is officially no skirmish mode, but there are preset maps you can play against the AI without doing the story."}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "That's odd. Mines works perfectly fine"}
{"product_id": "B00G237L7Y", "context": "this game is multilanguage??", "response": "I play in English and spanish"}
{"product_id": "B000BU0F5Y", "context": "how would u rate this against the razer game pad ?", "response": "Its ok...if you want a better game pad I would go with the Nostromo N52...it has keys that are NOT offset and its more comfortable with your hand...the only reason I bought this one over the N52 was because of the price...hindsight I would have spent the xtra money on the Nostromo"}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "NO! The initial Donkey Kong Returns works fine on a Wii U, since Wii U plays Wii's games, but NOT vise versa. So, since this is a game for Wii U it CANNOT be played to a Wii console."}
{"product_id": "B00G21VQ2M", "context": "is kenshiro a playable character?", "response": "Yes kenshiro is playable and he's pretty good I've never used him but I fought him a few times in the story"}
{"product_id": "B004TTNTYW", "context": "Does this actually work for Nintendo 3DS? Because I brought this for a replacement charger because I lost my previous one.", "response": "yes cord is just short"}
{"product_id": "B00E447L8C", "context": "will this charge a iphone4?", "response": "The battery doesn't come with a iPhone charging cable - but it will charge an iPhone if you bring your own cable."}
{"product_id": "B000R9A9JG", "context": "how many batteries are included in this. just 1 with choice of colors or all those in the picture?", "response": "When I ordered it, it was just one battery and no choice of colors for the back."}
{"product_id": "B00EW6QT76", "context": "does it play a bluray dvd?", "response": "Not sure where these other people were looking but it will play blu-ray...per the playstation.com website: \"Yes, you will need to download and install PS4's day-one system software update 1.50, and then activate your Blu-ray Disc video capability with a one-time activation through the internet in order to play Blu-ray Disc films and DVD video content.\""}
{"product_id": "B008OQTUKS", "context": "How can I get single player to play? It does not show any way to launch single player ,can anyone help me with this?", "response": "Just play the game from desktop icon..or login to battlelog from ur browser and than play campaign...campaign means the single player missions."}
{"product_id": "B005G4CXPK", "context": "I see the package is wider than usual, is there 2 different cases for ac1 & ac2 or 1 case with 2 cd inside?", "response": "mine was 1 for both"}
{"product_id": "B00D84DRNC", "context": "How would this fit a normal 3DS? The original, non-XL one. Will it rattle around inside this case?", "response": "There is a small elastic pouch inside the case where the DS sits. It should be held snug enough in the pouch so it might slide up and down inside but be protected by the cloth inside."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "As you may already know, it is not a true mechanical keyboard. It is clicky. Not as much a true mechanical keyboard sound and feel, but close enough. It is an excellent gaming keyboard though."}
{"product_id": "B00A878J5I", "context": "can you charge the Wiimotes with the wrist strap still on the controller?", "response": "Yest it will charge two hand controllers along with the gamepad"}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "It seemed to have come with everything that my son needed, or I would have heard about it, I think!"}
{"product_id": "B000H1V56U", "context": "Am i suppose to recieve a spliter for the fan? Because as of now, the male is 3 prong and the female is 4.", "response": "Both fans I ordered came with an adapter so it could be used with either board version.  Check the box carefully for the adapter.  If no adapter came with the fan it is possible to hardwire the fan to an external 12 volt power supply."}
{"product_id": "B00FM5IY4W", "context": "why can't you make it for xbox 360", "response": "Because it's the same thing as 4 but far worse trust me you don't want this game it's complete garbage"}
{"product_id": "B00F9RGFEY", "context": "I have two game systems. PS3 and PS4. This team works for both?", "response": "Yes, it works for PS3, PS4, Xbox360 and PC."}
{"product_id": "B00I4BGNVM", "context": "can you use a controller?", "response": "As Brian said, you can get third-party apps which will allow the use of a controller. However, playing an MMO with a controller is like playing a flight simulator with a mouse."}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "According to the box it came with, Yes."}
{"product_id": "B000VLNXRU", "context": "Is there a max power/current rating on these?  My USB hub is already stressed out.  Looking at buying this & another hub to support multiple devices.", "response": "I bought power adapter for the Saitek Yoke but it seems like it can't support it, it worked well on a separate USB powered hub."}
{"product_id": "B0091WIOJ2", "context": "Do i need a 7.1 Surround sound card for these to be fully functional.", "response": "Using them in Xbox or Playstation you shouldn't, using PC I can't tell. IMHO, A50 works really good and deliver good sound, but do'nt expect a real 7.1 sound experience."}
{"product_id": "B004RMK5QG", "context": "How do I receive the code? Will be via email or snail mail to my billing address? Cos the address belongs to my friend not mine.", "response": "I am from Argentina and i have a US account in PSN , can i buy this with my Argentinian credit card and then amazon send me the code to my email ? Thanks"}
{"product_id": "B0057SDCLY", "context": "Will this headset plug into a cordless phone handset.  Does it have a 2.5mm plug", "response": "no. it the standard 3.5mm, also, it may not work with cordless phone handset as you also requires usb as well."}
{"product_id": "B00EIM3BV6", "context": "Is there anything else I need to buy to go with these for them to work on the ps4?", "response": "Nope, just plug the audio optical cord in and your good to go! :)"}
{"product_id": "B00BCEK2LA", "context": "Is there warranty if you buy it from Amazon? Tried to get my G400 replaced but because the order was fulfilled by CT-X (through amazon) they declined.", "response": "Try going through Logitech. Their usually pretty amazing at warranty issues."}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "They are not worth that much. Retail price is $4.99. Unfortunately some Amazon sellers are charging much more."}
{"product_id": "B002FY0CM0", "context": "Is this cable compatible with the Sega Master System?", "response": "From my experiance it better to find the cables thatbsay sega on them because alot of third party cables just wont work"}
{"product_id": "B00AAQRNQ8", "context": "Can you program one of the buttons (side button preferably) to drop the DPI to a specified level only while being held then back to normal on release?", "response": "No, you can reprogram it to different levels of DPI (up to 4) and each click goes to a different level."}
{"product_id": "B0000CNUUP", "context": "Please advertise that this runs through the steam client. I expedited the shipping and basically paid 4 times for something i didnt want.", "response": "I have no idea what you guys are talking about.  This game does not require a Steam account, at least not the U.S. boxed version which I own."}
{"product_id": "B00DBRM3G8", "context": "i can play in spanish?", "response": "Yes, you need to change your language system to spanish"}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "It helps a little bit in CoD games. It didn't make a huge differencefor me though."}
{"product_id": "B007VPZR5U", "context": "Does anyone know what is different between the 2012 and the Epic Naga?", "response": "The Epic Naga is wireless, the 2012 is wired."}
{"product_id": "B00I4C2EKA", "context": "can this be downloaded on more than one computer?", "response": "Pretty sure it can. If you have steam then definitely."}
{"product_id": "B00D96BNGM", "context": "Does this come with ALL  original cables and accessories?", "response": "yes comes with alll the leads ect all id advise is to buy a better optical cable as the 1 it comes with is really flimsy :)"}
{"product_id": "B00DT55P94", "context": "does it support trophies?", "response": "Yes it does supports trophies, since each Game comes in different disc, so is like having each Game separately."}
{"product_id": "B001UIG6M2", "context": "Does this Come with a memory card?", "response": "No, it uses the PS2 card  that comes with it."}
{"product_id": "B007FVVXXA", "context": "Will this work on the PS4", "response": "I'm gonna take a guess and probably not. I haven't bought a ps4 yet to find out sorry"}
{"product_id": "B0047ERZ7Q", "context": "is this an actual psp player or an accessory?", "response": "Yes, indeed. But it depends on what kind of PSP you have. It is not compatible with the PSP 1000. Fortunately, it does go for the 2000 and 3000."}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "You can play the main story offline and all objectives, but will not be able to play the online world without connecting"}
{"product_id": "B008M4BNQG", "context": "How is the bass if you want to listen to music on your pc? I want it for gaming but since it can also connect to PC i was just curious.", "response": "It's a 7 on a 1-10 scale bass wise.  Enjoy!  :)"}
{"product_id": "B004XGN8W4", "context": "Does it work the Xbox 360 E?", "response": "Yes the 360 e isn't mutch different from the slim in form facter"}
{"product_id": "B00919RM1Q", "context": "can this version be loaded on both my lap top and desk top?", "response": "I can't answer that I have it on my desktop don't have a laptop I also have windows 7 and it works fine."}
{"product_id": "B00CD1FC6G", "context": "The only thought that I have for this keyboard is how are the LEDs?", "response": "This is my second one and the LEDS go out after a few months, a few at a time. I've had this second one for 6 months and there are 8 LEDS that are out."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "No you have to download under your account on 360 and after its done downloading (maybe like 5 minutes after) the game should pop up in your queue on xbox one"}
{"product_id": "B001IYR53W", "context": "I have the 2005 version but it does not have SPIDER,a  solitaire game..does this version have it.  Thanks", "response": "Yes, it does, and many, many other variations."}
{"product_id": "B00005LBHM", "context": "Can you play this on the Gameboy Advance sp?", "response": "hell yeah you can. Thats where I played it."}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "It comes with a standard 3.5 mm 4-conductor TRRS phone connector, and an adaptor cable with a pair (audio and mic) of 3.5 mm stereo (TRS) phone connectors (see: http://en.wikipedia.org/wiki/File:IPod_and_iPhone_audio_plugs.JPG). So, if you can plug it to your device, it should work."}
{"product_id": "B00EOPT5ZS", "context": "How quick is the reaction time?", "response": "Instant, or close enough that it doesn't matter. Never noticed any sort of input delay."}
{"product_id": "B006IOAHPK", "context": "this version is censored?? thanks", "response": "It's not censored,but it's not for kids also. There are a lot of curse words,some nudity,some of the nudity is blured,but you can still make it out. I would recommend this game for 17 years and up. If you like the show,you'll love the game. Hope this helps."}
{"product_id": "B0072HYRNK", "context": "Is this a pack of 3 controllers?", "response": "Nope, just the one ball controller."}
{"product_id": "B00292OW1U", "context": "Does the keyboard blue led so you can see it at night?", "response": "The Merc Stealth has red, blue, and purple setting for lighted keys.  There is also three brightness settings.  The standard Merc does not have lighted keys."}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "I have a ps4"}
{"product_id": "B0050SZBP6", "context": "I can buy the product and send me the cd key by mail and q live in Venezuela and the product It would take months to arrive?", "response": "Sorry, I do not ship international.Regards,Kelilarc's Shoppe"}
{"product_id": "B0088MVQIM", "context": "is it a two player game", "response": "Yes, with two cords, two people can play."}
{"product_id": "B008SBZD9G", "context": "may purchase soon, is it online only or can i play single player story mode. don't care for mmorpg games.", "response": "The main storyline requires you to play with others starting at level 15, and frequently thereafter. There isn't much content currently available for those who only want to solo."}
{"product_id": "B003Q9RGRW", "context": "can I use the pad with Netflix or Pandora or internet explorer? as if it was a pc keyboard?", "response": "Yes, I use it on netflix all the time. It works well. The mic broke like 3weeks or so. Didn't last long, but I mainly bought it for the pad."}
{"product_id": "B0090ECASW", "context": "do you get the mad catz or cyborg version? Also, do the keys light up and (if so) are you able to choose the color?", "response": "I got the mad catz and to this day I regret it. Never was able to get the drivers working even after 2 hours on the phone with their customer service. Yes it's backlit, and I honestly can't recall if you can change the colors."}
{"product_id": "B00IAVDQCK", "context": "Can you hear your own voice when you speak ? (Like on Turtle Beaches, you can hear yourself through your own headset to allow voice moderation)", "response": "When I use the headsets ive never heard my own voice once"}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "There is a limited factory warranty.  We are hoping its all it says, and we will have a good life out of it.  time will tell."}
{"product_id": "B00IIHU44E", "context": "I want to know if NSA could spy inside my home thanks to the Kinnecht apparatus. Thanks.", "response": "If you believe the NSA can spy on you through your kinect than you would be foolish not to believe the NSA cannot spy on you through your cell phone or laptop camera. In other words, if you own a smart phone I think a kinect is the least of your worries... Nice try though."}
{"product_id": "B00G6YJ60E", "context": "Can I play this game Offline?", "response": "Um I am pretty sure its offline"}
{"product_id": "B00EM5UFF4", "context": "What kind of game is this?  Is it just for kids?  I'm a 37 year-old male?", "response": "I am 41 and enjoy this game which I had bought for my 10 YO. It is not overly complicated, but still competitive and fun to play."}
{"product_id": "B00IYWV852", "context": "How do you get theThree Guest Passes with seven days of play time that come with this edition?", "response": "They will be, or should have been, mailed to the address you registered the game to.Possibly the one you ordered the game with, but mine went to the registration email.Good luck."}
{"product_id": "B0050SZBP6", "context": "Will this work on Windows 8?", "response": "Yes this does. It works great."}
{"product_id": "B002BXKJA0", "context": "Can you play this with steam?", "response": "As of the shutdown of Games For Windows LIVE you cant use the LIVE access code to register the game on your steam account. You either have to buy it on steam, or possibly buy a steam code from Amazon. You can still run the game with a steam overlay by adding it to your steam library."}
{"product_id": "B002Z7BE24", "context": "Does this video game come with the manual booklet? and also is this the greatest hits version or the standard gold edition version packaging?", "response": "No it does not come with a manual booklet also its the standard gold edition of resident evil 5 but it has everything but lost in nightmares you have to unlock by reaching chapter 3 but its still a great game"}
{"product_id": "B001BYMZ5W", "context": "Do these headphones put out 5.1 surround?", "response": "They are stereo headphones. Your sound card probably has something that simulates surround. Mine does. Very good headphones."}
{"product_id": "B003VAM392", "context": "does it work on steam? and is there the deadzone problem?", "response": "I have the F310, and it works just fine with steam. As they use the same software it should be fine too. As for deadzone problem, I don't think I had any problems of that nature with any of my logitech gamepads."}
{"product_id": "B00BBUCCKO", "context": "How loud is this keyboard?", "response": "Not loud at all."}
{"product_id": "B00ATF5YZM", "context": "Can this be bought/installed/played on a UK Steam account, want to know before purchace?", "response": "My guess is Steam is just Steam with no national connection. If you are already downloading from Steam then it should work."}
{"product_id": "B00ECOAX34", "context": "is this a 2 players simultaneous game?", "response": "Yes very fun as well"}
{"product_id": "B00CBNV7UQ", "context": "Is it Chinese subtitle or English?", "response": "ENGLISH. Voices can be in Japanese or English"}
{"product_id": "B0000AFQRR", "context": "will this work on microsoft vista?", "response": "I have no idea. I am not that well acquainted as to what all Microsoft vista can do. Sorry."}
