{"product_id": "B00F27JE1C", "context": "What does this come with?", "response": "Box, charging cord, and manual (IIRC in Japanese).    You'll want to order a memory card separate if you don't already own one from a previous Vita system.   I'm still happy I  bought this unit, quit waiting and buy one."}
{"product_id": "B000NJBD90", "context": "does this adapter work with the newer ps3 slims?", "response": "Yes It certainly does!"}
{"product_id": "B00I9GARIM", "context": "Does this headset with the PS4 or Xbox One?", "response": "Yes the Sentey headset works with either of them"}
{"product_id": "B001CXYMFS", "context": "Can you detach the throttle but still use it?  Say if I wanted to mount the throttle on the left arm of my chair, and the flight stick on the right?", "response": "They are detachable but you will have a wire going a cross the gap which limits the distance you can move it"}
{"product_id": "B00E1DMWBM", "context": "this may be a stupid question but can it play sega genesis cartriges?", "response": "good news and bad news with this. Bad news is that it will not take any cartridges. Good news is that it comes with so many games that the cartridge you may have wanted to load may very well already be included with the system."}
{"product_id": "B00GS1TYIO", "context": "Is this compatible with Mac?", "response": "You can go Masques games and buy Candy Bar for Mac."}
{"product_id": "B00EADTVL2", "context": "do the lights turn off when no controller is attached, or are they constantly on when the unit is plugged into the wall?", "response": "The turn off when no controller is attached. They also turn off half the time when you plug in a controller. These are garbage, do not buy."}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "It's wired. Powered by USB."}
{"product_id": "B000266786", "context": "I have windows 7 will this game work with that?", "response": "No, it's an oldie!  You'll need an older OS."}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "Don't know exactly what 64 bit is, but mine played on windows 7 & 8"}
{"product_id": "B009AP23NI", "context": "I accidentally ordered this one... will this work alright with an NA console and how difficult is it to feel my way through syncing, since its in JPN?", "response": "It works perfectly fine with the NA console. Syncing the controller is very simple, its just pressing the sync button on the back of the game pad and the sync button on the Wii u console itself."}
{"product_id": "B00B23MO9Y", "context": "i have the 2008 version which does not have the 6 add-ons and the this expansion, if I buy this expansion and the 6 add-on codes what disc will need to be inserted?", "response": "Once it is installed any disc will let you play."}
{"product_id": "B00EPZ8POY", "context": "does this game works with any ps3 console(usa)?", "response": "Yes I live in arizona"}
{"product_id": "B003NVMEVQ", "context": "my nephew is left handed will this mouse work", "response": "It is described as ambidextrous on the box, Razer website, and seems to be that way from an owner. Hehe...so yeah...I think he will be fine. Good mouse really...I have no complaints."}
{"product_id": "B00CXCCB64", "context": "If I Downloaded all the expansions for XBox 360 will they transfer over to XBox One? Do I have to repurchase all those downloads again or buy premium?", "response": "I believe youll need to buy premium. But I could be wrong. And at least theyre selling the premium version of the game for xbone cheap."}
{"product_id": "B00IYWV5HS", "context": "I am temporarily living in Europe. If I buy the US version, can I download and play on US servers from Europe?", "response": "ive been told you cant"}
{"product_id": "B003OZOAKY", "context": "will it play on windows 7/64 ?", "response": "It plays on windows 7, not sure if ours is 64."}
{"product_id": "B0050SZBP6", "context": "is this the physical game?  or just the serial... Standar Version", "response": "This is the physical pack. You get the install disc and the activation code."}
{"product_id": "B00BGHUS58", "context": "how do i get the 60 min of gameplay", "response": "If you get the game for PS3 or PS4 you will get the 60 min of gameplay."}
{"product_id": "B000GCJ6MK", "context": "Will this work on Windows 7?", "response": "It worked on my Windows 7 computer.  I haven't tried it on 8.1 yet."}
{"product_id": "B004HYIAPM", "context": "Do you have to continue buying subscriptions if you buy the CD or does buying the CD give you unlimited time to play?", "response": "You're able to play as much as you'd like if you buy the CD!"}
{"product_id": "B009DYOPK0", "context": "I was wondering on a level 1-10 how loud the clicks are? odd question but gaming annoys the girl friend lol", "response": "Maybe there is some variance? I don't know.  Others say it's soft, some say it's loud.  I think it's just slightly above average at about 6.  If you dislike the sound I can imagine it would be annoying."}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "Yes and it is included in Xbox One Stereo Headset box."}
{"product_id": "B00DBCAT3W", "context": "does this game have multiplayer mode?", "response": "No sadly just better graphica for the original and a newer user interface sone what."}
{"product_id": "B007SO6USW", "context": "Does it come with a charger?", "response": "As per the description....it \"IS\" a charger."}
{"product_id": "B00BCEK2LA", "context": "I currently have the MX 518. Anyone have a comparison in both use and size?  I have smaller hands and have a heck of time finding a gaming mouse.", "response": "not sure about mx 518 but the g400s is very narrow an long fits my hands perfectly and I have medium size hands"}
{"product_id": "B000O5DY0E", "context": "Does this game work on Macs?", "response": "You need to buy the MAC version of it in order for it to work. The PC game won't work on MAC. c:"}
{"product_id": "B006PP4136", "context": "Would a ps vita slim fit in this case?", "response": "Yep that's what I bought it for.  Works good for a thin sided carrying case"}
{"product_id": "B007SO6USW", "context": "Does it come with a USB cord because mine is broken", "response": "Yes, it does. The functionality is iffy though. Mine still works but only one of the ports and it's on and off."}
{"product_id": "B00006HYLN", "context": "Where do I get a charger? I have this wheel and I want to play Project Cars with it. But the original charger was lost on my last relocation.", "response": "It will be a power adapter, not a charger. You just need to find a power adapter that matches the voltage on the wheel and the same pin size. Second hand stores are always a good option for finding those."}
{"product_id": "B0080RAT42", "context": "I know this is for Genesis, but would it also work with Sega Master System controllers as well? don't both the controllers have the same plug-in type?", "response": "As the other answer says, yes it should work just fine.  They do all share the same plug and even the (relatively) same  button mappings on an actual console.  I don't own master system controllers, but I have used this with atari joysticks and it worked just fine."}
{"product_id": "B00292OW1U", "context": "Does it have volume controls on it and a mute button? The picture does not zoom in so I can't see.", "response": "It does. They're at the edge of the top left"}
{"product_id": "B007SRM5MO", "context": "So why does the box say Internet connection required if the DLC is on the disc? Or is it only required for the Harley Quinn content?", "response": "Hello, Internet connection is required because DLC (Downloadable content) is on the disk. DLC may enhance the game and therefore these features wouldn't be available if there wasn't an internet connection. I hope this helps. Regards, Carolyn Number One Discount Store"}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "It'll work fine if you have the gamecube controller adapter. Personally I think it's the best because it has a longer cable than any of the other iterations of the controller. (longer cable is less tugging on the console)"}
{"product_id": "B0038PBF1W", "context": "How do I order more add on aircraft for this sim?", "response": "I find that down loading Gaijin Entertainment Forum will allow access to download opportunities to add to the aircraft inventory.  The addional aircraft are called \"Skins\".. Not every type of aircraft is available for download to Wing of Prey.. The Aircraft has to be associated with the period and theater of operations for that time.."}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Yes it does. Only works while marked on. The switch is pretty secure so no accidental moving."}
{"product_id": "B005LN5UOC", "context": "can i hook it up to my phone?", "response": "i imagine you can, it's paired like any other bluetooth device"}
{"product_id": "B006JSY3MI", "context": "Can I add PC version to Steam?", "response": "The PC version REQUIRES  steam."}
{"product_id": "B00DNHLFQA", "context": "will this work with win 8.1? Thank you.", "response": "Yes, its been working no problems on my W8 and still worked just fine after upgrading to W8.1 for me."}
{"product_id": "B00EWEHI5K", "context": "Does anyone know if it comes in the hard-shell briefcase if I purchase it directly from Amazon?", "response": "No it does not, it comes it a plastic clear box."}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "Yes it will work with both 32 and 64 bit windows 7 versions"}
{"product_id": "B00DC7G0GG", "context": "We just ordered the Wii U... what extra controllers will we need for multiplayer use?", "response": "You can literally use any controller: the old Wii controllers work as well as the standard one that comes with the Wii U.I prefer the Wii U wireless controllers they made for the system"}
{"product_id": "B00005QEFD", "context": "Does the system come with the game where the bunny chases carrots?", "response": "No.  That needs to be purchased separately."}
{"product_id": "B006JSY3MI", "context": "Do you need internet when using this game?", "response": "No, it loads something called \"Steam\" but the game installs on your PC and runs without being online."}
{"product_id": "B0073J8BYS", "context": "Does this work for the playstation 4 as well?", "response": "I gave this as a gift, sorry I don't know."}
{"product_id": "B008HPAXZ2", "context": "how many come in the pack?", "response": "Only 2 slides one for each display of Nintendo 3DS XL"}
{"product_id": "B00DRKJBC8", "context": "How do you use it?", "response": "You will download the steam client then follow the steps emailed to you"}
{"product_id": "B0041RY3W4", "context": "Is it 110~240V ?", "response": "I beleive it works on both.Me, I have pluged it on 220V."}
{"product_id": "B00CX8VY4S", "context": "Is this game appropriate for my 12 yo son? Haven't looked into it yet.", "response": "Lots of adult content and language, sexual situations and a lot of violence. So no, it's rated M for a very good reason."}
{"product_id": "B00J6DLPLK", "context": "does this game have co-op?", "response": "No, this is a single-player action RPG."}
{"product_id": "B00CMSCTA2", "context": "can you uninstall steam after you download the game? or is steam required to play it?", "response": "Yes, it's a steam game, so it's required to play"}
{"product_id": "B002CZ7P04", "context": "I bought wii in 2012 . can I use it with Walk it Out. What other efforts it need to implement it ?", "response": "Yes, you can use it with the regular wii remote or the balance board."}
{"product_id": "B00I14395A", "context": "Is there any noticeable latency when using the keyboard?", "response": "Not that I have noticed."}
{"product_id": "B000H67DDY", "context": "Is this device HID compliant? Or does it rely on the included setup software for assigning controls?", "response": "They don't mention HID compliant on the box or in the instructions, but it comes with driver software and you can personalize your setup."}
{"product_id": "B0027AP5S8", "context": "is it Jtaged for copy games? and can European/PAL games work on it?", "response": "Not sure I understand your question. This is a customizing case for the hardware. No software comes with this purchase."}
{"product_id": "B003VANOFY", "context": "Is the wireless quality really \"Gaming grade\"? Can anyone compare to the wired version of the product? I have that one now.", "response": "does it work with 360?"}
{"product_id": "B00CMQTVUA", "context": "Does the Xbox one include any Kinect based game like the Xbox 360 with Kinect did (I believe it had Kinect Adventures)?", "response": "Mine did not, that was when they came out though"}
{"product_id": "B00F27JN8Q", "context": "How do psp games look on the big screen?", "response": "PSP and Vita game all look fantastic on my 60 inch TV. Just be aware that you can only play Japanese psp games on Vita TV right now until it is released in the US later this year."}
{"product_id": "B0015PHMFU", "context": "Does this fight stick work with Mortal Kombat X on PlayStation 4?", "response": "Only with a controller adapter bro"}
{"product_id": "B00BZOBE78", "context": "Is this a steam key? And if not will it work with steam?", "response": "It is the actual disc. It worked with steam."}
{"product_id": "B00GANWVJE", "context": "Which languages does it have? Is Spanish included?", "response": "Mine came in English.Don't know about Spanish."}
{"product_id": "B00F27JDY0", "context": "can you change language to english and have everything like us version and can you use your us psn account?", "response": "yea, everything can be just like the us version. So psn accounts and language will be exactly like the US version."}
{"product_id": "B00B98HDNO", "context": "does it have to use inernet", "response": "Yes.  It's a link to the Steam system which actually holds the game.  There is no way to play the game without internet."}
{"product_id": "B00AAS88K6", "context": "If I swapped the batteries with Rechargeable Eneloops, would this be able to charge them over the wire like the Logitech MX Performance mouse can?", "response": "Hi Matthew, I can't tell. I just finished the batteries that come with the mouse and now I started using rechargeable batteries. I look at the manual and it's not stated."}
{"product_id": "B00E369SDM", "context": "How many wired controllers can I hook up to this?  And how many total (wired+wireless)?  Trying to see how I can have 4 players if possible.", "response": "On all the ps3s there are only 2 USB ports, but you can plug in a 4 port USB hub and have all 4-5 controller's working.Actually the ps3 supports up to 8 players but good luck finding a game that will support 8 lolWireless is up to 8 controller's also, you can of course combine wire and wireless."}
{"product_id": "B00HEX8TA4", "context": "The lights come on, but the mouse and buttons won't move or work?", "response": "Try it on another computer to see if it's a problem with your computer."}
{"product_id": "B00I9UVY30", "context": "Does it have A dream Team?", "response": "Yes, pretty similar to dream teams from previous versions of FIFA."}
{"product_id": "B00CQ9L1Z6", "context": "Does this work on 3ds games on the 2ds system?", "response": "Yes it wrks on either or"}
{"product_id": "B002RYLG4Q", "context": "Is it a bad thing to buy?", "response": "Put it this way a new system for 15 - 20 dollars and the old nes system is 100 dollars"}
{"product_id": "B0050SYX8W", "context": "All right i'll admit it, i'm a bit challenged when it comes to some of these things. My question is-if i buy this halo 4 x box game will my grandson be able to play this on his i pod?", "response": "No your grandson won't be able to play it on his ipod simply because Xbox and an ipod are 2 different systems and companies all together. There are games for ipod and games for Xbox so if your son wants to play games on his ipod he can search for them in the store."}
{"product_id": "B004RMK4P8", "context": "hello, the code they send me to my mail? live outside the US, but my account is USA", "response": "Yes, they send you an email. Also you can see the code right after purchase."}
{"product_id": "B006LVZEN0", "context": "Are the measurements listed for the mouse or mouse package?", "response": "You ever seen a mouse with any dimension that was nine inches?"}
{"product_id": "B00FJWNSWQ", "context": "what is the difference between the ultimate and standard edition", "response": "ultimate has more characters, skins and some other stuff"}
{"product_id": "B00BGAA29M", "context": "I´ve got two kids. Can they play it together?", "response": "If you have two controllers and kids that like a bit of challenge and learning from mistakes, then absolutely. I play this with my roommate all the time, we have a blast playing on a couch and take down enemies together, along with messing with each other in-game and out-game. Hope that helps!"}
{"product_id": "B002I0HJG8", "context": "Does this one give me Founder Status with the 8 Character slots, 4 bank slots and all, or do I need the Collector's edition instead for those benefit?", "response": "The key from the cd box is all you need for founders status.When entering the key remember to enter it backwards as well for an additional mount."}
{"product_id": "B0000695GX", "context": "What version would work best on win 7?", "response": "This should work though...if not, I do not know. What I did was kept trying and it eventually worked."}
{"product_id": "B004S5TDUQ", "context": "Does the game work on windows 8?", "response": "I don't know. I'm still using windows 7. If you check with the games website, they'll have the answer for you."}
{"product_id": "B007MM9E42", "context": "What controllers are needed? Do I need the classic controller or will the regular one and nunchuk work fine?", "response": "To answer your question, you do not need the classic controller at all. All you need is the regular Wii controller and nunchuck to play this game. If you want, you can purchase the paint brush nunchuck to make it feel like you are painting, but it is not necessary."}
{"product_id": "B00B3FIXJQ", "context": "can i get banned on mw2 and mw3 for using this controller", "response": "Possibly yes , but the chance of that happening is nearly impossible."}
{"product_id": "B00BI9MDSO", "context": "How many game cards can this case hold?", "response": "Not many as other cases just 3 plus a memory card plus a game in your vita.there's  room for more cards if you make a thin card holder."}
{"product_id": "B00576U8CC", "context": "For players who prefer to fight solo rather than with a crew or clan, is this game still enjoyable?", "response": "It can be once you get past the glitches. They have recently went FTP and have added season 2 story content I believe."}
{"product_id": "B0017Q4DGI", "context": "Can this be played on the original wii console?", "response": "How do you do it, I got to the screen of TV Only selection but it won't do anything."}
{"product_id": "B00CPS59CE", "context": "Would it work on a Xbox One?", "response": "The audio would work, but you would need to get a different adapter from turtle beach for chat."}
{"product_id": "B00CX8VYM0", "context": "Hello, I own both systems xb1&ps4 does anyone have a suggestion what system looks better or runs smoothly or are they both the same ? Please", "response": "They are both pretty much the same; just purchase it for the system with the more comfortable controller,  or the one you have more friends playing on."}
{"product_id": "B00ATF5YZM", "context": "can i buy and download this if i live in Australia??", "response": "Worked fine for me in New Zealand"}
{"product_id": "B003ZMF26W", "context": "Can you reprogram any of the buttons? Including the dpi switch, profile switcher, and macro key?", "response": "Yes just re plug in your mouse and it will set your buttons"}
{"product_id": "B00DC9SWWE", "context": "Is this the PAL version of the game? I am asking because in the picture the region says PAL.", "response": "The game I received is in fact NTSC. I believe that because Amazon sales worldwide that they have access to both copies (PAL & NTSC) and they take in account your location when sending out your copy of Titanfall!"}
{"product_id": "B00CX9L30W", "context": "Does buying this come with a subscription?", "response": "Purchasing the game comes with a 30 day free trial. Or at least it did when I bought the game. After that its about 15.00 dollars a month give or take. I believe you can also do a \"pay as you go\" using Crysta purchased on the Square Enix site but I dont know how that works."}
{"product_id": "B004C34D2M", "context": "So you have to buy something else for Motion Plus?  I thought it says it rubmles.   What is the adapter?", "response": "Motion plus is built in.  You do not need anything additional."}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "Because there is an option to turn off blood. At least that's my interpretation of the rating."}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "It does NOT work for me. I have 8.1 windows. I don't know how anyone else has gotten it to work"}
{"product_id": "B00HN9LS48", "context": "Does it work for Samsung curved TVs?", "response": "My TV is flat but I would guess it would work with the proviso that the contact point on the support arm will have slightly less area of contact in the back. A homebrew modification (adhesive tape) might be required. I haven't seen any model designed specifically for a curved set."}
{"product_id": "B00CJD4HD2", "context": "Does this mouse have the same clicking issue as the G500. i.e Sometimes it doesn't register a click, sometimes it double or triple clicks.", "response": "My husband says it does not have the same issue that the G500....sorry for the slow response I had to wait till tonight to ask him the question since the mouse was for him"}
{"product_id": "B00DC7G0GG", "context": "is it worth 50 bucks?", "response": "The game is still amazing so just get it from a different seller or like gamestop"}
{"product_id": "B0000512IE", "context": "Does anyone use these for Elite Dangerous? If so, how are they?", "response": "Works great with elite. Using them with assist off can be a bit tricky though."}
{"product_id": "B00GZ1H07Y", "context": "Will this work on PS3?", "response": "No it is PS4 only."}
{"product_id": "B005L38QK2", "context": "My mouse stopped working. How can I return this product and replace it with another ?", "response": "You should contact steelseries directly, try it with an email or looking for a customer service number on their webpage: www.steelseries.comA receiptwill be asked so you better have it on your hands at the time you make thecall or ask for information."}
{"product_id": "B0071NH8B8", "context": "what exactly is included within this bundle besides a Vita?", "response": "The version that I recieved had the handheld console with an installed Sim Card, a USB cable, an AC Adaptor with power cord, and an 8GB Memory Card."}
{"product_id": "B009LGO88E", "context": "Will this function with an American 3DS XL, or is it only compatible with Japanese 3DSXLs?", "response": "It functions on American 3DS XL :)"}
{"product_id": "B005L38QK2", "context": "What are the difference between this one and the Steelseries Sensei RAW Mouse?. and is this an optical or laser mouse? Thanks.", "response": "I have not used the raw version but honestly it doesn't look like there is a difference at all other than the aesthetician Diablo 3 logo.  The light also slowly pulses.  And this Diablo 3 version has the rubberised surface not metal.  As for the the latter it uses an optical not laser."}
{"product_id": "B00KGGJPYA", "context": "Does this have connector for 5C? I think 5C is different from 5 connectors. Thank you.", "response": "I was able to charge Gembonics battery with iPhone 5c.... -- Just plug your normal phone cable with the device and charge it.."}
{"product_id": "B005MQ3BSK", "context": "Does it run on Windows XP ?", "response": "I don't know, I have windows 7."}
{"product_id": "B00IRHE892", "context": "Is this really a worthy successor to the G500?", "response": "I believe it is, the sensor is superior and I've found the design and shape of the mouse very comfortable, software is also very user friendly"}
{"product_id": "B00BV72X1U", "context": "Will this work with windows 8.1?", "response": "Yes. Infact, I'm using this on Windows 8.1 right now."}
{"product_id": "B00CMSCTA2", "context": "Does This include the Expansion", "response": "Yes, it has the conquerors expansion"}
{"product_id": "B00GJSUUC0", "context": "please can anyone tell me if this is a blue ray CD or PSN code?", "response": "If you're talking about the game itself, it's a Blu-Ray Disc. If you are talking about the BONUS items, that's downloadable content."}
{"product_id": "B00E447L8C", "context": "Can you charge a tablet with the 3000 vs. the 6000?", "response": "I havent charched a tablet with the  Lepow series 3000mAh.  It perfectly works with my cell phone."}
{"product_id": "B005HN5LKY", "context": "I ordered this product and only received the cord that plugs into the wall, should I be expecting the brick, or is that not part of this purchase?", "response": "I got the brick, but it's a different voltage. I took it in to a Gamestop and they said the powerbrick was European. So I got totally ripped off."}
{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "Yes.PS Vita is not region locked.All menus and everything is of course in Japanese though."}
{"product_id": "B00166N6SA", "context": "Can we play offline?", "response": "Yes, you sure can it just won't be linked to the online store, or online friends"}
{"product_id": "B00GV0LR64", "context": "Is there any way to use these and not cheat?", "response": "You aren't \"Cheating\" by using this.  All this does is helps to put your hip fire on target."}
{"product_id": "B000NJBD90", "context": "Will this work with a PS2 Hori fight stick?Since there is no analog button on the stick how would it register when asked for the PS button?", "response": "There are limited to certain capabilities, this product would not be ideal for the PS2 Hori Fight Stick."}
{"product_id": "B00JB4WHWU", "context": "Is this a physical package that is actually shipped or just the code that will be received via the downloads tab or email?", "response": "It a physical card that you have to wait on, sorry. I thought it would just be a code when I ordered it, that is all you need off of the card."}
{"product_id": "B008SBZD9G", "context": "Hi, Does this product includes the CD-Key needed to register and play?", "response": "Yes it does you get one free month to play then every month after is $15.00"}
{"product_id": "B00BGA9YZK", "context": "Is the game a disc or just a digital download", "response": "The \"standered\" is a game \"digital\" and \"digital bundle\" are both download only."}
{"product_id": "B005UI8V6C", "context": "Does this work with an Xbox 360 controller?  Or is it strictly Keyboard and Mouse?", "response": "Sorry for the delay. I assume its only a computer game, like the previous two answers. But, if you want to try it out, go for it. I know there are games you can have the controller hooked up to it as well. If you want, contact WildTangent games."}
{"product_id": "B00519C7JC", "context": "What does Lto meanWhat does Lto mean?", "response": "To be honestI don't know but I know you get a free map pack"}
{"product_id": "B000096L71", "context": "I read that others supply 4CDs with this software. it so with this offer?", "response": "Yes, Raymond,This version of Microsoft Flight Simulator does have 4 CD's   CD's 1, 2, and 3 load the program into your computer.CD 4 must remain in your CD Drive to activate and run the program.Happy Flights!!DWL"}
{"product_id": "B000K9Q5NW", "context": "Do you have to use two feet to gas/brake because there's a post going down the middle?", "response": "I use only one foot just like a real car.  My right foot operates the gas and break with no problems."}
{"product_id": "B00BXE4W4C", "context": "where are all of the boards needed to repair the bridge?", "response": "I do not leave my games on my computer since I have hundreds. Have not played this one in a while. Sorry I cannot help. GP"}
{"product_id": "B00D96BO7K", "context": "can this be used wirelessly to watch movies from my xbox 360? thanks", "response": "No. The headset is wired."}
{"product_id": "B002LARYGA", "context": "Is this a line of sight remote or can the signal go thru a wall?", "response": "Line of sight for rf devices but bluetooth for ps3 connection goes through the wall."}
{"product_id": "B008O510Y8", "context": "How long are the audio/mic jack wires?", "response": "Don't know exact specs but they are very long compared to most, and if its too long for your liking it has a velcro strap on the cord you can use to shorten it."}
{"product_id": "B004TTNTYW", "context": "How long is the cord?", "response": "It's not anywhere near as long as the one that comes with the 3DS. This one is about two and a half feet shorter than the one that came with the 3DS."}
{"product_id": "B00IYWV5HS", "context": "On the Wildstar website, it states that the game comes with 3 7 day guest passes. Does this download give the same guest passes?", "response": "Yes I received three when I bought this"}
{"product_id": "B00FQFFPZO", "context": "can you vary the number of laps in a race or does the game force you into 400 or 500 miles?", "response": "You can do 3%,5%,20%,40%,80%, and the full race."}
{"product_id": "B00166N6SA", "context": "Is this the one you need to buy to install in computer before you can play any other Sims3 games?", "response": "yes hon. it's the base game."}
{"product_id": "B006SVUQNQ", "context": "Will this work with an original XBox game?  I've been wanting to play Shenmue II with my XBox 360 Slim, but don't know if this harddrive would work.", "response": "The hard drive has nothing to do with being able to play an original Xbox game on the 360. Take a look at the wiki page for compatible games https://en.wikipedia.org/wiki/List_of_Xbox_games_compatible_with_Xbox_360"}
{"product_id": "B0053BCO00", "context": "Does this game work on a 3DS XL?", "response": "Yes, it will work on an XL. XL \"EXTRA LARGE\" is just referring to the size of the handheld system."}
{"product_id": "B00EF1OGOG", "context": "I don't want to charge off a PC, can I charge the Anker off the AC wall charger & cable that came with the iPhone or do I need an extra cable?", "response": "Well to charge the Anker it comes w/ a wire to charge w computer but you can plug the USB side to you iphone plug. And to charge your iphone use your iphone wire"}
{"product_id": "B006QRMR4S", "context": "Can I play Japanese games on this? Because the Japanese version can only play games from Japan... So I don't know if it's the same with this.", "response": "No the system is region locked."}
{"product_id": "B00BGAA0SU", "context": "is this infamous really the limited edition?", "response": "Not the copy i got"}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "Just the dlc's of the expansions, not the base game (either as a dlc or hard copy) or hard copies of the expansions"}
{"product_id": "B001Q24UAM", "context": "what are the games?", "response": "Mystery Cookbook, Alabama Smith, Treasure Masters, Heroes of Hellas, Pet Show Craze, Farm Frenzy 2, Beach Party Craze, Supermarket Mania, Fashion Craze, Jewel Quest, Mystery of the Bermuda Triangle, Natalie Brooks, others.  Heroes of Hellas is my favorite.  Mostly hidden object games."}
{"product_id": "B001DNGCN2", "context": "it can help ps3 prevent to get YLOD on 60 GB?", "response": "Yeah, the less heat the better for the system. Having the fan boosts the chances of extending your PS3's life by at least 3 years depending on how often you use it."}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "It's just the DLC for the game"}
{"product_id": "B003Q55Y5C", "context": "Will the game support a Logitech F310 gamepad, combined with a 2Ghz/Win7/D-Core/4Gb ram/Directx-11 environment? 2nd: Plz confirm NO \"Steam\".", "response": "Not sure about the gamepad, but, the setup will support it and it also requires an online steam account . Hope This was helpful."}
{"product_id": "B00E1A1SP6", "context": "Can you play retro NES, SNES and N64 games with this?", "response": "I don't really use the online store, so I'm not sure what retro games are available to buy. I don't think the modding community has fully cracked anything if you wanted to use emulators, plus you would probably need some sort of sd card adapter to do it."}
{"product_id": "B00IVHQ0KI", "context": "can you use the th8a add on shifter and the tp3a add on for this wheel????", "response": "What is th8a and tp3..?"}
{"product_id": "B004RMK57U", "context": "i'm from Portugal , and i have a portuguese psn account , if i buy it ,will it work for me?", "response": "Yes it will work like a charm, you can buy without any fear... Thanks"}
{"product_id": "B000PD0HQE", "context": "will this console come with all cords like the red, yellow, and white cord that connects to the older tv's?", "response": "Hi Tanya,Yes it does. You can see each seller's \"offer,\" which will include different items and will explain what is included in each bundle."}
{"product_id": "B00292OW1U", "context": "Does the keyboard utilize mechanical switches?", "response": "no it does not"}
{"product_id": "B00CTKHXFO", "context": "Would this game work on my PS3 (I live in the UK)? Not sure if it would be region locked or not.", "response": "I think it would work"}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "If you do mean the ps3, then no the new design is the micro USB the old one was mini USB."}
{"product_id": "B00H1FCUBY", "context": "Are these headphones compatible with Bluetooth 4.0 devices?", "response": "I have a Samsung Galaxy Note I I and it is bluetooth 4.0.The headphones work my phone and tablet.The sound for the money is very good."}
{"product_id": "B001EYU1WS", "context": "Does it work with X-Plane 10?", "response": "I don't know couldn't get mine to work it all but I've got X plane 10 and a Mac so apparently that's two strikes. Al my other saitek stuff works great."}
{"product_id": "B006NU6HAS", "context": "Does this stand on its own or is this an addition to Flight simulator X", "response": "As all have already stated... this is an add-on to Flight Simulator.  If you were interested in PMDG enough to buy this product, invest a little more and get FSX.  There is nothing like it. Although, buying scenery and weather add-on... its not cheap but I would do it all over again. Truly enjoy this game."}
{"product_id": "B00BGA9YZK", "context": "can you play off line as a single game or is it just multiplay mode. do i need to buy playstation plus?", "response": "Its all of the above online and single player campaign,i recommend wolfenstein instead"}
{"product_id": "B0005PHYPO", "context": "Will this load on Windows 7?", "response": "Not neccessarly .  I was able to get it to work but it was difficult ."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "Yes I accidentally hit my plastic chair with the controllerc and it now doesn't want to work normally anymore"}
{"product_id": "B000TT2D2A", "context": "Are these Rock Band 1 or Rock Band 2 drums?  I need Rock Band 2 to attach cymbals to that aren't compatible with Rock Band 1 Drums.", "response": "I see no place for attaching cymbals !"}
{"product_id": "B00HS5FETM", "context": "I like to game with the TV sounds on certain games, and with my headset on others like cod. Mine has a transmitter so does this cable make it pointles", "response": "This is strictly a chat cable, which runs from the Dual Shock controller to the headset to enable chat audio. It would have no impact on what audio plays through your TV."}
{"product_id": "B009S4JZKK", "context": "I have a 12 year old that loves trains. Is this game to complicated for a 12 year old? If so can anyone recommend windows 8 compatible please?", "response": "This is not too complicated for a 12 year old.  The interface and controls are very easy to use."}
{"product_id": "B004W1IX1G", "context": "Does this work with the Wii U?", "response": "sorry don't know. Don'y have a WII U"}
{"product_id": "B008TP1OKI", "context": "Battlefield 4 requires a 2gb hard drive space to install the game, but it needs a Microsoft offical hard drive. Will this HDD emulate microsoft HDD?", "response": "Yes,it will. I installed bf3 with no problems. But doesn't BF4 require a whole lot more than that?"}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "Yes it is, I'm playing it in my 3DS XL."}
{"product_id": "B005YR308S", "context": "Does this game come brand new, factory-sealed in the plastic?", "response": "Sorry i don't know, it for my sister :)"}
{"product_id": "B00FEDP968", "context": "can you hear your own voice in the headset while chatting?", "response": "Unless you can hear what the other person is hearing(your voice) from their mic then u can't"}
{"product_id": "B000GCJ6MK", "context": "How can i run it on a mac?, thank you in advanced!", "response": "I don't know, I run the program with windows"}
{"product_id": "B00A878J5I", "context": "Will the game pad fit in the dock station if you have a silicone cover on it and does it charge ok with it on it.", "response": "You may have to remove the silicone cover before you place the remote on the charger. It charges great!!"}
{"product_id": "B002JTWODG", "context": "What's the difference between the Standard and the 2013 edition besides $50?", "response": "The laser and the battery life, most importantly, the battery life. The old model lasted a couple hours tops."}
{"product_id": "B004HYIAPM", "context": "Does it work on a computer with Windows 8.1 ?", "response": "Yes it does, so far I'm only in the early stages of the game, but it works perfectly. My PC SpecsOS - Windows 8.1CPU - Intel 4790kCPU Cooler - Phanteks PH-TC12DX PWMGPU - EVGA Geforce GTX 980 Super Clocked EditionRAM - Kingston Hyper X 16gb 1866 CAS 10MOBO - Asus Z97 Sabertooth Mark SPS - EVGA 750wt G2 Supernova"}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "I had about one month left on my subscription when I bought another year subscription - and it just added that time on, so you should be able to do the same."}
{"product_id": "B0045ZB66I", "context": "Does this game run on windows 7?", "response": "Smooth as silk for me. I upgraded to Win 8 a few months ago and it even runs great on that."}
{"product_id": "B00CD90R72", "context": "Does someone know if this video game come with the Spanish language option? Thank you.", "response": "well mine came in spanish!"}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "They only make one version. It will both work with a pc and a ps3."}
{"product_id": "B008NMPSEU", "context": "when 3 golden eggs appear to pick on why does in stay on screen and what are the crystal collections for?", "response": "are u talking about chicken coop or are u talking about something else?"}
{"product_id": "B00AWEMODK", "context": "Will this run on Windows 8.1?", "response": "Yes it will. Just make sure to go to the playonline website for the launcher. The launcher that comes with it will not work for windows 8.1."}
{"product_id": "B00ENFVS5Y", "context": "Does this have the most recent update? And did they fix all of the earlier batch problems?", "response": "No they did not follow up despite more than one request. That wheel is without question the worst product I have purchased"}
{"product_id": "B00BMFIXOW", "context": "I played AS3 It was my first AS game. I loved every thing about it, it litterly amezed me. I Played it on Wii U. do you recommend BF on PS4 or Wii U?", "response": "Ps4 is the most recommended, the WII U does not support high graphical games"}
{"product_id": "B000H1V56U", "context": "Does this work on the xbox 360 slim?", "response": "They have a Whisper Slim for the Xbox slim. You can find it on amazon as well"}
{"product_id": "B00E88G054", "context": "are there any programmable buttons/does it come w/ a drive program?", "response": "No unfortunately not, it's just a regular mouse with good aesthetics. It's got a forward and reverse button on the left side for browsing, and you can adjust the dpi but that's about it."}
{"product_id": "B006YDPU48", "context": "What's with the wide baseball bat swings with two handed sword? Real swordsmen only did quick snap strikes back then.", "response": "Be wary of recklessness"}
{"product_id": "B009Q8M816", "context": "CAN YOU CHANGE MODS", "response": "Yes by just clicking the sync button"}
{"product_id": "B004HYIAPM", "context": "what is steam requirement?", "response": "It means that Skyrim runs through the Steam software. If you already have it it'll add the game to your Steam library, if you don't have it it will install Steam on your PC alongside the game."}
{"product_id": "B0041RR0TW", "context": "Do they come with batteries, if so what size, brand and/or type of battery?", "response": "Mine came with two Duracell double A batteries."}
{"product_id": "B007XVTR12", "context": "Can I use this with Macbooks?", "response": "No, Its a PC game for Windows Vista SP2 or Windows 7"}
{"product_id": "B0096PLB9O", "context": "My pc cant find the drivers for this, where can I go to download them. Have alienware x51 pc, wont work without installing drivers.", "response": "Its a real pain, you have to pull them off the CD, delete the drivers you had for the device and force install drivers for it from the ones you pulled off the CD. It doesn't work automatically."}
{"product_id": "B0053BCML6", "context": "Can you play 2 player with just 1 cartridge (2 3ds) or do you need to purchase it 2x for 2 player?", "response": "este juego es en español"}
{"product_id": "B004L5SJ4Y", "context": "what are system requirements?", "response": "Not off top of my head.... But google the game and scroll down, it should give you the requirements there"}
{"product_id": "B00BS520SG", "context": "If I buy multiple adapters and plug them all into Wii motes, can me and some friends play brawl simultaneously at the same time?", "response": "Yes you should be able to, you just need a GC controller for each adaptar"}
{"product_id": "B004GINKNQ", "context": "will this work on the 4GB Xbox 360?", "response": "I bought it for my 4GB 360E.  Works like a charm."}
{"product_id": "B0041RR0TW", "context": "Do I have to set the buttons to play games like assassin creed 3 will this controller have already default setting just like consoles style", "response": "yes, you only need to set the switch to the X mode, this works like a Xbox 360 Controller settings automatically."}
{"product_id": "B00886XQO0", "context": "I have the Headset Adapter that came with another set of Turtle Beach headphones, can I plug these into that for my Xbox One?", "response": "If the adapter is specifically for the Xbox One controller then it should work fine. You also need a XB1/PS4 Chat Cable in order to connect your headset to the adapter/controller: Turtle Beach - Ear Force Chat Cable for PlayStation 4 Headset Compatibility - PS4"}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "I would just like to knw is it 240Hz ,can you watch regular tv like Direct tv,& how far appart from each other do you have to be to see your own screen.Are we gonna have to sit next to each other in the sofa & cuddle or what...LOL? No seriously"}
{"product_id": "B00AAS88K6", "context": "will this mouse work with a new Mac Power book?", "response": "If you have bluetooth"}
{"product_id": "B00FB45YFQ", "context": "Do these completely cancel out all noise?", "response": "Yes they do, but the right earphone dies.  I would not recommend these."}
{"product_id": "B009JZ04BC", "context": "Does this mouse support free-scrolling scroll wheel?  (like when you spin a wheel on a skateboard, how it keeps spinning)", "response": "It is actually is more like a gear. When you turn it, it moves in small equal increments and stops the moment you take your finger off it."}
{"product_id": "B00BI83EVU", "context": "How do you get on the multiplayer free roam where there are other players? (on PS4)", "response": "Once you get to the 3rd (I think) mission it unlocks multiplayer. From there you can open the map and switch to the multiplayer map where you choose what you want to do."}
