{"product_id": "B000266786", "context": "Will this work with a mac, specifically OS X version 10?", "response": "I don't know.  You could contact the company and ask"}
{"product_id": "B0089NVTDM", "context": "What different emulators will this work with?", "response": "It's read as a generic input, so any emulator allowing button mapping (which should be all of them)  should be compatible.. I used it specifically with dolphin, but should work elsewhere. I don't support emulation, and the only games I emulate are isos I rip off my own discs to play over the Internet Internet  with friends."}
{"product_id": "B003VH5Z2C", "context": "Why doesn't Faxanadu work?", "response": "Some of my games work and some don't. I think you should try to clean the cartridge. If it still doesn't work, i don't know."}
{"product_id": "B00GU4F4OM", "context": "How big is this thing?  I have large hands and FPS gaming can be a pain because my thumb and pinky usually drag on the mouse pad causing my shots to..", "response": "3.25\" wide, 5\" long and 1.7\" deep, it's really pretty big and would be great for fps cuz the side buttons are very easy to reach and really easy to change the DPI on the fly plus its programmable."}
{"product_id": "B005BLAJRC", "context": "Can I download it to my computer or do I have to keep the cd in the computer to play?", "response": "Yes you can! just place the disc in the computer and it will download or use the link to download online. Keep the disc though and enjoy the puzzles. it is quite simple."}
{"product_id": "B005YR308S", "context": "Are there a lot of complicated button combinations to push? Is this at all similar to Diablo? Apologize for the simple terms. I'm new to the PS3.", "response": "If you are unfamiliar with the Dualshock 3, then it may be challenging for you at first. I would suggest playing some other games to get acclimated with the controls first, then return to Heavy Rain."}
{"product_id": "B009RXUNGM", "context": "let me get this straight. cause im not 100% sure. i can plug in the included shorter cable for a phone? the hesh 2's are too bulky for school", "response": "Yes, there is a cable that plugs into the headset, then plugs into the device that plugs into your pc/console. Or it can be plugged into a phone or mp3 player, etc. Its long but not too long, about the same length as most earbuds."}
{"product_id": "B00DNGQQUQ", "context": "Can this be played on xbox One?", "response": "Nope. No 360 games can be played on the xbox one."}
{"product_id": "B00CJ7IUI6", "context": "This version is pal/uk  or ntsc/usa?", "response": "it usa but the dlcs you can put them in France, English and spanish"}
{"product_id": "B00E88G054", "context": "Does anyone know if this will work with Windows 8?", "response": "I use Windows 8 and I love the mouse. By the way, any peripherals (Monitor, keyboard, mouse, speakers, etc) should work with any computer or operating system. The only setback would be if a wireless or bluetooth device needed drivers installed, which you would simply follow the instructions for the device. Operating system should never interfere. Hope this helps!"}
{"product_id": "B000VRCNLG", "context": "Is this program compatible with Windows Vista?", "response": "CFS3 was released for distribution in 2002. 2-3 years in the making, Windows Vista was released world-wide in 2007. There is a 5-year gap in the development and so the Vista platform is entirely different from that of the platform that runs CFS3. Conclusion: CFS3 will not or will run poorly on Vista."}
{"product_id": "B00D3TRMD8", "context": "is this compatable with windows 8", "response": "I'm pretty sure it is"}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "Yes it's a super slims well that's what my friend just told me. But you should buy from EZCORP they are awesome I had a small problem with something missing and they shipped it to me in a heartbeat. I recently bought a PS4 from them."}
{"product_id": "B00DC7G2W8", "context": "Can you use the Wii U gamepad? Or do you have to use a wheel?", "response": "all gamepad ... pro and wheel ... work"}
{"product_id": "B009AGXH64", "context": "If our wii console still works, what is the benefit of buying a wiiU?", "response": "The benefit are the great graphics and more of a better player experience also its backward compatible with wii games and accessories"}
{"product_id": "B00562O8U0", "context": "my tv is a Samsung and infrared / shutter/ battery glasses. one of the first 3d tv. will they work ? I really want them for mulitplayer", "response": "Hi!!i don't know, i have a tv Sony bravia and work excellent but in samsung i can't sure that."}
{"product_id": "B00FATRKWM", "context": "Which is the frabrication year?? Do you have 2013?", "response": "I think I bought it in November, 2013, but I am not sure if it is manufactured in 2013."}
{"product_id": "B0002XJBG4", "context": "My present controller's joy sticks are sticky on center making it hard to steer the cars in my racing game... is this controller good for racing games?", "response": "I've had no trouble using it in racing games. The joysticks are good for just about any game really. The holes are square so you might need to learn to control your thumbs a bit more but it's honestly nothing that will bug you for very long if at all."}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "You just need an HD TV or one that can use the red/yellow/white cables. (Sold separately from the Wii U.)"}
{"product_id": "B00BQMGW4Y", "context": "How long is the cord, and does it have an extenion to the cord to plug into xbox? & What is the warrenty?", "response": "The cord is shorter than the original. At about 6 feet, it's too short for most couch configurations, and there is no extension. Not sure about the warranty, but I ordered 2 and I had to send one back because it was DOA. These are cheaply made, but hey, what do you expect for $8."}
{"product_id": "B0058GMO0A", "context": "Is it compatible with macs", "response": "It's not Mac compatable but here's a link for one that is. Look in the search for this one. Mahjongg 4 Deluxe (PC/Mac) [Old Version] by Viva Media - PC/Mac"}
{"product_id": "B0057S9SYY", "context": "Does it have memoryfoam or what king of ear cups does it have?", "response": "I am not sure but they are really comfortable"}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "The game only supports cross-save but not cross-play. You have to buy both the PS3 and the Vita version if you want to play on both systems. But your saved game on the Vita CAN be used on the PS3 and vice versa."}
{"product_id": "B007JDMPOK", "context": "Does it actually come with the soundtrack? I've seen some unboxing videos where it doesn't come with the OST.", "response": "Mine did not come with a soundtrack"}
{"product_id": "B00H8NS1K8", "context": "In terms of audio, what's the difference between these and the AD-700's?", "response": "No difference at all, same build with mic."}
{"product_id": "B0029LJIFG", "context": "Sorry what's this for is it for playing live? I just want this so i can download games for my son. Can I download 2 games per month. Any games?", "response": "Yes, per my sons, you can play online with friends as well as download  2 games per month."}
{"product_id": "B003NVMEVQ", "context": "my nephew is left handed will this mouse work", "response": "yes :)that's the magic of it, Two Identical Buttons (left and right click) and the scroll wheel. perfect for switching for lefties"}
{"product_id": "B00FA6YFTQ", "context": "Do this game or another one on the series has a history co-op mode?", "response": "no in single player only. No co-op or multiplayer. You might also consider the redux version at this point. It had better graphics and improved gameplay over the original."}
{"product_id": "B008SBZF2Q", "context": "Does this character work with WII U", "response": "I ordered this figure for my grandson who has an Xbox.  I believe the characters are specific to Xbox, WII, etc. so don't believe this will work for you."}
{"product_id": "B007JM8ULS", "context": "Will I be able to play my original xbox games on my 360 slim with kinect with this hard drive plugged in?", "response": "Short answer: No. Long answer: Don't expect this drive to work at all. Couldn't even install and play the first game I tried on it and that was a 360 game. Original Xbox games require a specific partition to be in place on the drive that this drive lacks. I'd go for an official Microsoft drive."}
{"product_id": "B00111SFEU", "context": "does it work with ps4", "response": "It didn't even work with my PS3. Save your money and listen to the reviews on here. The official Sony bluetooth headset works much better and for only $15 more."}
{"product_id": "B0058FAEAS", "context": "Does it work on a MacBookPro?  I called Madcatz and they said NO. Do you need to use Parallels so Windows can be installed?", "response": "I didn't still install my Saitek. I still need to acquire a better computer. I have information that it is excellent."}
{"product_id": "B00CORA9GC", "context": "Is a joystick needed?", "response": "no just use keys on laptop."}
{"product_id": "B00CHGYUE2", "context": "Okay what is the difference between the map pack version and the regular black ops two?", "response": "The map pack version comes with a code to download Revolution on the game. I think it is a way better deal"}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "I wish I could train dogs. Someone ripped me off and sent me the chinese knock off version - watch cats. These things can't be trained. It sucks!"}
{"product_id": "B0029LJIFG", "context": "What is the difference between this gold card and the newer version - besides price - wouldn't this one still provide 12 months of xbox live?  thanks!", "response": "The only difference is like you said. It's newer. They all provide the amount of online time as displayed. You should have no problems what so ever."}
{"product_id": "B00DNGQTFI", "context": "has the version in Spanish?", "response": "There is no Dub in Spanish. It only has subtitles in spanish."}
{"product_id": "B00DC7O3K6", "context": "for how many players?", "response": "can just one person play this game is there a single player mode? thanks"}
{"product_id": "B00EV7AYAO", "context": "i cannot turn the backlight on even when i press Fn+esc", "response": "You may have to check the bulbs, mine came working out the box but on other sites I have read that this keyboard may come with faulty bulbs, hope this helps."}
{"product_id": "B00FBV6V56", "context": "Does it work with Windows 8.1?", "response": "It should. You may have to update the mix amp on the Astro website. But I didn't buy the pc splitter. So you may have to purchase one sepretly or unless you can find one that comes with it."}
{"product_id": "B00DPJBTM6", "context": "Are these wireless? I read somewhere that there is something to make the A40's wireless", "response": "These are wired. Pretty sure you can get the Astro equivalent of the A40 wireless though. Just costs a bit more."}
{"product_id": "B00CMSCTA2", "context": "Does This include the Expansion", "response": "Only games body, did not include DLC."}
{"product_id": "B002AQNT96", "context": "will this game operate on windows 8, also does the pc version support LAN?", "response": "I am not sure Its a good game. I have Windows 7 Professional also new computer Alienware played older Computer."}
{"product_id": "B007OVHW90", "context": "what size is the input 2.5MM?", "response": "After looking at product box it tells me that it is 2.5MM"}
{"product_id": "B00BU3ZLJQ", "context": "Change the language to Spanish? Thank you", "response": "Yes, change the language preference temporarily on your device."}
{"product_id": "B00IIHU44E", "context": "Does XBox One absolutely need internet? Or can it be used offline because my internet isn't the best.", "response": "It does not need internet, they changed the format when people started complaining. It is best to use internet so you can play multiplayer games."}
{"product_id": "B004H7P0B6", "context": "Are these easy to install? I would be worried that I do something wrong. I never assembled any controllers before.", "response": "Very easy to install I have never replaced anything on a controller and I did it no problem"}
{"product_id": "B003V4AK8E", "context": "Is there anything we can do if a brand-new controller won't charge (i.e. if the controller can't operate unless it's plugged in)", "response": "What I do is plug it in to a usb plug next  me but then that idk"}
{"product_id": "B005M2KSLC", "context": "I'm looking for a mouse with a middle-mouse button that's very easy to press. I heard Kana has a low pressure one. Is it?", "response": "To me it feels like it is easy to push down but I am young and don't have arthritis or any other hand problems.  Mine does take a little bit of force to push it down; I personally think its the perfect amount."}
{"product_id": "B0058FAEAS", "context": "Hi does the yoke comes with  the power cable or ti's sold apart", "response": "I doesnt use a power cable. Just a USB included"}
{"product_id": "B004FS8LYK", "context": "Hey guys! So I was thinking of buying Tomb Raider but I hear there's multiple games in the series. Is this the first one? What's the order?", "response": "There are other games but this one was a reboot.  Although i didn't play the old ones i really had a lot of fun with this one. They did a great job!"}
{"product_id": "B000TGQLYE", "context": "You said you tested this multitap with your own PS2.  Which model version is your PS2?", "response": "I tested the multitap on the very first version, not the slim."}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "Yes. You purchase this and receive a game code. You go into steam and redeem the game using the code."}
{"product_id": "B00286BZ4Y", "context": "Does it work on a Mac?", "response": "I am not a Mac user, Sorry."}
{"product_id": "B008EZ3PBY", "context": "Does the xbox reset if you switch your tv to cable or something else with these aftermarket adapters. Do you have that problem with this one?.", "response": "That does not happen when my son uses his"}
{"product_id": "B00GJXMRX0", "context": "can i download it again if i erase it", "response": "Yes because it will be stored into your steam account. If you do not have a steam account you need it to download the game"}
{"product_id": "B00GJXMRX0", "context": "Is it compatible with windows 7?", "response": "Yes, it is even compatible with windows 8."}
{"product_id": "B0088MVODO", "context": "I would like to know if there is just 1 CD or if the quantity is different, just because I heard there is a version of 3 CD's", "response": "It's only 1 CD."}
{"product_id": "B00CBQO930", "context": "Is this mouse good for League of Legends?", "response": "Literally any mouse is good for League of Legends.. Lol I enjoy it!(: I play League and SC2 with it no problem!"}
{"product_id": "B00D7UHT0E", "context": "Is the Cupid Shuffle in the song list.  I have been searching for a Just Dance that contains this song.", "response": "It isn't on any that I got for my granddaughters."}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "yes it does but just so you know hdmi is the only way to hook it up there are no conversion cables just hdmi."}
{"product_id": "B00F27JDUY", "context": "can i change the full internal language to english?", "response": "yes, it gives you the option to pick the language you desire. it is beautiful and you will love it."}
{"product_id": "B00ERDGMT4", "context": "Is this the unupdated version of Borderlands 2, meaning no bug fixes/patch updates?  Will I need an internet connection to patch the game if so?", "response": "This game has updates every other week or so and yes you need an internet connection to access those. We play it on Xbox however."}
{"product_id": "B00IP0H4GA", "context": "Is this game compatible with a United States model 1 PS3?", "response": "Not sure if it works on the original ps3 but it does on the slim"}
{"product_id": "B00FWWY1V0", "context": "can it be used for ps3", "response": "Yes it can I use them on both xbox and ps3 currently on the ps3"}
{"product_id": "B00BKF5IXS", "context": "Good day. Does it include also the original PlayStation controller?", "response": "Yes it does,  just one however"}
{"product_id": "B004N7HSGU", "context": "So if i were to buy these Astros, What EXACTLY would i need to buy extra to work with my Xbox One?", "response": "This will work with the Xbox one. Just need the Xbox one adapter"}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "I had the same concern but dont worry you can choose English when installing."}
{"product_id": "B0099OZR9W", "context": "Stupid question but i need to know if there are directions for the install?  I'm not tech savvy at all  lol", "response": "Not hard at all open the door on the side take out empty plastic box insert your new drive easy as 123 once you put it in close door back and it's ready hope it helps you it does explain on box to good luck"}
{"product_id": "B00FLLFJ68", "context": "Is there a way to hang it or attach it to the wall?", "response": "no it appears not from reading box its unopened"}
{"product_id": "B00AWEMODK", "context": "I already have the game and part of the expansions on my computer, if I bought this just for the extra expansions, will it install on top ok?", "response": "Yes. Go to the Square Enix Account Management website. Login and go to Select Service > FFXI > Additional Services. Enter the code you received and it will upgrade your account."}
{"product_id": "B003O6EDSM", "context": "Is this a hard copy, or just a psn download? I'd prefer to just have it as a hard copy instead of downloading a terrabyte!!", "response": "I bought my son the hard-copy trilogy. There is plenty of DLC, however, that should make your gaming experience more enjoyable."}
{"product_id": "B00HN9LS48", "context": "Will this fit an LED screen? Credit Card thin might be a problem unless this thing really adjust to the monitor.", "response": "the bottom device swivels and has a rubber pad for gripping. My tv isn't very thin but maybe an inch or so and this bracket holds without an issue. Now if you were to have a credit card thin tv... that might be loose but the bracket can angle, therefore, giving you a more stable hold."}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "what do you mean by free files?  my version covers federal and state and allows you to file 5 free federal online and 1 state online."}
{"product_id": "B002CZ7P04", "context": "Do you get a real workout from this game, can you loose weight?", "response": "I lost quite a bit of weight from Walking It Out for 1/2 hour a day and watching what I ate."}
{"product_id": "B00B5GZORW", "context": "Does anyone know how to get past the point of the downed tree in front of the path? I have started 3 times and keep getting stuck here.", "response": "you can do a search by typing in the name of the game then type the word walkthrough or go towww.gamezebo.com and look for the walkthrough. thats how i got through the game."}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "The codes stack, so say you bought two years you can input them both in and have the time set for that two year period."}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "the wheel does has a click feel... I have it set to a button in wow"}
{"product_id": "B00EHBKUTE", "context": "Does the Tartarus gamepad have the glue issue horror stories on the palm rest that I've heard about the Orbweaver?", "response": "I haven't had any issues"}
{"product_id": "B0049B2FP4", "context": "What mods don't require the mod installer?", "response": "Most mods like harbor city(best one I've used) LA and NYC have their own built in installer but none of them that I've use need a special installer that didn't come with it"}
{"product_id": "B00B1MXGDO", "context": "Is this work for windows 8?", "response": "Nope, It actually doesn't work at all don't get if you don't wanna waste your time!"}
{"product_id": "B000OYMYZQ", "context": "Will this work with PC?", "response": "it charges the battery from any powered USB port"}
{"product_id": "B007VTVRFA", "context": "i am little confused by all these negetive reviews, can any one confirm if i can play this game offline as on today?", "response": "yes, Offline has been updated for some time now. Have at it and enjoy!"}
{"product_id": "B00J6DLPLK", "context": "Does the game have dual Audio and Subs? As in English and Japanese.", "response": "Yes but only if you buy it as DLC from the playstation store."}
{"product_id": "B0098EVZZ8", "context": "My grandson asked for these figures and I'm really confused. Do you have to have a game system to play with these?", "response": "Sorry, no clue...gave to my grandson a while ago."}
{"product_id": "B00FLZ4FS2", "context": "I only have xbox 1 can I reedem in the computer in the xbox page and then download on xbox 1", "response": "Yes you can a buddy of mine had to do it that way"}
{"product_id": "B001UWGDPS", "context": "will this run on win 7 32 bit", "response": "Yep. It's a 32bit program, so you shouldn't have any issues."}
{"product_id": "B00FOHP8XI", "context": "can I play my ps2 games on it?", "response": "Actually ps2 games can be played on a couple of the first generation models. They may have them for sale as pre owned in Gamestop. None of the new Ps3's will play ps2 games, which is unfortunate."}
{"product_id": "B00BMFIXKQ", "context": "Does the frame rate drop tremendously when in major cities for anyone else.       I have a super slim ps3", "response": "I have the ps3 slim too, and when I played this game I was surprised because the refresh is better in comparation with assassins creed 1 (for example when you load and Atalaya). I think you probably have a ventilation problem."}
{"product_id": "B000FQ9R4E", "context": "My son is 8 and wants this game for his birthday.  Is it inappropriate for an 8 year old?", "response": "There is minor cartoon violence. Other than that there is no other reason i would find it unsuitable."}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "yes, I play on windows 7 with no problem."}
{"product_id": "B00F8W9SWQ", "context": "Does this keyboard have feet, to elevate the back of it?", "response": "Yes, there are feet but they are small.  The thing I love most about this keyboard is the knob to adjust the audio volume.  So much faster than clicking and adjusting with the mouse.  The keys 'feel right' and everything works well.roy"}
{"product_id": "B00E3667XQ", "context": "Is there a Micro SD card port to add content (music files, etc.); and could I download to the console from Google Play, etc?", "response": "Yes there is. We have one in ours now."}
{"product_id": "B008SBZF4Y", "context": "does this work with swap force", "response": "Yes! All giants work on swap force!"}
{"product_id": "B00BMFIXZG", "context": "can you play the pc version with a 360 controller?", "response": "I have an Xbox 360 wired controller that works very well with my Windows 1 laptop.  Make sure that when you load the game that you go to options and configure the customizable controls as using the Xbox Controller."}
{"product_id": "B002I0HJG8", "context": "DRM type, no internet required?", "response": "you have to have internet to play this game. it's like WoW without the fee"}
{"product_id": "B007VTVRFA", "context": "i am little confused by all these negetive reviews, can any one confirm if i can play this game offline as on today?", "response": "I don't know the other people can play? but I can"}
{"product_id": "B009LGO88E", "context": "Will this function with an American 3DS XL, or is it only compatible with Japanese 3DSXLs?", "response": "works on both no region locks"}
{"product_id": "B003O6JKLC", "context": "is this the old version,or the slim new one? cause the picture on the box show the new one but the description on top says that it is the old version", "response": "it says old version because the newer e console came out in june of 2013, and the s console came out in 2011. Personally i prefer the s console. I've had mine for two and a half years and it runs like its brand new. The newer e version also comes with one less usb port."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "I'm sorry-I don't know because I don't have that program."}
{"product_id": "B009Q8M816", "context": "does it work for black ops 2", "response": "yes it does. but remember that this is not a jitter, so it will not make automatics faster, only make them slower. but single shots fire like lightning, on number 4 setting. pop pop pop goes my 57 on hc and does goes the whole team. :D"}
{"product_id": "B0018YXM3Y", "context": "do you have to download the game of the disk.", "response": "No. If you buy the digital version it auto installs"}
{"product_id": "B003O6E986", "context": "is this 2 disc version? full version?", "response": "It is the complete game with all standard cars and tracks, when I ordered I received the American Muscle DLC pack, September Penzoil DLC pack and the 2013 SRT Viper GTS-R for free. All the other DLC's you will have to pay for."}
{"product_id": "B00001LDCK", "context": "will it work with vista?", "response": "It works in windows xp, it should work in Vista, u have to set win98 compatibilty in program properties."}
{"product_id": "B00EEMLRTS", "context": "If I bought this and bought a xbox one later, can it be transferred later? I had read somewhere that it was possible.", "response": "Sorry boss but it will be married to your system so no can do on that"}
{"product_id": "B0038MVFYC", "context": "does it include the code for Nintendo Club ? so that we can register it as a game we own ? if yes, do you also sell Soul silver ?", "response": "I just checked both my boxes for Pokemon Heart Gold/Soul Silver and they both have it. Make sure you get it brand new to be sure. If its used the previous owner may have already registered it"}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "This is for the original vita system. You have to place the system in the grips at an angle. Where the top buttons are on the vita, they go in first at a downward angle, then the rest of the system snaps right in."}
{"product_id": "B00503EAG2", "context": "Does this come with a new product key for activation on Steam? (Physical copy + Product key?)", "response": "Yes, the key included unlocks the game for steam."}
{"product_id": "B002I0F5I2", "context": "Is it in a box which includes the manual and the offer code", "response": "If you buying the game brand new, yes it should come with both. Most used games don't come with manuals or even the offer codes. So please beware. The instructions is actually in the game itself. The codes are mostly for the multiplayer levels, skins, weapons and characters."}
{"product_id": "B00A0EPNPI", "context": "Is it a mechanical keyboard?", "response": "No, it's a membrane. But they designed the keys to work like a mechanical and they pop out just like a mechanical for easy cleaning. Still worth the purchase. It works amazingly well."}
{"product_id": "B00BGAA29M", "context": "I'm 36 almost 37.  Will I enjoy this game?", "response": "I'm 45--I just finished the game last night. It's entertaining enough that I'll take another run-thru to try to get more of the \"gadgets\" that you can collect parts for throughout the game.  My 15-year-old daughter enjoys it as well."}
{"product_id": "B003O6CB6S", "context": "Does this game have any requirements like the downloadable version?", "response": "IT is a shorter format version!  can be played off line."}
{"product_id": "B00F27JDUY", "context": "If you play a game where there is multiplier, would you be able to play with someone who is on an Xbox?", "response": "As far as I know Sony vita can only be compatible with Sony software, meaning games music,and other Sony apps."}
{"product_id": "B0094H8H78", "context": "Can you play music while playing a game?", "response": "No. It does not support multi-task. You can try Android-based game console, such as JXD s5800."}
{"product_id": "B00CMC6HCY", "context": "Is this game easy enough to pick up and play? My son is 6, loves WWE, but I'm not sure if this is too advanced for him.", "response": "It wasn't good, but I think he can manage how to play it"}
{"product_id": "B003O6JJKY", "context": "If i buy a used did it come with  controller ?", "response": "No it's up to the buyer."}
{"product_id": "B008NMPSEU", "context": "Can you please tell me all the games in this slot. Thank you.", "response": "I haven't played this slot in a long time and I'm afraid I can't help you.  I have bought other ones since then and don't even have Enchanted Slots any more. Sorry"}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "Yeah sure will, the arm extends to a pretty wide length"}
{"product_id": "B003Y5AHPG", "context": "Will this model play Castevania 3?", "response": "If its a nes, super nes, or sega game it should."}
{"product_id": "B0002DKTY2", "context": "is it for windows 8?", "response": "I don't know if it was made for Windows 8, but I use Windows 8 and the program runs on my computer, as it is intended."}
{"product_id": "B00FJWNSWQ", "context": "Do you need XBOX live to play the ultimate edition?", "response": "I used the free version on Xbox 360 live. I used the full version on a cd I bought because we love it so much."}
{"product_id": "B00BI4VVGY", "context": "Is it a 2 or 3 pin fan controller?", "response": "It is a three (3) pin controller and one i like very much."}
{"product_id": "B00B23MO9Y", "context": "If I buy this disc, will I code to add it to my account? Will I get it instant or have to wait?", "response": "The code works instantly. You will have to wait a long while(1 day) to install everything if you have never played this game before or have not previously installed the game to your hardrive. It is a great game overall and will keep you occupied. Hope this helps."}
{"product_id": "B00FM5IY38", "context": "How long did it take to install yours? Mine's going on 5 hours, and it isn't installed enough to actually start a game.", "response": "it took about 1 hr. I am told that the internal drive although it reads fast is not a good writter. Many recommend buying a 2 tb external drive that is high rpm's and it works better when hooked to the usb3 port.."}
{"product_id": "B00E4MQODC", "context": "Is there a slot in the battery compartment to store the USB nano-receiver when on the road, as with other Logitech gaming mice?", "response": "Yes there is, just under the battery cover, which I believe is a standard for Logitech Gaming mice. Only on standard Logitech mice is it questionable, as they don't get carried around as much as gaming mice."}
{"product_id": "B0000A2TPE", "context": "Can this work on Windows 7?", "response": "Yes it does. I've played this game on my present laptop that has Windows 7. The color scheme will change when the game is open, but it's nothing to be alarmed about. As of now, the game has ran smoothly for me."}
{"product_id": "B00D96BORK", "context": "Does this Call of Duty Turtle Beach Headset work with the PS4 out of the box with nothing extra?", "response": "Yes it's ps4 compatible"}
{"product_id": "B00FM5IY4W", "context": "will this play on the 360?", "response": "No. The Xbox One games are Blu-ray Discs, which the Xbox 360 won't read."}
{"product_id": "B00BGAA29M", "context": "What type of game is this?  Is there strategy involved?", "response": "There's some but not a lot.  It's an old school game.  Not quite as intense as Sonic."}
{"product_id": "B00EZPCX1A", "context": "This system does play the regulards and 3ds games right?", "response": "Yes it does. The only difference is that it doesnt fold closed, has the battery life of a 3ds xl, and lacks the 3D switch."}
{"product_id": "B0006PJAZU", "context": "Is it compatible with windows 8.1?", "response": "Works well with mine."}
{"product_id": "B00503EAG2", "context": "can I put this on steam?", "response": "Yes. It comes with steam."}
{"product_id": "B002L93F0A", "context": "Am I right when I see that there are two (2) controlers for $12.50 price?", "response": "yes, I bought four, and one doesn't work. :("}
{"product_id": "B00ENFVJJO", "context": "Will it charge the Gold Wireless Headset ?", "response": "I honestly don't know. We set 2 controllers in the base and charge them"}
{"product_id": "B009RHEBWA", "context": "Is there a limit on how many people can file their tax using it?", "response": "Five electronic E-files and unlimited printed for mailing..."}
{"product_id": "B00B15EXJC", "context": "DOES IT COME WITH A CHARGING CABLE?", "response": "Yes it does, but it's very short."}
{"product_id": "B00FENJVOE", "context": "Can you use characters developed from D3, or do you have to start fresh from lvl 1?", "response": "Your characters carry over from Diablo 3 into Diablo 3: Reaper of Souls! So you don't have to start a new character and build them up. With Battle.net, you just log into your account and all your characters from Diablo 3 will be there for you to adventure with."}
{"product_id": "B004H7P0B6", "context": "How many grey caps come in the package?", "response": "Just one of each color"}
{"product_id": "B001H4NMNA", "context": "Is there a risk of over charging the batteries and shortening their lifespan?", "response": "No once it is fully charged it know not to charge any more"}
{"product_id": "B00DLDEKOK", "context": "can this display volume", "response": "My son said \"it can display chat volume but not game volume\". I personally have absolutely no idea what those things mean or if he is even meaning the same thing you are."}
{"product_id": "B00ERDGMSA", "context": "If I buy the physical copy of the game do I get a code to redeem on steam so I can  play with steam friends?", "response": "Yes. BL2 is a Steamworks game."}
{"product_id": "B00009TW6R", "context": "does this game work with windows 8?", "response": "Have used on Windows 7, 8, and 8.1"}
{"product_id": "B002I0H2AG", "context": "I played Gears of War 3 and liked the campaign.  Should I give this game a try?  Is it a must play for 360 owners?  I am only interested in single player.", "response": "I mainly own these for the campaign so I would say go ahead. It is the best part of Judgment"}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "I'm not sure but I think you need the audio control that comes with these headphones or something similar to that not just an adapter, but I'm not totally sure."}
{"product_id": "B0095D1CM8", "context": "Is the pinkie rest included?", "response": "yes it is, it took me a little while to figure out how to rest my pinky on it to be comfortable, but now that i am holding it propperly its quite comfortable."}
{"product_id": "B00CERXJNW", "context": "i have a k70 and a buddy is trading it from me for a k90, should i do it ? is mine better ?", "response": "no get rid of any idea that any corsair keyboard will be anything but terrible my first one died within a year my 2nd one the k95  died within two months DO NOT BUY THESE KEYBOARDS"}
{"product_id": "B008YA9BVC", "context": "How do I test the Mic? What games are headphones good for on the Wii U?", "response": "You can test your Mic on call of duty. The headphones are good for playing any game on the gamepad!"}
{"product_id": "B003981JQ4", "context": "Will a Nintendo DS fit in here??", "response": "fits real tight. I returned it"}
{"product_id": "B000B78F72", "context": "Does it have tripeaks", "response": "The pc version has Triple Peaks and the new app version does also."}
{"product_id": "B00AKIPBNS", "context": "Which 3DS region lock does this game have? Does it depend on where it's ordered from?", "response": "I would say it's US locked. I live in the US and it works fine on my system."}
{"product_id": "B00AJILG1K", "context": "This is labeled as a 901 but does not have the US key layout pictured. If I order it will I receive the proper keyboard?", "response": "American here. I ordered this keyboard. Here's what mine looks like (pardon the smudges): http://i.imgur.com/Mn6qVwI.jpg"}
{"product_id": "B0091WIOJ2", "context": "Is Astro support really as bad as many of the reviews on Amazon state?", "response": "I haven't had to contact them great headsets."}
{"product_id": "B00GGUMV46", "context": "Can I play maps if I redeem the code from a US account and play it with a EU account?", "response": "nop, you can´t  the game and the seasson pas has tobe of the same region. Game EU seasson Eu... Or Game USA Seasson USA"}
{"product_id": "B00GPH7Y8S", "context": "Does this game have starforce?", "response": "I have this game, How would I know if Starforce is on the game."}
{"product_id": "B007YLUCME", "context": "How do you turn it on after unplugging the usb?", "response": "The gamepad did not work for me neither =(...sorry"}
{"product_id": "B009LGO88E", "context": "Will it works on the new 3ds xl?", "response": "Yeah it works on all regions of the 3ds xl"}
{"product_id": "B00B1N07QM", "context": "Is this the stealth version? If not, are you going to be offering the stealth version on Amazon?", "response": "This is not the \"Stealth\" model. This model is pretty fantastic. I have the Nostromo which is now replaced by Tartarus which has the same \"Stealth\" keys. I prefer the mechanical personally. I am sure Amazon will get more of Razer's inventory due to Amazon being one of the better third party vendors."}
{"product_id": "B0072A4JVW", "context": "Does it work well with the PS Vita Slim?", "response": "Here the 2k modelPS Vita 2000 Trigger Grip - Black"}
{"product_id": "B00CMC6HCY", "context": "is sheamis on the game", "response": "Yup, hes in there."}
{"product_id": "B00J128FPA", "context": "Is Heavenward an expansion to this or is it a completely different game that I'd have to have a subscription for?", "response": "Is an expansion ^^ and an awesome one. There's the new race aura and flying chocobos,new class like dark knight and astrologian."}
{"product_id": "B002I0H2AG", "context": "Can I still enjoy it as a purely single player experience (for the price)?", "response": "I'd wait until the price gets below $10 compared to the other gears of war the single player campaign wasn't really good. It didn't have a good story to it like the others."}
{"product_id": "B007SRM5U6", "context": "Does this game have an option for skill level? Can it be played on \"easy\" or \"beginner\" for instance?", "response": "Yes you can set the difficulty of the game from easy to hard."}
{"product_id": "B003RS1A7Y", "context": "Is this guitar compatible with Band Hero featuring Taylor Swift?", "response": "No, this Fender guitar only works for Rock Band 3."}
{"product_id": "B0002DQUH2", "context": "Is this keyboard compatible with the  hp f1523 model?", "response": "I'm not really sure it would be compatible, but I bought it for an HP Media Center (it´s an old model) and it works as well as the original did."}
{"product_id": "B005HN5LKY", "context": "I ordered this product and only received the cord that plugs into the wall, should I be expecting the brick, or is that not part of this purchase?", "response": "It's missing pieces. DO NOT ORDeR THIS item. It's a piece of junk.  Ours stopped working after 2 weeks!"}
{"product_id": "B00B0QONB0", "context": "is this for titanfall", "response": "This HDD works for any game. The storage unit type is irrelevant, as long as the unit is in place and has the required space necessary for installation."}
{"product_id": "B000ND3XXA", "context": "I know this is meant for a computer, but would it also work with the Wii U possibly?", "response": "No, this will only work on PCs and Macs. If you want to use a Gamecube controller on the Wii U (for SSB I assume :D ) then Nintendo will be releasing an adapter to do just that on the Wii U either before or at the same time as SSB for the Wii U later this year. http://www.polygon.com/2014/5/29/5761960/wii-u-gamecube-controller-adapter-smash-bros"}
{"product_id": "B00635N6YI", "context": "Does the mouse work on a Mac?", "response": "I don't why it wouldn't.  MAC has the same style USB port, right?  So, it should work"}
{"product_id": "B00KAI3KW2", "context": "Can you play classic xbox (1st console) and xbox 360(2nd console) games on xbox one?", "response": "If you plug you XBox 360 into the HDMI Input on the XBox One...You canIf you have lot's of available inputs on your TV, it wouldn't matter but in this way, the XBox one just becomes a bridge from your 360 to your monitor/TV"}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "It blocks the cameras if your afraid of someone using the kinect cameras to watch you."}
{"product_id": "B005BLAIGE", "context": "what types of games are there?", "response": "All the basic casino games and some slots. There is a second CD with more Slots but I couldn't get it to install on windows xp or windows 7. but the main game Hoyle Casino works good."}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "You need to sync your remote with your PS3."}
{"product_id": "B00D9EPI38", "context": "do you have to pay for internet?", "response": "Yes. I don't know of any company that offers free WiFi to your home."}
{"product_id": "B002MRUROI", "context": "will this work on XBox 360 Kinect'???", "response": "not sure ..i used it on an old xbox.. but it didnt work anyway .it stll overheated"}
{"product_id": "B009Q8M816", "context": "does it work for black ops 2", "response": "Yes it does. I use it regularly."}
{"product_id": "B000RA778G", "context": "I love this game but now Im not able to play it and Im not sure why please help I miss my game", "response": "The version for Windows 7 doesn't work properly, it has too many bugs.  I also have a netbook that has Windows XP and the version for the XP works fine."}
{"product_id": "B0012DPHKW", "context": "Does it run on windows 8?", "response": "I don't know but I would like to know if it runs on 8.1 with out any problemsThanksDon"}
{"product_id": "B005CELN8W", "context": "So this game does not work on Windows 8, I presume?", "response": "Sorry, I can't answer that. I have Windows Vista and it works fine on my PC. Good luck!"}
{"product_id": "B00HLT0YT0", "context": "Why is this 100 dollars cheaper than a Vita without any games?", "response": "This is a new version PS vita which comes with some games."}
{"product_id": "B00EM5UFEK", "context": "Does it require Xbox live?", "response": "Yes Yes Yes and YES!!"}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "Only one disc for the ps4 and the ps3."}
{"product_id": "B003VUO6LU", "context": "does this load DVD/BD disks from the front (like the original PS3) or from the top?  My components are in a stack and I need front load .", "response": "It looks just like the Play Station 3 .Showmen in the picture.If is laying down it loads from  front slot.If is on it's end it would be loading top front...."}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "Yes, downloads and plays on my laptop running Windows 7 without any problems."}
{"product_id": "B001AWBYRA", "context": "Does this work with Windows 7?", "response": "Yes, I'm using Windows 7 - 64bit."}
{"product_id": "B004TTNTYW", "context": "Does the charger burn and create smoke?", "response": "Both of my chargers smell like electrical fire and are dirty, I threw them out and didn't plug them in."}
{"product_id": "B004AM5RAW", "context": "Does it get hot? With the way it's shaped it seems like it would get a little hot...", "response": "Not at all. As we all know anything with a current running through it produces heat as a byproduct. RAZR does a great job of preventing this heat from being noticed by the gamer. And I play eso for hours a day."}
{"product_id": "B006IR6NH8", "context": "Will this work for non-racing-sim games, like Euro Truck Simulator 2?", "response": "Yes it will I use it for that game regularly."}
{"product_id": "B00111SFEU", "context": "does it work on a computer", "response": "Do not buy this product ! It did not work at all"}
{"product_id": "B000266786", "context": "Will it run on OSX 10.6 without classic?", "response": "I can't get Reader Rabbit to run on my windows computers XP or later.  I don't know what OSX is.  I am disappointed because my children loved reader rabbit and my grandson did too."}
