{"product_id": "B0050SYILE", "context": "Is Assassin's Creed 4 a better choice than Grand Auto Theft V?", "response": "Sorry I dont know but all my friends say ifs kinda boring so I would stick with gta"}
{"product_id": "B003O6CB6S", "context": "I personally loved this game on Xbone, but now I want it on PC. Is there anyone else still online? Spare the negitivity, I've already read the reviews", "response": "Call of Duty Ghost is excellent to play on PC with a large amount of competition with players you can OK to play about six minutes of action that is addictive because your selected battle is very fair and real  period. This allows you to chose competition that is fair."}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 7? I might as well ask if it works with Windows 8 although I am not a user of that operating system.", "response": "Yes on both accounts. Windows may auto-detect the device, if not, it comes with a cd with drivers."}
{"product_id": "B007VFHIHA", "context": "can you play this game without the internet and do you get disc & software package for disc?", "response": "I play this game under Steam platform, I think it can be played offline. thus, I don't have disk or anything else."}
{"product_id": "B00C71034I", "context": "do you have the other disk so you can play online with different people or do you just have the campaign disk or do you have both disks", "response": "I have both disks."}
{"product_id": "B0050SY77E", "context": "do you need a code like most EA games to play the multiplayer", "response": "No code need since ea stopped that policy' I thought you meant predator edition extra code. No you don't need it because ea stopped that policy so that means any ea game is playable without a code."}
{"product_id": "B00DJYK9L4", "context": "I am in a wheelchair, does it work if you use the arm band or by holding the remote? If I was to wear the belt higher, in theory would it work?", "response": "you can hold the remote"}
{"product_id": "B00IVJ1M7M", "context": "Does this work with the New 3DS XL?", "response": "Yes, since the new 3DS can still run 3DS games it should always work. The action replay powersaves only edits with your computer on applying codes inside the game cartridges."}
{"product_id": "B00I5LMSE2", "context": "can you play this on a 3 DS XL", "response": "Yes you can XL is just a different size screen but still a 3ds system! !!"}
{"product_id": "B0050SYK44", "context": "Can I use this game with the game of the year edition add on content? Thanks.", "response": "If you have the DLC code or the DLC already downloaded onto your Xbox it should work. But this version doesn't come with the DLC."}
{"product_id": "B00BGAA3S2", "context": "Is this similar to the Kinnect for the Xbox? How or how not?", "response": "Yes and no. Yes because both use voice recognition, infrared cameras, and face recognition. No because the kinects features are more advanced. Well not to get into the whole science of this but it would've been easier to have had googled it"}
{"product_id": "B00FE8WKMO", "context": "Does the Wii balance board work well on carpet?  I notice all the pictures show it on hard surfaces like wood, tile, etc.", "response": "Yes. It comes with larger pads to put on when used on carpet."}
{"product_id": "B004JKZUJI", "context": "i have recently downloaded the classic game of mario golf on my wii. Do you know if this wii classic controller works with my wii mario golf 64?", "response": "I boug it for the new super mario bros game classic I downloaded works good same. So yes it will work for your game :)"}
{"product_id": "B00562O8U0", "context": "I have a Sony BRAVIA XBRHX929 TV and wondering if I need a 3d Synch xmitter along w/ these glasses or will it synch/work directly with the TV ?", "response": "You would NOT need a 3D emitter because your TV has one built-in as does mine (KDL-55HX729)."}
{"product_id": "B00FJWNSWQ", "context": "is this worth 20 bucks??", "response": "Yes! The additional characters and side missions make it worth it. It's act pretty entertaining. As a casual gamer, I'll play injustice more than madden 15.  It has a great story too."}
{"product_id": "B00D6PTMHI", "context": "Will this enable a person to read music and play other pieces, or do you only learn the songs included?", "response": "Reading music is not part of this product.  You only learn the limited number of songs included or that you download later at extra cost."}
{"product_id": "B009S4JZKK", "context": "does this program work on windows 8 .1", "response": "I have used the program on Windows 7 only."}
{"product_id": "B004HYIAPM", "context": "Is this game appropriate for a 12yr old? What are the \"sexual themes and alcohol\" content in here like the rating says?", "response": "Violence is really the only mature content.  There is some blood and gore throughout though only with swords, axes, and bows.  The worst part is a beheading in the very beginning of the game.  The alcohol and sexual themes are very minimal, nothing like grand theft auto."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "Yes it use 2 AA batteries. Like the old one"}
{"product_id": "B001IYR53W", "context": "Do you have to have the CD inserted to play the games after installation?", "response": "No, just load on to your computer and enjoy.  I am 71 years old and I like the old card games.  I play them often."}
{"product_id": "B00JM3R6M6", "context": "appropriate for 10 yr old girl?", "response": "definitely, feel free to get it for her."}
{"product_id": "B002ZS6Y64", "context": "Do the headphones come with every accesorry needed to plug and play? Also do the the headphones need to be connected to an outlet?", "response": "Theyre plug and play on the older consoles, not the xbox one (and idk about the PS4). They do use USB for power so you can plug it into the console instead of the wall."}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "Morrowind works great on windows 7, it does not require any modifications.  Also, it is good on lower spec systems such as laptops. Some dialing down on the graphics is needed, but it works fine.  enjoy"}
{"product_id": "B00BCEK2LU", "context": "Is this keyboard mechanical?", "response": "This is not a mechanical keyboard, but I'm really actually surprised to find that out. It is an excellent gaming keyboard. I bought it for my boyfriend for Christmas, and has yet to voice a single complaint or issue with it. I plan to buy a second for myself, very soon."}
{"product_id": "B008XHCLFO", "context": "If I put my 3ds xl in this case would it be able to still fit in here?: HORI Retro Mario Hard Pouch for NEW 3DS XL and Nintendo 3DS XL", "response": "No, it wouldn't. The dreamGEAR IS A CASE WITHIN ITSELF. It gives a great controller feel to it and provides security from accidental drops, NOT any intentional spikes to the floor. Overall. From one gamer to another, this completed my XL gaming experience!"}
{"product_id": "B009OYUFMG", "context": "Does this product work on World at War?", "response": "Yes.  It works with ANY game.  Not limited to BLOPS2."}
{"product_id": "B00DOD0TZG", "context": "Will this work for people in Europe?", "response": "I assume that as long as you have Steam and Windows, it should work."}
{"product_id": "B003ZSP0WW", "context": "I just got 2. I turned them on and their power buttons just blink - they don't connect. I tried hitting the console power button, too. What do I do??", "response": "youtube it my friend. anything you need youtube it."}
{"product_id": "B0009PRCNO", "context": "Is this ps3 60gb backward compatible? and what is it's model number? thanks!", "response": "the model number for my backwards compatible ps3 is CECha01. i thought that all 60gb ps3s were backwards compatible, but they are not because i bought one for my daughter on amazon recently and it wasn't backwards compatible. So if that's what you want, ask first."}
{"product_id": "B00A378L10", "context": "Hey guys, I have a laptop, does this just plug right in through usb port?", "response": "It uses a usb connector. I think it should work with your laptop."}
{"product_id": "B006W3ZXEW", "context": "Has anyone else had the problem with the mouse not working at all after some time? Is there a way to fix it?", "response": "The one we bought stopped working after only a few months. Amazon has only a 30 day return policy so we contacted the manufacturer and they are supposed to replace."}
{"product_id": "B00A378L10", "context": "Hey guys, I have a laptop, does this just plug right in through usb port?", "response": "Yes it does, it is a great buy.  Hope this helps"}
{"product_id": "B00FYIXMHQ", "context": "Does the Collector's Edition have spanish audio/subtitles?", "response": "I just checked and the game has options for both audio and subtitles but it seems like it's linked to your system setting so I had to change my entire system region over to Spanish but then it showed access to both the English and Spanish audio and subtitles."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "It has a usb at the end not a nintendo 64 controller port. I'm sure you can find a converter or an actual controller"}
{"product_id": "B006QRMR4S", "context": "Can I play Japanese games on this? Because the Japanese version can only play games from Japan... So I don't know if it's the same with this.", "response": "The 3DS is region locked."}
{"product_id": "B002I090AG", "context": "does it come with a AR card", "response": "Mine didn't, but I just emailed the seller and he sent them to me."}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "The key is a headphone wrap and the fish is a cord wrap."}
{"product_id": "B00286BZ4Y", "context": "Does this come with a CD", "response": "No I downloaded it from the internet"}
{"product_id": "B003O6N64Y", "context": "Will this work to listen to music and talk on an iPhone?", "response": "Yes. Everything that has Bluetooth."}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "yes it is and arent bad at all. not the common talent you always hear everywhere else"}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "i ordered this via amazon prime early november 2014 and it contained the usb receiver and a set of duracells, too. i'm guessing other sellers may not include it?"}
{"product_id": "B000B6MLPU", "context": "I purchased one of the older models of the XBOX 360 (120 GB with no wireless).  Is this the same cable that came packaged with that version?", "response": "Yes. At some point they switched from this AV cable to an HDMI. This is the original cable that was packaged with the first couple revisions of the console."}
{"product_id": "B0050SYK44", "context": "I've never had a game consol.  How do PS3 and Xbox compare?", "response": "sorry i dont know. it was a gift.."}
{"product_id": "B00562O8U0", "context": "where can i get a charger for these glasses?????", "response": "Each new pair comes with a cable. It is a standard USB micro Type B and can be purchased any where online, like Amazon.com or Monoprice.com. If you need it right now, most big box stores, like Walmart, Target, Best Buy and Radio Shack will have them also at a much higher price. Hope this helps."}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "2 players.  But bigger monitor but better view."}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "The headset isn't wireless so there are no batteries. It's pretty much your standard headphones with a mic. All you need for it to work on the Xbox one is the adapter which comes with it"}
{"product_id": "B00HLT0YT0", "context": "Is this the WiFi or 3G model?", "response": "As far as I understand it they've 86'd the 3G feature. WiFi only for the new slim model."}
{"product_id": "B002B9XB0E", "context": "Does this work with raspberry pi?", "response": "It will be seen as a USB device and function at the hardware level but it will still require a compatible driver; the availability of which I am uncertain."}
{"product_id": "B00A8HIGSS", "context": "is this a physical copy or is a box with the code inside, i hope its physical?", "response": "This is a physical game disk playable in US systems and is in English! There is no code within this game."}
{"product_id": "B00BU3ZLJQ", "context": "Can this be played offline? The person who I am buying this for does NOT have internet. Will he still be able to play the full game?", "response": "My son's xbox has never been online and this game plays without Internet."}
{"product_id": "B002Z7BE24", "context": "my friend has the regular version of RE 5, if i have this one can i still play online multiplayer with him?", "response": "You should be able too. The Gold Edition is the same game, its just has DLC content with it."}
{"product_id": "B00CD1FC6G", "context": "Does this board still have the LED Issues? (Them dying off after a month or two)", "response": "I've had mine for more than a year with no issues at all"}
{"product_id": "B0095P5K8I", "context": "Compatible with Os X?", "response": "Of course.Any wired mouse is compatable with any operating system as long as your computer has a USB port (Your computer has a USB port)."}
{"product_id": "B007YLUCME", "context": "I am confused of plug and play. If the controller cannot turn on without having it plugged in, what's the point of having a rechargeable battery?", "response": "The controller can turn on by itself..you only plug in the reciever"}
{"product_id": "B00CX9L30W", "context": "i have it for pc but would like to play on ps4. will on characters be on both or will i have to start new ones", "response": "Your character will be on both. It's tied to an account not PC/ps4"}
{"product_id": "B0007U2CX6", "context": "Will this work on a PSP model 1001?", "response": "Yes it will. That's the model I bought it for."}
{"product_id": "B0036VO4XO", "context": "Will this work with Mac OS X?  Yosemite?", "response": "Yes, it works very well with my max"}
{"product_id": "B00KAI3KW2", "context": "Are the Xbox One games online only?", "response": "No but games like titanfall are online but other you can play with out having to be connected online or having a membership"}
{"product_id": "B0009VXBAQ", "context": "does this play gamecube games?", "response": "Make sure the Wii is the one made in 2006. That's the 1st model that will play GC games."}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "I just bought the Wifi Controller for Windows directly from Amazon and it does come WITH the USB transceiver for the PC. Buy it directly from Amazon if you want the transceiver with it."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 8", "response": "yes. I am using it with 8."}
{"product_id": "B00BCEK2LA", "context": "how does its size compare to the G502 Proteus Core which I've seen at Best Buy? My grandson is 14 and wants a little bit smaller mouse than some.", "response": "The G502 is overall the better mouse, however also a lot more of a serious.he would need to set it up to his liking and know what sensitivity and weight he is comfortable with. this one is ready to go straight out the box so considering his age I owuld probably say this is the better choice."}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "Yes, Silent Hunter can be played without having to be online but like all games you will need to register your game. I have been with Silent Hunter ever since the very first version and I have never had to be online to play. I strongly suggest you find a good submarine forum, like subsim.com I hope this helps."}
{"product_id": "B00EOI2MRS", "context": "Does this work with the God of War Saga games? I can't press the buttons fast enough and want to play the games.", "response": "I don't use the turbo button, but it functions how you think it does: mashes the button when you hold it. I don't know how fast though"}
{"product_id": "B00DJYK8XS", "context": "does this promote weight loss", "response": "No, but you will lose weight if you watch what you eat.  I'm sweating after 20 minutes.  It is a good way to get cardio."}
{"product_id": "B0050SYK44", "context": "Is the game brings the voices or subtitle in Spanish?", "response": "I do not think the Xbox 360 version can change spanish subtitles however the pc version can change subtitles"}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "I ordered mine on February 17th. Delivery is the 8th."}
{"product_id": "B009GZX49Y", "context": "Do you need to download patches like the stand alone disc releases of the included games?", "response": "I'm not sure as I've never opened or played it. Though I do believe that if it does require any kind of patch or update it will let you know right after you boot the game up. I hope that answers the question as I'm just not sure how the trilogy differs from the stand alone versions."}
{"product_id": "B00I9UVY7G", "context": "This game include also clubs or just national teams?", "response": "National teams only. It includes all 203 that participated in the tournament."}
{"product_id": "B00GQTZ8TM", "context": "Does it have pokemon on the console or is the ds plain red?", "response": "Its plain Red... no Pokemon emblems.  The game is just installed in the system memory"}
{"product_id": "B000WCCURW", "context": "Does this game play on windows 8?", "response": "Charles, just loaded this game on my Windows 8 computer and have played around six hours with no problems whatsoever. Happy gaming!"}
{"product_id": "B00A8HIGSS", "context": "Are the menus put in english too, or just subtitles?", "response": "I think the menu's are in english as well.  I can't read kanji so otherwise I wouldnt have known where to start the game if it was in kanji"}
{"product_id": "B00D6PTMSW", "context": "Aside from the game and guitar is there anything else you need to purchase? I know nothing about guitars and this is a gift... is an amp required?", "response": "No amp is required, you do, however, need the cable, the cable is hooked up from guitar to xbox and the sound comes thru whatever you have hooked up to the tv, be it the speaker system or tv itself."}
{"product_id": "B00BT71S4K", "context": "can the galaxy s5 fit in this gamepad?", "response": "yes but becareful buying this controller it only works with ipega games the best choice for a controller would be a moga pocket or moga hero or moga pro"}
{"product_id": "B009LGO88E", "context": "Will this function with an American 3DS XL, or is it only compatible with Japanese 3DSXLs?", "response": "As it is a peripheral that only communicates via the IR sensor, this will work on all 3DSXLs. I bought mine to play Monster Hunter 3 Ultimate and I've had no problem."}
{"product_id": "B00BGA9YZK", "context": "Is the game a disc or just a digital download", "response": "When I purchased my copy it was an actual disc, although I do believe there was an option to select for digital download, so just be sure to look at all options before you purchase."}
{"product_id": "B0050SYILE", "context": "Is it safe to order a used one or better to buy a new one?", "response": "But a new one from the game stop"}
{"product_id": "B0053BCML6", "context": "Can more then one person have a house in New Leaf just like in Animal Crossing City Folks?", "response": "Yes, but only one can be the mayor."}
{"product_id": "B005OSFUZI", "context": "Can this cable be used for software other then Rocksmith/Rocksmith 2014? (like garage band or some other sound recording software)", "response": "After some online search, we investigated that the problem is about the connection point of the cable (the cable consists of two pieces), we disconnected them and then connected again and it's working now.Thanks for your interest"}
{"product_id": "B003O6CBIG", "context": "how many maps on multiplayer are their without dlc maps.", "response": "About 10 or 12"}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "This is only compatible with the Wii U. You will need to get a Classic Controller to hook into the Wii Remote to get a similar experience on the Wii."}
{"product_id": "B00EADTVL2", "context": "What happens if i leave the dualshock 4 on the charging station while it is plugged it even when the battery of the dualshock 4 is fully charged", "response": "I've had these charging stations on the PS3, and according to Energizer when the controls are already charged, the LED lights are on, but stop charging the batteries. And it really works, because I had four controls, and they worked perfectly until sells them."}
{"product_id": "B0088MVPFQ", "context": "Will this game play on a Nintendo 2DS.", "response": "will this work on a dsi xl"}
{"product_id": "B0056JPS84", "context": "I have the Lite-On drive and was manufactured JUL 2009.  Not sure of the exact model #, should I re-open and provide model prior to ordering?", "response": "There are a couple different models so you want to make sure you order the right one"}
{"product_id": "B0091WIOJ2", "context": "Is Astro support really as bad as many of the reviews on Amazon state?", "response": "Absolutely.  It took me months to have the issue resolved with my headset, and you can never actually speak to a person directly, only through e-mails that they do not respond to in any decent time frame."}
{"product_id": "B0087N222Q", "context": "How do you connect it to the PS3 because mine does not work ?", "response": "I just turn on the PS3 first, and then I turn on the headphones and it searches the PS3 out first and connects..... hope this helps!"}
{"product_id": "B00BZOBE78", "context": "Do you need gods and kings for this to work?", "response": "Yes.  However, it is natural to start with Gods and Kings...but  it is your choice."}
{"product_id": "B00EADTVL2", "context": "What happens if i leave the dualshock 4 on the charging station while it is plugged it even when the battery of the dualshock 4 is fully charged", "response": "Nothing it just stays charged until you are ready for it. I do it all the time. I leave one of my 2 plugged in to the station at all times that way when I need a controller that works I can swap them out and continue play like nothing ever happened."}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "Sorry, I have no idea. Mine is Window 7"}
{"product_id": "B004N3FGHC", "context": "We cannot get our new remote to sync.  We have put in fresh batteries and pressed the red button, but it will not sync like our other Nintendo remotes", "response": "I have the fresh batteries in my wii remote I bought from you guys and on the charger it's always has a  blinking red light and I HAD IT ON THE CHARGER FOR 2 DAYS NOW?"}
{"product_id": "B00D3RBYM0", "context": "Does this game have multiplayer mode", "response": "Yes, it is open world multiplayer.   You can drive up next to someone and challenge them or take them out as a cop."}
{"product_id": "B00DOD0TZG", "context": "Will this work for people in Europe?", "response": "This uses steam keys to download and install these 3 games, as far I know this should work in any region. 98% of single player games tend to be region free(with exception of Xbox 360/One games) , in other words it works in any region. Bets of luck~TL;DR Yes!"}
{"product_id": "B00005LBHM", "context": "The game comes with the all box stuff?", "response": "The one I get did not come with all of the box stuff.  In fact the game itself is unable to keep the save data or at least the copy that I had bought."}
{"product_id": "B001E93IWI", "context": "Will this headset break easily like some turtle beaches do", "response": "Mine broke just after a month..... looking for a better one"}
{"product_id": "B00BQMGW4Y", "context": "Is this the official Xbox controller S (made by microsoft)?", "response": "No. But it works great."}
{"product_id": "B0098W4ZD4", "context": "I have retarded hands that gush out sweat when I play games. And gush is not an exaggeration. Will this be a problem for RAT? its got alot of crevices", "response": "Well, I for one have no idea how your hands work but I can safely say that no matter how mentally challenged your hands maybe, this mouse will uphold it's due duty."}
{"product_id": "B00H72EMP8", "context": "IS THIS HEADSET WIRELESS?", "response": "No, but if you're using it for ps4 then all you do is connect it to your controller. So you can still move around the house and everything with it as if it is a wireless headset."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "No it is not!"}
{"product_id": "B00B0QONB0", "context": "Do I just plug it into the Xbox or do I have to buy a cable to connect it?", "response": "It goes right in the Xbox.  It didn't work in my Xbox"}
{"product_id": "B00I14395A", "context": "Can the angle of the keyboard be adjusted?", "response": "There are two tabs that flip down to raise the keyboard. But there's only those two angles. Normal height and with the tabs down. Hope that helps"}
{"product_id": "B003NVMEVQ", "context": "does it change colors", "response": "No it doesn't. It's a vibrant blue."}
{"product_id": "B009DL2TBA", "context": "does hookup to analog tv? also, can get pandora and netflix?", "response": "With analog TV is ok. Netflix, only suscribe credit card before to play app"}
{"product_id": "B00EF1OGOG", "context": "How long does one charge last without charging it again? I guess if I leave on standby, how long will the charge last?", "response": "I'm not sure the longest, but I charged mine before leaving for a hike through Yosemite and the charge held through that 5 days. On the last day of the hike, I used it to charge my phone and some of my other electronics."}
{"product_id": "B00CMSCWGS", "context": "I'm wondering if the instructions are decent.  I'd probably be using an Xbox controller.", "response": "Dear,If you asking is it Will work or not? I will say yes it is will work.Sorry for my weak English :)"}
{"product_id": "B00F47ZNP6", "context": "the mouse pointer wont move even though it says the drivers were installed. is there a way to fix this issue?", "response": "Try delete the driver and reinstall again?"}
{"product_id": "B00F27JE1C", "context": "What does this come with?", "response": "Just the system, power cord and ar cards"}
{"product_id": "B00EV7AYAO", "context": "Is there really a difference between a gaming keyboard and a regular keyboard?", "response": "Not much. I think there might be a slight difference with how easily the keys are depressed and the surface texture of the keys. The other junky keyboard I have has keys that can stick and this has never happened to me with this keyboard"}
{"product_id": "B00I4C2EKA", "context": "Will this run on Windows 8.1? I have a Surface Pro 2", "response": "I run it on my Surface Pro (original) and it runs great. You should have no problem."}
{"product_id": "B00F27JDY0", "context": "What contents are included in the box?", "response": "Inside the box was the Vita charger, Console, AR cards in one single sheet, and manual sheet in Japanese. That is all I remember I got when I bought my slim Vita from Japan."}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "Just the expansions, not the base game"}
{"product_id": "B008CXTW5G", "context": "What support is there for Mac OS X?", "response": "I do not see any compatibility options for MAC OS online. As a USB 2.0 connection, they are compatible to a certain extent, but are NOT 100% compatible with each other considering the \"WIN\" function that has programmable keys available with Windows software."}
{"product_id": "B003ZSHN0O", "context": "will it work for windows 7?", "response": "Perfectly. Actually is made for win7."}
{"product_id": "B0050SYX8W", "context": "Can you jump into Halo 4 not having played the other games?", "response": "Absolutely. I recommend that you play the story mode of Halo 4 first because this will help you become familiar with the controls. It will also introduce you to all of the weapons and vehicles"}
{"product_id": "B002I096AA", "context": "Can it play regular DS games?", "response": "Yes I believe it can play both DS and 3DS"}
{"product_id": "B0081GA50U", "context": "Does this Work with 2000 series?", "response": "No....because the 2000 is slimmer.... 1000 is fat lol :)"}
{"product_id": "B000H1V56U", "context": "Does this fan have a four pin connection?", "response": "Not sure, mine only lasted about 3 weeks and I tossed it in the trash."}
{"product_id": "B008XHCLFO", "context": "Hello, I have a new Nintendo 3DS (XL) rather than an original 3DS XL. Will this grip work with the newer model?", "response": "They now have one for the new 3DS XL too. I think they have a link at the top to switch between the two versions depending on what you need."}
{"product_id": "B000BIZR72", "context": "The images show menus in a different language. Will the game appear as such or will text be in English?", "response": "I do not know mine was in English. If their was something different my grandson would have said something"}
{"product_id": "B00CX9L30W", "context": "What does the PC Download Collector's Edition come with? I purchased it and I don't see any of the in-game exclusives, nor do I see anything sent .", "response": "Comes with the Baby Behemoth minion, Coeurl mount, Helm of Light, and Behemoth Barding, as well as a Moogle Minion and a Fat Chocobo mount which were recently released. You'll get in game mail, which you have to pick up at a mail moogle that has each item attached."}
{"product_id": "B00AYBKQRW", "context": "Will this remote work with a LG Window Air Conditioner Model LW1210HR?  It looks the same as the original except for missing the Energy Saver button", "response": "Yes it definitely will work"}
{"product_id": "B00IAVDQCK", "context": "Are there over-ear? And how do the build quality and sound quality stack up against a mid-range turtle beach headset?", "response": "They are over the ear and very comfortable. The sound is good but not as good as turtle beach. The headset only produces stero not the surround sound a turtle beach   They are very good for the PRICE.  Could be louder."}
{"product_id": "B00HPU96FI", "context": "My VGA cable doesn't show anything. I can't hear it or see it.", "response": "Same thing happened to me. Returned my cable, but haven't yet ordered a new one. Could not figure out if my tv was incompatible or my cable was defective."}
{"product_id": "B000TK99PS", "context": "Is the game Bump Em on this", "response": "Yes, all the ones I have had, do have that game, I am using the CD for 2008 on windows 7."}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "It will, but you should run it as an administrator, otherwise it will freeze up periodically. As an admin, this only happens once in a while. (Turn computer off when it does, remember anything not saved in the game will be lost). Still worth it, though."}
{"product_id": "B00A8HIGSS", "context": "Is Motion Control required to Play this?", "response": "No it isn't.  However it does make the overall experience a bit better."}
{"product_id": "B007JDMPOK", "context": "Do I have to use the activation code to get the mounts? I was hoping they were seperate codes.", "response": "The mounts are included in the activation code. After activation, you can find them in the Item Claim tab on the in-game menu; under account-bound items. All your characters can use them."}
{"product_id": "B000B78F72", "context": "Do you have to download this game to play or can you take the cd and use it on another computer?", "response": "it is downloaded. I have the same disc downloaded on two different laptops."}
{"product_id": "B00J128FPA", "context": "Do you have to be logged into PSN and what about the game patches issued every two months or so?  Will you get those?", "response": "No, if PSN is down sometimes you can still log in, updates come less often but its fast"}
{"product_id": "B00GPH7Y8S", "context": "Do each of these games have single player options? I ask because IE 5 is required to play each of them?", "response": "Wouldn't know....game wouldn't play sorry."}
{"product_id": "B00A1Y2STQ", "context": "Is this a quiet keyboard or are the keys noisy when you strike them?   Thanks.", "response": "Its reasonably quiet; if your in the room, you'll hear someone using it, but it still has a nice feel."}
{"product_id": "B00FMNNQCY", "context": "Is this controller made by Sony?", "response": "That's right. It is a product that Sony has produced."}
{"product_id": "B00DC7O3K6", "context": "What winter games does it have? Also again can I play wii games on my wii u console", "response": "You can play wii games on the wii u. You will have to save the data from the wii on a sd card and tranfer it to the wii u. Wii u has instruction on how to do it"}
{"product_id": "B001H4NMNA", "context": "Do you have to plug this into the PS3 or can you use a wall outlet to charge the remotes with this?", "response": "Only plugs into a wall outlet."}
{"product_id": "B00G0OYHCW", "context": "Are the games Physical or Digital?", "response": "Both. Like xbox360 you can purchase discs or you can download some games online through Nintendo's estore"}
{"product_id": "B00FQFFQ2Q", "context": "can you make you own cars in this game?", "response": "You can make your own cars for offline play. Online play causes issues with custom cars. Only you can see custom cars. Online playersnormally are relunctant play against custom cars because they cause conection issues during online play. Custom cars are kicked from mostOnline lobby's."}
{"product_id": "B00IYWV5HS", "context": "I have the new Mac Pro.  Could I play this using Parallels?", "response": "if it's powerful enough you shouldn't really have a problem with it. How about you try it out? There's going to be a beta weekend this weekend and you can claim your beta key here:https://www.facebook.com/logitechgaming?sk=app_174961479209942&app;_data=submitted-1if it doesn't run then you will know not to waste your money on it :)"}
{"product_id": "B009AFLXJS", "context": "Does the Wii U Pro controller's analog sticks \"click\" like a button if you press them, i.e. does it have L3/R3 functionality?", "response": "Yes they do..best Wii u controller"}
{"product_id": "B009RXUNZI", "context": "are these compatible with the wii u?", "response": "Yes, they are. They"}
{"product_id": "B00B0QONB0", "context": "Does it comes in Retail Box or bulk ?", "response": "It comes in a white box inside of the box shipped. It is not a x box product but is made to be used in it. Works great. I am very satisfied with this product."}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "The charging base itself just plugs into the wall so you won't need batteries. If you mean for the controllers, It's just the wireless rechargable packs that you can buy at the store, like this one Xbox 360 Rechargeable Battery 2-Pack"}
{"product_id": "B00CXCCH1I", "context": "Can I play this game with someone else not online? like with a second controller (ex. Fifa, COD, NHL)", "response": "Yes ..you can pretty much all games that have on the back logo .. They normally say 1player or multiplayers .. I hope this answers you question."}
{"product_id": "B0076DO5A0", "context": "what are the system requirments on this game?", "response": "The system requirements are:  Windows XP (sp3), Windows Vista (SP1), Windows 7 Windows 8Intel Pentium Core 2 Duo 2 Ghz, AMD Athlon 64 x2 or better2GB RAM (XP) 3GB RAM (Vista/7/8)512MB graphics card, Nvidia 8800GT 512MB9GB free hard drive spaceSound card compatible with DirectX 9.0cDVD-ROM, mouse, keyboardInternet connection required"}
{"product_id": "B002I0F5I2", "context": "When the DLC content codes game expired?", "response": "As far as I know, if you buy the game new it dosn't expire."}
{"product_id": "B00JFPO7JG", "context": "After download the patch to start the program it start but after I hit the play button it turn off or said it can be run. What I need to do to fix it?", "response": "That sounds like it may be Graphics related.  Try updating your video drivers."}
{"product_id": "B004SJFJUA", "context": "Can you play with your 3DS while charging on the base?", "response": "Yes, but confortable? No.You can just unplug your 3DS charger from the base and plug it on your 3DS to charge while playing. (the base uses your 3DS charger)"}
{"product_id": "B004JKZUJI", "context": "does this work well for zelda virtual console games", "response": "sorry i haven't even played zelda yet. i have sooo many nes, sega and snes games and zelda is on my list to play but sorry i couldn't help you with this review"}
{"product_id": "B00IPTUJ8G", "context": "What was sacrificed to place this on the PS-Vita?-  Frame Rate-  Number of Co-op/Multi-Player Users at once-  Image Quality -  Load Timesetc", "response": "I think some of the image quality get compromised, now the bodies explode and don't leave parts like in ps3"}
{"product_id": "B00HGAWFJG", "context": "How high is the ps4 with stand attached (exact figure please)?", "response": "The Playstation 4 mounted on the stand is 11 3/8\" tall."}
{"product_id": "B00GY4OAM0", "context": "is there free roam", "response": "If you man free play yes, but like most of the Lego games all the levels have to be complete for all things to be available."}
{"product_id": "B00004VUFG", "context": "will it work with papyrus nascar4?", "response": "Have not used it on NASCAR4, but it worked on previous versions, so I pretty sure it will."}
{"product_id": "B00004VUFG", "context": "can I use this with my xbox 360?", "response": "No.this is for the pc only"}
{"product_id": "B0041G5SD8", "context": "I HATE STEAM - it is as bad as YELP - is this the only way?", "response": "I could not agree more. STEAM is a useless middleman between you and the game. It rarely works, and is really aimed at the on-line multiplayer crowd. Why game developers like Creative Assembly have adopted it, I cannot say. But it is a requirement, and it is the only way."}
{"product_id": "B0029M6VKA", "context": "Does it work with WOWP?", "response": "All supported games are listed on their website!  :)http://www.naturalpoint.com/trackir/03-enhanced-games/enhanced-games-all.html"}
{"product_id": "B009NQPGOW", "context": "Hello, yes I would like to ask is this a PSP 1000? THANKS !!", "response": "No, it's a psp 3000."}
{"product_id": "B00BY0G0YU", "context": "Any ideas on what the special edition of the game contains?", "response": "Unfortunately, it only contains the game. I feel a little cheated, but at least this version of the game without the extra fluff is cheaper."}
{"product_id": "B00H1FCUBY", "context": "Do these work well for playing video games? Plan to use Bluetooth for music and the 3.5mm jack from the PS4 controller for gaming.", "response": "These headphones work great for listening to music and watching movies. But about playing games it depends on the game you want to play.I tried these for playing counter strike on my pc. But didnt find them great for playing games. I think you should go for gaming headset for gaming if you are a regular player."}
{"product_id": "B005VA5D24", "context": "Do you need a cable to plug it in to the Xbox, or does it plug in directly?", "response": "no  it plug in directly into your hard drive port on the side of your xbox"}
{"product_id": "B008U5ZNIG", "context": "Does it work well?", "response": "Yes indeed it does, my 16 yr old is a computer and gaming geek, he loves it, its very sturdy and worth the money!!!"}
{"product_id": "B0085VIILY", "context": "Does this come with a model plane? because the picture makes it look like that.", "response": "It's not a model plane... it's a plane unlock in the game.  Don't waste your money on this game... it's really not that good.  The stick is not too bad yet not the best I've used.  If you find really cheap then might be worth it."}
{"product_id": "B001AI7CF2", "context": "Can you combine two (2) extension cables?", "response": "Yes! You can combine all four if your heart desires! Just make sure they're secured together tightly so that they don't fall out, and play gamecube from where ever you want."}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "nope, it doesn't. Sorry Andy but No local co-op in this game."}
{"product_id": "B0050SYR74", "context": "Does it interfere with wi-fi?", "response": "I never turn off my receiver and it does not seem to mess with the wi-fi at all so my answer is NO it does not interfere with wi-fi."}
{"product_id": "B009AGXH64", "context": "Can I use the original Wii controllers (The ones that are NOT \"plus controllers\") with the Wii U?", "response": "Yes, Absolutely!  Now I am sure there are some games that you can't, that like require the tablet but each game tells you on the back cover of the box what controllers work with it.  But the system itself does allow classic Wii remote use."}
{"product_id": "B00EM5UFEK", "context": "i have xbox gold live but still cant log on to play garden war fare", "response": "We have had the same problem. I was told that it requires a lot of pull from the internet so if you have a weak signal strength at all then you will have a hard time playing it."}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "no it's not look here http://support.xbox.com/en-US/xbox-one/accessories/controller-pc-compatibility"}
{"product_id": "B0090ECASW", "context": "I'm purchasing this keyboard in the US. Will it be the ISO version or the ANSI version? The pictures in the item listing show both.", "response": "just don buy this keyboard. 300usd  and not mechanical"}
{"product_id": "B00AXI9WFS", "context": "Which system is the best to play infinity on ?", "response": "We use it with Xbox 360 and it's great!"}
{"product_id": "B00BM7NXMW", "context": "does it need batteries? Mine just \"Went off\" and I don't know what to do", "response": "It does not take batteries. If its not responding its most likely that either the mouse itself is broken or that there as an issue with the USB port or PC"}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "Actually, I'm selling this bundle with the actual physical copy of the game, and not the DL code"}
{"product_id": "B00IAVDPSA", "context": "Does the remote stay \"on\", or will it shut itself off like the controller?", "response": "It will shut itself off in a few seconds!"}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "Because that stupid Nintendo has region lock on all their game consoles. That means different region console can only play that region version games."}
{"product_id": "B005LN5UOC", "context": "Is it compatible with the PS4?", "response": "Yes but it is only capable of chat functions."}
{"product_id": "B00FXOP1JI", "context": "Does this come with the ac adapter?", "response": "Mine did as it was new in the box. Hope this helps."}
{"product_id": "B002I0GF72", "context": "This or Super Smash Bros?", "response": "Both games are excellent.  They are totally different kinds of games.  If you are a solo player get zelda.  If you like to play with friends get Smash.  Also, although a very good game, zelda has low replay value compared to smash."}
{"product_id": "B00ICWO0ZE", "context": "Can you download to WiiU console?  Our disc keeps freezing up.", "response": "I don't think you can. Your wii probably needs to be shut down or reset. When you open the cover there should be a red button just push it and it should reset the console. It shouldn't delete anything. If not then the disc needs to be cleaned."}
{"product_id": "B0080CE2WC", "context": "mine blinks red when I plug in any controllers.  What does this mean.", "response": "Lighting up red is charging. Blinking red means bad battery pack."}
{"product_id": "B003NSLGW2", "context": "Will these still fit snugly and not slip off easily if the original joystick cover has completely come off?", "response": "Yes. Pretty good item, nice and easy to install."}
{"product_id": "B0094X28J0", "context": "Is this the motion plus, just incorporated right into the remote?", "response": "Yes. I use it for tennis, baseball, golf, & bowling."}
{"product_id": "B00H1FCUBY", "context": "How is the battery life on these headphones?", "response": "You can listen to music or your videos basically for a whole day. The sound is pretty decent."}
{"product_id": "B0017TFLBQ", "context": "Is HOMM3 compatible with Windows 7 ????", "response": "Yes i am running it on a windows7 laptop, at sometimes it locks up but this is not very often"}
{"product_id": "B008CP6MA2", "context": "So what is this exactly? A disk per game? Everything has to be downloaded? I´d like to know if all of the games are included or not", "response": "Is one disk for games 1 and 2, other disk for game 3, the other two games are download able with a code inside the case."}
{"product_id": "B00DLRLDBO", "context": "Does the headset acutally connect to an Xbox 360 controller? For chat?", "response": "we have the ps3 and it connects directly to our ps3 box"}
{"product_id": "B001MGNWDI", "context": "Is this stick durable? Can it tolerate stressful actions  like, trigger pulls under duress or a high anxiety turn?", "response": "You cant be a true tryhard with this joystick. The biggest problem you'll have is with your \"high anxiety\" turns due to the base not being weighted, the whole stick will likely flop over."}
{"product_id": "B00CHYOP80", "context": "is the material on the earcups synthetic leather?", "response": "It is synthetic, very comfortable after several days of breaking them in."}
{"product_id": "B00AJXEYOG", "context": "Do you have a list of games", "response": "100 Ladies,Billy Goat Bucks,Boingy Beans,Bean to Be Wild,Blackbeard's Doubloons,Bonus Bubbles,Cougarlicious,Crazy Chameleon,Diamond Jubilee,Frantic Antics,Miss Red,Whale Song,Wild Red Sevens,Win Zeroes!,Blue Blazes,Winning Colors!,Red White&Blue;,Wolf Run 2 Into The Wild"}
{"product_id": "B00DRKJBC8", "context": "can you use a controller (xbox360) or do you have to use the computer keyboard?", "response": "Xbox 360 controller works well for me (using win 8)"}
{"product_id": "B001E93IWI", "context": "Can it be used on pc>", "response": "No this is plugged directly into the bottom of the Xbox 360 controller only."}
{"product_id": "B0086UK7IQ", "context": "Is this mouse ok for smaller hands? Mine are, and though it's hard to tell from the photos, it looks rather large...", "response": "Definitely! I have small hands and it fits very well! I definitely recommend it for small hands!"}
