{"product_id": "B007SRM5MO", "context": "Is it worth it to get the Game of the Year Edition?", "response": "Definitely. It adds a lot of playability to the game, definitely worth the extra few dollars for all you get!"}
{"product_id": "B002YVD3KM", "context": "Will this make me have to remap my emulator's input options because the controller uses joystick buttons, or does it activate keys on the keyboard?", "response": "You will have to remap the settings in the Emulator as it reads it as joystick buttons."}
{"product_id": "B007SRM5MO", "context": "are this games safe for kid 14 yrs old", "response": "There is a lot of violence in this game, but no blood. It's mostly hand-to-hand combat. I believe it's okay for kids 14 and older."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "No it can't because it has a different output"}
{"product_id": "B004HYK8Y8", "context": "The latest patch solve the problems that cause so many 1star ratings? All the glitches and save size problems?", "response": "I've never had a single issue with the game. This is with months and months of nonstop playing. Nothing to worry aboot."}
{"product_id": "B00CRL9TU2", "context": "I recently had to give my GT5 disc back to my friend and was wondering if GT6 was worth the extra 20 bucks. And is it more realistic then GT5?", "response": "Yeah its more realistic then gt5 I would spend the extra 20 bucks"}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "sadly this is not. if you looking for free scroling get Logitech G502"}
{"product_id": "B007SO6USW", "context": "does it come with a battery pack for the controller?", "response": "No you have to have the rechargeable controllers already. This is just like the cord but two spots for the controllers to sit in. I wouldn't get it though. Mine was a POS. I just threw it away"}
{"product_id": "B002I0K6X6", "context": "Is it best to have two move controllers, or one controller with this move navigation controller?", "response": "That depends on the game you are playing."}
{"product_id": "B004CFASL0", "context": "How does the billing work?  Is it monthly,every 3 months.  Please let me know?", "response": "You buy the game outright from amazon.  It is not like the other game companies that charge you every month."}
{"product_id": "B006JKARP8", "context": "Can't charge this because I have a vita 2000 and had to buy a separate cable for it. Does anyone know a way to make it charge?", "response": "the ac charger that comes with the original ps vita will charge the portable charger."}
{"product_id": "B00BS520SG", "context": "Does this work with the Wireless Wavebird controller? I've seen some ppl say yes, others say no. If you have TRIED YOURSELF, let me know the answer.", "response": "I have done this and yes it does work, but I notice that the adapter for the wave bird tends to fall out. So it does work as long as it stays in."}
{"product_id": "B0089OBLDO", "context": "I just want to confirm,  I want to use my xbox 360 controller on ps3, and I want to use this wireless,  this should be no problem right?", "response": "As far as I know, the xbox 360 needs to be wired"}
{"product_id": "B000SOYG8U", "context": "Lot of the reviews said it was just the original game, but you stated it was the Gold Pack .Is that true?", "response": "Yes..I ordered and received the Gold pack"}
{"product_id": "B005BLAJ68", "context": "can you play off line without Wi-Fi or internet?", "response": "Yes. With the board games such as chess or backgammon, I do all the time. Enjoy!"}
{"product_id": "B00ERDGMT4", "context": "Is the DLC included on the disc or does it have to be downloaded?", "response": "The DLC is included on the DLC install disc. There are however additional updates that you can get when you connect to Xbox Live."}
{"product_id": "B0091A3AHA", "context": "And what is the hook up. Is it the red,white,yellow thing or what?", "response": "Its a 6 inch HDMI cord and not a composite cable a.k.a red,white, yellow thing (winks)"}
{"product_id": "B00475AYUA", "context": "Are the expansion sets already installed when you open the game or do they get launched independently?", "response": "It's been awhile since I've played but I'm fairly certain they're opened independently."}
{"product_id": "B00FFL0T46", "context": "Is this for the whole series or just for the first 2 episodes?", "response": "It's for the first season. If you purchase this for $24.99 your paying $4.99 for each episode. There are 5 episodes per season. So your paying for Ep. 1 through 5. So yeah, pretty much all of the first season."}
{"product_id": "B007R9PWLY", "context": "I am buying a laptop with a 1 tb hard drive and 8gb solid state. In this configuration is the OS put on the HDD or SSD?", "response": "It's on the SSD."}
{"product_id": "B003NSLGW2", "context": "Do these work perfectly on PS3?", "response": "I use them for the PS4, and I have not had any problem..I'm sure they will work well with PS3 controllers"}
{"product_id": "B002I0GF72", "context": "Is this the same game as Majaras Mask with better graphics or something. Its hard to tell looking online everywhere", "response": "No this is it's own game. My husband has all of them and he had a great time with this one as well."}
{"product_id": "B005L38QK2", "context": "Are there more buttons on the right-hand side of the mouse or just the two on the left that are next to where the thumb rests?", "response": "The mouse is ambidextrous so there are 2 buttons on the right and 2 buttons on the left for both left and right handed people"}
{"product_id": "B003O6C0V4", "context": "Do the accesories that come with this game work with the first Active game?", "response": "The sensors used for this are exactly the same as those in the first Active as well as More Workouts. I have all of them. They all work."}
{"product_id": "B0091WIOJ2", "context": "Does this headset offer surround sound? Also, how long does the battery last on a full charge?", "response": "Yes it is surround sound. And I'd say the battery will last me a good 10-12 hrs of straight usage time."}
{"product_id": "B00FKV8AK6", "context": "i have never played Halo before, is this first person shooter?", "response": "Yes. its amazing game."}
{"product_id": "B00EI4V3X2", "context": "Can you let ME know what kind of (Headset) I have by this Information here:**Model:TB300 3276-01(?) ;**FCC ID:X4B-TB2278(?) ;**S/N:G3276D3702106(?)", "response": "It is the turtle beach px4 headset"}
{"product_id": "B00AJXEYOG", "context": "Can you run this game FULL SCREEN (not windowed)?", "response": "no it is not full screened.but it is still a blast ,,they set it up like a casino..now kitty glitter is full screened and also hours of fun and you dont need facebook to use it..."}
{"product_id": "B008CXTW5G", "context": "What support is there for Mac OS X?", "response": "in short the answer is....it doesnt matter. the keyboard is junk. pass it up and find something better for the money."}
{"product_id": "B00CJ7IUI6", "context": "I want to buy this for a friend who wants to play Skyrim with DLC's but cant access PSN will he be able to use the DLCs? without internet??", "response": "I believe the DLC is located on the disc already. It takes awhile to download though."}
{"product_id": "B00AIALGZK", "context": "is this download the full game or a free trial", "response": "Yes, and the game is a real butt kicker. I really enjoy it. I am not a kid I am 70 years old."}
{"product_id": "B00FLLFJ68", "context": "Is there anywhere to get another dongle? I lost one and need two for my two controllers.", "response": "Actually, I just had this problem, wrote to Nyko customer service online, and they sent me two new dongles for FREE right away."}
{"product_id": "B00AYBKQRW", "context": "I have a lg mini split model number m122cd i dont have the remote can this remote work? just want to make sure it is compatible", "response": "I am not sure but I would suggest you call LG customer service"}
{"product_id": "B00GZ1H07Y", "context": "How good is the flipper action w/ PS4 controller? Does anyone have experience using on other platforms & if so would you say PS4 has the best feel?", "response": "This doesn't work fast enough on the PS4....the flippers are delayed so you need to anticipate what to do and it's not fun."}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "Yes it is really. Once you download it you have to go to Steam to enter the code and start it up."}
{"product_id": "B005CELN8W", "context": "Does this play on my ipad", "response": "No it does not because it has a disc that u down load onto your computer"}
{"product_id": "B003ZJ1VD8", "context": "What colour is the back light?", "response": "There is no light on this model"}
{"product_id": "B0090WBXSM", "context": "Does this work with the Fire Stick?", "response": "With the Fire TV box, it worked with directional arrows but it wouldn't let you select anything. It stopped syncing almost immediately.  It looks great but I don't think it was made for this interface. Save your money."}
{"product_id": "B000B78F72", "context": "Does it have tripeaks", "response": "It has a game called Triple Peaks."}
{"product_id": "B001FBHT34", "context": "does it work with ps3", "response": "have not Tried it on my ps3 yet but i am sure it will work wonderfully! but i will test it out and let you know."}
{"product_id": "B003VAHYQY", "context": "DOES IT WORKS WITH A MAC???", "response": "I don't believe it may fully wotk out of box but a quick search yields this thread which may be worth a read:http://forums.logitech.com/t5/PC-Gaming/Gamepad-f310-Mac-Compatibility-how-to-install-on-a-Mac/td-p/529274Some folks seem to have workarounds but a Mac might not read the X-input format, only traditional direct input. In other words you may be able to use the controller in one mode but not the other."}
{"product_id": "B006W3ZXEW", "context": "Can the buttons be used to bind any sort of macros (shift+F1, etc) or can they only switch between 1-6 and numpad 1-6?", "response": "It can be used to any sort of macros, like you say the shift+F1, I special try to do it. But you need to install the Razer synapse 2.0."}
{"product_id": "B002RRLQIO", "context": "Does this keyboard use Cherry MX keys and if so which color?", "response": "No it's not mechanical, just a regular gaming keyboard but ive used it for almost 2 years and its still going strong for me in ways similar to that of a mechanical keyboard"}
{"product_id": "B00GQTZ8TM", "context": "I bought one a while ago for my brother and it didn't come with a charger. I'm assuming that this one does, correct?", "response": "Yes it came with a charger."}
{"product_id": "B00576U8CC", "context": "I realize that its an MMO, but do you need a Gold membership on Xbox live even if you just want to play single player? Is there even single player?", "response": "In order to even play the game on single player, you must have an XBOX Live membership. The game is useless to anyone without an XBOX Live membership."}
{"product_id": "B00HPU96FI", "context": "I have one question.  I get video from this cable, but no audio at all.  Is there any way to get sound from this cable when it's plugged in?", "response": "I didn't have any problem getting audio from the two RCA outputs...how do you have it hooked up?"}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "Yes ma'am, if you buy the 12 month subscription, the day you enter that code will be the same day next year it will expire."}
{"product_id": "B00A8HIGSS", "context": "Are the menus put in english too, or just subtitles?", "response": "All english or how would you start properly."}
{"product_id": "B00919RM1Q", "context": "Can this verison be used on Windows8?", "response": "Yes, it loaded fine on Windows 8!"}
{"product_id": "B00E1L786S", "context": "does it come with or is it wall mountable?", "response": "It has feet at the bottom to allow it to sot on a table, but it does have portrait slots on each side to allow it hang from the wall like a picture"}
{"product_id": "B009XZ1CTQ", "context": "Will the physical CD version work for Windows 8?", "response": "Yes it will.  No problem."}
{"product_id": "B00B67ZTUW", "context": "Is there any option to set this game to Japanese language with English subtitles?", "response": "Unfortunately, no. There is no dual-audio version of this game, and the original Japanese version does not have English Subtitles. There have been many fans of Tales games that have asked for this to happen, but as of yet, it hasn't."}
{"product_id": "B0089NVTDM", "context": "Will it work on a Mac?", "response": "Yes sir. I use it with my MacBook"}
{"product_id": "B00DJYK9L4", "context": "What controllers are supported?", "response": "The Remote Controllers which one must buy separately"}
{"product_id": "B00B1VJZO4", "context": "The installation is not working !!!!!!! It says that you have to have sims 3 installed before? WASTE OF MONEY", "response": "Yes, you have to already own the Sims 3 core game. This particular game is a expiation pack."}
{"product_id": "B0088MVODO", "context": "if I buy the anthology on ps3 does it work on ps4?", "response": "As far as I know ps4 is not backwards compatible at all. Thats why is you bought call of duty or battle feild 4 you could by it for ps4 for 10 dollars.Either way by it new your getting like 6 games it's worth it if you have a ps3"}
{"product_id": "B00GY4OAIE", "context": "Why did this product come in a paper sleave instead of the protective plastic blue ray case?", "response": "Sorry I think this person received these for promotional purposes."}
{"product_id": "B002I0J5CO", "context": "Does this headset have a button to mute the microphone? If so where is it located?", "response": "Yes it has a mute switch next to volume control."}
{"product_id": "B004FS8LYK", "context": "Hi, is this compatible with ps4 console?", "response": "Only the definite edition is for ps4 which is pretty much the same game. I only noticed slightly different graphics and facial features really."}
{"product_id": "B002BSA20M", "context": "can i multiplayer on halo reach", "response": "I multiplay on this game as much as time permits. It's a great game I highly recommend it"}
{"product_id": "B00FATRKOK", "context": "Can I buy this machine and related games in US and play it in Hong Kong?", "response": "You can, BUT you will have to buy a different power supply. I bought a 220v power supply through Amazon for about $23.  The power supply that comes with the US version is only for 110v."}
{"product_id": "B00EZAWV6W", "context": "So, is it possible to play against the computer only, or are you always playing against other people online? (I know nothing about shooter games)", "response": "Can both my son & daughter play a 2-person game (at the same time) on the same computer?  If so, what do I need to do to make this happen?"}
{"product_id": "B00519C7CE", "context": "is this a digital download for xbox 360? i wanna play today, but i dont wanna wait for shipping.", "response": "It was bought for my grandson. It was the actual game"}
{"product_id": "B007VTVRFA", "context": "If i buy this off of Amazon can I play multiplayer with friends who buy it through EA?", "response": "Do you need the disk in to play or does in run of hard drive like an older version like 2000?\""}
{"product_id": "B009JZ04BC", "context": "Where do you install the application for the mouse? To change colors?", "response": "You install it on your computer, you can download the program off the website, it's very simple to use."}
{"product_id": "B00BZOBE78", "context": "do you need the original Civ V to play this?", "response": "Yes. You need th original Civ 5 to make this work."}
{"product_id": "B00E447L8C", "context": "1) How long does it take to fully charge this on the computer?2) How long does it then take to fully charge an iphone?", "response": "I charged mine with an outlet...not computer..took a couple hours. And I only used it until I could get my phone or iPad to a regular charger"}
{"product_id": "B007VFHIHA", "context": "can you play this game without the internet and do you get disc & software package for disc?", "response": "I loaded the game from the internet and can play without the internet."}
{"product_id": "B00GU8W5AE", "context": "How clickable are the 12 side buttons on a scale from 1-10", "response": "100000 i love them so much.. they take a bit to get used to but after that its all golden, they are a bit small.. not really suited for big big hands."}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "Yes, you can hear all apps and tv."}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "If your son has the Wii, there should be four controller outlets on top of the device, under a plastic cover. If he has the wiiU, the controllers are NOT compatible."}
{"product_id": "B000B78F72", "context": "Mainly want simple Spider Solitaire for WIndows Vista - will this suffice?", "response": "Yes. It has several spider games and lots of others. I love Pretty Good Solitaire."}
{"product_id": "B002BRZ9G0", "context": "when was this game released?", "response": "I don't know, I got it about 8 months ago. Sorry :-("}
{"product_id": "B00CQ9L1Z6", "context": "Can you get legendary pokemon like mew in Pokemon y", "response": "yes you can get any Pokemon except Hoopa, and the other two the aren't released yet"}
{"product_id": "B004RMK5QG", "context": "When does the year starts running? When I buy the card or when I redeem the code on the PS4?", "response": "When you redeem the code on the PS4"}
{"product_id": "B00CMQTVK0", "context": "Hello is this item works with 220 v Electrion or 110 v help pla", "response": "Yes 110v for U.S. and between 200-240v for Europe."}
{"product_id": "B004S5PBM0", "context": "Can you use a hollow body electric/ electric acoustic?", "response": "We are not sure-sorry!"}
{"product_id": "B001CXYMFS", "context": "Does it work with Windows 8 and 8.1?", "response": "I am running it on Windows 7, so I would think it would run on Windows 8. But I can't give a definitive answer."}
{"product_id": "B00GOOSORM", "context": "do u need it if u buy the ps3game", "response": "It's a game time card for the whole service. Doesn't matter what you play the game on. You could also go to the moghouse and pay for time there. The mog house is where you access your ffxiv account."}
{"product_id": "B0087ZMATE", "context": "Are these loose on your head?", "response": "Yes they are. If i tilt my head down they fall off quite easily."}
{"product_id": "B00IIHU44E", "context": "I want to know if NSA could spy inside my home thanks to the Kinnecht apparatus. Thanks.", "response": "Yea dude your so important and smart in the world that they are watching you. The tv provider sends them what you watch so they study your habits. And your phone records you in your house!"}
{"product_id": "B002BS47JE", "context": "will this system work with a U.S. purchased sysyem. thanjs", "response": "It should, I use a U.S. purchased system."}
{"product_id": "B00F9RGFEY", "context": "This does come with the USB light up device just like the regular prismatic headphones? Or does the tower replace that?", "response": "It comes with a light up tower"}
{"product_id": "B0088MVODO", "context": "are these the games?", "response": "No, it's just RE 6"}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "Probably you need to register (pair) the remote control with your PS3. Follow the instructions on the remote control manual."}
{"product_id": "B004774724", "context": "I accidentally bought the wrong one, what should I do?", "response": "go under your orders click on return or replace items.  click return times and a list of the things you bought recently will come up. select the item you need to return or replace and a manger will walk you through the steps."}
{"product_id": "B000AOJ7FK", "context": "Is this game legit, like when you buy it you can download it and play? this is not a scam right?", "response": "Pretty much the only thing being sold here is the KEY for this game. This is not a scam if you buy it NEW! DO NOT BUY IT USED! I would recommend you buy this game off steam thought download Steam find the game and purchase it digitally. http://store.steampowered.com/"}
{"product_id": "B0094H8H78", "context": "is the screen backlit? In other words will I be able to play the games in a dark room?", "response": "Yes. It is like a mini lcd screen. Very good picture quality. Something is off about the sound or the speaker."}
{"product_id": "B0088MVODE", "context": "Is this edition fully physical or just download codes?", "response": "RE6 is a physical game along with the DVD, but the other games (RE:5, RE:4, RE:code veronica) are codes. I loved it but I am a die hard fan. Wish playstation would have given the rights to RE:1, RE2, RE3, but oh well take what u can get."}
{"product_id": "B00ATF5YYI", "context": "does the PC download work on mac", "response": "It wouldn't work for me on Windows 7, couldn't get any tech help either.  waste of money!!!"}
{"product_id": "B0081Q58AW", "context": "Is this a physical disc, (for those of us that don't have the fastest dsl, in which the download would take a day)?", "response": "It's a number of discs for installation. But I'm not sure, at least for pc, if they're selling them with the new free to play. Haven't seen it at Wal-Mart in a month. But if they do it gives an activation code so you can play the game"}
{"product_id": "B003981JQ4", "context": "does it come with pen and stilisis ?", "response": "I don't recall any accessories coming with the case."}
{"product_id": "B00D96BJSO", "context": "Will the headset work? Im using a monitor (HDMI-DVI) instead of a TV and I'm getting sound from pc speakers through S/PDIF rather than from a TV.", "response": "Yes it should. The Xbox wirelessly sends the sound through to the adapter and into to the headset, so it shouldn't matter what kind of screen you are hooked up to."}
{"product_id": "B00FEOR4MY", "context": "Will the DS fit in this?", "response": "The DS would probably fit to carry around, but you wouldn't be able to play it in the case like the 2DS in the picture."}
{"product_id": "B007WPM9GO", "context": "Does this one fit the Nintendo 3ds XL??  Please help", "response": "Sorry, but I don't really know."}
{"product_id": "B006NU6HAS", "context": "Does this stand on its own or is this an addition to Flight simulator X", "response": "It's an addition to the Microsoft Flight Simulator X"}
{"product_id": "B008CXTW5G", "context": "does it have any warranty? I bought it several months ago, but my W is becoming more and more insensitive..so ..", "response": "It should have a one year manufacturers warranty.  Get on the website and get a hold of somebody and you can probably prove your purchase through your amazon emailed receipt."}
{"product_id": "B00CMQTVUA", "context": "Hi, Can I use this in India?", "response": "Yes you can. I have bought it from amazon. Do remember to buy a power converter of 220V... Best of luck.. :)"}
{"product_id": "B009GZX49Y", "context": "So you have to download two of the games to the HD to play them but is that from the disc or online like a DLC?", "response": "They install from the disc, but  you still have to have the disc inside the PS3 to play the games. All 3 games are on one disc, brotherhood is the only game that can be played straight from the disc."}
{"product_id": "B00BA9AWTO", "context": "I installed on my other computer and was able to do something so that I did not have to have the disc in. Can't remember what the secret was. Anyone?", "response": "Perhaps your other computer was equipped with a virtual drive program."}
{"product_id": "B00GPH7Y8S", "context": "When you got this did it come with 2 CD's?? Mine only has 1.", "response": "Mine came with one.Tthe game was so terrible i returned it. The game lacks realism and is for kids. Worst game I ever attempted to play in my life."}
{"product_id": "B002Q4U5DK", "context": "Does the LED light always stay on? Is there a way to turn it off?", "response": "WARNING: This mouse is a counterfeit reproduction of the Razer Deathadder! This product is not legitimate and cannot be officially registered with Razer Support."}
{"product_id": "B00EV4O8VS", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "It's the standard battery, but it lasts a good amount of time. Unless you're going to be playing all day without a break, it should be plenty. Also, are the extended replacement batteries even out yet? I was under the impression those haven't been released yet (as of this writing)."}
{"product_id": "B00FKV8AK6", "context": "Is XBox live (or internet connection) required to play?", "response": "It's not required to play, however; there will be a few options you wouldn't have access to."}
{"product_id": "B008IYCVK2", "context": "If this is just a game code for steam, does that mean it can be played cross-platform on PC and Mac?", "response": "Nope. It's a game with 2 CDs to run on PC under steam and not a game code. I hope it helps and good luck with this awesome game!!!"}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "There is a side panel. on the right side of your Xbox there. is a tab to push it should. pop up. A section. and power. off xbox insert. drive replace panel dlb."}
{"product_id": "B003O6C0V4", "context": "Has anyone actually been able to create a user account on the WII?  Each time I try the game informs me that the EA servers are down.", "response": "No, I haven't. I've been trying since I bought it several month's ago but it's never connected. I get same same error message."}
{"product_id": "B000FRU1UM", "context": "Hi, this could not be loaded in XBox360. It stated region code error. How can I fix it?", "response": "Cecilia I wish I could help,but this was a gift for our Grandson who lives in Tennesse and we live in Plattsburgh New York,I am not a gamer and he is on the go all the time ,so I don't hear from him."}
{"product_id": "B004JKZUJI", "context": "i have recently downloaded the classic game of mario golf on my wii. Do you know if this wii classic controller works with my wii mario golf 64?", "response": "I have not played Mario golf it dos work on Mario racing games  just fine"}
{"product_id": "B00CX8VY4S", "context": "Is there anything included in the box that would discourage buying it used (Xbox One version)?", "response": "No. The box includes a pamphlet that has information about uplay but nothing important."}
{"product_id": "B001NXDBI6", "context": "Is there anyway to use the usb 2.0 ports to make this a wireless keyboard?", "response": "Not sure what you even mean by this, but the keyboard actually requires a power source so no."}
{"product_id": "B00FM5IY38", "context": "How long did it take to install yours? Mine's going on 5 hours, and it isn't installed enough to actually start a game.", "response": "for all xbox one games go to xbox one settings, network then click go offline and all games install faster however when you enable this again youll have an update for the game but its still faster to install"}
{"product_id": "B00BXONG7G", "context": "Can you activate this via: Steam?", "response": "No, only by Origin"}
{"product_id": "B00D78Q4UM", "context": "Is the palm rest removeable?", "response": "Yeah it is, but I found it to be quite a bit more comfortable with it on."}
{"product_id": "B001CXYMFS", "context": "how does this stick work playing elite dangerous? any suggestions if this one isnt very good for the game?", "response": "I bought this for my husband as a Christmas gift, he has only used it a 2 or 3 of times, so I don't suspect he is very fond of it. I'm sorry that I don't have more information for you."}
{"product_id": "B00DLDEKOK", "context": "can this display volume", "response": "It has a volume conto on the cord. Slider wheel."}
{"product_id": "B007WPM9GO", "context": "Do these cases fit the DSi XL?", "response": "Yes it does fit ds I xl"}
{"product_id": "B009NQPGOW", "context": "Hello, yes I would like to ask is this a PSP 1000? THANKS !!", "response": "It's actually a 3000!:)"}
{"product_id": "B00GZ1H07Y", "context": "How good is the flipper action w/ PS4 controller? Does anyone have experience using on other platforms & if so would you say PS4 has the best feel?", "response": "Ive only played this on PS4 and PS3.  Not too sure what kind of answer you are looking for though, you press the button and the flipper flips.  I think everything about the game plays great."}
{"product_id": "B007LQG9A6", "context": "is this remote fake or really from microsoft?", "response": "Yea this controller is definitely a third party controller. To be honest I bought this because it was cheap but for some reason I kept getting shocked by the controller. Eventually it was unbearable and persistent to the point where I sent it back and just bought a microsoft controller. No complaints since then."}
{"product_id": "B0047ERZ7Q", "context": "is this an actual psp player or an accessory?", "response": "It is an accessory. It is a camera that attaches to the top of the actual PSP player. I personally did not like this product. I received a defective one. The latest model of the PSP is the 3001 slim type the into your search bar."}
{"product_id": "B00J128FPA", "context": "What  is the size of the packing on this edition?", "response": "This is the best answer The box of the actual game is 11 x 8 inches. It came in a box 17 x 16 inches. Depth of about 2 inches for both.Keith C. answered on October 3, 2014"}
{"product_id": "B0050SYK44", "context": "Is this game enjoyable to play as a single player game?", "response": "It has only been played as a single player game in this household and it is extremely fun to play in that format.  I won't be playing it any other way."}
{"product_id": "B00BCEK2LA", "context": "How big is the mouse.  I don't care about the size of packaging.", "response": "The mouse is about as long as a cellphone, but when you put your hand over it to use, it fits nicely in your palm and all the buttons are in a good position to reach with ease."}
{"product_id": "B00E88G054", "context": "How is the packaging? does it come in the original box and would it look presentable as a gift?", "response": "It comesin original box. It is imported so it does have chinese writing on the box. Ive had mine for about a year with no issues . Only con is the blue led lights do not have an on off switch. Great on the fly sensitivity adjustments."}
{"product_id": "B009AFLXJS", "context": "Does the Wii U Pro controller's analog sticks \"click\" like a button if you press them, i.e. does it have L3/R3 functionality?", "response": "Yes they do click. They do have that functionality."}
{"product_id": "B000IBELZG", "context": "!! can this thing really record videos???", "response": "can this thing be used in skype video chat?"}
{"product_id": "B00B1VJZO4", "context": "Is this an expansion pack? do i have to buy sims 3 first before i get this?", "response": "It is an expansion pack, so yes, you need the Sims 3 first."}
{"product_id": "B006IOAHPK", "context": "Is the case red or white?", "response": "Mine was white, no manual, perfect condition"}
{"product_id": "B000PD0HQE", "context": "will i need to buy a built in wifi device for this console?", "response": "Yes, this model does require a Wifi Adapter to use wifi. The xbox 360 slim has wifi built in."}
{"product_id": "B00EZKNT18", "context": "I see that it works for PC but will it work for a Mac computer?", "response": "You'll need a driver, but yes. Works fine."}
{"product_id": "B000R0SRNU", "context": "why are you advertising this as an xbox 360 game when in reality its an original xbox game?", "response": "Yeah - I bought it as an xbox 360 game and have played it on my 360"}
{"product_id": "B003VUNWG0", "context": "it wont download on my windows 7", "response": "I have never gotten it to work on windows 7. The software does not work on 7 only on older versions.  I bought this version specially to work on win 7 and it doesn't."}
{"product_id": "B003O6JLZ2", "context": "is the controller wireless?", "response": "yes it is wireless"}
{"product_id": "B00DPQ6GPO", "context": "Can all those mods work for online if it does i will buy it then just want my question answer", "response": "It's works in multiplayer. Add me if you need more information Poseidon_IV"}
{"product_id": "B00CXI0BPG", "context": "Does the logo glow all the time, or can it be shut off?", "response": "All the time, its not too bright though"}
{"product_id": "B00GD962OA", "context": "how many GB IT HAS??", "response": "8 GB, but only 3 are usable for games. The other 5 are used by the OS and updates."}
{"product_id": "B00ECOAX34", "context": "How does the game look on the Wii U compared to the PS4? I have both systems and am having a hard time deciding which to get", "response": "There is a very little noticeable difference, but the game is more interesting to play on the wii u. And also you hace the option to use the game pad as a standalone console."}
{"product_id": "B0050SX9I2", "context": "will this remote control a regular sony blu ray player? a bpd-s5100 to be exact?", "response": "Sony tv and playstation 3 only will not control other Sony blueray players has Bluetooth in remote for ps3 and ir for tv control"}
{"product_id": "B003O6CB6S", "context": "hi, i would like to know if it comes with subtitles in Spanish, thanks for your help.", "response": "Not that I know of.  English is the language of the creators, and the characters in the game.  Maybe there is a version somewhere in a country whose primary language is Spanish, otherwise, you will figure it out eventually"}
{"product_id": "B00FQFFQ2Q", "context": "What if my disc is scratched when I get it?", "response": "One of two things. Call Amazon and let them know. They have one of the top services in business in my opinion. Or you can try the old toothpaste(white paste only) trick. Rub it on the disk then clean it off. I've been successful on DVD's, never tried game."}
{"product_id": "B0050SY4DG", "context": "This game comes with multi idioms included spanish?", "response": "If you mean can you change the subtitles to Spanish then yes I believe you can"}
{"product_id": "B00FE8WKMO", "context": "Does the Wii balance board work well on carpet?  I notice all the pictures show it on hard surfaces like wood, tile, etc.", "response": "I have mine on low pile carpet and it works ok for all but the weight. I noticed mine jumped around from day to day with it. I would check on bathroom scale and it would be off from wii fit. I finally put mine on a board to get a more acurate set of weight in the program."}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "As long as you log in your US PSN account on your PS4, you can redeem the code from a different country."}
{"product_id": "B004XIQN3I", "context": "will it work on windows 7?", "response": "I tried the game on windows 8, it works well depending on the computer. A bit hard to control at first but fun when you know how to work everything."}
{"product_id": "B00GANWVJE", "context": "Is it different enough from ALTTP to where I won't feel deja vu?", "response": "It is different but at the same time its way better!"}
{"product_id": "B00JB4WHWU", "context": "Is this a physical package that is actually shipped or just the code that will be received via the downloads tab or email?", "response": "You get a physical package BUT the game itself is sold separately."}
{"product_id": "B007MM9E42", "context": "What controllers are needed? Do I need the classic controller or will the regular one and nunchuk work fine?", "response": "I believe it's the regular controllers."}
{"product_id": "B00FQFFQ2Q", "context": "Is this a multi player game?", "response": "It is a multiplayer game"}
{"product_id": "B00F8W9SWQ", "context": "Can you see the keys clearly with the back light off?", "response": "Yes, absolutely.  With the backlight off, it is just like any other keyboard.  The characters are clear and a good size."}
{"product_id": "B0086V5UF0", "context": "will it work in europe?", "response": "I don't know. You might want to contact Nintendo and ask if the U.S. programs are compatible with Europe."}
{"product_id": "B00EV4O7B4", "context": "Does this come with X & Y games as well as the 3DS?", "response": "No it does not."}
{"product_id": "B00GJSUUC0", "context": "Is Phantom Pain included? What does unlock bonus MGS V Phantom Pain with Ground Zeroes means?", "response": "Nope. Phantom Pain is not out yet. The bonus in this game is a Phantom Pain's trailer only."}
{"product_id": "B001CXYMFS", "context": "Does it work with Windows 8 and 8.1?", "response": "It does, indeed. I got it for my PC that runs Windows 8.1, and it works great!"}
{"product_id": "B00DHUUTEM", "context": "what type of mechanical keyboard is it? black cherry, blue, brown, etc", "response": "It's black with blue led keys."}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "No clutch pedal - what are they thinking?   If you want to drive a manual transmission, that clutch pedal is needed.  Otherwise, this is all for simulating automatic transmissions."}
{"product_id": "B00FLLFJ68", "context": "Is there a way to hang it or attach it to the wall?", "response": "No. The way it's designed the controllers fit onto it and would slide out if it were attached to a wall."}
{"product_id": "B00AYBKQRW", "context": "I lost my remote and my LG unit is 9000 BTU'a model number LP0910WNRY2 ...will this one work for that?", "response": "Yes same remote for all btu"}
{"product_id": "B007MM9E42", "context": "Can you play this game with two paintbrush controllers ? The clicker is very expensive and not very good.", "response": "You can play with the two without problem, buy the two makes the children adapt, but his character"}
{"product_id": "B00BGAA3S2", "context": "Which the contents of the pack? Comes with the support?", "response": "Could you rephrase your question?  That doesn't make any sense.Its a camera for the ps4.  Plug and Play."}
{"product_id": "B00E6OLJ88", "context": "will this work on gotham city impostors?", "response": "If it is a first person shooting game then yes mostly on a  pistol"}
{"product_id": "B00BI9MDSO", "context": "soooo, my new Vita Slim PCH-2001 won't fit in this case? Thanks.", "response": "No. It wont fit"}
{"product_id": "B002W8D0EQ", "context": "what is the difference for play station network card and the play station store card", "response": "There is no difference"}
{"product_id": "B0086V5V8G", "context": "Is it still a little challanging on the easiest difficulty because I have convictoin and it's still pretty challenging", "response": "Yes. It also depends on how you go about the missions"}
{"product_id": "B002BS47JE", "context": "what is a pal version?", "response": "What I have read about it is you can have 2 people set up to work out together. I have not done it yet."}
{"product_id": "B0009PRCNO", "context": "Is this ps3 60gb backward compatible? and what is it's model number? thanks!", "response": "yes and I forgot the model number sorry"}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "Perfectly. if you hve questions or something isn't working right, check your pc specs. need anything else? just ask"}
{"product_id": "B008BGXYBM", "context": "Is this mouse good if I do not use claw grip.", "response": "i use a palm grip works wonderful for me, its got a nice curve to it. I have smaller hands as im female, i'm not sure if that makes a difference"}
{"product_id": "B004J6KRD6", "context": "Has anybody been able to get this to work with the xbox1/360/ps4 ?", "response": "This method will work with both X1 & PS4 and ANY wheel that is PC compatible.https://www.youtube.com/watch?v=2pXJMWWcWRA"}
{"product_id": "B006W41X36", "context": "Will this headset give me surround sound from my ps4 to turtle beach stealth 400?", "response": "Your headset would need to be compatible with surround sound. And its simulated surround not true. I'm not familiar with the stealth but if it came as a stereo then this will not help you."}
{"product_id": "B00FQFFPZO", "context": "can you turn cautions off", "response": "Yes when you set the race up you can turn the cautions off under the flag options."}
{"product_id": "B00BZOBE78", "context": "Does the pc dvd work with a mac???", "response": "NO, it doesn't. You need the MAC dvd for Civ 5."}
{"product_id": "B002I0K3PM", "context": "is this a 2 players simultaneous game", "response": "No.  It is only 1 player."}
{"product_id": "B000E1A4XS", "context": "whys it rated teen", "response": "I imagine it's because there is no harsh language, or nudity, or bloodletting or sadism in the game.  It's a scary one.  Suitable only for the older teen."}
{"product_id": "B00EH5V1IO", "context": "Can one headphone be removed to leave one ear open while using the headphones?", "response": "Yes, the right-side headphone can be removed."}
{"product_id": "B008U5ZNIG", "context": "Since it has has individual back light can you customize them individually by color or intensity or does the whole keyboard need to be one color?", "response": "Just the Razer signature green backlighting. You can choose brightness but just one color."}
{"product_id": "B00DNGQTFI", "context": "Does this game have a story/ free- roaming mode? Like, where you can collect dragon balls? And can you fuse characters/items to create new characters?", "response": "1.) No unfortunately mission is like story mode, No open world.2.) There is no Gathering Dragon Ball (only online to win, but no wish).3.) No fuse/items to make new character.Recommend Old DBZ game like DBZ B3 or U.T"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "It works well with Windows 7. No problems."}
{"product_id": "B00J6DLPLK", "context": "is this game satanic/Demonic? and sexual?", "response": "I don't think that shall be considered as satanic/demonic based on any type of religion... it has a lot of gore and it's about sisters being hunted by other sister... I would consider this game more like a type of adult anime... definitely is not for kids.Cheers!"}
{"product_id": "B00I5LMSBK", "context": "For the North America pre-order of the game, was amazon supposed to give both the Shigechi & Kira DLC? I only received an email for Shigechi", "response": "Amazon is Shigechi unfortunatley..."}
{"product_id": "B009K7OFSC", "context": "what kind of surface does it do good on?", "response": "I use a firm mouse-pad. I haven't tried using a cloth mouse-pad, do I cannot confirm the performance there. The mouse works well over-all with the only adjustment being that the right click doesn't make a tactile click when pressed. Something to consider."}
{"product_id": "B000H683YC", "context": "Can I buy the remote off of you?", "response": "No, I only have one"}
{"product_id": "B000H1V56U", "context": "do you need to solder anything?", "response": "No, no soldering. It's just popping a few plastic tabs and undoing a few screws, then putting it all back together. Very easy."}
{"product_id": "B008RA5DIY", "context": "If we purchase the actual disc, are we able to download also?", "response": "I have seen companies who you can purchase the download through and purchase a back up disc also. But if I were you I would download the program to a disc and then install it to your computer. Then you have the back up right away and don't have to purchase it too."}
{"product_id": "B004X56PWK", "context": "Is this a game for people who just want alot of running in a Sonic game or is there alot of stopping and story and destroying bots?", "response": "A lot of running, It is the style of sonic game is a good story"}
{"product_id": "B008CP6MA2", "context": "I'm new with the PS3, do I need a PSN account to download Ghost of Sparta and Chains of Olympus?", "response": "Yeah but it's free so don't worry about it"}
{"product_id": "B0072A4JVW", "context": "Will the grips still fit on the vita if it has a case on it? I have the eForCity snap on crystal case", "response": "Hello Jennifer. I took a look at your eForCity snap on case and I can judge from just looking that it will be a very tight squeeze should you decide to buy this with your crystal case. It is already a tight fit with no case on mine, I wouldn't recommend using this with your snap case."}
{"product_id": "B0050SX4CI", "context": "Does it works with ps4 ?", "response": "Yes, and navigator too."}
{"product_id": "B0086V5V8G", "context": "Is it still a little challanging on the easiest difficulty because I have convictoin and it's still pretty challenging", "response": "yes, but not hard"}
