{"product_id": "B001EYU1WS", "context": "Is this product compatable with windows 8", "response": "Not really. I have Flight Sim, Prpar3D, and XPlane. Win 8 does not work with any of them at least not without a lot of tinkering.  Works ok with Win 7 and Win XP. Unbelievable that Saitek can't seem to get it right with proper drivers."}
{"product_id": "B00AAQRNQ8", "context": "I have very large hands, how will this mouse work out with that? I prefer palm grip, and most mice force me to use claw because they are too small.", "response": "honestly I don't have enough information to answer that question with any degree of accuracy. I don't know what you consider to be 'large' and I've never used palm grip before so... but if I had to venture a wild guess, I'd say you may have to claw this one as well."}
{"product_id": "B000LQ4HTS", "context": "Is the base heavy enough to play with it resting on a desk, or does it need to be bolted down?", "response": "You will want to either use two screws to mount it or use velcro; as the stick and throttle is not that heavy."}
{"product_id": "B00B3PDHBU", "context": "Will this headset work on the xbox 360 & the xbox one?  Looking for a headset that will work on both.", "response": "Yes it does both. In fact it comes with a wireless dangle for the 360 so u can have wireless chat, but u have to buy a adapter  for the one but it's like 24$"}
{"product_id": "B008M4BNQG", "context": "i just order this mic heard it was great where does it plug n to playstation 3", "response": "HiIt's plugged into the USB port at the front.It's a good buy. My hubby loves this headset. Said it allows him to hear the game music better."}
{"product_id": "B00008J7NZ", "context": "Will this work on the Xbox 360?", "response": "It should if you have an 'authentic Microsoft hard drive', as those have a special compatibility software needed. If its a third party or imitation hard drive, it might not work. Source: http://en.m.wikipedia.org/wiki/List_of_Xbox_games_compatible_with_Xbox_360#List_of_compatible_titles"}
{"product_id": "B0007MZWQS", "context": "Does it work on a modern TV?", "response": "no. ive tried everything flat screen old roller dial projecter tvs ect.... bought new cables standard rf and av cord and nothing work  on nothing. i can see on tvs when i switch the game on it goes fuzzy like its trying but cant activate to play"}
{"product_id": "B00DJYTGYU", "context": "can this controller be used for all ps3 games", "response": "Yes. And this is the most durable and accurate controller I have ever used. Trust me I've got  a drawer full of controllers."}
{"product_id": "B00EW6QT76", "context": "Does this include Playstation Plus?", "response": "No it doesnt, and also if you make the math, there´s no savings in the bundles, they charge you exactly the same as if you buy the additional items separately."}
{"product_id": "B0094X28J0", "context": "do you need a nunchuc", "response": "for certain games, yes, u need a nunchuk. but this remote does not come with a nunchuk if that's what u mean"}
{"product_id": "B002I0JZIS", "context": "does it say call of duty in thw back of the vita", "response": "No standard vita with the game"}
{"product_id": "B005MQ3BSK", "context": "are the instructional videos on frtz 13  complete, or at least more complete than the miserable video 'snippets' on frtz 11", "response": "13 is basically the same as 11. instructional videos are poor in both; BUT the 'program' is very good, well priced."}
{"product_id": "B00CMQTVUA", "context": "Does the xbox one only support hdmi?", "response": "Yes. It only supports HDMI. Good news for you though. There are adapters out there that might allow you to convert to Component if need be. Just Google search, HDMI to Component(or whatever you want)."}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "No, the first month is free. Afterwards, you can choose from different subscription options. You can do month to month, or even 3-6 months in advance for even more savings."}
{"product_id": "B00BMFIXKQ", "context": "it is for One player or multiplayer?", "response": "Only multipleyer online, story mode is one player."}
{"product_id": "B000B6MLPU", "context": "Does the video come out of the component cables (red,gren,blue) and the AV cable (yellow) or both?  What is the yellow cable for?", "response": "The video comes from red blue and green for HD and red yellow white for basic depending on your sound hearing choose ex. Speaker or headset you might have to use red and white in audio out ports on TV."}
{"product_id": "B009GWLSFY", "context": "Does this include the Arcade version of Smash TV?Not the rated G SNES version right?", "response": "the game Smash TV is listed on the back of the case I'm assuming it's not the Super Nintendo version thank you"}
{"product_id": "B002I0H09Y", "context": "it is a usa version?", "response": "Yes! See also reviews by other who have purchased and played the game before buying!"}
{"product_id": "B00FE8WKPQ", "context": "Is this ready to play out of box or is another console required? Do I need to buy a regular Wii U first?", "response": "You need to buy a regular Wii U first.  Then when you buy the Wii Fit U and Balance Board you'll have everything you need.  (and you'll love it!)"}
{"product_id": "B003O6G5TW", "context": "Want to buy my nephew a Battlefield game and #4 seems to have to many glitches. Between #2 & #3 was wondering which was the better game?", "response": "I would go with either 3 or just getting 4, most of the glitches on 4 are gone now"}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "Worked on both XP and 8. Don't know about 7, but don't see why not."}
{"product_id": "B00B0QONB0", "context": "Do I just plug it into the Xbox or do I have to buy a cable to connect it?", "response": "it plugs into the hard drive bay on the Xbox.  no cable needed."}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "I believe it is 1 stage but there is a pinky trigger that I think you can program to make it two stage, It is a very complex HOTAS and i'm still learning how to program it it has many, many options! I hope this helps."}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "With the online game code you can buy Downloadable content or dlc and games but with this it allows you to play online with your friends and other people"}
{"product_id": "B00EPZ8POY", "context": "is this like a story mode or it's your standard fighting game?", "response": "Is like a story mode with standar fighting check it out on you tube the game play if you like it"}
{"product_id": "B000K9Q5NW", "context": "does it come with g 27 gear shift holder", "response": "I don't know about the G27 since I have the thrustmaster T500, but I'm pretty sure the gearshift holder you have to buy separate. It works well for the TH8 shifter that comes with the T500 racing wheel"}
{"product_id": "B00F9RGFEY", "context": "Is it possible to listen to my mobile device without the aux cable? via bluetooth?", "response": "My previous \"yes\" answer was supposed to be no btw."}
{"product_id": "B00DYAQHTQ", "context": "Does this game have multiplayer mode?", "response": "It's seamless during the campaign mode, but it does have multiplayer options."}
{"product_id": "B00CXI0BPG", "context": "Does the logo glow all the time, or can it be shut off?", "response": "Yes it glows all the time. Not to big a deal really though."}
{"product_id": "B003Q9RGRW", "context": "Can you plug the headset directly into the controller without the chatpad?", "response": "Yes you can you can plug it directly to the controller or the chat pad but if you choose chat pad you have to plug the chat pad to the controller and then the headset but otherwise you can just plug the headset to the controller"}
{"product_id": "B009AP23NI", "context": "I accidentally ordered this one... will this work alright with an NA console and how difficult is it to feel my way through syncing, since its in JPN?", "response": "Yes, it worked with mine. It's a NA system. The only thing that doesn't work is the Nintendo club number, it's meant for the Asian site.  But that doesn't matter because they are closing the club down."}
{"product_id": "B008RA5AWS", "context": "If we purchase 3 user licenses does that mean three people can use the system and on 6 different compurters 3 desktop and 3 portable", "response": "I don't think you will able to do that, you might call quickbooks."}
{"product_id": "B009LWQ0H0", "context": "Is it Mac compatible?", "response": "The disc version may be( or available as a stand alone version). I bought the PC version  steam code off of Amazon because they had it on sale. Steam does not have this in a Mac version."}
{"product_id": "B00ESN8YGW", "context": "do i need steam to play this? what if i don't have it? can't play?", "response": "Yes you need it for the activation at the beginning. Afterwards you can also play offline if you want to."}
{"product_id": "B001AH8YSW", "context": "Will it run on Windows 7 ?? I keep getting minimum requirements not met.", "response": "Yes it will l. I'm running the game a PC with an AMD phenom x3 2.8 processor and a Radeon HD 6450 video card with  max settings. Runs great."}
{"product_id": "B0050SX9I2", "context": "will this remote control a regular sony blu ray player? a bpd-s5100 to be exact?", "response": "Don't think that it will. According to the manual, it's only able to operate the PS3, supported TVs and Sony-only AV amps."}
{"product_id": "B0081Q58AW", "context": "Is it all strictly PvP or is there some PvE as well?", "response": "There is some of both PvP is kind of week/poor and optional something to do if bored, and it's lacking any proper end game / elder game for PvE but it's mainly PvE focused just not the greatest PvE."}
{"product_id": "B00C71034I", "context": "Is it free roam?", "response": "Daughter says yes, but have to do missions to beat the game. Hope it helps:)"}
{"product_id": "B004AM5RAM", "context": "Do you notice any latency between clicking and games responding? I have had terrible wireless gaming mouse experience.", "response": "There is a little bit with all wireless mouses however if you are havr excess it it probably due to other wireless items in you home or general area interfering with the signal"}
{"product_id": "B004NRN5DU", "context": "What happens if your batteries die, or perhaps you remove the battery pack (by mistake of course).  Will this trick work to render a pause?", "response": "There is no way to pause the game. However, you can quit out at any time and the game will exactly save your progress."}
{"product_id": "B00AAS88K6", "context": "I'm guessing the mouse isn't 8.7 inches long, that's the box.   What is the actual size of this mouse?", "response": "Length: 8.5cm at the base, 9.7cm at the longest. Width: 6.7cm wide at the base, 5.75cm where you actually grip it. Hope that helps!"}
{"product_id": "B00DBRM3G8", "context": "Can I play this game with my cousin on the same screen on the same system? 2 players?", "response": "Yes you can. Evento 7 cousin"}
{"product_id": "B00BGAA3S2", "context": "Is this similar to the Kinnect for the Xbox? How or how not?", "response": "You set it up petty much the same way as the kinnect. Its not complicated at all"}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "I have Windows 7 and it worked fine."}
{"product_id": "B005M2KSLC", "context": "its works with MAC/OS?", "response": "Yes. But some buttons will doesn't work without drivers. But drivers for Mac osx is absent :(Use third-party software ;)"}
{"product_id": "B004C4U1VI", "context": "It doesn't seem to accept HDMI input which is what an Xbox One has. Not sure it will work there?", "response": "Exactly, this item does not have a HDMI. It is a HD component cable for the devices mentioned."}
{"product_id": "B00D9FQAM0", "context": "is there a headset included", "response": "No there is not"}
{"product_id": "B002B9FIUU", "context": "Can you use two of these for 4 player games; IE Mario Party?", "response": "Yes you can, and it even works with 4 players as well depending on how you set it up."}
{"product_id": "B00656HLGO", "context": "Which one of these works externally with an xbox 360 FAT (the original 360's)?", "response": "This will work with the old 360s.It attaches at the top."}
{"product_id": "B000ND3XXA", "context": "Does this controller allow 2 players to use gamecube or ps2 controller at the same time?", "response": "It does allow for multiple controllers at the same time. Its worked for me with GCB and a ps1 ckbtroller . but I assume ps2 and Xbox would work too"}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "It says it will only work if wired thru the pc with a usb connector."}
{"product_id": "B0016897GS", "context": "the router to connect 30 ft. away .http://www.amazon.com/gp/product/B00NR2VMNC/ref=ox_sc_act_title_1?ie=UTF8&psc=1&smid=ATVPDKIKX0DER", "response": "No it will not work for 30 feet away you would need a 100 feet one to do the trick."}
{"product_id": "B00BCEK2LU", "context": "Is this keyboard mechanical?", "response": "No. Keys are very sensitive to touch. I prefer a cherry-brown for my gaming."}
{"product_id": "B0018YXM3Y", "context": "Is it a disk you put in your computer, and if so, does it install with steam? or no.", "response": "yes, it's a disc & it requires Steam."}
{"product_id": "B00HWMP0OU", "context": "Will this play in 3 DS from UK", "response": "No it definitely will not.I hope it will be released for the uk market soon as I bought it for my son and he cannot play it on his machine."}
{"product_id": "B009AGXH64", "context": "Is the game pad the only controller compatible?", "response": "The gamepad is the main controller, you need it to navigate the menu and the store. But you can use the wiimote, Wiimote and nunchuck, Wii U pro controller, classic pro controller (VC games) and you can buy the gamecube  Wii Uadapter to use gamecube controller in the upcoming game super smash brothers."}
{"product_id": "B009CL6LA6", "context": "is this rely worth the money to buy it, when i can get similar quality for cheaper?", "response": "If cost is a concern, then by all means get cheaper if you know the quality is similar; to each their own. I personally think these were worth it for the price :)."}
{"product_id": "B0000512IE", "context": "Will these work with the Saitek Yoke, Throttle Quadrant and Trim Control?", "response": "That probably depends on if the game can receive inputs from three devices."}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "It gives the option for both. So, yes you can download it through steam by redeeming the codes through steam."}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "Have you received any response to your inquiry:  Is WP 8 compatible with Windows 7??Tony - tc1000@verizon.net"}
{"product_id": "B001NT9TK4", "context": "does this wheel work for consoles mainly the Xbox 360 or PS3?", "response": "In my experience it doesn't work for Xbox 360.  It does work for the PS3."}
{"product_id": "B000R9A9JG", "context": "Does this work with the Wii Plus remotes?", "response": "Yes it does. I have 2 wii plus remotes I use with these batteries."}
{"product_id": "B0086UK7IQ", "context": "I often switch between a palm grip and a claw grip depending on what I'm doing. Is this mouse only suited for one style of grip preference or not?", "response": "I think it is suited mostly towards a palm grip. I would find it difficult to use using a claw grip."}
{"product_id": "B00DCDZM2I", "context": "are the characters compatible with the old Wii?", "response": "Skylanders are not the grant"}
{"product_id": "B0065NP6NC", "context": "Which one is better fallout 3 or new Vegas", "response": "Both are equally great but new vegas has better companion story lines and weapons. New vegas has so many glitches, freezes and corrupted saves it can really almost make you quit playing it. In my opinion you must have both. Just make sure you get the ultimate edition and GOTY edition respectively."}
{"product_id": "B00FB5R3XQ", "context": "Now, I've had many people say that PS3 sticks don't work as well as Xbox 360 sticks for PC, can anyone confirm or deny this?", "response": "They both work equally well. Just going to need to get something like motionjoy to use it though."}
{"product_id": "B0086V5UF0", "context": "Is Just Dance 4 also known as Just Dance 2013? Some one wished for this game for this holiday. I am not familiar with WII or this game, so asking.", "response": "I don't know. I do know that Just dance 4 has a copyright year if 2012 printed on the disc. It could still be what your wisher wants. I'm sorry I can't be more help"}
{"product_id": "B002Z7BE24", "context": "Can this edition be played with the Move controllers (like RE4 for the Wii)?", "response": "Resident Evil 5 is not compatible with Move but Resident Evil 5: Gold Edition is. You have to get the Gold Edition to play with Move."}
{"product_id": "B00HNJ4DTA", "context": "Who manufactures this thing?  Where can I find warranty information?", "response": "I have no clue they never respond to service requests"}
{"product_id": "B0041RR0TW", "context": "does it work with windows 8", "response": "If you windows 8  installed the  drivers uninstall it from the  \"device manager\" and install using the  CD  and run compatibility for windows 7... if that's not the case... try installing the  drivers manually using .inf file or controller files"}
{"product_id": "B00B3PDH5G", "context": "What's the digital out port on the transmitter used for?  Can I plug speakers into it so I can listen either through the headphones or speakers?", "response": "Don't know about speakers. The port is for connecting to either Xbox or PS4. You can also connect it your iPhone or Smartphone to listen to music or take phone calls on one of those devices."}
{"product_id": "B00D84DRNC", "context": "How many games can you fit in this with the 3DS XL?", "response": "More than enough. I would post a picture of mine right now if I could. I currently have a 3DS XL, charger, and about 53 ds/3ds games in mine."}
{"product_id": "B00BCEK2LU", "context": "Can you change the color and/or turn off the key lights for specific keys or is it all or nothing? ie. only light up WASD and a few others in games?", "response": "You can change the colour of the light, but you can't choose to just light up certain keys. It's all or nothing."}
{"product_id": "B005F1ZUU4", "context": "is the one that can work with the Xbox One as well??", "response": "Xbone controller will work on a PC without an adapter, just use a USB cable. This will not work with xbone controllers."}
{"product_id": "B000TLU67W", "context": "you can play ps 1 games on the original ps2, can they be played on the ps2 slim?", "response": "You can play PS1 games on PS2 slim. It just has to be the correct region. For example PAL games will not work on NTSC systems. only NTSC games would work on NTSC SYSTEMS."}
{"product_id": "B000YMQGWU", "context": "Are these compatible with Mac iOS X?", "response": "Yes it will as long as you have the USB port, please note that there may be limit on some sensors and games."}
{"product_id": "B004W1IX1G", "context": "Does this deal come with the \"Wii Motion Plus Adapter?\"", "response": "This product description is for the game disc only (in original disc case)"}
{"product_id": "B002YVD3KM", "context": "What kind of emulators does this controller work with?", "response": "I use openEmu on my mac book pro and I can't get this to work. It says plug and play but its not working. I also got the n64 controller that is also not working."}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "Yes. The voices are in English. I don't remember, but I think you can switch the dub to Japanese if you want."}
{"product_id": "B000B6MLSM", "context": "Does this remote work with Xbox Live? I need it to work with NetFlix that I'm streaming through my Xbox.", "response": "yes it works with Netflixs - you will need to use your TV remote for the volume (or at least I need to)"}
{"product_id": "B00965WK8K", "context": "How is this mouse for fingertip grip? Isn't the thumb area too narrow of a space with the buttons and the rest taking too much space?", "response": "Don't get the rat 3, there's not as much customization as the rat 5 or 7.  If you have the extra money and don't need all the bells and whistles get the rat 5, really good mouse."}
{"product_id": "B0087N222Q", "context": "Can it connect to a PC?", "response": "It's Bluetooth. So, yeah."}
{"product_id": "B004QRKWKQ", "context": "do i need to own an xbox if i only want to use this to play games on my pc (does it require some sort of set up with an xbox)??", "response": "Nope. The controller comes with a Wireless transceiver. Its USB plug-able. Just plug the transceiver into any free USB port on your PC. Turn on your controller and you're good to go. Simple as that."}
{"product_id": "B00BGA9V2Q", "context": "is there a multiplayer mode", "response": "Yes there's online multi player up to four people  can play in a game."}
{"product_id": "B00CQOG8MM", "context": "Do you need to have Windows programming as well on your Mac? It won't let me download Origin because I don't have Windows...", "response": "You don't need windows. The game has Mac version.  Go and download Origin, then find your game and type in your key number. The game will be installed automatically."}
{"product_id": "B0098W4ZD4", "context": "Is the Precision Aim Mode button programmable, or can it only be used to drop the DPI?", "response": "It is not programmable, sorry about that."}
{"product_id": "B00FEOR4MY", "context": "The description says it holds 6 games, but it looks like it holds 12 in the photo.  Which is correct?", "response": "Yes it holds 12 games, 3 rows of 4 games"}
{"product_id": "B001CXYMFS", "context": "does the Thrustmaster T-Flight Hotas X Flight Stick by Thrustmaster work on all flight simulators games for macs", "response": "I don't know the answer to this quest as I do not have a mac. I do know that the thrustmaster website has a compatibility website. You can also call there 800 for questions even if you are not a customer."}
{"product_id": "B00FATRKLI", "context": "Can I play games purchased in Colombia, South America?", "response": "Sure you can play game in any countries in this continent : including Colombia, South America.. The system would only a transformational converter in some Europen countries  Hope you find that answer helpful. Good luck with your purchase!!!!"}
{"product_id": "B00656HLGO", "context": "Will this play the original XBOX games that are compatible with the XBOX 360?", "response": "Just to let everyone know this is not a certified may Microsoft HDD so it will not let you play original Xbox games with it. You will need a certified Microsoft HDD."}
{"product_id": "B002CJ8Z04", "context": "Does it come with a Gameboy Advance Cartridge, and a DS Cartridge? Or just a Gameboy?", "response": "If you have anymore questions just ask"}
{"product_id": "B007SRM5MO", "context": "This or old version?", "response": "this one comes with maps and dlc"}
{"product_id": "B00I5LMSBK", "context": "Will the game is in Spanish?", "response": "I haven't seen anything on the game that says it's in spanish. I've only noticed it being japanese voice with english subs with no options to change it in the settings menu."}
{"product_id": "B00E1L78N6", "context": "Did any of you get an notification that your boom mic was on the way? I registered my product and never received an email from Polk.", "response": "We had to call and ask for it, but it came pretty quickly after that."}
{"product_id": "B00ATF5YYI", "context": "Do you know if it is the 1.7 patch?", "response": "Yes it is 1.7. I checked my COD WAW properties /details."}
{"product_id": "B00G21VQ2M", "context": "Will this work on a US vita? Or does it have to be a Japan vita?", "response": "This version of j stars victory vs is region free meaning it works on the US vitas as well as Japan vitas"}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "I have no idea. I don't use that crap of an OS"}
{"product_id": "B008GEH8LQ", "context": "what over the ear headphones are recommended for an 8 year old?", "response": "Sony MDR-222KD Childrens Headphones"}
{"product_id": "B008M4BNQ6", "context": "Can you use two of these headsets on one Xbox 360 console?", "response": "NO , only one at a time"}
{"product_id": "B00G42KO0Y", "context": "Does it work on Iphone?", "response": "yes, it works with iphon and ipad but noly for iCade games."}
{"product_id": "B004GINKNQ", "context": "Can I use this model to play Destiny on my xbox 360 slim?", "response": "How much space does it say you need to have on your hard drive to play this game?  60 gb should be plenty."}
{"product_id": "B009RXUNZI", "context": "How do you set this up to work with a PS4? The PS4 has HDMI connection....", "response": "try hooking them to the audio out on the tv"}
{"product_id": "B00GANWVJE", "context": "Which languages does it have? Is Spanish included?", "response": "I don't believe so. Sorry."}
{"product_id": "B00H72EMP8", "context": "Does anyone knows if it works with WiiU, nintendo 3ds,and PC? It's because I've seen one of this model Kunai(advertise of the company)saying that.", "response": "It works on PC"}
{"product_id": "B003ESDQW4", "context": "is this a single player game or can two kids play?", "response": "This game, like most spider-man games, is a single player game. The only Spider-man game I can think of that is 2 player is called Spider-man: Friend or Foe, but that game is for younger kids than this one...hope that helps. This game by the way...is really good...my kids love it."}
{"product_id": "B0049B2FP4", "context": "What mods don't require the mod installer?", "response": "A lot of mods are just drag and drop into the mod folder, which is located in the main directory for 911FR"}
{"product_id": "B003VUO6H4", "context": "how many controllers can it handle?", "response": "Four, you can use even pc controllers. I dont recomend it but its an option. All the games are only design for max of 4 lan players."}
{"product_id": "B000FQ9R4E", "context": "I got my Wii back in 2008 or 2009 will it still work?", "response": "As long as it is Wii not Wii U"}
{"product_id": "B00FNNQREC", "context": "can you milk cows in this game?", "response": "no they the cows mile themselfs. they walk through a automatic milking machine"}
{"product_id": "B003N3HEU0", "context": "Is the language shown on the screen as well as heard?", "response": "if you turn the subtitle options on"}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "kkk nvm my question was answeered here.. damit the slim is so damn dope i love mine. dontevenuse my reg vita anymore lol and the slim looks great everyone go import one haha. btw it uses Micro usb to charge thats why it wnt wrk =("}
{"product_id": "B00F27JDY0", "context": "What is the difference between the JAPAN version and the ASIA version?", "response": "Thanks for your inquiry.It means, is the difference between edition and edition in Japan in Asia not the game not hardware?In the game, the difference in displayed language is divided by an area, and the design of the character may be different.Would you help it?"}
{"product_id": "B006JSY3MI", "context": "Can it run on windows 8?", "response": "Yes, it runs great on Windows 8."}
{"product_id": "B009GWLSFY", "context": "There is no list of games in the product details. Can I get a list of the games included?", "response": "google it or just buy it its a cheap buy if you like the oldschool vibe of games"}
{"product_id": "B00GY4OAM0", "context": "Forgive me if this seems a stupid question, but how do you get it into two player mode on the PS3? I don't see any options anywhere!", "response": "Have you tried doing a search for the answer online? Someone is bound to have posted a how-to about it."}
{"product_id": "B00EI4V3FU", "context": "How come I just bought this headset and it does not work on my PS4?", "response": "Because the headset is a hunk of junk I just use the headphones that came with my iphone as a PS4 headset"}
{"product_id": "B00FLLFJE0", "context": "What's better, Rayovac AA rechargeable batteries or this nyko charge base for the xbox one. Which one will last longer?", "response": "I haven't try the Rayovac, I always have NYKO. I believed the battery has a lifetime warranty on it."}
{"product_id": "B004774724", "context": "If I bought the download, would I be able to install it on my PC and my laptop? Or would I have to buy two copies?", "response": "You can install it again on your PC and laptop by going into the Games & Software Library."}
{"product_id": "B00EHBKUTE", "context": "I am purchasing equipment for an Oculus Rift that will be released next year. Does this work well for first person games? I know only WASD.", "response": "Yes it works fantastically.  There is an unlimited number of ways to set it up to where it is the most comfortable playing experience for you."}
{"product_id": "B002I0H2AG", "context": "Can I still enjoy it as a purely single player experience (for the price)?", "response": "Yes. The single player campaign is solid."}
{"product_id": "B00EPZ8POY", "context": "does this bring athena hades and poseidon", "response": "Yes, you have to unlock them."}
{"product_id": "B007W8S2MG", "context": "Is everything from the PS2 version intact?", "response": "Yep! Has the exact same feel like in the ps2! Chie and Teddie have.. new voices there's new characters and events.. and of course new features~You'll have a similar experience as the ps2 version (:"}
{"product_id": "B00FM5IY0Q", "context": "Is this game exclusively for XBox One - or can it be played on an XBox?", "response": "It's coming to PC as well"}
{"product_id": "B00CX9L30W", "context": "What does the PC Download Collector's Edition come with? I purchased it and I don't see any of the in-game exclusives, nor do I see anything sent .", "response": "It should be in your mailbox (warriors of light) helmet"}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "Unfortunatley not you need to download it on a 360 first then it unlocks it for free on Xbox on on the account you downloaded the 360 version on"}
{"product_id": "B001EYU1WS", "context": "Is it as complex as the picture?", "response": "Nothing is complex about it...it is simple and completely true to function.  In other words...it works great.  It is however oversized and toy-like in feel and appearance as is the other panels.  Also if you plan on using it with X-Plane you must download a plugin for it to work.  Go to http://forums.x-plane.org/index.php?app=downloads&showfile;=14646"}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "yes it is, that's what I am running it on"}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "Works ok if the driver can keep up with it. Works great on XP."}
{"product_id": "B000BIZR72", "context": "does this play on a DS Lite?", "response": "I believe it should because it says DS on it.."}
{"product_id": "B009AFLXZM", "context": "does it work with just dance2015", "response": "No it works with the singing games including the voice game. My kids got this yr and love it."}
{"product_id": "B0057S9SYY", "context": "Why is the microphone so weak? I have to almost move the microphone into my mouth for it to register my voice.", "response": "We haven't had any issue. They hear us loud and clear for a foot or so away."}
{"product_id": "B00GD962OA", "context": "How many GB capacity has this?", "response": "buenas tardes amigo esta consola esta disponible, que se inifica en stock"}
{"product_id": "B00475AYUA", "context": "How come it says it has 4 games but when i download I only have 1?", "response": "I don't know.  The main game was so boring that I quit and never bothered to check for anything else.  And this is coming from someone who LOVED Civ2."}
{"product_id": "B0050SX4CI", "context": "Compatible with MotoGP 14? Is possible to use 2 together to play Split Screen?", "response": "Thanks Nicholas normand who posted that link. That looks like a fabulous wheel he mentioned and it is compatible with both PS3 and PS4! It is a Thrustmaster brand."}
{"product_id": "B00EV4O7B4", "context": "If i buy this and it breaks does this has warranty?, sorry for asking it's for my little cousin.", "response": "Depends on how you break it. If it breaks from faulty parts or something similar, it's under warranty by Nintendo. If you take it outside and jump on it and then smash it with a hammer, then no I don't think so. :)"}
{"product_id": "B001IYR53W", "context": "DOES IT HAVE  CARD GAME MEMORY MATCH", "response": "Yes, it has a memory match game."}
{"product_id": "B00FYIXMHQ", "context": "I've never played Infamous 1 - Should you find a way to play it ( even if you don't own a PS3 ) before attempting Second Son?", "response": "I think the best story is the one told at Infamous 1 , so you should definitely play it regardless of anything.If you havent and play second son, you just might miss a couple of references to the old games (no big deal)"}
{"product_id": "B00FLLFJE0", "context": "Charging Base doesn't light up. Battery is in correctly and controller is working. Battery came with charge so not sure if that's why no light on Nyko", "response": "If the item is new and its not charging its because you installed the batteries incorrectly. On other hand if you had this item for a couple of months then it seems the batteries are dead because they die out not long after use. No replacement batteries sold by manufacturer."}
{"product_id": "B00BMFIXEW", "context": "can i play with the wii plus control like a sword?? i mean if i have to move  like if i were figthing??", "response": "No, you can't.  But I will say that it is an incredible game. Hope this helps!"}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "It depends on how far away the tv is from the wall itself ... I don't see any reason why it wouldn't work... It seriously is cheap easy and perfect for the job"}
{"product_id": "B004N7IIQ4", "context": "Are the wires very long", "response": "Yes they are, and there is a lot of them."}
{"product_id": "B009WI7V9E", "context": "Just asking, if the DLC's are on a disc, does this mean that if I get this used I can still get them?", "response": "Yes. Come on disc. No special codes needed"}
{"product_id": "B00ANHBJBY", "context": "Does anyone know how well this holds up in games like Super Smash bros? The responsiveness and durability for example.", "response": "I played through both Bayonetta games and a fair bit of online Smash with this pad without issue."}
{"product_id": "B008SBZF2Q", "context": "Does this character work with WII U", "response": "Not, this character don't work wii u, you need special one"}
{"product_id": "B005L38QK2", "context": "What are the difference between this one and the Steelseries Sensei RAW Mouse?. and is this an optical or laser mouse? Thanks.", "response": "Hardware wise, none. The SteelSeries Diablo III Gaming Mouse only difference is the Diablo 3 logo."}
{"product_id": "B00BFOEY3Y", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "It's switchable between free spin and ratchet. You can customize which button you want to use to switch between. You can also set it to one mode that you prefer and not have your switching assigned to anything."}
{"product_id": "B007VH2WPQ", "context": "Do the screws from my original case fit or do I have to buy new screws?", "response": "the screws will fit but i don't think its worth your time to by it"}
{"product_id": "B00BV72X1U", "context": "how does this work i got this in mail and disc wont read i think its too small", "response": "I searched for unstructions on youtube. The disc is useless but the driver is available online. The step by step can be found on youtube, I got mine working just fine."}
{"product_id": "B00D6PTMB4", "context": "Is easier to use the interface on PC or is it the same with a PS3?", "response": "Can you use the pc version on a laptop, then run out HDMI to the tele?"}
{"product_id": "B00656HLGO", "context": "Which one of these works externally with an xbox 360 FAT (the original 360's)?", "response": "320GB Hard Drive HDD for Xbox 360 - Highest Capacity works great with the original Xbox 360, I have one and it is easy to install."}
{"product_id": "B002CZ7P04", "context": "Can I use the wii walk it out video game with the wii u", "response": "Yes. I use this game with my Wii U, balance board, and controller with nunchuk."}
{"product_id": "B006KYYOSO", "context": "Do you need the code to play multiplayer online?", "response": "Yes, it comes with it."}
{"product_id": "B006IR6NH8", "context": "Will this work for non-racing-sim games, like Euro Truck Simulator 2?", "response": "Yes.  I've used it in ET 2."}
{"product_id": "B0002XJBGE", "context": "I tried to play Call of Duty 4 on my MacBook Pro with this controller.  Plugged it into my USB & it doesn't seem to control anything.  Any suggestion?", "response": "This device is compatible with mac, the drivers are built into the OS.  If the game doesn't have configuration of buttons for Mac, you will have to use a button mapper software to do sohttp://www.usboverdrive.com/USBOverdrive/News.html"}
{"product_id": "B00ATF5YYI", "context": "Is this the complete version (just like the one on Steam) that has all DLC? I'm pretty sure the DLC isn't even sold separately anymore for downloads.", "response": "Yeah it is. I'm not sure about how other PC games are with DLC but yes this does include it."}
{"product_id": "B00CXI0BPG", "context": "Can you choose the DPI levels (I play at 750 and 1100 DPI) or are you locked into pre-set DPI levels (like 500, 1000, 2000, 4000)?", "response": "You can adjust dpi but it only goes down to 800"}
{"product_id": "B00B98HF1O", "context": "Hi.  I have a US Xbox 360.  Will this play or it is locked to some other Zone", "response": "unlock! my location is South KOREA."}
{"product_id": "B003JVF728", "context": "if i buy pc disk will it let me download it to", "response": "Yes it will just take note of whatever you do on steam!"}
{"product_id": "B009Q5XGO2", "context": "So when you charge the gamepad this charges with it? You don't need to charge them seperatly right?", "response": "That is correct. You do not need to charge them separately. The light will turn green when the \"Uboost\" has fully charged."}
{"product_id": "B00DB9JYFY", "context": "Does anyone play this game online anymore?", "response": "Yes, thousands of people still play.  Most just play Attrition (team deathmatch) but all games are populated.  Definitely worth it.  I find it more fun than Call of Duty."}
{"product_id": "B0002XJBGE", "context": "I bought this, along with the Special Edition Doom DVD, to play on my Asus laptop.  Game plays okay, but does not recognize pad.", "response": "Sorry to hear it didn't work with our laptop.  I'm not teach support so I really can't help you other than to say I paired this controller with two home built pc's as well as an Asus laptop and I had no problems."}
{"product_id": "B002I0J4VQ", "context": "does it come with cords", "response": "yes it came with cords"}
{"product_id": "B000IZAQD8", "context": "are the cables included", "response": "Every cable except the power cord was included in mine."}
{"product_id": "B0016HG4H4", "context": "Is this set wireless", "response": "It is not, Sherry."}
{"product_id": "B00BQWTGIS", "context": "cn you play this game with an xbox 360/pc controller", "response": "Yes, you can and it makes it an even more involved experience to play through the game."}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "No you need to choose one 3.5mm or wireless"}
{"product_id": "B00EFFW0HC", "context": "Can you turn off the lights in a building so enemy's cant see anything?", "response": "yes, in some maps you can do that and it seems to work but 3d spotting kinda ruins the point of it."}
{"product_id": "B00BDS415I", "context": "WIIL THESE WORK WITH WII U", "response": "I'm not sure what WII U is. They work good with PS 4.  if you're referring to wii I don't know"}
{"product_id": "B008RA5DIY", "context": "If we purchase Quickbooks from Amazon, does Intuit still provide support?  They tell me that you may not get their actual product.  Is this true?", "response": "I've downloaded QB 2013 - I'm continuing to get upgrades.  I've paid for support (as I'm sure you have) effective the end of the year and that continues through the year.  I don't think I've ever purchased QB software from Intuit.  I've always gone to Staples or Sam's Club.  Hope that answers your questions."}
{"product_id": "B00F9RGFEY", "context": "My roommate got this and I thought it was incredibly cool and high quality.  If I were to get my own pair, would the 2 wireless broadcasts interfere?", "response": "Most definitly not. It is just like a remote control to a television.the remit will power on the tv that it was made for. So henceforth the wireless head set will only be tuned to the transmitter stand. But just like radios put five of them together on different channels and all play like suppose to"}
{"product_id": "B000B6MLSM", "context": "Will this control the DVR functions in WMC?  I have one of the new remotes and it lacks many of the functions that you would expect it to have.", "response": "No this only controls the tv its self it can't be set to use for VCRs DVRs DVD players ECT only tv and xbox"}
{"product_id": "B00CJ7IUI6", "context": "I want to buy this for a friend who wants to play Skyrim with DLC's but cant access PSN will he be able to use the DLCs? without internet??", "response": "Yes, the dlc comes within the game; it's just like downloading the game to your ps3 and the dlc you have to download from your cd to your ps3 seperately."}
{"product_id": "B003EUPCZG", "context": "Does this left handed mouse click on the right side so I can rest my whole hand on the mouse and click with my index finger like righties do?", "response": "The 5 buttons on the mouse are fully customizable using the Synapse 2.0 software (which is compulsory installation to use the mouse). So you can make it a \"left click\" on any of the 5 buttons you want."}
{"product_id": "B004QRKWLA", "context": "Has anyone used this with old-school console emulators, and if so, does it feel okay playing older games?", "response": "It should work, but the D-pad feels awkward in 2D games in my opinion"}
{"product_id": "B002I0K3CK", "context": "Why is this game $67.99?? This game is 2.5 years old and all new games are based at $60....", "response": "I just bought this brand new at my local walmart for $39.99"}
{"product_id": "B004AM5RAW", "context": "Does this work on Mac?", "response": "Yes, to my belief the retail box does say this is Mac compatible."}
{"product_id": "B008BT2FWI", "context": "does it work on window 7", "response": "Yes. I use Windows7."}
{"product_id": "B00005B8G3", "context": "Does this include with charger?", "response": "It runs on AA batteries.  The SP model has a rechargeable battery and should come with a charger, but this one uses regular batteries."}
{"product_id": "B002I0J4VQ", "context": "does it come with power cord to charge controller", "response": "It mite but the one I got said it  came with a controller  but it didn't and not only that but the disk drive didn't even work so now I have to use it for parts"}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "There should not be any problem unless you don't have enough memory in your system or password restrictions by your anti-virus software or computer manufacturer like Dell."}
{"product_id": "B008BT2FWI", "context": "are these games 3 hiden objects system", "response": "It is a game where you match tiles. It is horribly addictive. Simple but addictive."}
{"product_id": "B000R0SRNU", "context": "why are you advertising this as an xbox 360 game when in reality its an original xbox game?", "response": "Because, as a quick google search reveals, it's an xbox360 game released in 2007."}
{"product_id": "B008FHL56S", "context": "Does this product play Titan Falls?", "response": "Sorry. I cannot answer your question because my grandson does not have the game you are asking about."}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "Just to let you know, as of May 2014 the Voucher is still active. I purchased this set and was still able to download the Festival of Blood via the voucher inside. FOB is really cool by the way, I'm having a lot of fun with that title alone."}
{"product_id": "B00HGLLRV2", "context": "looking into getting  a ps4 for Christmas I played the first game and really liked it is this game on par or better then the first infamous?", "response": "it was just as good as the first with better qraphics"}
{"product_id": "B00EZKNT5O", "context": "How is the quality on these? I'm aware it's a licensed controller, but I'm still curious. PC gamer, have had Logitch F310 fail on me in under a year.", "response": "Mine's lasted over a year (maybe even two) just fine."}
{"product_id": "B0050SYK44", "context": "I've never had a game consol.  How do PS3 and Xbox compare?", "response": "Well I never had a PS3 before but from my experience with friends and other people the Xbox is better. While the ps4  is good, the Xbox is better then the PS3. I am not 100% sure on what makes the PS3 better or worse then Xbox, but if you Are asking my opinion, buy the Xbox."}
{"product_id": "B009DL2TBA", "context": "can this play Blu ray video?", "response": "Yes, it will play blu ray, but not HD DVDs."}
{"product_id": "B00DOD0TZG", "context": "Does this come with DLC's?", "response": "No, just the main games. I picked up the infinite season pass on sale for $10 right after I bought the triple pack. That was a few months back though."}
{"product_id": "B007MJSZDQ", "context": "Does this also charge fully or is it like the charging cable where it says it is done charging and about 5 minutes later it dies on you?", "response": "it charges fully and the batteries work for several hours, depending on how long you play at one time.it grate I'd recommend it."}
