{"product_id": "B00J128FPA", "context": "What  is the size of the packing on this edition?", "response": "The box of the actual game is 11 x 8 inches. It came in a box 17 x 16 inches. Depth of about 2 inches for both."}
{"product_id": "B00CMQTUSS", "context": "does it come with the cable", "response": "I bought a double battery charging station with cable separate and it was worth every penny"}
{"product_id": "B008CP6MA2", "context": "I like 20 day came my game but when you enter the Captcha code tells me this expired or was used that happened there", "response": "These are used games so the previous owners used the codes for the other two games like chains of Olympus and ghost of Sparta"}
{"product_id": "B00FKV8AK6", "context": "Why is it rated m", "response": "I'm not sure, maybe because of the gun violence and maybe cussing is what I'm thinking."}
{"product_id": "B00178630A", "context": "does it work on a MAC?", "response": "Yes It does, I have a buddy who plays on a mac"}
{"product_id": "B000LQ4HTS", "context": "Is this available for windows 7 ???", "response": "I had the same question when I was considering this Joystick and found a thread on the \"Rise Of Flight\" forum for the X52 Pro. It's working good for me after downloading the latest drivers from Saitek.  Good luck."}
{"product_id": "B006JSY3MI", "context": "Are the controls for the PC version easy to use?", "response": "Yeah it's alright, the farting controls are a bit weird. But it's completly fine."}
{"product_id": "B0041RR0TW", "context": "Has anyone used the 710 Gamepad on a windows 8.1 system?", "response": "Yes I my f710 is currently running on Windows 8.1. It works well you just may need to go to the Logitech website to download the driver specifically for Windows 8.1."}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "Also have windows 8 and it crashes a lot. Also I can't seem to get any game patches to register."}
{"product_id": "B0050SYILE", "context": "Would you let a MATURE 13 year old boy play this game?", "response": "I would think of it this way. You should play it with your boy and explain things along the way. Just like would you let them watch Road warriors the movie by them selves or with you watching it with them."}
{"product_id": "B003O6EDSM", "context": "Is this game like Dragon Age (RPG) but with guns instead of swords and magic?", "response": "You are going to get the same vibe with mass effect as you did dragon age story wise and rpg wise. But the combat is much better in mass effect than dragon age. Mass effect 1s combat is kinda clunky. But they improve significantly in the second and third game."}
{"product_id": "B00GOOSORM", "context": "Does this time card add \"Crysta\" points, since Ultimate Game Card is already voided. Just wondering because I plan to world transfer.", "response": "No its just for paying for your monthly sub."}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "My 15 year old son installed this and this only. You need to push all the way in until it clicks. This is the only thing we bought and it works awesome. Total capacity is is like 316. No extra cables nothing."}
{"product_id": "B0050SYK44", "context": "Is the game brings the voices or subtitle in Spanish?", "response": "Don't think the xbox version can."}
{"product_id": "B00EH5V1IO", "context": "Can one headphone be removed to leave one ear open while using the headphones?", "response": "One headphone will come off and the other will continue to function, however, they do not stay on well once one side is removed."}
{"product_id": "B00BI4VVGY", "context": "Is it a 2 or 3 pin fan controller?", "response": "3 pin fan controller"}
{"product_id": "B009SJR278", "context": "Do I need to buy a splitter for pc gaming?", "response": "No you don't. It's included."}
{"product_id": "B00DC9T2J6", "context": "Will Titanfall run on a macbook pro?", "response": "You need to Boot Windows 7 on your Mac - if you have it installed. If you don't, buy Windows 7 and then follow Macintosh instruction for Boot Camp Utility. Get an i7 with 8gb ram or face hot laptop and sketchy graphic jumping."}
{"product_id": "B007Y7OP8K", "context": "what is storyline of this game and its windows 8 compitable?", "response": "You will have to download a comparability pack for it to work on win. 8, and the story is straight forward. Your friend becomes president due to some alien invasion and your surrounded by cuties ready to be conquered by you"}
{"product_id": "B009M72E5Q", "context": "My father is disabled and bed ridden. Are there many games for this console that can be played in a hospital bed?", "response": "I would think so.  He would more than likely have to sit up to play.  Go in on Wii or Amazon to see a good selection of games that your dad might like.  All the games have instructions."}
{"product_id": "B005QUQP80", "context": "Does it have backlight?", "response": "Nope, you'd have to upgrade to the K70 or K95"}
{"product_id": "B004JKZUJI", "context": "Does this work when playing games on the Wii Shop Channel?", "response": "It works wit old classic games I have not try it on wii shop games. But so far is a legit good control....I hope this will help you."}
{"product_id": "B00GO4PTR0", "context": "These memberships works for just one account? Or multiple accounts in the same console? Thanks", "response": "It only works for one account. Make sure you use it on your Primary account."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes the ps3 is not region block"}
{"product_id": "B00DBCAT3W", "context": "is this just the fist game converted to 360 or a completly new game that takes place after fable 3", "response": "It's a remastered version of the first game. New graphics, old game."}
{"product_id": "B0029LJIFG", "context": "Can I send electronically to someone?", "response": "The code is only good for one use (one membership), so if you have this mailed to you, you  could reveal the code & then email that to the recipient (as long as it wasn't used).  You could also just have this mailed directly, but it's a physical card w/ a one-time-use code."}
{"product_id": "B00B5QLS4A", "context": "Does this mouse have a middle-click function on the scroll wheel separate from the button below it?", "response": "Yes, you can click in the scroll button itself. I use it to close tabs in my browser."}
{"product_id": "B00BGA9X9W", "context": "Why doesn't this come with a USB cable to charge it?", "response": "Alot of people don't have a charger so you can connect it to thier play station 4 to charge it ot you can charge it using your desk top also. hope this helps"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game", "response": "Each figure has their own minigame.  Certain figures come in playsets which open up extra worlds.  Toy Story and Cars for example have their own special worlds to play in."}
{"product_id": "B00EVWZHLK", "context": "Is it a multiplayer game?", "response": "There is an Xbox live multiplayer feature however, these games are a few years old so hardly anyone plays multiplayer online anymore. There is no split screen feature."}
{"product_id": "B00JM3R6M6", "context": "Can you play the Tomodachi Life on a regular Nintendo DS?", "response": "no, but if yor ds isn't region locked, there's an older version that was only released in japan simply called \"tomodachi collection\" I've played it on emulators. it's pretty much the same thing only this version has a lot more features."}
{"product_id": "B00DHUUTEM", "context": "Is the clicking on the keyboard quiet?", "response": "Actually it is a fairly soft touch and doesn't have mechanical keys that click when pressed.  If you type heavily though you will still have the key striking bottom sound you would have with any keyboard.  Hope this helps."}
{"product_id": "B00001IVRD", "context": "Has everyone playing on Windows 7 had problems with saving games?", "response": "It works just fine for me on Windows 7 Home Premium. If your issue persists, I suggest you to contact the developer of the game; Blizzard Entertainment.https://us.battle.net/support/en/games/starcraft?page=1"}
{"product_id": "B003V4AK8E", "context": "Is there anything we can do if a brand-new controller won't charge (i.e. if the controller can't operate unless it's plugged in)", "response": "Well unless you can open it and try to buy a battery for it there is nothing else you can do for it. Read the Returns listed for the company and for Amazon opening it may void any chances for any replacements or refunds!"}
{"product_id": "B004YC4NN0", "context": "What emulators does this work on?", "response": "They basically work on any emulator that you can remap your controls to. I have not once had a problem using it with any emulator."}
{"product_id": "B00005QEFD", "context": "The gamecube I bought has a broken disc reader and was very filthy when I took it out of the box. I.E. cobwebs and caked on dust.", "response": "Mine was not in a condition near that at all. Im sorry to hear that."}
{"product_id": "B00F27JDUY", "context": "Does it vita could ship to Cambodia country?", "response": "HelloWe can ship it from Japan."}
{"product_id": "B00J6DLPLK", "context": "does this game have co-op?", "response": "As answered by Darkcaedus, the game does not contain a Co-op (or any form of online) mode, but he incorrectly states it is an RPG.  The game itself contains some RPG-style elements but the primary gameplay would be classified as a Hack-and-Slash."}
{"product_id": "B0041G5SD8", "context": "I HATE STEAM - it is as bad as YELP - is this the only way?", "response": "STEAM is actually QUITE GOOD and better then having just  discs..auto updates,  configuration, reviews, support, forums, and SECURE!"}
{"product_id": "B00AQ2BLI2", "context": "Does it contain the original game? I accidentally buy the part 2 but it does not contain the original game.I can't play it now.", "response": "Shogun 2 does not contain the original game."}
{"product_id": "B00DPJBTM6", "context": "is the mic worse than average?", "response": "I haven't really heard my own voice through the mic, but from what I've heard from my friends, it sounds really clear."}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "Nothing, cuz it is not 90 bucks..."}
{"product_id": "B00GU8W5AE", "context": "Can I program the keys to enter passwords?", "response": "For stuff like Authenticators? Yes. It's essentially like your number pad, except instead of it being off or on, it's on all the time."}
{"product_id": "B002J9GDXI", "context": "Does this mouse work with Win 8? Having trouble programming G400 buttons?", "response": "I'm using this mouse with Windows 8 and it works perfectly. If you don't install the gaming software, it acts like a normal 3 button mouse with adjustable DPI. With the Logitech G software, you get full programmability. The software is nice if you use other logitech products since you can program everything in one place."}
{"product_id": "B00A2WP4UC", "context": "Does it include the sensor bar?", "response": "Yes it does. :-)"}
{"product_id": "B00JFCA6V2", "context": "do the ps vita come with ar cards", "response": "No, it does not come with the cards"}
{"product_id": "B0098F1Y3K", "context": "Is it possible to turn off the demon head?", "response": "I don't think you can. Suppose to be part of the devilish training"}
{"product_id": "B001GIUWX0", "context": "How many can play at one time", "response": "Up to 12, when you play online. Offline it it just 4."}
{"product_id": "B00CHSY0R2", "context": "Do i need to buy a USB to use these?", "response": "No you do not have too. The USB jack is all ready equipped on to the headset."}
{"product_id": "B000O5DY0E", "context": "Will this game work with the new Windows 8 computer?", "response": "No, it won't. You can download or buy the disc but it won't play the game the way you would want. Can't make your own people and intermingle with the people already on the game."}
{"product_id": "B001DU25UO", "context": "According to the May Flash website under the support/driver download sections it says it supports windows 8 as well", "response": "I use Windows 7 not sure if it works on win8"}
{"product_id": "B00F9RGFEY", "context": "This does come with the USB light up device just like the regular prismatic headphones? Or does the tower replace that?", "response": "The tower lights up and so does the headset. It's a great head set."}
{"product_id": "B00BGGIWZM", "context": "I just downloaded sims 3 Island paradise but I cannot run it because it says I need to download Sims 3 first. Does any one know if this is the case?", "response": "I brought this for my Granddaughter, but I do believe you need the first one since it is called an expansion pack, sounds like it expands the original version.  Elizabeth"}
{"product_id": "B008CP6Q6M", "context": "How many CDs are in the Pack?", "response": "2, 1 for each game."}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "The DLC with Cesar Millan sucks, he just keeps pinching my guy on the neck and not letting me eat KFC."}
{"product_id": "B0002DKTY2", "context": "does this dictionary have Audio pronunciations?", "response": "It will not work with Windows 8."}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "Bought this on November 12, 2014.The box does come with a receiver and installation disk.  You are set."}
{"product_id": "B006QRMR4S", "context": "Can This replace my DS lite? Will I still be able to play my original DS games?", "response": "Yes, but I'd recommend an XL model with its 90% larger screens and better build quality.  (EDIT: The XL is also backwards compatible...realized that might not be clear from my post!)"}
{"product_id": "B00ATF5YYI", "context": "will this play on win8", "response": "The game will play on Win 8.  However, if you are having problems with slow and jerky movements, you have a videoproblem.  I have this problem on my laptop, but not on the desktop with a good video card."}
{"product_id": "B007SO6USW", "context": "Does it come with a charger?", "response": "It is a charger for ps3 controller. And it has 2 USB slots on the side, which can be used to charge other things. I use it to charge my phone and head set. It does not come with anything else. Hope this answers your question, not 100% sure what you are asking"}
{"product_id": "B00886XQO0", "context": "I have the Headset Adapter that came with another set of Turtle Beach headphones, can I plug these into that for my Xbox One?", "response": "I don't know what type of adapter you would need. The Xbox One has digital audio out (optical) that will plug directly into the base station of this headphone setup."}
{"product_id": "B008SBZF4Y", "context": "Do the graphics differ depending on different consoles?", "response": "This is all about opinion to be honest.  But in my opinion it goes from Playstation 3, xbox 360, wii then DS.  The graphics are good but cartoon style.  I hope this helps."}
{"product_id": "B00B3FIXJQ", "context": "Will this work for Halo 4?", "response": "It's literally just an xbox 360 controller. It will work for any game on the xbox 360."}
{"product_id": "B00FKV8AK6", "context": "is this game mature, if is tell me why", "response": "Rated `M' for Mature... Blood and Violence."}
{"product_id": "B00DBDPOZ4", "context": "Anyone know how many mAh this battery is? The Energizer battery is 1200 but I do not see it anywhere on the product description for this one.", "response": "It is 1400 MAH."}
{"product_id": "B006W41X1S", "context": "can you sound whore with these?", "response": "It depends, I use them mostly for Call of Duty and in Ghosts its really easy to hear enemies but in Black Ops 2 its harder just because the footsteps aren't as loud anyways.  Haven't really used them for older CODs.  I will try Black Ops and MW3 soon.  Hope this helps."}
{"product_id": "B0050SYX8W", "context": "Can you jump into Halo 4 not having played the other games?", "response": "Sure you can.  You will miss out on the story line from the beginning but you can still enjoy the game."}
{"product_id": "B0086V5UF0", "context": "I want to use this with a group of girls.  Do I need a remote controller for each of them or can they just follow the choreographer on the screen?", "response": "For the group mode a remote is needed for each player & actially there are goals on the game needed to be met as a group of 4."}
{"product_id": "B002I0H79C", "context": "if i buy this you will send me a code? first?", "response": "I never got one that I am a sure, I only bought it for horde and campaign mode."}
{"product_id": "B00FMNNQCY", "context": "Is this controller made by Sony?", "response": "It is made in Sony."}
{"product_id": "B00E1DMWBM", "context": "this may be a stupid question but can it play sega genesis cartriges?", "response": "no, get a sega nomad if u want to do that."}
{"product_id": "B00GHJ6X8G", "context": "I have a sealed copy of MLB 13 sitting next to me. Is it worth upgrading to MLB 14? I can't afford a PS4 now, so the PS3 version is my only option.", "response": "If you're only interested in the offline play and Road to the Show then this game is better. The graphics are also better, however the online play is really bad. If the connectivity and fluidity of the online improves then 14 is better. If you don't want to take the risk, then keep 13."}
{"product_id": "B0036WTVNG", "context": "Is this compatible with Android devices?", "response": "I was only concerned with the application of PC gaming. I didn't bother to try it with mobile games (not really into mobile games)."}
{"product_id": "B0054JGGGY", "context": "Does this mouse have the same input lag as a wired mouse compared to my DeathAdder? I would love to use it for CSGO", "response": "No lag. In either mode. I suffer from constant connection problems and randomly the sensivity spikes 100x. Stick with what you got until their next wieeless"}
{"product_id": "B0085VIILY", "context": "Can the joystick be used with other games like HAWX or Ace Combat?", "response": "I have only used it with Blazing Angels. Have not played the other games so not sure."}
{"product_id": "B007TYC8MI", "context": "the pass online doesn`t work bro :/ the game is in very good conditions but i need the pass online :/ please help i really need this", "response": "I received a NEW copy of the game... The passes have since expired, I too was upset when i received my copy with an expired pass. False advertising if you ask me."}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "Has Anybody Called Corel about this?"}
{"product_id": "B003O6CB6S", "context": "hi, i would like to know if it comes with subtitles in Spanish, thanks for your help.", "response": "yes it comes in Spanish language to change in settings"}
{"product_id": "B00A378L10", "context": "What do you mean by 'Brown Switches?'  Is the key light white and the keyboard black?   Thanks!", "response": "Brown switches are one of the 5 types of switches that mechanical keyboards use. They each have different type of sound and hardness when typed. Google key switches mechanical keyboards and you'll understand."}
{"product_id": "B003O6CBIG", "context": "will online work or do i have to buy it myself, because online is the best part of Cod games", "response": "as long as you have an internet connection, PS3 is free to go online. so yes, online works :)"}
{"product_id": "B00286BZ4Y", "context": "Does it work on Windows 7?", "response": "I have windows 7, and it works just fine.  I also have Wheel of Fortune"}
{"product_id": "B00GANWVJE", "context": "Is it different enough from ALTTP to where I won't feel deja vu?", "response": "They managed to make this game so that almost all the deja vu you do end up feeling is good. All the areas that it would be bad in are different enough to feel new. It is a brilliant combination."}
{"product_id": "B001UWGDPS", "context": "will this run on win 7 32 bit", "response": "yes runs perfect,and the game is absolutely fantastic a lost gem I,ve played it 3 times.and will play again"}
{"product_id": "B000VBFWAG", "context": "Is this a physical copy or a download?", "response": "Hello, this is for a physical copy of the game."}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "my son says you can do 2 player"}
{"product_id": "B004TTNTYW", "context": "Does the charger burn and create smoke?", "response": "This charger is not working on the such DS"}
{"product_id": "B007FVVXXA", "context": "Will this work on the PS4", "response": "read my review this thing is a piece of junk"}
{"product_id": "B004RMK4BC", "context": "Do i have to have a real  US address to purchase this item ?  Thank you ..", "response": "As long as you have a credit. Card you can purchase the card.you have to have an email address so they can send you the special code that you need."}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "I use it on my flat screen.  You won't need any special connections.  Its great playing old school games on a nice big flat screen!"}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "It will be working (this is STEAM version)"}
{"product_id": "B00CX8VYM0", "context": "Can I play this on the PS4?", "response": "Not this version it's for the XB1, but there is a version for the PS4 it's the exact same game just different format. Hope I answered your question"}
{"product_id": "B004QRKWLA", "context": "Can I use this controller in the place of a mouse and keyboard on SIM type games?", "response": "I've heard of JoyToKey (google it), I'm not familiar with actually using it, but I believe it's a way to enable a controller to emulate a mouse and keyboard"}
{"product_id": "B00DHUUTEM", "context": "Is the clicking on the keyboard quiet?", "response": "Yes, the keyboard is quiet; the mouse has its normal clicking sound though."}
{"product_id": "B002L93F0A", "context": "Does this product work and if so how does it hold up to light/moderate use?", "response": "Yes, not bad for moderate use."}
{"product_id": "B00AAS88K6", "context": "Will this work with windows 8.1?", "response": "Yes. You will need to update the software but I do not notice a performance or functionality difference. It works very well."}
{"product_id": "B00F9RGFEY", "context": "I have two game systems. PS3 and PS4. This team works for both?", "response": "Heck yeah they do! My hubby uses ps4 and my daughter uses ps3!"}
{"product_id": "B00BQWTGIS", "context": "Is the goods use a cd-rom to install or download online?", "response": "I haven't bought a cd rom since 2007. If I was you I would download it"}
{"product_id": "B001H4NMNA", "context": "An odd reply for this question below so I'll ask it again: Can I put a PS3 and a PS4 controller on this charger?", "response": "No. PS3 is Mini USB (This product)PS4 is Micro USB. Completely different cables. Even if the notches of the charger line up it won't physically fit."}
{"product_id": "B00F27JGVA", "context": "Does this card works correctly with USA's PS Vita systems?", "response": "Yessir David, works perfectly just like a chip from here. I got mine in the mail not too long ago and couldn't be happier with all the space it has on it"}
{"product_id": "B00CMQTUY2", "context": "what size is the cable?", "response": "Package does not specifically say.... But, this is from Microsoft's site: 9' (2.8m) charging cable with LED charging indicator.-IWD"}
{"product_id": "B00EI4V3X2", "context": "Is this headset surround sound for both PS3 and PS4? I would like a headset that has equal surround sound for both systems?", "response": "Yes thr surround sound is controlled on the black box you plug into your ps4 or ps3"}
{"product_id": "B0079V29EI", "context": "Can I charge my vita with this grip on?", "response": "Yes. You use the same charger to charge the grip and vita. The vita charges first then the grip after the vita is full."}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "Runs fine for me on Windows 7, so yes it does."}
{"product_id": "B000ND3XXA", "context": "Is it compatible with other emulators? For example, If I wanted to play a SNES emulator with a PS2 controller, would it work?", "response": "I've done it with N64 and SNES."}
{"product_id": "B0081Q58AW", "context": "Is this key redeemable on steam?", "response": "I don't believe so."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "All the Dorito dust... all of it."}
{"product_id": "B00FM5IY0Q", "context": "I just bought an Xbox One.  Should I pick this game up or pass?  Is it anything like The Last of Us.  I really liked hat game.", "response": "Well, it is survival horror. But that's about where the comparison ends. It's meant to be sort of funny. Not so serious. But as far as games available on the x1 right now it's pretty much this or titanfall."}
{"product_id": "B004S5TDUQ", "context": "Does the game work on windows 8?", "response": "Yes I've used it on Windows 8 and 8.1 but you do need a more powerful computer.  See the minimum system requirements then  I would add a little. If you don't then there may be some lag time between playing rhe note and it registering."}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "hi , i run with 8.0 win but must be in lower thin HD Resolution."}
{"product_id": "B0048XAVC2", "context": "Can I run Roller Coaster Tycoon 3 on MAC OS X 10.9.5??Also, Do I need a video card?", "response": "Yes it will run on mavericks (10.9.5).  Your mac already has a video card built into the hardware, no need to upgrade it for RCT 3."}
{"product_id": "B002I090AG", "context": "Is an SD card really necessary for the 3DS?", "response": "If it is necessary to store photographs, videos, ringtones and user settings."}
{"product_id": "B00FQPQO4A", "context": "Does this game work on the Surface 2", "response": "it will not but you can buy and download farming simulator 2014 on it"}
{"product_id": "B0041RY3W4", "context": "does it plug into a wall outlet or does it have to be pluged into to ps3 station?", "response": "It plugs into the wall outlet."}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "No, and a ton of wires!"}
{"product_id": "B00D96BNGM", "context": "I have had this headset for almost a year now, but all of a sudden i cannot talk through my mic, is something broken??", "response": "Check your headset controls.  Update console AND the headset by going to Turtle Beach website."}
{"product_id": "B00EOPT5ZS", "context": "How quick is the reaction time?", "response": "As fast as you can press the button down with your foot. I like the board - but it did take some time for me to get used to using it quickly. Turns out your fingers are a lot better at this kinda thing."}
{"product_id": "B0000C7GHG", "context": "does it come with memory card?", "response": "Mine did. I believe it is on a per sale basis. Look in description closely. The system itself works fine. Still in use."}
{"product_id": "B0044DJZ0A", "context": "is there any backlight? and how does it do compared with the Mad Catz Strike 3. good for BF4? Thank, oh and can i set the color of the light?", "response": "The SteelSeries Logo at the top right of the keyboard lights up, but the keyboard itself is not backlit. I have had mine for about a year now and still enjoy using it (World of Warcraft keyset). I'm not sure how it stacks up against the Mad Catz Strike 3."}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "Nintendo 3DS XL/LL consoles are unfortunately locked by region, so you can only play games from that region. I haven't tried US games on this 3DS, but this is the explanation I have heard. In contrast, the Sony Vita is not locked."}
{"product_id": "B0087OZ5FG", "context": "Pulse elite or gold?", "response": "They are the Pulse Elite."}
{"product_id": "B00D96BMV8", "context": "This product brings Stereo Headset Adapter?", "response": "Yes, It has the adapter for the controller."}
{"product_id": "B0042J7I3C", "context": "I bought 3 for my grandsons. They are playing on 2 xbox 360's in same house. All 3 headsets are skipping when they talk to each other.  Any idea why", "response": "Being close to 1 another with the headphones will cause skipping."}
{"product_id": "B00BZOBE78", "context": "Do you need gods and kings for this to work?", "response": "No you do not need the gods and king explanation pack to play it will fine without."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "1 - 2 players offline. http://www.saiyanisland.com/tag/j-stars-victory-vs/"}
{"product_id": "B009DL2TBA", "context": "does it play ps1 games and ps2 games too?", "response": "Just want to reinforce that yes, it will play PS1 games.  Anyone who says it won't is wrong.  You can play PS1 games from a disc just fine.  It's PS2 games that won't work."}
{"product_id": "B000B6MLPU", "context": "the cable does not seem to fit into the x box anywhere.  Do I have the wrong cable? Or is there somewhere it should connect?", "response": "Your Xbox 360 might be one of the newer (newest?) model, which I think only has an HDMI port. This composite cable won't plug into your machine if that's the case..."}
{"product_id": "B00ANHBJBY", "context": "Controller only works when plugged in. Is there a color that indicates when the thing is fully charged? Or did I just receive a bad unit?", "response": "My first controller did the same thing - bad battery or something, if you return it to Amazon they'll ship you a new one and you can ship the defective one back in the box the new one came in. Second controller works great!"}
{"product_id": "B00519C7CE", "context": "is this a digital download for xbox 360? i wanna play today, but i dont wanna wait for shipping.", "response": "Thanks but that doesn't help. Is it a hard copy or a digital download?"}
{"product_id": "B0087ZMATE", "context": "is this a good headset if i need to hear people calling my name?", "response": "With the open foam ear cups, you have very good ambient awareness. Sound  quality is very good, although sensitivity is a little low if you try to use these for mobile device."}
{"product_id": "B008MI7MWQ", "context": "can I play this game on o/s windows 8?", "response": "I don't know. I've never tried it."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "No, it is a standard audio jack connection."}
{"product_id": "B00DE2W4PK", "context": "What's the difference between the US and the Japan version of the PS4?", "response": "I don't know, never really thought about it."}
{"product_id": "B004FS8LYK", "context": "Do I need to play any other Tomb Raider games to understand this one?", "response": "Not at all.  I have to say this one is by far the best Tomb Raider game."}
{"product_id": "B001IYR53W", "context": "Does it have tournaments?", "response": "While this lists quite a number of card games, I see no sign that it has the capacity for tournament play."}
{"product_id": "B009GTV5HS", "context": "Is this a wired or wireless mouse? I have read online that this is a Hybrid with both features, but the pictures look like a wired mouse.", "response": "This is a wired mouse. The pictures are deceiving on the size though. Its quite large. I ended up returning it and replacing it with a different mouse. The left and right buttons were susceptible to bowing in when pressed hard and squeeked pretty good."}
{"product_id": "B003ZSHN0O", "context": "will this work on windows7", "response": "Yes it has worked just fine on my computers in Windows 7."}
{"product_id": "B004NRN5EO", "context": "can i play this game in spanish?.. or even subtitles in spanish?", "response": "The game only has English audio and subtitles (or Japanese if you purchase the Japanese version. There is a multilingual (Spanish) Prepare to Die version of Dark Souls for PC though, if you don't mind buying the game for and playing on a PC. This PS3 version, however, is limited to only English audio and subtitles."}
{"product_id": "B0071NH8B8", "context": "How many hour's of gameplay will it last before the battery needs to be re-charged?", "response": "I've been getting 4-41/2 hours per charge."}
{"product_id": "B0086UK7IQ", "context": "Is this mouse ok for smaller hands? Mine are, and though it's hard to tell from the photos, it looks rather large...", "response": "Its on the larger side. If I was you I'd go with the Naga for a smaller size."}
{"product_id": "B00178630A", "context": "can you play 2 people at the same time", "response": "Not on the same PC.  You can, however, play with up to four people at a time online."}
{"product_id": "B00FNNQREC", "context": "What is a good age for this game?  Can younger kids play it?", "response": "I think for a teenager, not kids."}
{"product_id": "B00BDS415I", "context": "Can these be used with the PS4 right out of the box? no adapters or anything?", "response": "Yes, they will work right out of the box."}
{"product_id": "B002BSA20M", "context": "Can this be played without an XBOX Live membership?", "response": "If you don't want to have an online experience play, yes, it's a great game one of the best games of the Halo saga enjoy it."}
{"product_id": "B0040UAYI4", "context": "does it work with PS4 ?", "response": "No not at all"}
{"product_id": "B00FRESQYG", "context": "Is this version contains World of Warcraft, The Burning Crusade, The Wrath of the Lich King and Cataclysm ?", "response": "ya it contains all 4 previous to Mists of Pandaria    :D  happy WoWing!"}
{"product_id": "B0058FAEAS", "context": "Can you trim the plane with this product or do you need the trim wheel and can you use a rutter function without buying the peddles", "response": "There are multiple buttons on the yoke and the throttle to customize for trimming. So you don't need the extra trim wheel. I don't think there's any good way to performs he yaw function without the rudder pedals. I highly recommend getting the rudder pedals. That completes the set so it mimics an aircraft more accurately."}
{"product_id": "B00AK4QB22", "context": "Can you play as a female character?", "response": "Absolutely- who would WANT to be a man when they can be a kick ass woman?!"}
{"product_id": "B0096L2SJ0", "context": "Does it still work for emulators?", "response": "It works with drastic, John gba, my boy, and a great color emulator but the driver apps are crappie and it doesn't like to stay connected for long if at all. The nyko one is infinitely better.."}
{"product_id": "B003VH5Z2C", "context": "I didnt realize my TV didnt have a Yellow in for video. Is there anythying I can buy that will convert the yellow and white plugs to HDMI?", "response": "That adapter is very expenses. We used to the hori one."}
{"product_id": "B00E4MQODC", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "It is fixed non-switchable."}
{"product_id": "B002I0KP4G", "context": "Does the latest version of 13 inch retina 128GB works for this game?", "response": "Yes it does, though I wouldn't recommend trying to run the graphics on Ultra/Extreme on anything with a less than 2.6Ghz processor same as Wings of Liberty.  However you can still run graphic on High you might be able to get away with Ultra if your Graphics card is good enough."}
{"product_id": "B00EZAWV6W", "context": "is it better on pc or xbox?", "response": "Do not buy for PC. Spent about 6 hours downloading it and setting up account at 2 different websites and game just comes on and you can't get the players to move."}
{"product_id": "B00CHYOP80", "context": "are these a usb headset", "response": "Both they have a standard connector for iPhone iPod ect and a USB converter that connects to PC and gaming consoles but you can solely use the headphones without usb"}
{"product_id": "B000PD0HQE", "context": "will this xbox 360 include all listed items?", "response": "Hi Tanya,Yes, it will."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "The longest I've used the head set was roughly 8 hours and it lasted. That is it being fully charged before use."}
{"product_id": "B00AK4QB22", "context": "where is the manuel?", "response": "There isnt one, this is the way the game is designed. You'll make mistakes, and will pay for the price dearly, again and again and over again. It is punishing but at the same time, very rewarding!!But if you go to Google search for \"Dark Souls 2 Wiki\" you will find all answers you seek."}
{"product_id": "B001E27DLM", "context": "Does this game have multiplayer mode?", "response": "Nope. Single player rpg from SNES era."}
{"product_id": "B00EZKNT18", "context": "How long is the cord?", "response": "Must be 3 or 4 feet. Hasn't been an issue for me because I sit next to my tower but its long enough to comfortably wrap around and plug it in the back and still have slack"}
{"product_id": "B001PO2BJI", "context": "We have the \"Wii Remote Plus: Princess - Peach\" - will these work with that model of remote, please?", "response": "Yes, we have an original and a plus and they both work the same."}
{"product_id": "B00CBQO930", "context": "So does it go up to 2000 DPI or 4000 DPI?", "response": "If you download the anker software it's goes up to 4000"}
{"product_id": "B0086UK7I6", "context": "I'm curious about the buttons behind the scroll wheel. In some images one of them is raised and in others they're not. Are they normal buttons?", "response": "Yes, they are normal buttons. The one furthest from the mouse wheel is raised a bit."}
{"product_id": "B00CPS59CE", "context": "Does this come with the bluetooth wireless chat adapter as shown in the photo?", "response": "Yes,  for the 360 controller."}
{"product_id": "B003VUO6LU", "context": "I wana play ps1 and 2 games can i", "response": "This is a genuine machine. Only run ps3 games."}
{"product_id": "B001AH8YSW", "context": "When I try to launch the game I get an message that says to insert the original game disc. That is what I believe I have done. I have Win 8& 4 discs ?", "response": "Try patching if not try an xp machine I use one as a backup for older games on discs never fails."}
{"product_id": "B00CJ7IUGS", "context": "Do I need to have played Oblivion to understand Skyrim?", "response": "Not, absolutely not. They happend houndred years in between so they are almost independent from one another. The only thing is if you pick up books on Skyrim, you will find some that talk about the Oblivion Crisis. No more than that."}
{"product_id": "B003Q9RGRW", "context": "Does it come with the headset", "response": "The one I bought didn't but it didn't show a headset on the cover either."}
{"product_id": "B00CX9L30W", "context": "Does buying this come with a subscription?", "response": "For the first month yes."}
{"product_id": "B00G6YJ60E", "context": "Is Whistleblower included in this or do you have to buy that seperately?", "response": "It is not included."}
{"product_id": "B009DYCTY4", "context": "does the product come with a controler", "response": "Yes, it does come with one controller and a cable for recharging.  Cable is USB to Mini USB."}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "There's no internet or wifi feature."}
{"product_id": "B006RJ373K", "context": "Can I use it with Windows Vista?", "response": "Yes, but highly recommend you go to Windows 7.  Skip 8!"}
{"product_id": "B008U5ZNIG", "context": "Does it work well?", "response": "Yes it does ive had a problem with it but amazon fixed it right away everything is perfectly fine now."}
{"product_id": "B003BKWEHS", "context": "does it work on windows 8, 64 bit?", "response": "Yes, it does. My husband's computer is has Windows 8."}
{"product_id": "B006JKARP8", "context": "Can this be used to charge other devices via USB?", "response": "Yes it can be used to charge other devices, but the unit itself does not come with a cord to charge itself. The charger needs to be charged with the PS Vita proprietary cord."}
{"product_id": "B00F2ENJY8", "context": "can 2 or more people play simultaneously, or do they take turns (e.g., mario kart)", "response": "You can do 4 people simultaneously (even more if you buy extra equipment).  When you purchase a game just look at the back of the cover and see how many players it is made for."}
{"product_id": "B000087H7T", "context": "Bought one from a seller and it played games fine for them.The GBA SP won't play games when I try to. Broken console?", "response": "Probably, talk to the sellers. Or maybe it's your games?"}
{"product_id": "B003NVMEVQ", "context": "When you click the mouse is the sound, soft or loud?  I need one that has as low noise as possible when clicking.", "response": "It's okI think is soft not too loud"}
{"product_id": "B00IAVDQCK", "context": "Can I use this headset for voice chat only?  (Game Sounds still coming out of the tv.)", "response": "Yes you can... the adapter has buttons where you can adjust the percentage of voice/game volume. If you hit the voice button until it beeps, you will only hear voice :)"}
{"product_id": "B009RXUNZI", "context": "When you \"stash\" the mic, does it mute? I would like this to act like PTT during games.", "response": "sadly stashing the mic doesn't mute the headphone. the volume and the channels are all controlled by the mixer on the cord"}
{"product_id": "B000TGQLYE", "context": "Does it work for reading PSX/PSOne memory cards?", "response": "It didn't even work for my PS2. It was meant to because its specs were in line with my PS2 version and still only two controllers worked."}
{"product_id": "B007A7K60A", "context": "will this work with windows 8 on a PC", "response": "It works with Windows 8.1 but you need to manually install some runtime components in order to get them to work. They have to be run manually."}
{"product_id": "B007XVTR3K", "context": "So do you need an online pass to play it if you buy it used?", "response": "Hey there!Nope:) nice thing about black ops is there's no separate purchase to play online."}
{"product_id": "B00G21VQ2M", "context": "does it have english subtitle? can i play online if im in the US", "response": "No it doesn't have english sub but yeah you can play online"}
{"product_id": "B00DVEJA7G", "context": "I have a Sony non Bluetooth CD player and I was going to order a Bluetooth transmitter for it. Will these headphones pickup from that transmitter?", "response": "Yes they Will connect to any other blues tooth device"}
{"product_id": "B00IIHU44E", "context": "Can I use my 360 controllers with the new system? Thanks!", "response": "No, the Xbox One and Xbox 360 use different controllers"}
{"product_id": "B0018YXM3Y", "context": "Does this game work on windows 7 ?", "response": "yes my son is using it on his windows 7."}
{"product_id": "B008RA5DIY", "context": "If we purchase Quickbooks from Amazon, does Intuit still provide support?  They tell me that you may not get their actual product.  Is this true?", "response": "Not sure who \"they\" are, but you get genuine QuickBooks and whatever support is advertised with the particular package you may purchase.  I have both QuickBooks 2012 (single), and QuickBooks 2013, 3 user."}
{"product_id": "B0079V29EI", "context": "I have read lots of complaints about people receiving the wrong model for their vita. I have the original vita, will this grip work for that model?", "response": "The answer is yes. I also have the original Vita and it works great."}
