{"product_id": "B00D3TRMD8", "context": "Can I buy it here and send to my nephew in different country? Will I be getting a password so that he can download?  Or am I the only one who can download?", "response": "You can as long as he has a steam account and you use his to give him that game."}
{"product_id": "B00A7VK16A", "context": "can I plug this into a car with a DC to AC adapter? If so, which adapter would you recommend?", "response": "I have not attempted to do that and don't think I will...."}
{"product_id": "B00GD962OA", "context": "How many GB capacity has this?", "response": "This Nintendo Wii U is the basic console and has 8 GB of storage."}
{"product_id": "B007MM9E42", "context": "Can you play the Wii version on the Wii U?", "response": "The only thing you can't play is the Nintendo Gamecube games on Wii U"}
{"product_id": "B002I0GF72", "context": "What controllers are supported?", "response": "game pad, or pro controller for wii u"}
{"product_id": "B00CPKUV98", "context": "is this 1 or 2 player", "response": "Game is only single player"}
{"product_id": "B001BYMZ5W", "context": "Does this headset come with the USB Dac and also does it have Mic Monitoring?", "response": "No, It comes with a 3.5mm headphone and mic jack and an adapter for the headphones to a larger analog jack. this headset is completely handcrafted and anoalog. to answer you question with a video watch the unboxing here. https://www.youtube.com/watch?v=9cb641UtuuM"}
{"product_id": "B001UIG6M2", "context": "Does this Come with a memory card?", "response": "No it does not.  There are thousands of codes on the disc that load into memory.  Any extra codes you enter for a game are saved on your existing Memory card.  Make sure you have one that has room on it if your entering codes for a game."}
{"product_id": "B009AFLXZM", "context": "how long is the cable?", "response": "Mine has not been opened.  However I'm hoping that it's cordless."}
{"product_id": "B00A2WP4UC", "context": "Does it include the sensor bar?", "response": "I bought one for my son in January. Yes, it comes with the sensor bar and blue one wiimote and nunchuck."}
{"product_id": "B009S4JZKK", "context": "can you create your own layout? or world? and is their a website for downloading other yards, engines, and or cars? and can you also upload your world so other can play? what you have created?", "response": "I found this program too complex and difficult to operate.  I am sure there must be better train simulators than this"}
{"product_id": "B004N7IIQ4", "context": "can i use this headset with my ps4 and pc?", "response": "Yes as long as you have the right ports for your pc the ps4 has the right one"}
{"product_id": "B00FQPQO4A", "context": "How do i install the addon after i install the base game?", "response": "Simply download it from Amazon, double click the executable and when prompted enter the key code provided.  It does not do a full install process it just extracts some files and updates others.  It doesn't look like and install from the base game."}
{"product_id": "B006JKARP8", "context": "can i charge my samsung  galaxy tab 2 with this portable charger? i have a ps vita too, but i would like to know if i can use it with my tablet and my iphone 5.", "response": "My sister owns Samsung Galaxy Tab 2 10.1, I tried charging it with this charger, and it indeed worked."}
{"product_id": "B000J18SR2", "context": "Will this play with a 2D video card and Windows 7?", "response": "I have windows 7 but not sure what kind of video card I have.  The game works fine for me."}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "per my son yes it is"}
{"product_id": "B00D2EGWDA", "context": "I just bought this new, did the download on PS3 then installed it. When I go to play,only have 3 maps town/farm..where is the dlc at?thanks", "response": "DLC has to be redeemed through the psn store, even if it's the gotye. You should receive a 12 digit code to redeem for dlc, or purchase it separately in the store"}
{"product_id": "B000LQ4HTS", "context": "Can I twist the stick to control yaw in a helicopter  or use it as rudder in a plane?", "response": "Yes, the control stick has twist axis which is used for yaw function, also there is special knob which disables this function if you don't need it."}
{"product_id": "B00503EAG2", "context": "Does this come with a new product key for activation on Steam? (Physical copy + Product key?)", "response": "I didn't even use the disc. Launched Steam and chose Activate a product on Steam. Entered the code that is included inside the case and Steam downloaded it."}
{"product_id": "B006YDPU48", "context": "On the PS3 version, do you experience difficulty connecting to the servers due to overload (not due to a banned account)?", "response": "Impossible to say what causes lost connection as the message on screen does not tell you - it just says \"lost connection\" so can be any type of fault (you or them)"}
{"product_id": "B00IAVDQCK", "context": "Are there over-ear? And how do the build quality and sound quality stack up against a mid-range turtle beach headset?", "response": "They cup over the ear but do not match the intense sound of turtle beach.  I have an inexpensive set of turtle beach (X12) and the work great with the xb one.  You do have to purchase the Xbox earphone adapter though.  Don't pay more than 25 bucks..shop around."}
{"product_id": "B005VA5D24", "context": "Is this hard drive compatible with the Xbox 360 Original Console?", "response": "To my knowledge, it should work with any 360 console out there."}
{"product_id": "B00FM5IY4W", "context": "Can two players play this game at one time?", "response": "Yes. The game will switch to split screen. However, you can not play online with two people using the same xbox."}
{"product_id": "B00E1DMWBM", "context": "Can this system emulate games other than Genesis, like SNES?", "response": "It only has sega games"}
{"product_id": "B00002SANH", "context": "will this work on newer computer like 8.1?", "response": "Yes, but you will need to swap around some files. Here's an instructional video on how to do it.https://www.youtube.com/watch?v=QKan-FbCfVM"}
{"product_id": "B00GO4PTR0", "context": "These memberships works for just one account? Or multiple accounts in the same console? Thanks", "response": "It works for multiple accounts on the same console. Each account must have their separate online Id."}
{"product_id": "B000056SPM", "context": "Does the control rod extend out of the back of the case, or is it completely enclosed? Thanks...", "response": "Extends out back by 45mm in neutral position. Out 90mm with Yoke max forward.Hope this helps"}
{"product_id": "B00002SANH", "context": "Will this version work with a Windows XP, 3.3 GHz, 1.98 GB of Ram?", "response": "It should. If you have a 32 bit version of windows Xp should work out of the box. If you have the 64 bit version you will need to manually install it but it will work fine too."}
{"product_id": "B004G5TUJM", "context": "How do you use the foot pedals.  I have it hooked up to the PS3 but can't seem to get them to work.  The steering wheel is working.....help please.", "response": "On most games you have settings which you can change to move functions to different controls.. Find this menu and see what the setting is for the peddles. GT5 or 6 you have to go to the end of the start menu to find it, before you chose how you want to play arcade or career"}
{"product_id": "B00GY4OAIE", "context": "How do you save your game when you're not done with a level? Are there check points or something? My 8 year old is having a terrible time.", "response": "There are save statues in every level. It's a statue of a dwarf holding a paper where you can save your progress."}
{"product_id": "B009SJR28W", "context": "Is this a true Chiclet keyboard with scissor or higher grade switches, or just the style with a membrane layer underneath?", "response": "I'm not sure,but I'm not having any problems like this other guy. Some places say it has scissor switches, but I haven't taken any keys off to check. It's a good keyboard IMO."}
{"product_id": "B001Q24UAM", "context": "Does Play! have the actual games or just one-hr. trial versions with the opportunity to buy the real games?", "response": "The games are actually on the discs, they are to my knowledge the full game."}
{"product_id": "B0000695GX", "context": "are any of the roller coaster tycoons playable on windows 8?", "response": "I play my roller coaster tycoon 2 on windows 8. Runs perfectly fine and isn't buggy. Just like when I was running it on windows 7!!"}
{"product_id": "B00FEOR4MY", "context": "Will the DS fit in this?", "response": "We got this specifically for the 2DS. We also have a DSi, and it will not fit in this case. This case is made specifically for the 2DS. (This new 2DS does not fold in half.)"}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "I can go about two days with out a charge. And I use it to chat for several hours."}
{"product_id": "B00D6NPFDK", "context": "How many people can play", "response": "2 People can play at the same time and you share the screen/play space. You each need a wii remote and figure. If 2 are playing you work as a team. There are some battle modes where you can go at each other as well."}
{"product_id": "B008MI7MWQ", "context": "Has the Cleopatra slot machine game by Encore been fixed?", "response": "I never had a problem"}
{"product_id": "B003N3HEU0", "context": "waht kinde of remote can you use for this game the classic controller pro?????????", "response": "Yes you can use a wii gun or the classic controller"}
{"product_id": "B0087ZMAUS", "context": "Are these open eared?  Will i be able to hear whats going on around me and myself talk? Thanks.", "response": "Yes, these are open eared, similar to a number of their headphone models, including the discontinued HD-580, which I also own and recently replaced pads on."}
{"product_id": "B001E27DLM", "context": "Does this game have multiplayer mode?", "response": "Not really, just a tagged on \"raise a monster for fights\" pvp minigame, but you would need two games."}
{"product_id": "B0044DJZ0A", "context": "IS THIS KEYBOARD COMPATIBLE WITH MAC", "response": "Some features work out of the box, such as the normal keys, the audio jack, the media keys and the USB hub. Other features require the software which is not available for MAC. Meaning it's a waste of money if you have a MAC... because you won't get the advanced features out of it."}
{"product_id": "B0085P7U0U", "context": "Does this software work with new operating system Maverick", "response": "Don't know because I don't have the Maverick operating system."}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "sorry The......  i dont know how to say it.. the  \"back support\""}
{"product_id": "B00B3FIXJQ", "context": "the synk button is not working", "response": "Sometimes you have to hold it for a second"}
{"product_id": "B002I0HJG8", "context": "Does this one give me Founder Status with the 8 Character slots, 4 bank slots and all, or do I need the Collector's edition instead for those benefit?", "response": "This one will do just fine if you want the founbder status.All you need to do is once u get ur solid copy redeen your Cd key on the website.extra tip is to redeem your cd key backwards afterwards and you'll get extra stuff, hope it helped and have fun in the world of TERA."}
{"product_id": "B007XVTR12", "context": "Can I use this with Macbooks?", "response": "Unfortunately, we can't check system requirements given that all of our inventory is at Amazon.  -IWD"}
{"product_id": "B00C2B2Y9A", "context": "Will these work with the playstation 4 in full surround sound?", "response": "Yep, and is AWESOME!!! jaja ;)"}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "Yes plug&play;, but if you want to take full advantage of the functionality of this keyboard, you need to download the software from the corsair website."}
{"product_id": "B00B98HDNO", "context": "does it have to use inernet", "response": "I think so. When game is installed it installs Steam. Steam typically must access the online server before any of its games will play. There may be eceptions."}
{"product_id": "B005BLAJ68", "context": "i just bought a new computer think it was windows 8.1 will this work for my system", "response": "It DID NOT work!!!"}
{"product_id": "B002I0K3PM", "context": "is this a 2 players simultaneous game", "response": "No it is not and it requires the use of the game pad as well."}
{"product_id": "B00KAI3KW2", "context": "Can you play classic xbox (1st console) and xbox 360(2nd console) games on xbox one?", "response": "As of 15th June, 2015 yes you can! Microsoft announced at the e3 conference that xb360 games WILL be playable. (this list is small but is expected to grow once all game makers sign an agreement form). Also you wont have to pay to play games you already own on disc or digital."}
{"product_id": "B00DB9JYFY", "context": "Do you need a \"chat headset\" and a \"Kinect\" in order to play Titanfall?", "response": "Neither is needed.A headset I would recommend if you had friends to play with"}
{"product_id": "B00CBNV7UQ", "context": "Does it have cuss words in it?", "response": "No I do not remember there any profanity or cussing in this game. I believe it's rated T for Teens"}
{"product_id": "B00EZAWV6W", "context": "Does this work on iMac?", "response": "No. You're have to use Bootcamp or Parallels/Fusion with Windows loaded."}
{"product_id": "B00D96BPL0", "context": "Is there an option that let's you change your voice?", "response": "Not that I know of, no."}
{"product_id": "B00BQZ5EWW", "context": "if i buy Total War: Rome 2 will the Imperator Augustus be add or do i have to buy Total War: Rome II - Emperor's Edition to get it ?", "response": "You have to buy it seperately,   they are two seperate editions"}
{"product_id": "B000056SPM", "context": "Does it use external power or just the usb? If it does use external power does it work on 240V?", "response": "It uses USB power only"}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "Might be defective cause mine doesn't do that"}
{"product_id": "B00JFCA6V2", "context": "What does it mean when this ps vita has been 'factory Recertified'?  Why does it cost less than the others?", "response": "It means that this is used and it has been refurbished by Sony.  It isn't brand new, but they did an awesome job with it in bringing it back to par."}
{"product_id": "B00ECOBFA4", "context": "- Does this game have multiplayer mode?", "response": "Yes, it most definitely does have two player mode or single player."}
{"product_id": "B00FNNQREC", "context": "What is a good age for this game?  Can younger kids play it?", "response": "I would say 7 and older they have to know the essentials of farming to understand the game though it's complexed like planting spraying and combining crops!"}
{"product_id": "B006W3ZXEW", "context": "Is that a 7th button in the middle of the 6 side buttons or is it just a nub for resting your thumb.", "response": "It's a nub for the thumb. It's in rubber compared to the buttons so you can't mix it up and you thumb doesn't slip. You get 3 different size in the box."}
{"product_id": "B003ZSHN0O", "context": "I have avg antivirus, does anyone else get the warning that gov of poker 2 contains the win32 heur virus?", "response": "BOB: Disable your anti virus, and delete the game, then keep your anti virus disabled and then re-download the game again, then activate your anti virus. Let me know, Please."}
{"product_id": "B00C2B2Y9A", "context": "Will these work with the playstation 4 in full surround sound?", "response": "Yes and they work great best headset in my opinion.  Long charge great sound good price."}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "You get emailed activation codes. In the Playstation store at the bottom of the main menu there is a selection which says \"redeem codes\" you'll enter them there for each expansion and then download."}
{"product_id": "B001IYR53W", "context": "Is Canasta included in this version?", "response": "yes I love to play it too"}
{"product_id": "B00ECOBFA4", "context": "Will this play on the Kinect?", "response": "No, it does not. You will need to use the controller."}
{"product_id": "B00F4GSAYI", "context": "Do I have to have an additional internal hard drive to play the DLC's like Fallout 3 wants?", "response": "I agree with Tom. You shouldn't need to use an extra storage device unless your primary one is full."}
{"product_id": "B000K9Q5NW", "context": "What is with the fluctuating price? This seat was $299 last week.  I've seen the price move up and down around that number over the past several months.  Why the volatile price?", "response": "I got mine off of CL for $200.  I didn't pull the trigger when addicted to Amazon got them.  I was watching but missed them.  The chair is pretty good, I just wish both of my 360 wheels hadn't broken on me."}
{"product_id": "B00D6PTMB4", "context": "Does it work in a PS4?", "response": "I believe it is now available for download on PS4."}
{"product_id": "B000OPOCFU", "context": "Since it's used can it be installed and play by someone else?", "response": "I believe it should work. When you install, Just pick new player and start game at beginning as a hacker"}
{"product_id": "B00AQ2BLI2", "context": "Do I need to be connected to the Internet like in Empite or can I play offline?", "response": "You can play it offline"}
{"product_id": "B00CX9L30W", "context": "i have it for pc but would like to play on ps4. will on characters be on both or will i have to start new ones", "response": "You don't have to start new characters, your characters will be available to play on both platforms at any time. You can swap between pc and ps4 seamlessly"}
{"product_id": "B0056JPS84", "context": "Hi will the DG-16D2S, Phillips Lite-on Drive for Xbox 360 fit in the xbox 360 SLIM, or did i buy the wrong drive?", "response": "You should have disassembled you SLIM and determined the exact drive before you ordered.  Other than that don't have a clue."}
{"product_id": "B00HG0B8NA", "context": "I get the following error while updating the game: \"The application could not be installed because an application with that name already exists...\"", "response": "I've not experienced that actual problem, but try searching to see whether you've already downloaded the programme at an earlier time.   It could also be the programme is already installed as part of the system.   I hope you find what's causing the problem."}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "I Like The Nyko Charging Base Kit With The 2 Batteries, Never Had A Problem With My Nyko Charging Base For My Xbox 360, Just Bought The Xbox One For My Son 4 Christmas Along With This Charging Base. Go For It. I Recommend The Charging Base Better"}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "The base is plugged into an outlet, the remotes require rechargeable batteries"}
{"product_id": "B00BCEK2LA", "context": "How big is the mouse.  I don't care about the size of packaging.", "response": "You're better off watching Youtube review videos as it's very difficult to measure the size."}
{"product_id": "B00F27JDUY", "context": "So i can game online and there will no prob considering it from japan?", "response": "Yes i can game online worldwide"}
{"product_id": "B00HGLLRV2", "context": "looking into getting  a ps4 for Christmas I played the first game and really liked it is this game on par or better then the first infamous?", "response": "For me second son is much better."}
{"product_id": "B00FKV8AK6", "context": "Is XBox live (or internet connection) required to play?", "response": "No. It's just an option to play with people online."}
{"product_id": "B00GZ1H07Y", "context": "Does this game have 3D capability?", "response": "Yes, it looks like u r standing in front of the machine. Good graphics too..."}
{"product_id": "B00886XQNQ", "context": "does it work on PC/Mac? and is this wireless?", "response": "Andrew,You would need to have an optical port that put out dolby digital live on your PC and Bluetooth to use this headset with a PC. It is compatible out of the box with an Xbox 360 and a PS3, and mobile devices via Bluetooth."}
{"product_id": "B00BHSTXV6", "context": "I hit the space bar and it double space. Any fix for this? Thanks", "response": "Never run into that with the space, but I've notices with the O button in certain things it does a double O for it..."}
{"product_id": "B0095C0I4W", "context": "does this work on windows 8.1?", "response": "Red Alert 2 and on works fine for me. C&C; Dawn I needed to find a patch via Google Search. Red Alert works great. Tiberian Sun required some patching via Google Search. I used [Name Of Game] Windows 8.1 and varied adding different terms such as compatibility or patch. You'll find it. Good luck and have fun!"}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Yes there is an on/off switch on the bottom of the mouse"}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "I use xbox 360 controller, you have to buy one controller with the computer usb receiver, but the second controller it can be just the the regular xbox 360 wireless controller"}
{"product_id": "B002I0HD9G", "context": "Does this work with a racing wheel", "response": "Dear gamer  the game back cover states it accept steering wheels, so I am  assuming it works. Unfortunately I was not able to test and ensure it works as I dont have one. But either it allows or not this is a great game in my opinion. Good Luck!"}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "Yes I love mines it has a great volume and all"}
{"product_id": "B00D6PTMSW", "context": "Aside from the game and guitar is there anything else you need to purchase? I know nothing about guitars and this is a gift... is an amp required?", "response": "No! You just need a regular Electric Guitar or bass."}
{"product_id": "B0097CUREG", "context": "why cant i play this game on kindle ? Is there someway that i could ?", "response": "i can't play it either. I read from another email that you need directx11 on your computer."}
{"product_id": "B004H7P0B6", "context": "Does this include the grey cap?", "response": "It has a stander C joystick and a stander main Gray joystick. The product should work as long as it is a corded GameCube controller."}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "Unfortunately you would need a Wii U.  You can play Wii games on Wii U, but not Wii U games on your Wii.  The Wii U is an upgraded, more powerful system."}
{"product_id": "B00DT55P94", "context": "are they all on one disc? or seperated?", "response": "4 discs in two cases and a digital code for mega man 10."}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "It says it has a 2 year limited warranty and free online technical support."}
{"product_id": "B00GG4BBUM", "context": "I received this for the PS4 on Tuesday via pre-order, but there is no book in the game case.  Is this normal, or was my game just missing it?", "response": "I didn't receive a book in mine either. I looked a bit into this as well and from what I gather there's no physical manual."}
{"product_id": "B00BS520SG", "context": "How many controllers can plug into the adapter", "response": "Only one this thing is terrible please done buy itit was a waste of money for me  Would have rather bought the one from Nintendo for 100$ cuz at least that one would actually work"}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "The headset does, in fact, work. The huge problem I had with it is that the headset drains the battery so dead that the controller stops working. I honestly had to by another controller since the controller literally stopped working even with the charging cable connected."}
{"product_id": "B009LWQ0H0", "context": "Is it Mac compatible?", "response": "The disc version does say PC / MAC. So, it's definitely MAC compatible."}
{"product_id": "B00BU3ZLJQ", "context": "can you play in creative mode in xbox 360 edition?", "response": "According to my son, yes you can."}
{"product_id": "B00DC7FWRE", "context": "Is this just the game or does this come with the stand, and a remote?", "response": "It just came with the game."}
{"product_id": "B009CEM332", "context": "- Does this game have multiplayer mode?", "response": "The PC version does not.  There is split screen multiplayer on the Xbox 360 / PS3 versions."}
{"product_id": "B00C71034I", "context": "do you have the other disk so you can play online with different people or do you just have the campaign disk or do you have both disks", "response": "The game is packaged with both discs, but you require Xbox LIVE Gold Membership if you want to play online..."}
{"product_id": "B00CERXJNW", "context": "is it compatible with window 8.1", "response": "as far as plug and play in concerned, it will work. it is a keyboard after all. The program you download from corsair might be your only problem. on their website for the downloads it doesn't specify if it works with Windows 8. http://www.corsair.com/us/downloads/ That being said, it is a great product!"}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "Am not sure how people saying it works on Windows 7 or \"I don't know\" offers an answer to this question."}
{"product_id": "B0094H8H78", "context": "can you save your games ?", "response": "No you can't save games =0(("}
{"product_id": "B007LQG9A6", "context": "Does This Work With Windows 8 and I would like to know how this product preforms from a actual owner of this product thank you!", "response": "Yes it works! But mine got some cable connection trouble! But I don't think they all have this problem... So you may buy it if you want..."}
{"product_id": "B00CD90R72", "context": "Is there a 2-player mode where my wife and I play on the same screen?", "response": "Yes you can play with up to 8 players"}
{"product_id": "B0050SYK44", "context": "Does it support local co-op like the first one? My girlfriend and I really enjoyed playing it together.", "response": "Yup. It's famous for it!"}
{"product_id": "B004NRN5DU", "context": "The Game Has Spanish Language", "response": "On the back of the case it does"}
{"product_id": "B00A1AQJAO", "context": "I bought a used 3DS which did not come with any AR cards and the first thing the section would ask for is a \"?\" card; would this be included?", "response": "AR card = to your game cartridge"}
{"product_id": "B00HWMP0TU", "context": "So it looks like there are actually 2 versions of this game. One of them is complete in box and the other requires Steam. Correct?", "response": "Both require steam. Sucks i know but you have to have steam in order to play"}
{"product_id": "B0050SXKU4", "context": "Is this game at all appropriate for a 13 yo boy? My son is begging me for this, and it doesnt seem appropriate IMO.", "response": "It is not appropriate for a young kid to play this game, it has lots of gun violence, drugs, nudity, and dirty language. It is a fun game. But for a mature player."}
{"product_id": "B000OYMYZQ", "context": "Will this work with the wireless version for windows?", "response": "im not sure what your asking. it works great for any Xbox 360 if that helps."}
{"product_id": "B001AWBYRA", "context": "Does this work with Windows 7?", "response": "Yes, but i sugest buying the game off steam, mine didn't work on my computer after a few days."}
{"product_id": "B00C7103DO", "context": "Do this one comes with the Deathstroke dlc?", "response": "The one I got did come with the Deathstroke Challenge Pack."}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "If you bought a used version as I did, you dont get all the option available as in purchasing new.  The installation was ok for me, but I couldnt register it because it wasnt new purchase."}
{"product_id": "B00F27JGVA", "context": "is it a good idea to format the mamory card 64 gb when you get it new?", "response": "I didn't but it won't hurt anything if you do, so why not. I did just go through a corrupted minecraft save so maybe I should have."}
{"product_id": "B00KAI3KW2", "context": "how many gig on the hard drive", "response": "110v o 220v ???"}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine", "response": "I do not know - this was bought as a gift for someone else."}
{"product_id": "B004L6C6BK", "context": "Is there a way to mute my mic? I'm thinking of matching this mixamp with Audio Technica's ATHADG1 which requires you to hold the mute button closed.", "response": "No there's not. The mute is on the headset and there's no way to mute it on the mixamp. If you haven't already gotten the headphone the AD700s are really good and relatively cheap. Cheers,"}
{"product_id": "B000OYMYZQ", "context": "Will this let me use a wireless controller through USB on a PC or laptop, without using the Microsoft gaming receiver?", "response": "No it will not. You can only use a wireless 360 controller with the wireless receiver."}
{"product_id": "B00BMFIXZG", "context": "I bought this game and I can not play , I get it already been registered before. I could say I go to play ?", "response": "I had this happen to me, but all I had to do was close UPlay and re-log in"}
{"product_id": "B002Q4U5DK", "context": "is the mouse small?", "response": "This WARNING above is true. Box and mouse design are excellent counterfeits but not real product at all. It's not small nor big. Just the right size for my smaller end hands."}
{"product_id": "B008O7J1K6", "context": "Is this a Steam key?", "response": "yes this is a steam game."}
{"product_id": "B00DB9JYFY", "context": "Do you need a \"chat headset\" and a \"Kinect\" in order to play Titanfall?", "response": "No you don't. But you do need xbox live and wifi and xbox live membership."}
{"product_id": "B00DE2W33I", "context": "Hello!! Can I use this PS4 in Italy?", "response": "Everyone who has said the PS4 is region locked is wrong. A five second Google search will tell you that both PS4 and Xbox One are region free."}
{"product_id": "B002Z7BE24", "context": "Can this edition be played with the Move controllers (like RE4 for the Wii)?", "response": "It can be played with a headset with another friend who has a Playstation 3 headset. I heard rumors, that yes it can be played with the Playstation Move conrtoller. I have not tried playing it with the playstation move controller yet."}
{"product_id": "B000B78F72", "context": "1) does the freecell have a timer?  If so, can it be turned off?", "response": "I didn't see one, if it has one it can be turned off.---Yank"}
{"product_id": "B00EVWZHLK", "context": "Is it a multiplayer game?", "response": "Yes, it has online multiplayer 4-8 players. It has an offline campaign of 1 player."}
{"product_id": "B00DVEJA7G", "context": "Odd question, I use Spotify instead of iTunes on my iPod Touch...is this ok or must music run through iTunes?", "response": "I don't know if you will like it for jogging, they are not very snug. Perhaps an over the top of the head would work better than these behind the neck type. Good luck you will like the sound of them."}
{"product_id": "B000ZKA0J6", "context": "Can I instal on my two PC? Or is only for one PC?", "response": "You should be able to install it on as many computers as you want... there is no license limit on it like OS software."}
{"product_id": "B002TLTBN0", "context": "Will this work with Wii U titles?", "response": "Some with a classic controller prp logo on the back of the game case"}
{"product_id": "B004ASOLLM", "context": "Does it come with the charger?", "response": "No   it does not   just USB  cable that plugs into the system"}
{"product_id": "B00DJYK8XS", "context": "Dance Dance Rev games will \"boo\" and stop the game if you do badly. Does Zumba travel through the whole song regardless of how Awful you are doing?", "response": "It always plays through the entire song. If you're doing well, you get more background dancers and the scene lights up more. If you start doing poorly later on, the extra dancers will disappear and the scene will go back to the original style."}
{"product_id": "B00AWEMODK", "context": "Just wondering, does this collection has separate registration codes for the different expansions or just one for the whole package?", "response": "When you down load the client it has one for the entire collection which allows you to access the expansion packs"}
{"product_id": "B0099OZR9W", "context": "does anyone know if this will work in the xbox 360 E", "response": "It will as long as it is a slim newer model and not an older like the original xbox 360 elite."}
{"product_id": "B00GBCLG0E", "context": "does it play ps1, and ps2 games", "response": "I haven't tried myself, however from what I've read this version of the PS3 does not play PS1 or PS2 games."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "Yes, it uses AA batteries."}
{"product_id": "B0009SUW4W", "context": "Will it work on windows 8?", "response": "I  have  no  idea."}
{"product_id": "B009AGXH64", "context": "Is the game pad the only controller compatible?", "response": "No, the nintendo Wii U console it is compatible whit the nintendo wii remote w/o, the nintendo wii clasic control and the nintendo wii u pro controller."}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "You get codes !  I'd definitely go through amazon and get the codes."}
{"product_id": "B00002SANH", "context": "I have Windows 8 on my computer. will this work?", "response": "I doubt it - if it does not work on Windows 7 highly unlikely to work on 8."}
{"product_id": "B002I0GF72", "context": "How does it differ from the original  (game cube) game?", "response": "Well, unlike in the gamecube version, you can sail much better and farther than in the original, the graphics are better since the game is in HD, the color is sharper, new environments and the game is just as much fun to play if not more so than the original, but that's just my opinion."}
{"product_id": "B009S4JZKK", "context": "Is Steam required just to finalize the Install, or does one need to be connected by internet to Steam the entire time while playing Train Simulator?", "response": "you do not need to be connected to steam to play after install. just tried it and was able to play. it will come up with a message saying it can not connect to steam and will give you a button to press \"play game\" click this and it will launch the game. Happy railing!  :-)"}
{"product_id": "B006W41X36", "context": "does it work with xbox one?", "response": "Yes. It will work with any device that has digital optical output."}
{"product_id": "B000P46NMA", "context": "Is this the first game in the series?", "response": "Yes, it is the first one."}
{"product_id": "B002I096AA", "context": "Can it play regular DS games?", "response": "Yes it can play every ds game"}
{"product_id": "B00C71034I", "context": "The game comes in multilanguage? I want it in Spanish?? El juego viene en multilenguaje? lo quiero en español", "response": "im pretty sure Spanish is avail. in the options menu."}
{"product_id": "B00562O8U0", "context": "I have a Sony BRAVIA XBRHX929 TV and wondering if I need a 3d Synch xmitter along w/ these glasses or will it synch/work directly with the TV ?", "response": "these lenses functioned just with 40 LED 3D tv FULLHD SmarTV WIFI SONY KDL40HX755 without the ps3 ?"}
{"product_id": "B008TXMPJE", "context": "Will the sims 3 games work on a windows 8 or 8.1 computer? Or will it just work on the windows xp computers?", "response": "I have a windows 8 it works jus fine you can check this site to see if The Sims 3 runs on your computer. http://www.systemrequirementslab.com/cyri/ when you reach the site just type The Sims 3 and it will tell you if it can work. Because it really depends on the graphics and other hardware. Good luck"}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "Its has a click scroll there is no option free wheel scrolling"}
{"product_id": "B00D9EPI38", "context": "Can i play dvds from it?", "response": "Yes you lost certainly can but not Blu Ray ones.  Only Playstation 3 and 4 does that.  And you can do Netflix and Hulu also."}
{"product_id": "B00BRA9T5Y", "context": "How big is the USB dongle?", "response": "Unnoticeable, really small. About 1 cm"}
{"product_id": "B00B70WKUK", "context": "is this like a CD and you put it in the computer and all good will be able to play  or i have to install program and be online .?thanks", "response": "You will need a Steam account to play it. In order to play, you need to put the CD inside to install the game into the computer that way you don't have to keep putting the CD in the computer to play it."}
{"product_id": "B00H72EMP8", "context": "Can I connect these to my PS4 so I can use the inline controller?  It is a must-have for me to have a quick mute for my headset.", "response": "You can connect the cable with the mute button but it will sound very low"}
{"product_id": "B002DUCF8A", "context": "Works on X plane 10 without downloading drivers?", "response": "You have to download a plug-in from X-plane.org.  Install in plug-in folder.  Activate the plug-in."}
{"product_id": "B001GROEEO", "context": "This works for the ps4?", "response": "Yes yes it does. The PSN es network agnostic so funds will be seen by your account and all the devices registered to it."}
{"product_id": "B00B98HF1O", "context": "Is this just for kids or can adults enjoy the game?", "response": "My husband plays the game with our boys sometimes and my sister-in-law loves it. The skill level is easy enough for kids but there is enough to do that adults can enjoy it too."}
{"product_id": "B0017Q4DGI", "context": "What controllers do I need to have to play this game?", "response": "Need total Wii sysztem plus 2controllers"}
{"product_id": "B005THAX5Q", "context": "this game is the spanish ?", "response": "This game sucks, bad graphics and even worst control!! I felt like I wasted my money!! ���"}
{"product_id": "B00F27JDUY", "context": "Does it vita could ship to Cambodia country?", "response": "Hello.I can ship this item to Cambodia."}
{"product_id": "B00009TW6R", "context": "does this game work with windows 8?", "response": "We have only used it on Windows 7. Not sure if it would work on 8."}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "I have Win 8, and the game works but crashes often. Save often."}
{"product_id": "B00178630A", "context": "can you play 2 people at the same time", "response": "It is an online game, you can play WITH more than 2 people at the same time. As far as yourself controlling 2 characters at the same time, I don't believe so."}
{"product_id": "B009DL2TBA", "context": "can this play Blu ray video?", "response": "can this play dvd"}
{"product_id": "B00DB9JYFY", "context": "do titanfall has a competitive/ranked gametype  ?? like halo arenas, csgo competitive mode or CoD ranked games ? or is it just normal games like BF4 ?", "response": "Normal games like BF4"}
{"product_id": "B00D96BNGM", "context": "IT WORK DOR PC", "response": "Works on PC using Digital Optical Output"}
{"product_id": "B004YC4NN0", "context": "Will this work on phones, for emulators? Is it wireless?", "response": "It would not work wireless is a usb connection."}
{"product_id": "B00JFCA6V2", "context": "Can you play games off of the game cards without purchasing a Sony memory card?", "response": "Yes you can play the games but you can't save anything you did in the game."}
{"product_id": "B007TYC8MI", "context": "the pass online doesn`t work bro :/ the game is in very good conditions but i need the pass online :/ please help i really need this", "response": "Hi. This game was released in 2013. It could be that the code has expired.  Please contact the seller you purchased the game from for further assistance."}
{"product_id": "B004TTNTYW", "context": "Is this original Nintendo or generic?", "response": "Generic. But works great!"}
{"product_id": "B00C7103DO", "context": "Can you use remote play with the playstation 3 to the playstation vita slim", "response": "Afraid not. Sorry.There is a list of ps3 psp/vita remote play titles on the bottom of the wiki article.http://en.wikipedia.org/wiki/Remote_Play"}
{"product_id": "B0097CUREG", "context": "Will this work on a windows 8.1 pc?", "response": "Yes, I have Windows 8.1 and it works just fine."}
{"product_id": "B00A750QIE", "context": "Does the game get hard? I played like 5 games and I won them all easily. Does this change? It'd be great if it does. I want it to feel realistic", "response": "The level of play depends on the level you set it and the amount of control you wish take over your player also as you progress through a carrier the game becomes more challenging as you move up"}
{"product_id": "B0000512IE", "context": "I don't need 7 feet of USB cable.  If I replaced the cable with a different, shorter one, would the pedals still work?", "response": "No.  The cable is hard-wired into the pedal base.  The wires are very delicate, and would be difficult to reattach.  It'd void the warranty.  They are great pedals.  I'd just coil up the excess cable and secure it with tape or a zip tie."}
{"product_id": "B00HKCKA0G", "context": "can you use this as a pc headset?", "response": "Sorry Brian I'm not pc gamer. I don't think it would work well because of short cord. sorry I couldn't give you a definitive answer."}
{"product_id": "B000VTQ3LU", "context": "Does this come in a Retail Package as shown? Because I received it in Bulk packaging.", "response": "I got mine in a box that just says \"DATA CONNECTIVITY KIT\" no instructions or anything, but only paid like $3.50 so I guess I won't worry about it."}
{"product_id": "B00AAQRNQ8", "context": "Is this a good mouse for your money, or a good mouse overall? They actually mean two different things and the majority of reviews make it even more co", "response": "Great overall mouse that easily compares to others 3-4x its price."}
{"product_id": "B00CMQTUSS", "context": "Using this for PC, which will require the micro USB to always be connected.  Will I have any need for batteries at all?", "response": "I just plugged mine in to check, and the answer is no. Mine is powered up and functional with my battery pack out."}
{"product_id": "B00HN9LS48", "context": "Can this be used to mount the Kinect to the bottom of the TV?", "response": "I Don't see why not, You can custom move the clip for any flat screen fit."}
{"product_id": "B000R0SRNU", "context": "Is this all three previous Lego Star Wars games repackaged, or a whole new Star Wars game?", "response": "whole new Star Wars game"}
{"product_id": "B0086UK7I6", "context": "Are the buttons fully programmable for things besides games? ie copy/paste ctrl+w etc", "response": "Yes they are, the Logitecg software is pretty great. You can even change what they do in certain programs specifically."}
{"product_id": "B008TXMPJE", "context": "Will I be able to add these expansions through Origin if I didn't download my base Sims 3 through Origin? (I downloaded it directly through Amazon.)", "response": "I believe so. I called origin customer support and they linked everything. I also registered my games through origin. So check there."}
{"product_id": "B008M4BNQ6", "context": "Can these be plugged into the actual controller or do they HAVE to be connected via the console?", "response": "On a 360 you plug them into the controller for chat, and the console for game audio and power."}
{"product_id": "B00AXI9WFS", "context": "If I buy the Lone Ranger figures, can I play the lone ranger story with this Starter Pack? If not, what else I need to buy?", "response": "The Lone Ranger Set will work with this starter set.  -IWD"}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac os Yosemite?", "response": "Yes, through Steam it does. Download steam from here: http://store.steampowered.com/"}
