{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "Yes I am currently using it in Windows 8.1"}
{"product_id": "B00919RM1Q", "context": "can this version be loaded on both my lap top and desk top?", "response": "I don't know.  I only have a desk top.  It loaded good on the desk . Sorry I can't help you. Jim"}
{"product_id": "B00HKCKA0G", "context": "Is this a wireless headset? Meaning, is the cord going from the PS4, across the floor to my controller? My cat thinks the cords are a toy.", "response": "No, No, That's cute. What's your cat's name?"}
{"product_id": "B009JZ04BC", "context": "Is this the product is retail packing or bulk?", "response": "Hi, I bought this mouse and it came in a fancy box, so I don't believe it is a bulk sale.  It also works well in my left hand.  Also, works well with many games."}
{"product_id": "B003VAHYQY", "context": "How long is the length of the cable?", "response": "Don't remember exactly, but like 4-5 feet I think."}
{"product_id": "B0094H8H78", "context": "Does this have internet access such as facebook page?", "response": "No. Just straight up Sega Games as it advertises. No wifi , but you can put games on an SD card."}
{"product_id": "B00EHBKUTE", "context": "I am purchasing equipment for an Oculus Rift that will be released next year. Does this work well for first person games? I know only WASD.", "response": "Yes James it should do you good there"}
{"product_id": "B00BU3ZLJQ", "context": "Can this be played offline? The person who I am buying this for does NOT have internet. Will he still be able to play the full game?", "response": "Yes, my son only uses the internet for updates, otherwise he plays exclusively \"offline\"."}
{"product_id": "B004N7HSGU", "context": "Are these capable of using USB for a PC hookup or are they the green/pink cables?", "response": "As a side note to the others saying you can use the mixamp for usb, the mixamp is only powered by usb, no audio is output through it. You still need an additional audio source through the mixamp to use it."}
{"product_id": "B0050SX7BQ", "context": "Please, is this game translated to spanish?", "response": "No. Even the subtitles comes in english."}
{"product_id": "B008CP6MA2", "context": "So what is this exactly? A disk per game? Everything has to be downloaded? I´d like to know if all of the games are included or not", "response": "Hi Alfonso, God of War I & II are Disc One, God of War III is Disc Two. God of War Collection (Chain of Olympus and Ghost of Sparta) are downloadable items."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "This is the physical copy so you don't need to download it. As for any updates you would need WiFi and you need WiFi if you want to play multilayer"}
{"product_id": "B0050SYR74", "context": "does the xp500 transmitter work with the xp510 headset", "response": "No, the XP500 and XP510 models use different radios, so they would not be compatible with one-another."}
{"product_id": "B0085VIILY", "context": "Can the joystick be used with other games like HAWX or Ace Combat?", "response": "I believe so, I have used the joystick for Pac-Man and it worked just fine."}
{"product_id": "B009NQPGOW", "context": "Is the game also in English?", "response": "The game is mostly in Japanese but there is a small bit of English in it."}
{"product_id": "B0036VO4XO", "context": "After you install this, Under Control Panel - Sound - RecordingDoes - \"Stereo Mix\" show as an option?Thanks", "response": "No, Stereo Mix does not appear."}
{"product_id": "B0000A2TPE", "context": "Is this game still available to be bought? I know you had it on the market a few years ago but I lost my version of the game when I moved", "response": "Hello Ashley, Please note that we have this item in stock. You can search for AmitCJ seller under the listing of this product."}
{"product_id": "B000BU0F5Y", "context": "does it have onboard memory? so i can program a macro, and take it to the ps4?", "response": "No.  Also it is not compatible with home consoles.  Windows only.  I must note you that the Saitek Cyborg is much old and outdated now, discontinued by Saitek before PS4 time.  I suggest you to look up on Razer Orbweaver Elite."}
{"product_id": "B0094H8H78", "context": "is the screen backlit? In other words will I be able to play the games in a dark room?", "response": "Thanks for the feedback"}
{"product_id": "B00E6OLJ88", "context": "does it work for all games?", "response": "My Grandson loves it"}
{"product_id": "B00BCEK2LK", "context": "Might be a stupid question, but is this mouse compatible with OS X software?", "response": "I have no idea."}
{"product_id": "B007SO6USW", "context": "Can you charge the controllers with the skin on them? I have a glow in the dark skin cover on one of my controllers and its a pain to have to take off", "response": "I have a silicone skin that's kind of a pain to take off, and I never could get it to charge 100% with the skin on.  It will stay on the charger, but only charge to about 80%."}
{"product_id": "B0012DPHKW", "context": "Hi, we have a computer with Windows 7.  Will it work on our computer?", "response": "No, but we were happy to find this game for the DSi."}
{"product_id": "B0002DKTY2", "context": "will this work with windows 7?", "response": "It works with Windows 8, so it probably works with 7.  Best guess :)"}
{"product_id": "B002I096AA", "context": "can i play older gameboy games on this such as pokemon yellow?", "response": "No, it's a 3DS not a NDS and only the latter one can play Pokemon yellow :("}
{"product_id": "B000KA5T6A", "context": "Does this product include wireless receiver? I think yes. but then why amazon suggests to buy this controller with wireless receiver altogether in 'Frequently Bought Together' section?", "response": "Yes it does.  You do not have to purchase a separate receiver."}
{"product_id": "B00DCDZM2I", "context": "Does this include the actual disk to play the game, or just the characters?", "response": "yes the game disk is also included"}
{"product_id": "B00FRESQYG", "context": "Is this version contains World of Warcraft, The Burning Crusade, The Wrath of the Lich King and Cataclysm ?", "response": "yes it does, I just bought this one and its everything except for pandaria and warlords of draenor."}
{"product_id": "B0095P5K8I", "context": "Has anyone had any trouble with it randomly double clicking and selecting stuff behine open windows or drop down tabs?  I have had mine for 1yr.", "response": "Yeah I've had mine for about 14 months now and it began double clicking when i only single click a couple months ago, progressively getting worse"}
{"product_id": "B000VBFWAG", "context": "Can it work on windows 7?", "response": "Yes, it works on windows 7!"}
{"product_id": "B005J37I4Y", "context": "This doesnt work on xbox one right?", "response": "No. But I thought the X1 had Bluetooth support?"}
{"product_id": "B00D8S4GNS", "context": "is it like dance central", "response": "Yes, so like and very fun!!!"}
{"product_id": "B0094H8H78", "context": "Where do I find games to download onto the SD card?", "response": "go on to the website"}
{"product_id": "B00DCDZM2I", "context": "Can 2 or more players play at the same time?", "response": "No.  From what I have seen this is a 1 player game."}
{"product_id": "B001AI7CF2", "context": "Is there any lag input?", "response": "No lag at all that we can tell, I'm a gamer with consoles and computers. My son is Autistic and wants everything fast paced so if there is even a suggestion of an issue we'd have problems. Smash Bros is fast and on going, I'd say no issues at all. Hope this helps."}
{"product_id": "B00D5WDI3G", "context": "Will this version run on windows 8?", "response": "I do know Chess King will run on Windows 8.1, which is the system I have.  I caveat my answer since I never ran the software on Windows 8.0."}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "You don't have to charge it. It's wired, however the wire is extremely long if that makes anything better."}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "There's no vita game included so if it did work, and I havnt tried it, buy through Psn."}
{"product_id": "B002BXKJA0", "context": "Can you play this with steam?", "response": "Yes Rama, i can play it with steam."}
{"product_id": "B004JKZUJI", "context": "Does anyone know if this will work with Smash bros for the wii U?", "response": "Yes, however sometimes when you jump you jump at an angle even you didn't position the control stick too"}
{"product_id": "B009M72E5Q", "context": "Can you do karaoke on it?", "response": "Yes there are games you can get that are the same as karaoke."}
{"product_id": "B00BMFIXOW", "context": "Can I play the PS4 version using my PS3 save games?  Just upgraded to PS4 and don't want to start game over.", "response": "No you can't continue on a new console"}
{"product_id": "B002I0HJG8", "context": "Does the PC download version come with the codes? or do you actually have to purchase the physical copy which requires waiting for the shipping?", "response": "You need a physical copy"}
{"product_id": "B002I0GF72", "context": "What controllers are supported?", "response": "Gamepad and pro controller.  Both have their benefits.  The with the gamepad you can see all your items really well.  The pro controller has a superior feel in the hands as far as gameplay."}
{"product_id": "B004S5TDUQ", "context": "The description says it comes with the cable, but does it?  I already got burned by another seller where the description said it came with the cable.", "response": "Yes, it did come with the cable. I did notice several advertised with out So . . ."}
{"product_id": "B006W41W3M", "context": "does it work on xbox one and pc", "response": "Turtle beach made an adapter to fit the Xbox One's controller.  The headset will work with PC with sound, but no voice support."}
{"product_id": "B000266786", "context": "I have windows 7 will this game work with that?", "response": "yes , but you'll have to adjust the settings"}
{"product_id": "B00DH1KRQQ", "context": "where is the link to download the program that helps it run", "response": "I just plugged it in and it worked without having to install any extra software. My laptop read it, recognized it, installed the druvers, and away I went, playing Recettear on Steam, with no issues."}
{"product_id": "B00HGAWFJG", "context": "Does this cause the PS4 to overheat? There is no vent", "response": "No I never have overheating issues..heat dissipates up so a vent on the bottom wouldn't matter"}
{"product_id": "B007SO6USW", "context": "does it come with a battery pack for the controller?", "response": "no it doesn't. BTW dont buy this, it's a peace of sh#t. It's really difficult to place the controllers inorder to charge them."}
{"product_id": "B000BIZR72", "context": "Does this game work in the DSI XL?", "response": "We used it in a DSI and know nothing about the XL system. I would call game stop or Nintendo to get correct info, sorry I could not be of more help."}
{"product_id": "B00FB45YFQ", "context": "How well do these headphones stand against people with big heads?", "response": "I have a 23.5inch/~60cm round head measuring just above the ears.  For me they have held up really well and stay comfortable."}
{"product_id": "B0071NH8B8", "context": "Can you use this with regular WiFi, or do you have to buy the AT&T thing?", "response": "It's compatible w/ regular wifi or the AT&T; service if they provide your internet."}
{"product_id": "B00886XQO0", "context": "Will this Headset work with Xbox One if I have the Microsoft headset adapter? I already have the adapter so it wouldn't be a problem.", "response": "You can use the Tango with an Xbox One with the right accessories. You will need an audio adapter and a chat cable."}
{"product_id": "B00DLDEKOK", "context": "is it compatable with xbox 360 slim?", "response": "I don't think the system matters because it's the controllers that you attach the headset to."}
{"product_id": "B000VTQ3LU", "context": "How long is the USB Cable?", "response": "6 1/2 feet end to end."}
{"product_id": "B00I4C2EKA", "context": "Can I buy this as a gift for a friend or will it automatically try to download to my PC?  I want to give the code to someone else.", "response": "You can gift the code. Or give the game through Steam."}
{"product_id": "B00DE2W4PK", "context": "I did not come in the box PS PLUS membership. As I do in this case?", "response": "The ps plus membership was sent by e-mail not a card in the box."}
{"product_id": "B001GIOGBY", "context": "Do the mixture and prop controls work properly?", "response": "No, I could never get them to work"}
{"product_id": "B004S5TDUQ", "context": "I just installed it today and it seems to be fully working, but says it is the demo. Did I get robbed or is this a developer oversight? Anyone else's PC version say it's the demo?", "response": "if you correctly installed it it shouldn't say demo. under the steam menu, click \"games\" then \"activate a product on Steam\". enter your seiral key, and it should bring up the installation menu. that's what I did and it worked fine."}
{"product_id": "B005EQE0YM", "context": "If I buy this product itself do I need anything else to buy for it to work?", "response": "Comes with everything you bro have fun"}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "not sure if this will work with Win8 . However I have this Saitek stuff and I hate it. CH pilot makes much better controls."}
{"product_id": "B000A0IBLK", "context": "are you able to plat with 360?", "response": "Sadly I don't think so"}
{"product_id": "B005S0KH7I", "context": "is this a mechanical keyboard ?", "response": "No, the call of duty keyboard is not a mechanical keyboard."}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "I am not sure what you mean but you can push down on the scroll wheel and it shows a scroll icon which you use.  As far as weapons I do not know as I have not tried the scroll wheel on games.  Sorry."}
{"product_id": "B003O3EFY2", "context": "Are you able to save your games?", "response": "Depending on the game it's saves from last time you played"}
{"product_id": "B004C4U1VI", "context": "Have the Xbox 360. Do not see how the cable hooks up to the gaming console.  None of the slots fit any of the cable.", "response": "There is an xbox 360 componenet piece. I have it right in front of me :)"}
{"product_id": "B0042J7I3C", "context": "How durable for 9 dollar headset is it?", "response": "Wasnt 9 dollars when i bought it but ive had it for 6 months now no problems"}
{"product_id": "B00B98HDNO", "context": "does it have to use inernet", "response": "Well just to download, the game is fully playable offline co op or solo"}
{"product_id": "B006W41X1S", "context": "If I buy these do I need to purchase any other cords for it to connect to my xbox 360? Will they work on my xbox One?", "response": "You do not need to purchase anything for it to work on your Xbox 360. These type of headphones do not work with the Xbox one"}
{"product_id": "B005G4CXPK", "context": "Will this work on Windows 8 and 8.1?", "response": "Yup! Worked fine for me!"}
{"product_id": "B00GY4OAM0", "context": "is there free roam", "response": "After you complete all the levels the game will allow you to free roam through the lands and change characters. You can roam through them but cannot switch characters till you complete all the levels on story mode."}
{"product_id": "B00G6IJ5QK", "context": "Does the mouse come with warranty?", "response": "yes, but for defects that came from manufacturing process (a year) only. That means that for example, if the switches are not working at month 6, you might have a replacement of the mouse."}
{"product_id": "B008IYCVK2", "context": "I am playing this, is there any way to save the game state?  I haven't figured it out or, for that matter how to exit gracefully.", "response": "I wish that I knew what \"game state meant, but saving is done by pressing esc at the mission control option and selecting \"exit to desktop\"."}
{"product_id": "B000LQ4HTS", "context": "Can the buttons be reprogrammed like the X55?", "response": "Yes they can, using software you can reprogram them to do anything."}
{"product_id": "B001IYR53W", "context": "Will it run on windows 8?", "response": "Hi. It's been awhile since my purchase and I gave it as a gift. From my understanding, it did not work with Windows 8. Hope this helps."}
{"product_id": "B00F2ENJY8", "context": "Can you do 2 players on this console? And How?", "response": "Yes   You will need to buy an extra remote.  I had an old WII and the remotes worked with this one."}
{"product_id": "B004NRN5EO", "context": "this game comes with case, manual and artwork?", "response": "My son's did not."}
{"product_id": "B00DC9SWWE", "context": "My son is about to be 11 and is dying for this game.  I've never bought him an M rated game.  How is the violence and language in this game?", "response": "It's very bloody at all. Compared to a call of duty. I would get it for him!"}
{"product_id": "B00FZ12F34", "context": "Do these characters work with the 1.0 game?", "response": "yes but when I purchased the collection it was $199.  I would suggest pricing individual character vs bundle price"}
{"product_id": "B00656HLGO", "context": "It says 320 GB yet only has 293 GB available, what happened to the other 27 GB?", "response": "It is being used for System files on the Xbox. It is the same concept of getting a HDD for a computer where it says (some number) but available is less. The system files used to run your xbox along with any updates, DLC, or games will use this disk space."}
{"product_id": "B0017Q4DGI", "context": "Can this be played on the original wii console?", "response": "Yes, you should have no problems"}
{"product_id": "B000K9Q5NW", "context": "I'm 5'3 with short legs, will this be a problem?", "response": "No its adjustable enjoy!"}
{"product_id": "B00B1MXGDO", "context": "can i use this for pc gaming?", "response": "I hooked it up to my brothers windows computer to try and use it on the Xbox app thing and it didn't work so I don't know if I had it set up wrong or what"}
{"product_id": "B002I090AG", "context": "can nintendo dsl 3d games be played on the nintendo 3d system?", "response": "Sorry.  It was a gift and I do not play or have first hand information."}
{"product_id": "B009JZ04BC", "context": "Does it work with windows 8?", "response": "It should. The mouse has been out for a while the cooler master is a big company, i'm sure they would have updated their drivers if necessary. Mice usually don't need externally installed drivers to have basic functionality, so i don't think it would be a problem at all."}
{"product_id": "B004YC4NN0", "context": "What emulators does this work on?", "response": "It depends on the platform. I have used it on Windows with all my old school stuff (8 bit, 16 bit, Nes, Sms, GB, Snes, tg16,) and it seems to work pretty good. I have not tried it with new gen stuff because- no analogue stick."}
{"product_id": "B00EHBKUTE", "context": "Does this work well under Windows 8.1?", "response": "I too have had no problems since changing over to windows 8."}
{"product_id": "B0057WDE8Q", "context": "Is it wireless and would it be good for playing Mz PacMan", "response": "Its not wireless, but I think it would be good for pacman for that arcade experience"}
{"product_id": "B00919RM1Q", "context": "Does this game work with Windows 7?", "response": "Works on Vista, Win7 & Win8.1. Pro"}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "Given that the case fits my original 3DSXL with the Circle Pad Pro attachment snugly I'm sure it would accommodate the upcoming New Nintendo 3DSXL."}
{"product_id": "B008X73CE8", "context": "will this run on windows 8.1?", "response": "It runs fine from what I can tell"}
{"product_id": "B001CXYMFS", "context": "Can you detach the throttle but still use it?  Say if I wanted to mount the throttle on the left arm of my chair, and the flight stick on the right?", "response": "Yes, you can detach them and spread them apart and still use them as you describe (throttle left).  Don't know how big your chair is but average shoulder width is not a problem."}
{"product_id": "B0050SX7BQ", "context": "Please, is this game translated to spanish?", "response": "Is dubbed and has spaniah subtitles as well"}
{"product_id": "B00DLRLDBO", "context": "how many cords to i have to deal with?", "response": "there is one main cord which splits into two at the machine,  my only complaint is the cound cord is to short had to buy an extender."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "No sorry only two players can play offline with splitscreen if you want to play with 4 people you must play it with another console and online"}
{"product_id": "B00009ECGK", "context": "Does the previous versions have to be bough and installed? or Can I buy this game right away, install on my PC and play?", "response": "You can buy this, install, and play.  However, you will need to install Reign of Chaos before installing Frozen Throne, both of which are included in this battle chest."}
{"product_id": "B007MM9E42", "context": "Can you play the Wii version on the Wii U?", "response": "Yes, you can play the Wii version on the Wii U. The Wii U is backwards compatible with all Wii titles."}
{"product_id": "B00HN9LS48", "context": "Will this fit an LED screen? Credit Card thin might be a problem unless this thing really adjust to the monitor.", "response": "Doesn't seem like it could, though, I do not have that thin of a monitor to test it on."}
{"product_id": "B00DUARBTA", "context": "Can this game handle 1 - 4 players using 4 shock controllers?", "response": "You can only play up to 2 players."}
{"product_id": "B005OSFUZI", "context": "Does it work with both Rocksmith and Rocksmith 2014?", "response": "Yes the cable works with both Rocksmith and Rocksmith 2014, as I have both on my laptops, I use both since some songs can only be played with Rocksmith, so you will not have any issues using the cable for just Rocksmith, enjoy playing.............."}
{"product_id": "B009Q8PP16", "context": "Grand theft auto 5 Compatible?", "response": "Idk, I dont have GTA 5. Sorry"}
{"product_id": "B003BKWEHS", "context": "does it work on window 7?", "response": "I have Vista and it works great."}
{"product_id": "B008L3UUPS", "context": "If it only works for PC I can deal with  it, but does it work thru the USB on the wii-u ? Even in Virtual Console would sound great .", "response": "Just tried it and it does not work in any mode. I have a couple of virtual consol games including the n64 majoras mask and ocarina of time, and it still asks for classic controller to be plugged into the wii remote port."}
{"product_id": "B005BLAJRC", "context": "what games are included on the cd?", "response": "backgammon, battling ships, checkers, chinese checkers, chess, dominoes, tile games, master match, parchisi, panic, placer racer, reversi, rummy square, time breaker, word games, yacht, zilch."}
{"product_id": "B008CP6MA2", "context": "I'm from Italy. Can i use every game without a US PSN account? (don't answer with just 'no' in case please)", "response": "Yes, you can use any PSN acount other that the US.It really does not matter."}
{"product_id": "B002RRLQIO", "context": "how many concurrent keys can you press before it stops recognizing keys?", "response": "I use mine on my cad programs, with the left 12 programmable i have macros that use 5 keys at once and have not had any problems yet,   i would really like a older Gatway 2000 135 board though"}
{"product_id": "B0029LJIFG", "context": "I just received card in the mail to give as a gift and it says Made in Singapore and has both English and Asian language written on it. Will it work?", "response": "I wondered the same, I put in the code and it worked"}
{"product_id": "B00D96BNGM", "context": "can this unit be substituted for comuter headset", "response": "Yes with a blue tooth adapter"}
{"product_id": "B00656HLGO", "context": "Will this play the original XBOX games that are compatible with the XBOX 360?", "response": "Well yes Xbox 360 has reverse capabilties. The hard drive is not the issue. You must have xbox live to download the patches to play the original xbox games."}
{"product_id": "B0061PAZUS", "context": "Can I play this with my daughter?", "response": "Yes. Two player mode"}
{"product_id": "B00009ECGK", "context": "Do I have to pay monthly or yearly to play WOW and how much is it?", "response": "6 months its something like 12 a months or something I pay every 6 months cheaper in the long run I pay around 70 something worth the experience imo"}
{"product_id": "B0017HLYNC", "context": "is this the orginal syberia or a cut up version", "response": "no its the orginal version."}
{"product_id": "B00AR1LX9O", "context": "Will this work on mobile phone?", "response": "No. This requires the use of a USB port."}
{"product_id": "B005EOOT90", "context": "can i use this om ps3", "response": "Im not sure dude I have an Xbox 360.   but if it has the single connection on the controller id imagine so  please don't take my word for it thats just a guess  I hope I helped u out"}
{"product_id": "B004C4U1VI", "context": "Will this fit SCPH-70012 PS2 Slim models? Asking because I see various people saying it fits their PS2 Slim and some that say theirs do not.", "response": "It works for me. As far as i know, all ps2's have the same video output connector type"}
{"product_id": "B008L3UUPS", "context": "Does this work with other games? Not just the retro emulator games?", "response": "I, unfortunately, don't know as the company didn't send me the USB version, they sent me just a regular controller for the regular N64 console. I would look into a different seller, personally."}
{"product_id": "B002I0K6X6", "context": "Does the stick have a input for pressing in?", "response": "Like wat do u mean buddy"}
{"product_id": "B00F68LBE0", "context": "How can I use this controller on my PC?", "response": "Not for use on PC is only for PS3. Thank You"}
{"product_id": "B000BIZR72", "context": "does this work in 2ds", "response": "Hi. No it only works for DS Nintendo. I purchased one 2ds batman lego and I had to return it.  It didn't fit."}
{"product_id": "B00H3VJYD8", "context": "Is this a knockoff or is this an original 360 controller?", "response": "Honestly not sure, I do know it works great on both XBox and PCs."}
{"product_id": "B002I098JE", "context": "Are all the weapons in multiplayer already unlocked or do you have to unlock them?", "response": "You have to use your squad points to unlock them all... But when you pick your class for your soldier a gun or two are already unlocked for that class you just have to buy your attachments to your guns with squad points"}
{"product_id": "B000SOYG8U", "context": "Lot of the reviews said it was just the original game, but you stated it was the Gold Pack .Is that true?", "response": "The one i bought had both, but the expantion didnt work on my win8.1 OS"}
{"product_id": "B001DNGCN2", "context": "does this fan fit the 60 gig ps3 or the 40 gig ?", "response": "This fan seems to fit the fat PS3s.  Like I have one of the generation one (backwards compatible) units, the fan fits great.  This is not for a slim model."}
{"product_id": "B00111SFEU", "context": "does this play the game sound or just chat", "response": "Both...when you mute it both game and voices mute also."}
{"product_id": "B00DNGQQUQ", "context": "Is Tapion in the game?", "response": "I am still in stage one Of the Buu level and haven't come across Tapion yet."}
{"product_id": "B006JKARP8", "context": "Can I charge the charger itself using iPad adapter (any other USB power supply) or Vita adapter only?", "response": "Only if it is a 1.5A adaptor or has \"q\" technology allowing it to modify its output to the given device. 1.5A is set charge rate for anything Vita."}
{"product_id": "B00FM5IY0Q", "context": "I just bought an Xbox One.  Should I pick this game up or pass?  Is it anything like The Last of Us.  I really liked hat game.", "response": "Well it depend on you. If you really enjoy play \"kill zombies\" or something. I like this game. I not really play this game a lot. I love build new gadget, vehicles, and ETC. If you play deadrising 2 and you like it then you will love deadrising 3. I promise."}
{"product_id": "B00E3667XQ", "context": "Which are the best native games available for the Shield?", "response": "Half life 2, and Portal. There might be more, but these are the only 2 native games I have on shield. I also play The Walking Dead which is the best game for it's genre, and it works really well on Shield."}
{"product_id": "B005D5M1P4", "context": "WoW Will these work(voice activated) with World Of Warcraft? And, if so---have they been \"tested\" with this game? What were the results?", "response": "why not just buy the z6A, same thing and cheaper."}
{"product_id": "B009DL2TBA", "context": "How reliable is the Super Slim? For those who owned it for a while, does it give you any problems? Also how loud is it when it plays discs?", "response": "Haven't noticed any disc noise to speak of, and it handles the realiability very well. Able to run my system 12-14 hours at a time with very little over heating issues ever arising."}
{"product_id": "B009GSX0A4", "context": "Does this version have English subtitles or just the limited edition", "response": "Nope, this one is just Japanese from this seller."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "This headset can connect to an Xbox One controller through the (optional purchase) Stereo Headset Adapter from Microsoft."}
{"product_id": "B008KH7NZA", "context": "Does this work with the Xbox One? I bought the Chat adapter and I get game audio but no chat. I also updated the controller.", "response": "I Have this headset and the Microsoft Stereo Adapter, and they both work fine for me, I don't use the buttons on the adapter after getting everything setup, but it works."}
{"product_id": "B0058FAEAS", "context": "What is the purpose of the mode switch?  Is it simply to assign functions to/for different games?", "response": "First, there is a sofware for configuring the different buttons. And for each profile, you can use the switch to increase the number of buttons. But this switch is not done for switching profiles."}
{"product_id": "B00GZ1H07Y", "context": "Will this game play on the PS3 console?", "response": "No, PS4 games are not compatible with PS3 systems."}
{"product_id": "B0088MVPFQ", "context": "will this play on the wii", "response": "I am not sure of this it may not as it may need a link to be able to do so, maybe you can contact the mario or check it out on their website. Sorry that I couldn't be more helpful. Thanks."}
{"product_id": "B002I0J5CO", "context": "How long is the cord?", "response": "Unfortunately I can say that exact measurement but the cord is really long so if you are in a small area be careful of  the cables getting tangled."}
{"product_id": "B00D6PTMHI", "context": "I am not a 'gamer' & a lot of the phrasing and language here is over my head, but I want to learn guitar. Is RS an option for someone over (ahem) 50?", "response": "If you know how to use a computer, the game will teach you how to play the guitar. Very simple to understand. Go for it!"}
{"product_id": "B00DE2W4PK", "context": "DOES THE PS4 PLAY THE PS3 GAMES?", "response": "Nope. None of the ps4's play ps3 games."}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "No free files. Deduction Pro 2012 included in the Block at Home program.  Don A"}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "It's 150 cm, or 1.5 meters, or a hair less than 5 feet."}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "\"Why would you want to listen to music and watch TV at the same time?\"\"Because I like to party.\""}
{"product_id": "B0099OZR9W", "context": "When I put in this hdd, will my xbox 360 slim recognize it?", "response": "Yes, it slides in and works"}
{"product_id": "B00FWWY1V0", "context": "do they stick without the regular cover", "response": "No they do not"}
{"product_id": "B00BHSTXV6", "context": "Is this keyboard wireless or wired?", "response": "This is a USB wired keyboard."}
{"product_id": "B003XNU1JQ", "context": "Is there a way to save your progress when you get to different worlds?", "response": "Try this out. When you want to quit playing, choose to go to the home menu and you'll be asked if youwant to save. Choose save and when you want to play again, you'll start off where you left off. That simple."}
{"product_id": "B00CQ9L1Z6", "context": "Does this work on 3ds games on the 2ds system?", "response": "It didnt work there was no cheats pr codes for it just error all the time.. nothing happend when i put my 3ds games..."}
{"product_id": "B004RMK4P8", "context": "Hello, i Have trouble with the code... the code is USED! how can you help me with this...", "response": "Try call sony helpline"}
{"product_id": "B00DHF39KS", "context": "Does this have the \"Legacy\" control options (\"turn\" on left thumbstick and \"strafe\" right thumbstick), please?", "response": "Mmm, no I don't think so. They dont provide any costumization at all actually,  at least not on PS4. You could always try the pc version and mod it."}
{"product_id": "B0053BCML6", "context": "Does this game work with a 3ds xl?", "response": "Yes. All 3ds games and DS games work on the xl. It is the same console, just larger."}
{"product_id": "B0042J7I3C", "context": "Can i hear the gaming sound and friends chat on the headset", "response": "Just friends.  also good for sending messageS"}
{"product_id": "B00ENFVS5Y", "context": "I recently purchased and returned the TX 458, Just wondering if I should give it another chance?", "response": "Sure, now more than ever. Forza Horizon is coming and well, by now you have Forza 5 and NFS Rivals. Also I love to play on my PC with iRacing and RFactor. The new updates take the most of your wheels force feedback.I hope this could be of any help."}
{"product_id": "B005EQE0YM", "context": "Are these very comfortable?", "response": "I use them for long periods most work days and they have never bothered me.  They are quite light and the padding is decent."}
{"product_id": "B000PD0HQE", "context": "will this xbox 360 include all listed items?", "response": "Tanya, you will receive xbox 360 with 120 gb hd power cord and one controller also 3 games"}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yea mine fits perfectly, and I still have room for more srufd"}
{"product_id": "B00A0EPNPI", "context": "Is it a mechanical keyboard?", "response": "No it not but I really like the keyboard"}
{"product_id": "B00B3PDH5G", "context": "My headset keep turning off while in the middle of a game, does anyone else experience this? Happens in the middle of gameplay.", "response": "If you're experiencing any trouble using the product then please contact our technical support team for assistance:https://www.turtlebeach.com/contact-support"}
{"product_id": "B009RHEBWA", "context": "can you transfer saved information from turbotax?", "response": "Always has, always will"}
{"product_id": "B000B78F72", "context": "Do you have to download this game to play or can you take the cd and use it on another computer?", "response": "It's a CD for use anywhere"}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "It's only for the wii u system if I'm not mistaken."}
{"product_id": "B00D96BJSO", "context": "i can use it for listening for music in iphone 5 ?", "response": "i dont have an i phone 5 to test, but i have tried it on many Android phones and an iphone 4S and it all worked fine, i could even answer calls with them, It has a male 4-Pole 3.5mm input jack, and the mic is removable if you just want to use them as earphones"}
{"product_id": "B006PP4136", "context": "Would a ps vita slim fit in this case?", "response": "Most definitely would since slim is just skinnier than the regular. It will possibly be a little loose on the top section but should hold up just fine."}
{"product_id": "B00DHUUTEM", "context": "Is the clicking on the keyboard quiet?", "response": "It's ok quiet not anything to loud! I think it's a great keyboard!"}
{"product_id": "B0050SYX8W", "context": "Can you jump into Halo 4 not having played the other games?", "response": "yes, but there are a few things that may be confusing. But thats what i did, and it all made sense to me."}
{"product_id": "B0058GMO0A", "context": "will it work on vista?", "response": "I don't know, I have windows 7"}
{"product_id": "B0000C7GHG", "context": "How long is the controller cord? Also, doesn't the PS2 make noise?", "response": "In my experience PS2 slims are quieter so if you want to buy a quiet ps2 then you should probably get a slim."}
{"product_id": "B008OQTUKS", "context": "hi does this work on windows-8 64bit..Thanks", "response": "Yes yes yes..... In fact windows 8 is the best platform to run battlefield on you will get extra frames opposed to Windows 7."}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "If free-scrolling is the kind you can flick and it keeps spinning, then no - it's an incremental click scroll."}
{"product_id": "B00B15EXJC", "context": "Does this controller work well with call of duty games", "response": "It was missing a piece and was returned"}
{"product_id": "B004FS8LYK", "context": "Can you recommend games for 8 year olds?", "response": "No, It is not appropriate"}
{"product_id": "B000PS1TG6", "context": "does anyone know if i buy this if i can use it for ps3 guitar hero game or rockband games with a guitar from the ps2", "response": "Yes because the guitar is essentially a controller in the shape of a guitar."}
{"product_id": "B00E1L786S", "context": "will this work on a lg smart tv? thanks", "response": "If it has blu tooth capabilities then yes"}
{"product_id": "B002I0F5I2", "context": "that difference has this game UNCHARTED 2: Among Thieves GREATEST HITS ???, the original game ???  and because it comes in a red cover ???", "response": "Pretty much... The one I received had an code to redeem for the add ons & it was invalid."}
{"product_id": "B00BI9MDSO", "context": "it is good protection but i afriad it will make damage or breaking ps slim or not because it is very very fit to push push and push even take off also", "response": "It's made only for the first ps vita model. Not psp slim or ps vita slim"}
{"product_id": "B009CL6LA6", "context": "Can this connect directly to an iPhone wirelessly, or is the receiver needed?", "response": "No it cannot wirelessly.  A wire between the headset and phone is needed."}
{"product_id": "B00HGLLRV2", "context": "is the difference between the limited edition and the standard edition significant?", "response": "No, the difference is not significant. At this point, buy whichever version has the cheapest used copy available."}
{"product_id": "B00B3PDHBU", "context": "Do they work with the ps4", "response": "Also any thing with Bluetooth and it comes with a cord to plug in cd players or what have you"}
{"product_id": "B00503EAG2", "context": "Can you play this game offline?", "response": "This game has a single player campaign along with a survival mode and challenges."}
{"product_id": "B00IRHE892", "context": "Does the middle mouse button (scroll wheel) depress easily? That's the one thing I didn't like about my MX518, it felt mushy at times.", "response": "It's easy to press, but it's also nice and firm. You won't be accidentally pressing it down unless you have a finger made of lead; it also has a nice, muffled click when you press it down. By far my favorite mouse wheel."}
{"product_id": "B002YVD3KM", "context": "Can you hook up two of the controllers for co-op games like contra?", "response": "Absolutely, I do this all the time.  You just have to set up player 1 and 2 for each side...button wise.  Sometimes changing the usb ports jacks up the settings but most of the time, they just work."}
{"product_id": "B000YQ639M", "context": "does this run on windows 7", "response": "It should, I'm running it on windows xp with no problems which is very similar to 7. Windows 8 seems to be the one with major conflicts"}
{"product_id": "B00CMQTUSS", "context": "Does this come with rechargable batteries, and if not, which ones should I order?", "response": "No they do not... You have to supply your own batteries... This one is actually the best for your money....just buy batteries.."}
{"product_id": "B00D6PTMB4", "context": "I am a beginner at guitar and recently bought this game. Does anyone know if there is a tutorial section on finger posturing?", "response": "There is a whole section of tutorials in the software.  Everything from the most basics, like how to put the strap on, hold the pick, where to strum, to many advanced techniques.  All the lessons have practice pieces as well."}
{"product_id": "B004L5SJ4Y", "context": "compatable with windows 7? 8.1? 10", "response": "Yes, it is compatible with Windows 7, that is the system I am currently playing IL-2 on. As for the others, I couldn't tell you as I don't use/own them."}
{"product_id": "B0002DQUH2", "context": "just like to know if there is a volume control button ?", "response": "Not that I'm aware of or see listed.  This is a very basic board.  I didn't even know keyboards came with volume control."}
{"product_id": "B006YDPU48", "context": "Do I need to play the first one to understand whats going on?", "response": "Not at all, the story is weak but gameplay makes it. I'd suggest it though because in my opinion the first one is better."}
{"product_id": "B004RMK5QG", "context": "hello, a question if I buy it now comes to me today by email the code ?", "response": "Yes, only wait to confirm the pay and since."}
{"product_id": "B00IAVDPSA", "context": "do you need a kinect to use any of the remotes funtions?", "response": "No, a Kinect is not required to use this remote with the Xbox One. However, you would need to buy an IR cable for the Xbox One in order to use it to control your TV (turning the volume up or down, or turning it off) or your cable box, because the Xbox One can't independently control infrared-controlled devices."}
