{"product_id": "B00BGGIWZM", "context": "Do you have any problems with the  Electronic Arts and Origin mix. Crashes, freezing or anything like that with this Sims game?", "response": "No, I do not have problems with freezing or anything like that with the Sims 3 game. You might need to download the latest update."}
{"product_id": "B00BU3ZLJQ", "context": "can i play 4 player on the original 360 that doesn't have hdmi?", "response": "You need an hdmi cord that supports a higher resolution if not you would get a really grainy picture."}
{"product_id": "B000HZFCT2", "context": "does it work for minecraft?", "response": "If your able to use any kind of controller for that game, which I'm almost sure of it, then yes this would work. Has worked for every game/emulator I have tried so far. It will recognize it as a connected controller/joystick device. It works great."}
{"product_id": "B00FB45YFQ", "context": "why wont the LED lights work? and/or the software show a setting for it?", "response": "Either faulty or program"}
{"product_id": "B00DJYK9L4", "context": "What controllers are supported?", "response": "Regular wii and wii u plus remote"}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "I am not sure maybe"}
{"product_id": "B00E3667XQ", "context": "Which are the best native games available for the Shield?", "response": "The best games for NVIDIA SHIELD that I like are GT Racing 2, Asphalt 8, Dead Trigger 2, Modern Combat 4, N.O.V.A 3, Fractal Combat X, Minigore 2: Zombies and Virtual Tennis. All of them are totally controled by Nvidia Shield..."}
{"product_id": "B002I0K3PM", "context": "Is the game worth the price?", "response": "Yes. Im 30 years old and I loved it"}
{"product_id": "B000B6MLTG", "context": "Has anyone experienced any display ghosting with this product?", "response": "Not with this cable. I tried a couple other aftermarket ones that were terrible. The Microsoft one is the real deal."}
{"product_id": "B009GTV5HS", "context": "Is this a wired or wireless mouse? I have read online that this is a Hybrid with both features, but the pictures look like a wired mouse.", "response": "Full wired mouse. If there is a way to make it wireless, I haven't come across it."}
{"product_id": "B001NXDBI6", "context": "is it mechanical keyboard?", "response": "No, but it is a great keyboard none the less."}
{"product_id": "B002W8D0EQ", "context": "what is the difference for play station network card and the play station store card", "response": "Theres no difference they both are used for the same thing"}
{"product_id": "B008CXTW5G", "context": "Do the A1 and D1 series keys just not have any default values? I press them and nothing happens.", "response": "The A1 and D1 series keys have no default values and untill you assign a macro to them using the included software they will continue to have no use"}
{"product_id": "B00FE8WKPQ", "context": "will the Wii U FIT  game and meter work on the Wii?  Do not have the Wii U", "response": "The balance board will work for the Wii, the game only works on WiiU"}
{"product_id": "B00006B84X", "context": "Does it have independent centering for the pitch and roll axes? Can you feel that the roll axis is centered while moving the pitch axis?", "response": "it's not a ball joint like other products,  it's 2 hinges (pivot)  so yes you can feel the center of each axis wherever it is. it has 2 wheels on its base to offset each axis.  acting like hardware trims.  very useful for planes without trims!"}
{"product_id": "B002I0K6X6", "context": "does this connect wirelessly or does it come with the cable to connect to the ps3 just cause i just purchased a ps3 and have no idea what i need.", "response": "it connect via the PS3 Bluetooth connection. usually by only pressing the remote control  \"home\"button the PS3 will automatically assign a controller number (up to 7 controller can be sync with the PS3)."}
{"product_id": "B00D84DRNC", "context": "Best Buy says the depth of the New 3DS XL is 5.12 inches. This says the depth is 120 mm (4.72 inches). Has anyone tried it to confirm it fits?", "response": "I've taken my pouch to gamestop to when they had n3ds xl to demo. It fit perfectly fine, even with a bit of wiggle room. I was able to put the n3dsxl into a felt pouch and still fit it in the case. You should have no issues."}
{"product_id": "B00009OY9U", "context": "Seems like this is the best \"bang for your buck\" is it a descent joystick for Elite Dangerous?", "response": "That is exactly the game I use it for and it's worked well. Just don't jam it around and you should be fine"}
{"product_id": "B00F27JDUY", "context": "So i can game online and there will no prob considering it from japan?", "response": "Online gaming and the PlayStation store both work normally and you will have no problems. The only difference between a US Vita and Japan version that I can tell is that the circle button okay's things and the X button backs up out of menus."}
{"product_id": "B00E8JZILA", "context": "there's no cross-PLAY on this right? Saving the game on PS3 and continiuing on Vita... i already have this on PS3.", "response": "I don't think so"}
{"product_id": "B0053B66KE", "context": "Can you use a DS or DSI?", "response": "No, the game is made for the 3DS console only."}
{"product_id": "B00IRHE892", "context": "Can the Back and Forward buttons be customized to do in-game actions like throwing a grenade?", "response": "Yes in the logitech software you can change tje action of the buttons. You van use the two buttons in the left side too. I use one to melee attack and the other for throwing grenades"}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "Yes to both, it works very well online and in party chat."}
{"product_id": "B005761E70", "context": "are the thumstick controls more presise then the original,for the original controller sticks are too loose.", "response": "No perceivable difference. Unit feels good, kids are not hard-core gamers but they have put in maybe 60-80hrs since purchase and it's their favorite controller."}
{"product_id": "B00GHJ6X8G", "context": "I'm from NY  so I'm very interested in what the Yankee roster is before i buy this.....do they have any of the new players like Tanaka, Ellsbury,etc?", "response": "It updated all the trades from the recent trade deadline. If the players were on the team at the beginning of the season and they got traded, it's updated. Yes, Tanaka and Ellsbury are on the there. All of the rosters update through wifi."}
{"product_id": "B003VH5Z2C", "context": "is it hard to hook up", "response": "POWER BUTTON BROKE AND WONT WORK"}
{"product_id": "B0079V29EI", "context": "Does this come with a charging cable as well? I lost mine and was hoping for a two for one.", "response": "It does not, however, the power grip will charge your Vita once it's fully charged; extending the battery life significantly."}
{"product_id": "B0053B5RGI", "context": "does this play on the dsi xl 2d?", "response": "yes, you can play all the game in 2d if you want. in fact the game isn't all in 3d. so you can enjoy both 2d and 3d parts"}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "I've always used the nyko chargers. They work pretty well and last a long time."}
{"product_id": "B000NJBD90", "context": "I know it says PS2 to PS3, but it's a USB, do you think it'll work if i plugged it into my Xbox 360?", "response": "yes, the converter makes it compatible with all usb devices... including your xbox"}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "It's for everyone that enjoys playing Nintendo games . But yes 5-7 year old could play this game . I don't see nothing bad about it at all"}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "no I don't think so would not recommend for battery as mine has failed after only a few months but as a grip it is comfortable"}
{"product_id": "B008RA5DIY", "context": "Is this an actual disc or download only? I really want/need the disc", "response": "This is a disc."}
{"product_id": "B001GROEEO", "context": "delivery is online, for email?", "response": "Yes, if you go to buy a PSN prepaid game card to the store, you will get the card where is printed a code. When you buy on line they send you back via email, just the code you need."}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "Hi, are your ps3 systems brand new"}
{"product_id": "B0095D1CM8", "context": "How do you bind the thumb wheel to a key?", "response": "Open mad catz software go to profiles, go to thumbwheel and hit the key you want to use, then save profile. And remember which profile it is on, since you can select between three. Red blue and purple."}
{"product_id": "B0040UAYI4", "context": "Can i use this and play MW3 on the ps3 with the Eagle Eye?", "response": "Yes, you can. I tested with both MW3 and Ghosts"}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "No, If you live in the U.S. or request it, they will send you a U.S. version of it."}
{"product_id": "B00GS6A6V8", "context": "I am in Australia and have purchased the base game here (in Aus), will this DLC bundle work on my PS3 with my game?", "response": "Absolutely!  Just be careful. One or more of the codes may require using the \"space bar\" rather than dashes (-).  The bundle was well worth the price. Get used to being attacked by vampires, a lot."}
{"product_id": "B00I14395A", "context": "Can the angle of the keyboard be adjusted?", "response": "No adjustment for angle, standard keyboard angle legs one position only angle or not."}
{"product_id": "B00FC1UH82", "context": "Is the default gate for the stick square or octagonal?", "response": "it comes with the square gate."}
{"product_id": "B008WZRZJY", "context": "Does this game run on Windows 8.1? Thank you for an answer", "response": "Don't know.  I have Windows 7 and it plays great on 7."}
{"product_id": "B005F1ZUU4", "context": "Will it work with Fire TV?", "response": "has to be used with pc."}
{"product_id": "B00A8HIGSS", "context": "Is Motion Control required to Play this?", "response": "No. Even though it supports it you can play it with just a regular controller."}
{"product_id": "B004CFASL0", "context": "will they play on Windows 7?", "response": "I have them on my computer (windows 8) but I play them in windows 7 mode.  So I would say yes to windows 7."}
{"product_id": "B00EOUL7T0", "context": "Will this work with a Universal Afterglow headset", "response": "I honestly don't know. I bought it for my turtle beaches. But i've yet to find anything that it actually fits. Won't work on tritons, razers, or turtle beaches. I wouldn't recommend you buy it."}
{"product_id": "B00D78Q4UM", "context": "Does anyone suffer LED backlighting outage issues, like owners of the K70 do? It's an issue with the K70, so is it an issue with the K50?", "response": "I've had the keyboard for about 4 months now, no outage thus far, led always on"}
{"product_id": "B00F9RGFEY", "context": "Is this headset durable?", "response": "over the time ive had mine ive cracked the top band of the headset but its still fully functional"}
{"product_id": "B00JFPO7JG", "context": "Can tropico 5 play off line?", "response": "Yes, Tropico 5 has sandbox and campaign missions in addition to multiplayer."}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the -box 360?", "response": "As far as i know the Skylanders are universal and will play on all machines."}
{"product_id": "B009M72E5Q", "context": "Can Netflix be viewed on this unit?", "response": "Yes, once you set up your Wi-Fi and get your Wii online, you can use Netflix or Amazon Instant Video directly from the options menu. Hope that helps."}
{"product_id": "B00I4BGNVM", "context": "can you use a controller?", "response": "There's programs u can get that will allow u to assign commands to controllers yes"}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "In case you missed it, the RAT7 is now shipping.  MaximumPC did a review of it and gave it a 10 out of 10 and \"kick ass\" award.  They said the RAT9 should be available later in the summer.  I'm pretty patient, so I'm still waiting."}
{"product_id": "B00CJ7IUGS", "context": "Do I need to have played Oblivion to understand Skyrim?", "response": "No, definitely not, I did not play the past four games of elder scrolls at all. And now I am like a beast lol!"}
{"product_id": "B00C7103DO", "context": "Have the season pass and/or DLC's been integrated in one single game/CD yet or do you still have purcahse them separately?", "response": "Hello Fabian. The game came with the add-on \"Deathstroke Challenge Pack\" already included (they give you a code to download the content on PS Store)."}
{"product_id": "B000VBFWAG", "context": "will it work on mac or is there another version for mac?", "response": "don't use mac my os is windows and it works ok on it."}
{"product_id": "B00AQ2BLI2", "context": "when recruiting units is it like Rome 1 that is 1 unit per turn or can it be multiple?", "response": "Since I was never able to load it on my PC, I never was able to play it either."}
{"product_id": "B002I0HD9G", "context": "Can I control the weather in this game while free-roaming??", "response": "Not 100% sure but I don't think so"}
{"product_id": "B00FXOP1JI", "context": "Does this come with the ac adapter?", "response": "I got it brand new and it came with a AC adapter and the system has Mario and Luigi outlines on it, and the instructions and stuff it had, and it included AR cards which is a little extra thing for the system. And Mario and Luigi Dream Team is pre downloaded."}
{"product_id": "B00006B84X", "context": "my X52 is being sent back, too many driver issues where in the middle of playing DCS World, the sticks lights up flashing and fails to work.", "response": "Do not have any problems, but I don't use that often."}
{"product_id": "B009AFLXQQ", "context": "Compared to the other controllers, does this one have the motion stuff?  (Can i steer a car my tilting or shake it for Wii U Party)", "response": "You cannot. The wii u pro controller has no motion controls built in."}
{"product_id": "B000RA778G", "context": "I have windows 8, will it work.", "response": "I have windows 8 and the cd will not download."}
{"product_id": "B00DH1KRQQ", "context": "Would this controller work for my laptop that has Windows 8.1? If not do you have any suggestions on a controller that will?", "response": "Yes it works fine but you may have to download a DS3 tool."}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "I had the same question you are asking, and the answer is yes. The outside of the packaging is not in English, though, so don't panic when you get it."}
{"product_id": "B009AFLXQQ", "context": "Compared to the other controllers, does this one have the motion stuff?  (Can i steer a car my tilting or shake it for Wii U Party)", "response": "Like others have stated, there is no motion ability and that's likely why the Wii remotes/nunchuks are still usable on the system to allow that. The gamepad tablet has it, but not the Wii U Pro controller. It also begs the question why this controller is so expensive since it just has minimal rumble and Bluetooth connectivity."}
{"product_id": "B00EPZ8POY", "context": "Hello, I want to know if if the cover looks like the one in the picture? also, does it have spanish subtitles? thanks", "response": "Yes that is the cover for the game. The game is in Japanese with english subtitles Im not sure about spanish"}
{"product_id": "B009K7U6IK", "context": "dose this keyboard use USB", "response": "Yes, I can only use USB, so I made sure of it before I bought it."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "I have windows 8.1 and the game dosent work for me. However, I dont know if this problem is specific to me or all 8.1 users have it. Hope this helps!"}
{"product_id": "B002I0K6X6", "context": "Is this PC compatible?", "response": "I know you can plug them into the usb and pc will detect and charge but if there is anything that I know of that may help is the controller software called motionjoy. Best of luck. Will tell you I am not positive that this will solve your problem but a decent place to start."}
{"product_id": "B000O5DY0E", "context": "Does this game work on Macs?", "response": "Not if you buy the PC version. It needs to be the MAC version to run on a MAC. You can tell which version it is by looking on the upper left hand side of the cover."}
{"product_id": "B00GANWVJE", "context": "does thiws game work for the 3ds xl model?", "response": "Yes, a 3DS XL is just a larger version of the original 3DS. It will not work with a 3DS LL however."}
{"product_id": "B00EH5V1IO", "context": "Can anyone tell me how far the microphone extends? On the Siberia V2 it's 5\" (measuring from the bottom side), which is not long enough to work well.", "response": "They left the microphone the same as v2's so if you were hoping for a longer microphone that extends out of the headset further this did by happen. Hope that helps"}
{"product_id": "B00BS520SG", "context": "Why does my start button not work when i use this to play super smash bros brawl? Neither the start button on the gamecube controller or the + button.", "response": "On the back of the box it states that if you press the start button on the GameCube controller once it is - twice in quick succession is + and if you hold it down it is the home button. Hope this helped you out!"}
{"product_id": "B002I0K3CK", "context": "My kids love Super Mario 3D World, is this as good?", "response": "In my opinion super mario 3d world is superior but this game is still a pretty fun game, especially when playing with others."}
{"product_id": "B001AI7CF2", "context": "Is there any lag input?", "response": "None that I notice and i use the 2x a week."}
{"product_id": "B00292OW1U", "context": "Does it have volume controls on it and a mute button? The picture does not zoom in so I can't see.", "response": "Yes it has Volume up and down, and standard media buttons. but i would suggest getting a different product. mine died after 2 months of use, and i did get it working again, but it only lasted a short time, and now its 100% dead"}
{"product_id": "B008BGXYBM", "context": "Can you change the color of the lights on this, or is it only green?", "response": "Only green, but in the Razer Synapse 2.0 you can turn off the lighting of the scroll wheel and logo light if it clashes with your system."}
{"product_id": "B00A378L10", "context": "Hey was just wondering if there was any way to dim the led's on the keys?", "response": "Yes, there are buttons on the top that have sun-like image with a + or - sign. +makes it brighter - makes it dimmer"}
{"product_id": "B00CMSCWGS", "context": "does this work for windows 8?", "response": "Yes it works perfectly! Thanks!"}
{"product_id": "B00001LDBZ", "context": "will it work on my PC that is running window 7?", "response": "Thanks John, I am slow to catch on to some of these things, I am 77 Young, I had a Pin Ball Game on another PC, and was digging around trying to fine some thing that would work on my Lap Top, I think I will give it a try, thanks for Your in Put on my Question"}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "Make sure you order from amazon to get receiver. If you order it from someone else, apparently you get a knock off with no receiver."}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "I believe it is a cord holder, wrap a cord like USB around it and you can tuck the ends in the the end hooks."}
{"product_id": "B0095D1CM8", "context": "Is the red aiming button on the left side bothersome to some users?", "response": "No. It does not come in ur way if u don't use it."}
{"product_id": "B005M2KSLC", "context": "I'm looking for a mouse with a middle-mouse button that's very easy to press. I heard Kana has a low pressure one. Is it?", "response": "I am not exactly sure what \"low pressure\" means. This one is fairly stiff with a clicky feel, it is rather easy to press. Although much harder than a cheap clicky $5 mouse. I have never laid to much attention as to how clicky those buttons are so I am not very experienced in the field."}
{"product_id": "B00886XQO0", "context": "Will these work with the new Xbox E console, since the \"E\" does not have an optical connection?", "response": "If box does not have optical output you should still be able to connect to a tv or receiver that does. Connect standard av connector from xbox into tv/receiver and then optical from tv/receiver into head phones. Hope this helps."}
{"product_id": "B002LARYGA", "context": "Dose it work with PS4 Thanks", "response": "Does NOT work on PS4 as of 2.x firmware, it will register as a BT remote but no buttons function."}
{"product_id": "B00BBUCCKO", "context": "Do the keys stay lit continuously?  Or can they be made to?", "response": "The keys have 2 levels of brightness as well as off, for no lights. There is one button that lets you set it on, brighter, or off."}
{"product_id": "B00DE2W4PK", "context": "Is the ps plus code they provide good for a free year subscription?", "response": "Subscription excellent PS4 has always innovated and renew each year, ps4 for me is the ultimate and Playstation plus."}
{"product_id": "B0080RAT42", "context": "I know this is for Genesis, but would it also work with Sega Master System controllers as well? don't both the controllers have the same plug-in type?", "response": "I think so. I mean, I don't own (and I never had) an Master System controller, but since it works in the same way in a Sega Genesis I really think that this is possible."}
{"product_id": "B0050SVNP8", "context": "can this game work on 3ds XL UK version ?", "response": "Yeah and every system but to be sure buy it in the eshop"}
{"product_id": "B002I0F5I2", "context": "that difference has this game UNCHARTED 2: Among Thieves GREATEST HITS ???, the original game ???  and because it comes in a red cover ???", "response": "Uncharted:2 earned over 2 million copies sold and was given the greatest hits cover and for being chosen game of the year. It is a great sequel with great action."}
{"product_id": "B009DYOPK0", "context": "Can the LED's be turned off completely?", "response": "Completely off! Not sure why you'ld want to though. by the way,The Roccat Kone has a full user manual and specification on their website"}
{"product_id": "B001NT9TK4", "context": "has anybody tried this in ps4/? does it work", "response": "It works perfect on PS3 so I don't see why it owuldn't"}
{"product_id": "B00AYBKQRW", "context": "I have a lg mini split model number m122cd i dont have the remote can this remote work? just want to make sure it is compatible", "response": "yes, that remote will work for your air conditioner."}
{"product_id": "B00CMQTVK0", "context": "what is special about the day one edition?", "response": "Nothing outside of your controller having Day One stamped on it..."}
{"product_id": "B003O3EFY2", "context": "Can the Retron 3 play Super Famicom games?", "response": "No. Just the 3.  They have a new one out that does 8 or 9 systems. Not sure about famicom."}
{"product_id": "B000H1V56U", "context": "Does this work on the xbox 360 slim?", "response": "No,  it is a regular xbox 360."}
{"product_id": "B00FZ12F34", "context": "I could probably do the math myself, but I'm lazy and I don't quite follow exactly what's in this bundle.", "response": "It is the best offer I have seen,  it will match Walmart pricing and you get the extra coins."}
{"product_id": "B008SBZD9G", "context": "can i play offline just a story line type single player, or is it online only?", "response": "It is online only, I wish this game just had a four player split screen mode. Matter of fact, all MMO's should have optional lan or split screen modes."}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "Has a/v cables and s video."}
{"product_id": "B00IURGGA8", "context": "do i need steam to play this? or i can just launch this game by itself?", "response": "You need steam to play. If you will buy this then you will receive a Steam code."}
{"product_id": "B003VH5Z2C", "context": "Can you use original NES controllers?", "response": "I dont know. I dont have any original controllers. Sorry."}
{"product_id": "B003O6EDSM", "context": "So it comes with all the Mass Effect Games? Right ?", "response": "Yes, all three games, three separate discs. It also comes with some DLCs for Mass Effect 2."}
{"product_id": "B004XGN8W4", "context": "Does it come with all the power cords, or will i have to get them seprate?", "response": "It comes with the cords. It came with one short 6\" hdmi cord and an ac adapter for the monitor itself."}
{"product_id": "B005BLAIGE", "context": "why wont the full screen button work on the newest laptop", "response": "Sorry, I can't help you on this.  I have it loaded on a desktop and it works fine."}
{"product_id": "B000H67DDY", "context": "i want to know real weight (without case).Thank`s", "response": "Found this on Amazon page.Product Dimensions:  16 x 16.5 x 7 inches ; 2 pounds Shipping Weight: 7.8 poundsScroll down on this link.Saitek Pro Flight Rudder Pedals"}
{"product_id": "B008FHL56S", "context": "Does this product play Titan Falls?", "response": "I do not know. I do not have it"}
{"product_id": "B0002DQUH2", "context": "are the function keys separated in groups of four?  I am blind and that is easier to use", "response": "yes they are... in horizontal line from f1 to f4, then f5 to f8, and last f9 to f12"}
{"product_id": "B00E88G054", "context": "Wired or Wireless? (one star reviews say they recieved wireless instead of the wired version)", "response": "Definitely wired. It's a nice blue and black threaded cord."}
{"product_id": "B0050SVNP8", "context": "Can this be played on a ds lite?", "response": "Yes it can be played on the DS light DSI DSI XL 3DS and 3DS XL all of the above"}
{"product_id": "B002DUCF7Q", "context": "If i add alot of these like half a cockpit do i need to upgrade my Power supply?", "response": "No mate, they are USB devices, I run 6 of these on my flightsim with no problem at all"}
{"product_id": "B00EOUL7T0", "context": "Will it work with tritton primer", "response": "Should work fine. My understanding is that this puck is compatible with all turtle beach and tritton brand products. It worked well with my tritton ax pros."}
{"product_id": "B00GS6A6V8", "context": "I am in Australia and have purchased the base game here (in Aus), will this DLC bundle work on my PS3 with my game?", "response": "Yes it will work with the original skyrim game. You will still have to use your original disk when you play the game. FYI the bundle is so worth it. You can do so many different things now and there are many more quest."}
{"product_id": "B0010WS20W", "context": "Does it work on Windows 8?", "response": "Short answer....Yes it does!"}
{"product_id": "B00AK4QB22", "context": "Will this play on the Xbox One?", "response": "I would say no because the Xbox One is not backwards compatible."}
{"product_id": "B00ENFVJJO", "context": "Will it charge the Gold Wireless Headset ?", "response": "No. You cannot use it to charge the headset."}
{"product_id": "B000266786", "context": "Does this software require an always on internet connection?", "response": "No-- it's older software, and it doesn't require Internet to use.  The only downside: you'll need a computer which runs Windows XP rather than Windows 7 or 8.  Great program, though."}
{"product_id": "B009XZ1CTQ", "context": "I have found the liquid manure tank but cant find normal manure pile on farm simulator 2013 ps3", "response": "It's on the other side of the cow shed."}
{"product_id": "B008FHL56S", "context": "Can you use this hard drive to play Battlefield 4 and Watchdogs? I bought both games and was not able to play them on my slim.", "response": "I'm using it for BF4 with no problems. Not sure about Watch Dogs, but it works with all my titles, even GTA V (which requires a hard drive for content installation). Pretty sure you'd have no problems, but if you did you can always use a USB stick alongside it or by itself."}
{"product_id": "B003N3HEU0", "context": "waht kinde of remote can you use for this game the classic controller pro?????????", "response": "I sincerely apologize Theresa, this was a game for my kids who live with their mother. I can try to ask them, however being 16 and not living with me, unfortunately I cannot promise a prompt response. I really do apologize. Sorry :("}
{"product_id": "B00EV4O7B4", "context": "is this include Pokemon x y", "response": "no.  And, it is NOT clearly indicated on the packaging or the box.  We ASSUMED that X &  Y would be included in each unit.  WRONG!  We had to then spend another almost $100 to buy the games.   Very deceptive packaging. Expensive too"}
{"product_id": "B000FP0K0U", "context": "can I make calendars from this????", "response": "I read the other responses. I have not created a calendar. But after reading the responses, I will definitely try it."}
{"product_id": "B00CJ7IUGS", "context": "If i buy a used version will i still get all the DLC?", "response": "As long as it is legendary edition of skyrim, with the 2 discs. 1 disc being the actual game disc and the second disk being the DLC content. Used or new as long as you have those 2 discs"}
{"product_id": "B00H45K6KS", "context": "I have never played any games in the Atelier series, does this game provide tutorials for newcomers to the alchemy system?", "response": "Yes very detailed tutorials are given."}
{"product_id": "B00G6YJ60E", "context": "Is Whistleblower included in this or do you have to buy that seperately?", "response": "Whistleblower is DLC so unless you find some sort of bundle deal it will not be included."}
{"product_id": "B00H7KDNBO", "context": "What does buying instant access get you? like a code for origin?", "response": "Essentially, you enter or create an origin login and when you complete the purchase the game is available for download in your origin account"}
{"product_id": "B00IP0H4GA", "context": "Is this game compatible with a United States model 1 PS3?", "response": "Yes it is, I was curious about it at first but it looks like all ps3's aren't region locked so you can play any game from any region with any ps3"}
{"product_id": "B000IBELZG", "context": "Do it work on the psgo system.", "response": "I bought this little camera about a year ago and it look cheap but by accident washed twice and still working. The Instructions come in Chinese but I didn't need them lol. So yes it works !!"}
{"product_id": "B00D96BJSO", "context": "i can use it for listening for music in iphone 5 ?", "response": "You can with the second cable provided. You can also use that cable on a computer too.  It is just like any normal headphone jack."}
{"product_id": "B001UIG6M2", "context": "Does this device work on ps2 consoles bought in india?", "response": "i do not believe so since this action replay is designed for US games"}
{"product_id": "B00GOOSORM", "context": "If I use a 60 Day Time Card, does it countdown based on my time played or just 60 consecutive calendar days?", "response": "60 consecutive days added to your remaining balance in days."}
{"product_id": "B00FB4BXGA", "context": "Is the red one actually fully red LED or is it blue LED? Because the picture shows blue LED.", "response": "The roccat Ryos Series keyboards are blue led only. If you want a keyboard that can change the led colors you could get the ROCCAT™ Isku FX keyboard. The Color of the Cherry Switches (Blue, brown, red, black) does not define the color of the leds."}
{"product_id": "B00JFCA6V2", "context": "Can you play games off of the game cards without purchasing a Sony memory card?", "response": "Nope, game won't start without a memory card, I tried."}
{"product_id": "B00BMFIXT2", "context": "Is there a 2 player co-op? I want to play split screen, is that possible? thanks", "response": "There is no splitscreen option for Co-Op, unfortunately. I doubt that the framerate could handle two separate players amongst such large crowds, so perhaps it is for the best."}
{"product_id": "B00030GSJY", "context": "I'm interested in a career as a professional Helicopter pilot, is the X52 a good choice for someone who wants to practice Helicopter flight without pedals?", "response": "Its a pretty good stick if that's what your asking...as for closeness to a helicopter stick I'm not sure of but as far as simulations go this is a upper mid range stick I think its worth the money. I use it for dcs a-10 simulator and its excellent and that's a very detail oriented simulator"}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "Yes, I had them on my older computer with windows 7.  no problem"}
{"product_id": "B0088MVQIM", "context": "Does it come with a cable?????", "response": "According to the information from Ubisoft on Amazon, it does.  If you're purchasing it used, I'd ask.  I can understand thinking it wouldn't at that price, but the info says it does."}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "Yes Daniel , it will work on the PC I have a Iracing account. The only weakness is the pedals , load cells are much better. I don't want to ramble , but yes it works for the PC lol"}
{"product_id": "B009RHEBWA", "context": "Is there a limit on how many people can file their tax using it?", "response": "Yes,  you can use it for up to 5 federal e-file returns.  All state e-file returns cost.  Check with your state.  Some offer free returns by going to the state website and filing there."}
{"product_id": "B00C2B2Y9A", "context": "How long does the battery last?", "response": "I have measured around 12 hours with mine. Just be advised that it takes around 2 - 3 hours to get a full charge"}
{"product_id": "B00J6DLPLK", "context": "Japanese voice & English subtitles  Support?", "response": "the Japanese voice acting is a DLC that you have to buy , i bought it and its good ."}
{"product_id": "B00BGHUS58", "context": "I havnt got this game for my son yet and he wants to know if it's worth it", "response": "I think so. It is a lot of fun. You can follow the missions the game has lined up for you or you can just take off and do what you want. To me it's a nice change of pace."}
{"product_id": "B002I098JE", "context": "can you turn of blood", "response": "yes but that would be in the settings on the console just go to setting and go to system from their go to console settings and turn on family settings that will make it so their will be no blood I hope this helped you"}
{"product_id": "B00001LDCK", "context": "will it work with vista?", "response": "Don't know - I used it with XP."}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "You can download games and movies on PSN using the money added to your wallet with the digital code. For more information visit the playstation store web page."}
{"product_id": "B00HS5FETM", "context": "Can I use this as a connection between my Xbox One controller (with Adapter) and an Xbox 360 stock headset?", "response": "If the headset has an Xbox Live chat jack on it, then this cable can be used to connect the headset to the Xbox One adapter. Otherwise, if the headset's chat cable is hardwired to the headset, then this cord will not help."}
{"product_id": "B00DH1KRQQ", "context": "where is the link to download the program that helps it run", "response": "Depending on your OS, drivers may install automatically when you plug it in, or you may have to use the included cd, but there isn't anything you should need to download. If you're having problems making it work, you can try to talk to the manufacturer, but I don't know how good they are about customer service."}
{"product_id": "B0071NH8B8", "context": "Does Vita have a GPS for the car?", "response": "Yes and no.  It doesn't come pre installed.  You would have to find the app for it.  I haven't ever used it for that purpose."}
{"product_id": "B00D96BJSO", "context": "How Do I go about being able to hear the game play and the chat at the same time?  it seems like I'm only hearing one or the other?", "response": "Make sure your controller is updated ..."}
{"product_id": "B00BT9B2LC", "context": "Can you tell me what is the installed system version?", "response": "Like Jessica's, mine also says Version 7.2.0-17J. It was purchased in May."}
{"product_id": "B009JZ04BC", "context": "Where do you install the application for the mouse? To change colors?", "response": "It doesn't matter where you install it. Install it wherever you want."}
{"product_id": "B000K9Q5NW", "context": "I'm 5'3 with short legs, will this be a problem?", "response": "I am 5.6 and it wasn't an issue for me."}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "There is no sexual content besides cleavage. And the gore is kept to a minimum during and after combat."}
{"product_id": "B006QRMR4S", "context": "Is this a US based product?   Last DS I bought from Amazon came from China and I had lots of problems with it", "response": "Most US based companies that produce electronics work out of China   but the product seems to work fine"}
{"product_id": "B0085P7U0U", "context": "Does this software work with new operating system Maverick", "response": "I have OS X version 10.7.5. It works very nicely on my unit. (Maverick???)"}
{"product_id": "B0073J8BYS", "context": "Does it come with a mounting bracket for the tv?  How does it sit on top of the tv, if no bracket is included?", "response": "Additional information...HCC said on February 20, 2015Thank you for answering.You're welcome, we normally sit the camera on top of our tv or in front of the tv on our amoire. As long as the surface it flat, it works well."}
{"product_id": "B0050SVNP8", "context": "Is White 2 and Black 2 the same game? I'm confused because they have the exact same number of reviews and I don't know which to get my daughter.", "response": "Yes and no. They're different versions of the same exact game. They each have some minor, version exclusive content that the other game does not. This is to encourage player interaction and sharing. But you are not missing out on anything if you get one version and not the other."}
{"product_id": "B00GV0LR64", "context": "Does it work with all Call of Duty games?", "response": "No. This only works on Call of Duty 3 on Nintendo Wii."}
{"product_id": "B00FQPQO4A", "context": "what is the difference between titanium for 27.99 and the other one for 19.99? and can we download this on to our android tablet", "response": "Titanium Edition Has an extra map and farming equepments. Farming Simulator 2013 only for MAC and PC. For Android You can get Farming Simulator 14"}
{"product_id": "B00DJYK8XS", "context": "does this promote weight loss", "response": "I have been doing Zumba for a couple of months and while I have not lost weight, I have lost inches!  That's even better because it means I am losing fat and gaining muscle. It is a great workout.  You really burn calories and because it's so much fun it's not a chore."}
{"product_id": "B0096L2SJ0", "context": "Does this fit with the phone, when it has a case on?", "response": "Yes, I have the Galaxy lll w/ an Otter Box case and the fit is fine"}
{"product_id": "B00FM5IY0Q", "context": "Is this a FPS game?", "response": "yes its a first player so you run around and kill zombies while making new friends"}
{"product_id": "B009O8HH3M", "context": "Will this fit my 12 year old son?", "response": "Of course it can! My 12 year old cousin got it and it fits him perfectly. Plus it's adjustable for any sized head"}
{"product_id": "B0073QM45I", "context": "This cable works without having a battery? I mean, It will charge my controller without a battery inside?", "response": "it won't charge it without a battery, but you can keep it plugged in and use the controller without batteries it just has to remain plugged in the whole time."}
{"product_id": "B003O6EDSM", "context": "how much space is required", "response": "5.3GB HDD space. Hope it helps :)"}
{"product_id": "B00IP0H4GA", "context": "Is this game compatible with a United States model 1 PS3?", "response": "It worked on my US PS3. The only problem I had with the game was that everything is in Japanese and there is no English translation unless you go online and search for it. The game is awesomeeee though!"}
{"product_id": "B00GZ9ESEE", "context": "is this Kinect compatible", "response": "Yes, it will connect with no problem."}
{"product_id": "B009Q5XGO2", "context": "So when you charge the gamepad this charges with it? You don't need to charge them seperatly right?", "response": "yes one charge. my only complaint is after almost a year I need to buy another the battery simply does not hold a charge any longer"}
{"product_id": "B001V9PTVE", "context": "Can i play these on a mac?", "response": "As far as I know, you can't. However, you may be able to find it on line, just make sure to look for the Mac symbol.Hope this helps,Eric"}
{"product_id": "B002BRZ852", "context": "Is the co-op mode splitscreen?", "response": "I played with a group of four, two on my screen at my house and two remote.  It was an awesome game, very fast paced."}
{"product_id": "B00F27JDY0", "context": "Can you change it to American or is it only in japanese?", "response": "It can do all languages.  The main distinction is on the Vita menus, the X and O buttons do the opposite.  It will say press O to enter and X to close.  In most games it's back to non Japanese designations.  I found it easy to get over, but others don't like it."}
{"product_id": "B00GV0LR64", "context": "can this be used with the xbox one", "response": "Yes it does but DO NOT waste your money on this peice of TRASH trust me"}
{"product_id": "B0000C7GHG", "context": "Does it come with Dragonball Z Boudkai Tenakichi 3?!!!!!!!!", "response": "Some sellers sell them with games and some don't so you will need to look at the condition notes."}
{"product_id": "B000B6MLPU", "context": "would it work on a non hdmi tv?", "response": "Yes, as long as your TV has component input (red, blue, and green for video + red and white for audio) or composite input (yellow for video + red and white for sound). The component input is generally a higher quality."}
{"product_id": "B0041RR0TW", "context": "ZSNES/NES/N64 Emulator Compatibility Can anyone who has used this with old gen system emulators post about their experience using this with those progs?", "response": "Haven't tested the others, but it works with ZSNES except you can't go to and through Settings of the actual emulator with it (Don't know if you can with any other controller either however)."}
{"product_id": "B000LQ4HTS", "context": "Does the throttle work on it's own, since I'll be using a different stick?Thanks in advance.", "response": "If it is pulled all the way back it will not work."}
{"product_id": "B002I098JE", "context": "is it split screen", "response": "Not sure if that option is available. When I saw my grandson playing is was only one screen"}
{"product_id": "B000BAVN14", "context": "Will this still work with Windows 7?", "response": "Yes it will work with Win 7.  Plenty of people still play Sims 1 with Win 7, and I haven't heard anything about any installation problems.  If you run into any, try installing it as an administrator."}
{"product_id": "B004J6KRD6", "context": "could i use the warranty if i take this to america latina?", "response": "Course! But they haven't authorized partners there, so you must send it to US or Europe to fix. Anyway, the T500RS is the best for your pocket."}
{"product_id": "B000266786", "context": "Does this software require an always on internet connection?", "response": "No, Reader Rabbit does not require any internet connection for product use. You will need to leave the disc in the drive to run the program. Product registration may be done online."}
{"product_id": "B00FB45YFQ", "context": "why wont the LED lights work? and/or the software show a setting for it?", "response": "I'm not sure. When I received mine, I had to download the Steel Series Engine from their website.  http://steelseries.com/engine  Then all the settings I could ever want were on there. That website has an animation of how to use the software as well so if it doesnt look/work like that, something is wrong."}
{"product_id": "B00HWMP0TU", "context": "so this  version of the game has no physical manual or map or anything cool for my husband to be giddy over?", "response": "This version of the game has a Simple physical manual（7 page), a page of TECH TREE AND SPECIFIC CHARTS. It has 15 DLC. It need a account of steam. The game program can download in steam, DVD disk can't need. These help to you? if not, Please ask me in simple English again, my English is poor."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "if you have a playstation 3 then yes, reason why; is because the ps3 has no region restrictions. so you can use any games from other countries for the ps3 only other.other system like the xbox 360 require a Japanese region to play it."}
{"product_id": "B00D3TRMD8", "context": "is this the full version game or is this just the online code that I need to play this game.", "response": "Its a code, you need to play it on steam. I didnt know either till after i bought it."}
{"product_id": "B009M72E5Q", "context": "Can you do karaoke on it?", "response": "I have at least two games where i can sing but i really don't know if they have regular karaoke."}
{"product_id": "B003YC4D9A", "context": "I just got mine in the mail and I'm wondering how do I connect it to the Wii U?", "response": "What's up,I don't really know how to connect it to the wii u,since I don't got one but it connect real good to the wii..try google and see if u get any results."}
{"product_id": "B00DWXUYN0", "context": "will this case fit the dsi xl?", "response": "That's what I bought it for and it fits perfectly."}
{"product_id": "B00001IVRD", "context": "Does this works on Mac (Mavericks)?", "response": "Yep it should work."}
{"product_id": "B002LMX5ZW", "context": "Moraff requires a code number to get their discs to work. Is code number included in jewel case.", "response": "A code is not required."}
