{"product_id": "B00006B84X", "context": "Does anyone here have one the lasted more than 10 years?  How is it holding up?", "response": "It will last forever, it is very well constructed."}
{"product_id": "B003XNU1JQ", "context": "How do you play the two player mode? Do I have to get two of the classic controllers?", "response": "I would guess yes. I've never done it but this game absolutely will not work without the classic controller"}
{"product_id": "B007WPM9GO", "context": "Do these cases fit the DSi XL?", "response": "Yes this one will fit all except the 3dsxl with the brackets that come along with it."}
{"product_id": "B00DT55P94", "context": "Are all full games?", "response": "Yes  complete games good ofert"}
{"product_id": "B00AK4QB22", "context": "where is the manuel?", "response": "There isn't one. I think it's a way to get you to buy the guide but I I really do t know"}
{"product_id": "B00AFYAUYW", "context": "The pictures and the details appear to be contradictory. Are any games included in this bundle? ...gamecube controllers? Is it gamecube compatible?", "response": "There is no additional game included in this newest version.  This WII is not gamecube compatible."}
{"product_id": "B00G0OYHCW", "context": "How many can play on this at one time?  Also, what other devices do I need for the extra kids to play?", "response": "Up to 4 people can play. You can use the regular wii controlers for the other 3 players, and yourself for some games."}
{"product_id": "B00IURGGA8", "context": "How do I download this to my Mac? I received it as a gift so I did not buy the game myself, but I have the code and am just not sure where to enter it", "response": "Most likely a steam key,  just activate it through stream."}
{"product_id": "B002I090AG", "context": "Does it come with a charging cradle?", "response": "I think if your going to buy a 3ds you should get a 3ds xl there so much better I hated the little ones"}
{"product_id": "B0050SX9I2", "context": "will this remote control a regular sony blu ray player? a bpd-s5100 to be exact?", "response": "sorry no it want go back with exact remote"}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "You can change sections of the keyboard to different colors but not single key."}
{"product_id": "B00D96BJSO", "context": "i can use it for listening for music in iphone 5 ?", "response": "Yes but the quality  is underpar"}
{"product_id": "B002DUCF8A", "context": "do the pro flight panels work on mac`s?", "response": "Yes they work on the mac...I used them for X-Plane on a mac a couple of years back and they worked wonderfully...but please visit this thread...and use the link on the posts there for the plugin...you might have to use the plug in.http://forums.pilotedge.net/viewtopic.php?f=3&t;=886you will find the plugins here http://forums.x-plane.org/index.php?app=downloads&showfile;=14646-cheers"}
{"product_id": "B00INUME3K", "context": "Can this game be played on a Australian PS3 console?", "response": "I would think so because it's a ps3."}
{"product_id": "B00519C7CE", "context": "Call of duty black ops LTO Edition x box is it  black ops 1", "response": "yea but even better you get more maps if you play online..."}
{"product_id": "B0057WDBHA", "context": "does it have L1 and L2 buttons? the picture doesnt show any", "response": "It does but they are on the upper part of the arcade pad. As well as the start/select buttons. Top row, small buttons."}
{"product_id": "B005UI8V6C", "context": "So I've owned this game for a month and it was working fine until one day it just refused to finish loading and won't work anymore. Any Ideas?", "response": "If nothing else works, backup your save games uninstall then reinstall. Really you shouldn't need to back up the saves as they should be left on your computer."}
{"product_id": "B001MGNWDI", "context": "Does it have a Yaw capability?", "response": "It does have the ability built into it, but not all flight games accept its input.  It depends on the game really whether or not it will work but yes, it does have the ability."}
{"product_id": "B0071NH8B8", "context": "So, what is the upside to the regular Vita wifi?", "response": "3G costs too much, and can't do half of the system's functions, and the wi-fi can do all that with a signal."}
{"product_id": "B002YVD3KM", "context": "Does this work on a Mac?", "response": "I haven't tested it on a Mac, but it's USB and was plug and play when I tested on a PC. As long as your Mac has a USB port, I would be very surprised if the controller did not work. Hope that helps."}
{"product_id": "B0053BCML6", "context": "Can more then one person have a house in New Leaf just like in Animal Crossing City Folks?", "response": "I believe it supports up to 4 people, but only the first person can be Mayor."}
{"product_id": "B00F9RGFEY", "context": "Is this headset durable?", "response": "All I can tell you is that I have used the headset for quite a number of hours now and I can't spot any obvious wear and tear on them.  Still look and function like new."}
{"product_id": "B00HWMP0TU", "context": "I understand that I need an internet connection to download the game. Can I play the game offline once downloaded on my computer?", "response": "Yes you can play offline single player.  Even LAN and Hot Seat Multiplayer."}
{"product_id": "B001IYR53W", "context": "will it work with Windows 8.1", "response": "yes, I had no trouble downloading onto mine Windows 8"}
{"product_id": "B003YC4D9A", "context": "I just got mine in the mail and I'm wondering how do I connect it to the Wii U?", "response": "plug it in your wii remote.. like u would the num chuck"}
{"product_id": "B0050SWBAE", "context": "Does this work with the pro controller?", "response": "It is compatible with it however I have not personally used it with one (because it is easier to point and aim with a wiimote, I think)."}
{"product_id": "B004S5PBM0", "context": "does the cable works fine in rocksmith 2014 ?", "response": "Yes, better than the last"}
{"product_id": "B0050SYK44", "context": "Can I use this game with the game of the year edition add on content? Thanks.", "response": "I'm not quite sure, since i haven't purchased any if its DLCs, but gamerfaq.com might be of assistance. Hope it helps!"}
{"product_id": "B0050SYK44", "context": "why is it rated m", "response": "Plenty of violence -- blood, gunshot wounds, heads being blown off, hatchets, etc.  Some sexual innuendo, but nothing too blatant (at least so far -- I haven't completed the game)."}
{"product_id": "B00D6PTMSW", "context": "Do you have to have kinect on your xbox to use this lesson game?", "response": "If you have kinect you can use your voice to navigate the game."}
{"product_id": "B003BKWEHS", "context": "does it work on windows 8, 64 bit?", "response": "No idea.  I gave the game as a gift and it was used on Windows 7."}
{"product_id": "B002B9XB0E", "context": "Has anybody tried this with an emulator on Android?", "response": "Yes it works great hooked up to a usb otg cable on both my galaxy s3 and my rca walmart black friday tablet both running android 4.2+. With the gamepad, cheap tablet, and stand, it makes for a great snes/nes/gb portable emulation system. Fantastic Controller. Needs no drivers for any OS i've tried so far."}
{"product_id": "B007SO6USW", "context": "Does it work with the ps3 slim?", "response": "yes all you need is a USB port i have mine plugged into my tv"}
{"product_id": "B00I5LMSBK", "context": "A weird question but did anyone get a game manual in their case....It dumb but it always bothers me when I get a new game and there's just the disc", "response": "Yeah, the US release does not have a manual, shame I know, but the game itself shows you detailed instructions for modes and options anyways."}
{"product_id": "B00HS5FETM", "context": "I have COD black ops II xrays for my PS 3, Will this allow the xrays to work with PS 4??", "response": "Not sure. We had actual turtle beach earphones and it didn't work. Ended up just getting the Sony headset instead of returning the cord..."}
{"product_id": "B0087N222Q", "context": "Can I use this just as a microphone paired with a Bluetooth speaker for lectures?", "response": "I really don't think so since the headset and speakers are usually accesories that will pair with something else eg to a pc a console a car a phone etc, don't think these accesories will pair to one another then again i could be wrong safest bet would be using them both through a laptop."}
{"product_id": "B00C2B2Y9A", "context": "What's the durability? I am very careful with my electronics. How long do these last?", "response": "If you're good to your electronics then you shouldn't have an issue. The frame is a flexible plastic and could probably be broke intentionally fairly easy but if you're not just tossing them around or mistreating them they should last. I've had mine for quite a while with no problems."}
{"product_id": "B00CMC6HCY", "context": "in the storymode do you HAVE TO DO THINGS  to move on in the story line", "response": "Yes u do ...."}
{"product_id": "B002J9GDXI", "context": "Does this mouse have volume control?", "response": "It doesn't out of the box but it does have some programmable buttons that could do the job."}
{"product_id": "B005LUUWL6", "context": "does this work for 3ds xl for cheat code?", "response": "Yes it does very well worked for game I needed."}
{"product_id": "B0099OZR9W", "context": "can it be install on a xbox 360 model # 1439", "response": "Xbox 360 S Console, Model #1439 is what it says on the back of mine and it fits perfectly"}
{"product_id": "B00EI4V3X2", "context": "I have this headset, how can I remove the mic? I tried pulling it out with some force but nothing is unplugging it. How can I do this?", "response": "Pull on the middle of the cord, not on the base attached to the headset."}
{"product_id": "B006NU6F28", "context": "does it work on windows 8 at all?", "response": "Yep! I run it on 8!Brian"}
{"product_id": "B00HKCKA0G", "context": "What other headsets did you consider prior to buying these?", "response": "I didn't really look at others once I saw these and the price."}
{"product_id": "B0038MVFYC", "context": "Can you play this with the Nintendo 3DS?", "response": "Yes.  You can play any DS game on the 3DS.  It just won't be in 3d is all."}
{"product_id": "B0096DMDXY", "context": "Is this compatible with my HP notebook pc with Windows 7?", "response": "It should be. The requirements are as follows: Windows® 98, Windows® 2000, Windows® Me, Windows® XP, Windows® Vista™, Windows® 7Pentium® (or compatible) processor64 MB RAM20 MB available hard disk spaceCD-ROM driveUSB port"}
{"product_id": "B00FEDP968", "context": "Can I listen to music on my phone without it being plugged into the USB port?", "response": "TLDR - NoThe entire headset and control module is powered through the USB.  Plus, the wire that connects the headset to the control module is permanent.  It would be safe to assume that this headset is very much geared towards desktop PC/Mac users."}
{"product_id": "B001FBHT34", "context": "Does it work with a ps3? Does this work with a ps3? I know I'd have to get the adapter for the usb and mic so I'm just wondering if it'd work then.", "response": "Yes as long as you get the correct adapters (RCA female to 3.5mm female) and a USB adapter for microphone.  The sound in awesome."}
{"product_id": "B0044DJZ0A", "context": "Is the Shift Gaming Keyboard  or Keyset gaming Keyboard?.  I have the Starcraft II keyset and need the SHIFT keyboard in order to it works. Thanks.", "response": "We bought the Key Set first and realized we needed the actual Keyboard. The keyboard we bought had a generic key set with it, we just added our World of Warcraft keyset to the key board."}
{"product_id": "B005YR1VP2", "context": "Does it come with all the av cables and have an easy setup?", "response": "The purchase I made from Amazon was brand new. Everything was there. I was very happy with the product."}
{"product_id": "B0091WIOJ2", "context": "Can I use it for xbox one?", "response": "check this link for compatibility http://www.astrogaming.com/compatibility-console/compatibility-console.html"}
{"product_id": "B006W41X1S", "context": "Do these let in alot of background noise?", "response": "No back ground noise only if the noise goes in your mic"}
{"product_id": "B00FATRKWM", "context": "Is the controller included ?", "response": "The package that I purchased included one controller.  I purchased a second wireless controller separately."}
{"product_id": "B00D9FQ9CQ", "context": "do I need an internet connection to use this?", "response": "you would need an internet connection, especially for updates and to do XBOX Live"}
{"product_id": "B007MJSZDQ", "context": "dose it come with the battery packs?", "response": "Yes but it stops working after a week"}
{"product_id": "B00D6PTMB4", "context": "Could someone suggest a good guitar to use this with? Something cheap yet not horrible and sold on Amazon? Thanks!", "response": "I use an Epiphone DOT semi-hollow body its one of the cheapest but it sounds great when i plug in to an amp and play with my friend he has a Gibson 335 and i stay right up there with him. but i suggest go with a nice Epiphone they are great guitars"}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "Namco museum has galaga classic and an updated version"}
{"product_id": "B008FHL56S", "context": "Does this product play Titan Falls?", "response": "Wouldn't know don't have that game"}
{"product_id": "B00DBRM3G8", "context": "According to what iam reading you can't create a new team and create players and put them on it,is that correct?can someone answer this queation for me.", "response": "Yes you can, it's called MyTeam Mode.  You can put current players on your team or you can put legends on your team like Magic and Bird.  You can also have a mix of both.  In this mode you can play against other players or against the computer."}
{"product_id": "B00FB4BXGA", "context": "Anyone having the problem with key malfunctioning? I only use the arrow keys for driving & without touching a right or left car will suddenly turn.", "response": "No I've never had that problem. Are you sure you aren't slightly resting your finger on the left or right key when this happens?!"}
{"product_id": "B008EZ3PBY", "context": "Will this work with the xbox 360 pro?", "response": "this works with ALL types of xbox 360's...it can be used as a way to hook up surround sound and gaming headphones"}
{"product_id": "B006QRMR4S", "context": "Can you play regular ds games on the 3ds?", "response": "You can but there are some aspect like blowing into the microphone slot thing from the first DS that doesn't seem to work anymore, or for me to get around it, I'll have to dig around in some forums. But I dug out my old Sims 2 game and it worked until I got to that glitch."}
{"product_id": "B007JDMPOK", "context": "Is the Regal Frostlion Mount available for all the characters in the account or can only use it on one character?", "response": "it is account bound so all characters"}
{"product_id": "B00BDS415I", "context": "Will these work for the Xbox ONE?", "response": "I am sorry I dont have an XBOX one but if the interface of the XBOX 360 and XBOX one is the same then it should not be a problem"}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "Yes it opens up all character slots on any server. So you can play one of each class on one or multiple servers."}
{"product_id": "B00BCEK2LU", "context": "How does the backlighting compare to the venerable G11? Dimmer, brighter, same?", "response": "Seemed similar.  I hated this keyboard, though.  I returned it after a week.Several of the buttons double type. For example, one press of the space bar gives 2-3 spaces every ten times.  Drove me crazy"}
{"product_id": "B002SCQSKE", "context": "was the game fun", "response": "this game is so much fun I got it in pack of games and it was the only reason I got it and it is absolutely amazing! its the best game of all time!"}
{"product_id": "B004RMK5QG", "context": "How Many Years can you stack up of PS+", "response": "I don't know. I only bought an 1 year PS+ card and I renewed my membership. I don't know if you can stack up several memberships. I think you must ask this question for Sony.Hugs!"}
{"product_id": "B00DE2W33I", "context": "Hello!! Can I use this PS4 in Italy?", "response": "no this ps4 is a u.s model. you need a model that matches your region. you can use this ps4 but you would have to import games from the u.s to be able to play games on it though.ps4s are region locked."}
{"product_id": "B00H1FCUBY", "context": "how to connect the headphone to my Samsung S4 ?", "response": "put your phone on can be recognized by device then when you hold the button for it to flash red and blue then hit Search and it should connect"}
{"product_id": "B004JKZUJI", "context": "how does this one works with monster hunter ?", "response": "It didn't work at all for me"}
{"product_id": "B00D6PTMHI", "context": "is this have activation key?", "response": "Activation key does come with the DVD version.  It is inside the DVD case."}
{"product_id": "B0053B5RGI", "context": "Does it work on the 3DS XL?", "response": "Yes it does! :) It works very well on the 3DS XL! I myself have a 3DS XL, and it works amazingly!"}
{"product_id": "B004N7IIQ4", "context": "Is the mixamp compatible with PC ?", "response": "I think so, since my computer was a PC."}
{"product_id": "B00CBQO930", "context": "So does it go up to 2000 DPI or 4000 DPI?", "response": "I'm not sure if it is actually a 4000 DPI mouse or whether the drivers simply use acceleration to achieve what would be similar to 400 DPI. From my experience with it though so far, it does not feel like acceleration and doesn't show any of the symptoms that you experience when using acceleration in gaming."}
{"product_id": "B00FC1UH82", "context": "does it have any headphone jack ? and if it does, where is it ?   a picture can be good for that.", "response": "No It doesnt, just have a usb cord"}
{"product_id": "B002L93F0A", "context": "Do you get two controllers from this order or one?", "response": "You get two controllers from this order."}
{"product_id": "B006W3ZXEW", "context": "Can the buttons be used to bind any sort of macros (shift+F1, etc) or can they only switch between 1-6 and numpad 1-6?", "response": "If you install the Razer software you can set them to anything."}
{"product_id": "B000NJBD90", "context": "I know it says PS2 to PS3, but it's a USB, do you think it'll work if i plugged it into my Xbox 360?", "response": "I have no idea and I can't try since I don't have an xbox but maybe it will, the buttons might act weird though like the abxy buttons might be on the dpad or the joy stick might be the triggers"}
{"product_id": "B0018XWLKA", "context": "Will GTR EV. run on Windows 7, with a MOMO wheel? i have been burned before, buying games , then finding out they will not run on  windows 7... please help!", "response": "No.. Don;t use that version. Go to logitech.com & download all new drivers which appear on the Momo page. this includes the latest profiler. Throw that disk away....Ken"}
{"product_id": "B00CJ7IUI6", "context": "Is the DLC in the disc or is it a download code?", "response": "It was on the disk, but if you don't have internet I should warn you, Skyrim is very glitchy and if you don't have internet to download patches, you may not be able to play the game."}
{"product_id": "B000ZBZK7C", "context": "will this run on mac", "response": "No, but Optimum Video Poker will run on all popular platforms, including Mac OS X 10.2 and later."}
{"product_id": "B004AM5RAM", "context": "when you recieve the box will the box be the regular razer box or an amazon box, and will it have a wire to play wired itstead of wireless.", "response": "The box it is shipped in is the standard Amazon box, and it should arrive in the original \"Razer Naga Epic\" packaging inside of the box it shipped in. This includes a wire that may be plugged into the mouse directly, or a wireless adapter."}
{"product_id": "B009GZX49Y", "context": "este juego esta en ingles o en español?...o si se puede cambiar(this game is in english or in spanish?", "response": "It has both languages in it"}
{"product_id": "B002YVD3KM", "context": "Just received it.  Nestopia is recognizing it is plugged in, but there's no gaming response to any of the buttons.  What am I doing wrong?  Win7, hp", "response": "You have to allocate the buttons on the controller with Nestopia. This is what you do: Options --> input. Select \"Pad 1\" and allocate the movements. Push \"down\" for down, \"select\" for select etc. Hope this works."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "That depends on the app... I know that WWE Network has not been built with compatibility for remotes. Netflix and Hulu have however."}
{"product_id": "B009OYUFMG", "context": "Does this product work on World at War?", "response": "It's a mouse.  I can't see why it can't be used on any game that allows mouse input."}
{"product_id": "B005L38QK2", "context": "Is anyone else having an issue where the cursor doesn't react appropriately. it's like going into a \"seizure\", or something.", "response": "I have not had any issue; been working great!!!!"}
{"product_id": "B001BYMZ5W", "context": "is there a better gaming headphone than this? or this is top of the line?", "response": "This is by far the best gaming headset you can buy.  Especially paired with an astro a40 mixamp.  You can certainly find much better headphones however if you want a mic this is it."}
{"product_id": "B00IAVDPSA", "context": "Does it uses battery or is rechargeable???", "response": "It uses batteries, although I use rechargeable ones."}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "Yes it come with stylus and charger."}
{"product_id": "B00DRKJBC8", "context": "will this work for windows 8", "response": "Oh yeah, I play it on my windows 8 all the time"}
{"product_id": "B00BCEK2LU", "context": "Is this wireless? It comes up under a search for wireless, but the pictures seem to show a wire coming out of the top.", "response": "No it's not wireless sorry. The cable isn't stiff like some other keyboards are. It's about twice the thickness of an iPod data cable."}
{"product_id": "B00HWMP0TU", "context": "I understand that I need an internet connection to download the game. Can I play the game offline once downloaded on my computer?", "response": "It plays offline.  Steam is used to download the game onto your computer."}
{"product_id": "B005LN5UOC", "context": "is it compatible with cellphones?", "response": "Not sure if it is compatible with cellphones,  but the overall quality is not that good... but you get what you pay for"}
{"product_id": "B0002GTXDM", "context": "Is this compatible with the DS lite?", "response": "nope this is retro gaming technology right here, nothing for the ds lite will be this ceap, besides it will probably say ds lite in the title."}
{"product_id": "B00001IVRD", "context": "Does this works on Mac (Mavericks)?", "response": "No, I didn't know it until I got it. I have to symulate one of te OS which the game is compatible with."}
{"product_id": "B0000512IE", "context": "Can I use these with Window 8/8.1?", "response": "Mine work with W8, can't answer for W8.1 but since it does not require drivers or cd's to be recognized or initialized, I believe it may work. It is truly plug and play!"}
{"product_id": "B00J6DLPLK", "context": "For a big fan of Nier, who deeply love the narrative and characters. Would you recommend this game? (Really don't mind the gameplay)", "response": "The characters are awesome and funny. But Nier was better in my opinion. Like, there is no equivalent to Weiss or anything. But the game is similar in some ways."}
{"product_id": "B005BLAJRC", "context": "Will these PC games work on a 64 bit PC?  Many games I had stopped working when I upgraded my PC from 32 bit to 64 bit.", "response": "I have an HP Envy with Windows 8.1 and is a 64 bit. All the games run fine. Perhaps you could uninstall the game program and reinstall it. During installation, it might have asked if you had 32 or 64 bit. Good luck."}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "Yes, it's the fastest way that you can't get banned for. The only thing faster is electronic mods which aren't allowed and you can get banned for."}
{"product_id": "B0086V5V8G", "context": "how much of the game is stealth  or can you go in guns a blazeing", "response": "You can play Stealth or go in guns a blazing throughout most of the game, but there are a few stages that must be performed in the stealth mode, just a few. (I love the guns a blazing)"}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "It's rubber dome, but to be honest it feels amazing, DEFINITELY worth $30"}
{"product_id": "B001IYR53W", "context": "Will it work on Windows 7?", "response": "Yes it will. I have Windows 7 and it works fine"}
{"product_id": "B009LGO88E", "context": "Will this function with an American 3DS XL, or is it only compatible with Japanese 3DSXLs?", "response": "This works with all regions of the 3DS XL. In short yes."}
{"product_id": "B00DPQ6GPO", "context": "i am a call of dutty ghost on ps3 i like using shot guns., like fal pistol and sniper is the controller good for me in call of dutty ghost?", "response": "Honestly it's only helpful for zombies and offline gaming, my younger brother is a quick scope on black ops 2 and he said it isn't that help full, that's our honest opinion."}
{"product_id": "B00D9EPI38", "context": "can i add a hard drive", "response": "Yes, You absolutely can... I recommend buying a 250 gb hard drive.  They cheap and it will help you a lot..."}
{"product_id": "B00BRA9T5Y", "context": "What are the buttons on the side of the mouse for and how do I program them? I would read the instructions... but I don't speak japaneese", "response": "The buttons on the side are forward and back buttons. They can't be programmed."}
{"product_id": "B0050SXKU4", "context": "any guarantee the game works? it´s not frozen when playing?", "response": "Yes, it works like it should. The game they send is brand new, unless otherwise stated. Mine was new, and I only payed $30 for it."}
{"product_id": "B003O6EDSM", "context": "Is this game like Dragon Age (RPG) but with guns instead of swords and magic?", "response": "Pretty much. Both series were made by Bioware so there are a lot of similarities. The one major difference is that you play as the same character through all three games instead of creating a new one and all three games is one continuing story."}
{"product_id": "B0016HG4H4", "context": "will this set work with guitar hero warriors of rock?", "response": "This is not compatible with Guitar Hero on the wii. Only the xbox and playstation versions are cross compatible."}
{"product_id": "B00C7103DO", "context": "Any word coming down the pipes of a special edition that will include all DLC and such, like the last two?", "response": "There currently is one available in Europe but for some reason nothing has been annouced for the US."}
{"product_id": "B0057S9SYY", "context": "Would these work if I plug them into the optical port on back of tv?", "response": "Yes they only use optical. So you can hear anything thats optical input. For the microphone though it has to connect to the Xbox 360 wirelessly (it makes the xbox think its a controller)"}
{"product_id": "B007JDMPOK", "context": "Is the Regal Frostlion Mount available for all the characters in the account or can only use it on one character?", "response": "Available to all chars, every char  gets access to  the mount via it's personal mail box, I haven't played in a few months but I expect it to still be the same."}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "Klondike....the one with the grizzley bear icon"}
{"product_id": "B00DJYK8XS", "context": "How does this game compare to the Zumba workout DVDs? If you're a total beginner, which would you recommend trying first?", "response": "I haven't done the Zumba videos. I like the game because it walks you through most of the steps, scores you based on how well you follow the steps and keeps track of your progress."}
{"product_id": "B00FYMTUQY", "context": "Will the mount scratch the front of your tv?", "response": "I have had no problem. It's attached to a Samsung 40 Inch flat screen."}
{"product_id": "B002L6HJCI", "context": "Will the software work on windows 7 ?", "response": "It should.  I run it on windows 8 and it works fine."}
{"product_id": "B00EOUL7T0", "context": "Will it work with tritton primer", "response": "I bought it for my tritton Trigger head set myself and it worked perfectly. I think it would work just as well but if you have any serious doubts you may be able to find the specs for your primer and compare them to the trigger online. But I don't think tritton differs too much.Hope this helped!"}
{"product_id": "B0050SX7BQ", "context": "The item isn't the special edition. The special edition is a steel box version. am i wrong?", "response": "Yea the limited edition is in a steel box."}
{"product_id": "B005QUQP80", "context": "I just got the K60, I plug it in but no lights come on and no plug and play happens? whats the matter", "response": "Mine worked fine when I plugged it in. No issues like you are having. Mine is awesome.  Good luck."}
{"product_id": "B00FLLFJ68", "context": "I know it says that the station will let you know when the controllers are fully charged, will it prevent overcharging?", "response": "Yes it will stop charging once the controller has fully charged"}
{"product_id": "B00030GSJY", "context": "What type of plug does this Joystick use?", "response": "The joystick connects to the throttle module with a mini-DIN connector, and the throttle module in turn connects to your computer via USB.  The joystick cannot be used separately from the throttle module."}
{"product_id": "B00A7VK16A", "context": "Does the Xbox One fit in this case?", "response": "Yes.  my son traveled with his system in this case regularly."}
{"product_id": "B002B9XB0E", "context": "Does it come with a CD to configure controls or does it have plug and play compatibility?", "response": "There are various utilities to use this with, depending on your platform; google it."}
{"product_id": "B00E88G054", "context": "how is this mouse compared to the mazer 1 type r? better? worse? improvements?", "response": "Much better.  Good for simple and extreme PC gaming. It's a great mouse."}
{"product_id": "B003RS1A7Y", "context": "Does this guitar work with Rock Band 2 for PS3?", "response": "No, just for Rock band 3"}
{"product_id": "B00D96BORK", "context": "Where can I get an extra audio cable that comes with this headset (the one with the green end)", "response": "Send me a picture of that cable, If you like, hooper_85@yahoo.com mine broke, and my cables are sitting in the closet useless. I'll send them to you for free."}
{"product_id": "B00A8HIGSS", "context": "is this a physical copy or is a box with the code inside, i hope its physical?", "response": "Yes it's the physical copy"}
{"product_id": "B00EOUL7T0", "context": "Will this work with the Tritton TRIGGER headset?", "response": "Maybe, but I honestly do not recommend this item. See if you can get a replacement from the company. This isn't a good quality talkback cord at all and it is very easily breakable."}
{"product_id": "B00BCEK2LU", "context": "My kb sets on s slide out tray so over all length is a factor. What's the side to side length of the G510S?", "response": "It is difficult to measure, due to the beveled edges, but it measures 20 5/16 inches (20.31\")."}
{"product_id": "B005EQE0YM", "context": "Are the cups on this headset circumaural (fit around the ears) or do they lay on the ears?", "response": "So... I am not sure if everyones ears are different but mine go around my ears.  They are a perfect fit around my ears.  My only problem is the super long coord :)."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "yes. I have windows 7."}
{"product_id": "B00HG0B8NA", "context": "does it run on Windows 8", "response": "I had no problem whatsoever in downloading it and am throughly enjoying the games.. A great group of games, and great price! Thanks."}
{"product_id": "B00DFB99UI", "context": "Does this wheel have force feedback?", "response": "It has vibration feedback, but not true force feedback such as you'll find in the Logitech G27 and higher-end wheels. Meaning it rattles and shakes, but has no \"pull\" like a real car wheel."}
{"product_id": "B003O6N64Y", "context": "This headset powers off every five min due to \"lack of audio.\" Yet my Son is clearly talking.  Can someone tell me what's going on & how to fix them?", "response": "Please contact our support team for troubleshooting assistance:https://www.turtlebeach.com/contact-support"}
{"product_id": "B00I4BGNVM", "context": "can I only use the code on steam or can I enter it on the ESO website? How big is the download size for this game?", "response": "You can use it on either site. If you  use ESO you will have terrible download speeds  approximately 4 days to down load regardless of your connection speed. Use steam is my recommendation."}
{"product_id": "B00BQWTGIS", "context": "Does the PC version on disc also come with a steam code?  I'm guessing no because of UPlay but figured wouldn't hurt to ask.  Thx! :)", "response": "I installed it and when i installing it uplay come up so when the game open it open from uplay not steam."}
{"product_id": "B00F27JDY0", "context": "Please, what contents are bundled with this ps vita?", "response": "micro usb charge cable, ac charger adapter, ps vita, paper work in japanese"}
{"product_id": "B0056JPS84", "context": "Will it work for my xbox 360 arcade", "response": "Yes.  We purchased it for my son's XBOX 360 he's had over 4 years.  He has been able to play every game he owns, which is a lot."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "They are indeed noticably better than last gen."}
{"product_id": "B0087ZMATE", "context": "Are these loose on your head?", "response": "Not at all, the ear cans pinch a little after extended wear sometimes but these otherwise fit perfectly!"}
{"product_id": "B00GZ1GUSY", "context": "It is Singal Player or Two Players", "response": "Single Player...but an awesome game all around ...at least a 9 out of 10"}
{"product_id": "B00EM5UFF4", "context": "Can I play the Xbox 360 version on the Xbox One?", "response": "Napes. You can however access your account thru the Xone version."}
{"product_id": "B00292OW1U", "context": "The keypad to the left, can we use it to move the character about similar to the arrow keys?", "response": "yes.  they function the same."}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "Yes,if connected via a home cable as the other viewer said. There is even a YouTube video to show u out step by step."}
{"product_id": "B009K7U6IK", "context": "I am seeing conflicting answers for this, si I want to know: Is this a mechnaical keyboard? Or are the \"Gaming Keys\" Mechanical? Would like to know.", "response": "I dont think any of the keys are mechanical, but the WASD keys can be switched out with rubber tactile grip keys which is nice for gaming and its a nice keyboard in general"}
{"product_id": "B00BFOEY3Y", "context": "USB 2.0 or 3.0?", "response": "Its 2.0.  But I love this mouse.  It's a great but for any gamer."}
{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "I'd have to investigate that. I run it on Win 7 64 bit. I can think of no reason why it wouldn't."}
{"product_id": "B00B1VJZO4", "context": "Is this an expansion pack? do i have to buy sims 3 first before i get this?", "response": "yes!!! you MUST get sims 3 before buying this!"}
{"product_id": "B00HWMP0TU", "context": "So if you don't want to use the disk to play you can play via steam right?", "response": "Yes, essentially the disc is there only for the installation. All launching and play of the game would be from Steam."}
{"product_id": "B004L5SJ4Y", "context": "il2 cod-has force feedback? steam activation required with dvd version?", "response": "I'm not sure about force feedback. I had the DVD and needed to activate on Steam. Google   \"Air Tactical Assault Group\" or  \"Team Fusion\" register and post. They are extremely helpful and encouraging. They'll get you the best flightsimming experience ever!"}
{"product_id": "B0088MVODO", "context": "How are the graphics for Resident Evil 1-3? Did Capcom make them better or do they look like the PS1 versions?", "response": "They where the same. And you'll need to dig out your PS one memory card."}
{"product_id": "B000A2R54M", "context": "If I buy a used version of this game for my DSI can the progress be deleted? Thanks!", "response": "Yes. All you need to do is go to options and select DELETE ALL DATA."}
{"product_id": "B00AJZNUUI", "context": "WIll I need to purchase any additional remotes so that more than one person can play at a time?", "response": "Yes you will. It only comes with one remote"}
{"product_id": "B006W41W3M", "context": "Is this true surround or virtual surround?", "response": "All surround sound headphones are virtual.  True surround sound can only come from a 5.1 or 7.1 speaker system."}
{"product_id": "B00821ME4O", "context": "Is this controller also a mic?", "response": "No is just a controller is been almost a year and still works great"}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "Well I myself have a big head so yeah it is"}
{"product_id": "B00CMQTUSS", "context": "Seeing as you can use this for PC now, how is the Xbox One controller vs the 360 controller?", "response": "A massive upgrade ergonomically. The buttons feel more mechanical and precise and the joysticks have a really nice texture to the top of them. The triggers are a little bigger and the battery pack no longer sticks out of the controller, everything is internal. Honestly a complete upgrade."}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "You do not need DVD in the drive to play the games once it is loaded onto your hard drive."}
{"product_id": "B00ICWO0ZE", "context": "Can you use a gun to play the game?", "response": "Yes you can I haven't tried yet but it says its compatable"}
{"product_id": "B004X56PWK", "context": "Does this game have multiplayer mode", "response": "No this game does not have a multiplayer mode, although I wish it would, like sonic adventure 2 battle"}
{"product_id": "B001MGNWDI", "context": "Does the joystick work with IL-2 Cliffs of Dover, War Thunder or Heroes and Generals?", "response": "Works well with War Thunder, that's why I got it."}
{"product_id": "B00BDS415I", "context": "Will this work on the Wii U?", "response": "Couldn't say.  I don't have one.  Probably will though since it works fine on my computer, as well as the PS3."}
{"product_id": "B00E3667XQ", "context": "Which are the best native games available for the Shield?", "response": "Half life 2 and portal"}
{"product_id": "B0083H4NG4", "context": "Does this mouse have \"free-scrolling\" capabilities like some of the Logitech line?", "response": "No it doesn't , but it is a great mouse for gaming"}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "Not the way I have it set up.... I just turn the volume from my tv all the way down, otherwise you can hear both..."}
{"product_id": "B0002XJBGE", "context": "does anyone know another controller similar to this that is compatible with mac and usb ?", "response": "This controller does work on Mac through USB. I have a 2006 MacBook and this controller works great. The wireless receiver plugs into your USB port. The Mac recognized the controller automatically and that was that!"}
{"product_id": "B003ZMF26W", "context": "I have 6.5 inch hands, and I like to use a fingertip grip. Would this mouse suit me?", "response": "Sounds like you have roughly the same size hands as myself. I think you could comfortably use this mouse. It is slightly bigger than a standard mouse, and a decent bit bigger than most wireless mice. My favorite thing about this mouse is how comfortably it sits in hour hand after using for several hours."}
{"product_id": "B00000K4MC", "context": "Will this game work on a windows 7 laptop?", "response": "It does for me. I have it on my win7 Toshiba and my son is running it on a brand new win8 dell."}
{"product_id": "B0053B5RGI", "context": "Can you enjoy this game by yourself, or do you have to be in connectivity mode and do multiplayer?", "response": "You can play it by yourself"}
{"product_id": "B00EZKNT18", "context": "anyone know what size LEDs are in this remote i kinda wanna play with mine and mod it up a bit", "response": "In mine it had 3mm Blue led likely 3.3-5v to find an exact voltage you would need to use a multi meter and check the voltage you could use 3mm or 5mm they have the same base wire size..."}
{"product_id": "B002VBWIP6", "context": "if I buy 2 of these, and entered both codes, do I get a 2 years subscription ? or do I have to store the other code until the first one expires?", "response": "They are stack-able...you can input them both to get a 2 yr subscription."}
{"product_id": "B00ATF5YZM", "context": "Can this be bought/installed/played on a UK Steam account, want to know before purchace?", "response": "I used a steam account to download, but I'm in the USA. Pretty sure it's ok for UK users."}
{"product_id": "B0010WS20W", "context": "Will it play correctly on an Alienware 64 bit operating system?", "response": "I don't know. Ask the developer. He is very approachable. I use it with a Win 7 machine and it is flawless. Highly recommended."}
{"product_id": "B00HGAWFJG", "context": "How high is the ps4 with stand attached (exact figure please)?", "response": "The stand adds about a half inch to the ps4's height. Approximately 11.25 inches. You should have been taught that measurement is never exact."}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "One cable is for charging both the keyboard and mouse, the other should be and extension cable for the dongle."}
{"product_id": "B002BRZ9G0", "context": "Myself and one other person I know purchased this game when it was first released. Now when we load it in Wii it won't work, says it's not readable(both games, no damage to them) ??", "response": "I purchased this game along with another for my son and we have had no problems whatsoever with either one."}
{"product_id": "B005M2KSLC", "context": "Can I use this on a black wooden table without a mousepad? I despise mousepads very much", "response": "Yes, you can. But if you want performance, i suggest you buy the steelseries qck pad"}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "Yes, I have the same question.  Does any body know if it will work with Windows 7?"}
{"product_id": "B004N3FGHC", "context": "can you use a rechargable docking station with this remote?", "response": "not absolutely sure on that."}
{"product_id": "B00G6YJ60E", "context": "can  you use your xbox controller???", "response": "Yes you definitely can, but I highly recommend keyboard and mouse for horror games. But yeah it has full controller support."}
{"product_id": "B00A2WP4UC", "context": "can you use this system to watch netflix and/or amazon instant videos?...Is there internet accessibility with this particular system?", "response": "Yes to netflix,and Internet not sure about Amazon"}
{"product_id": "B00DE2W4PK", "context": "is this American  version  ? or Europe or middle east ? and this is 500GB ?", "response": "This is the American version and is the 500GB model."}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "No; there is no key or slider specifically for volume control."}
{"product_id": "B00GPH7Y8S", "context": "Do each of these games have single player options? I ask because IE 5 is required to play each of them?", "response": "It's been a long time since I played the game, But, I think there's a single option. \" My opinion the game is too buggy, and the sound affects were awful (e.g. When something blows up )\""}
{"product_id": "B006NU6HAS", "context": "Does this include the 800/900 and the 600/700 or just the 800/900 ?", "response": "Hi Cameron, the 800/900 is the base package. The 600/700 is the add-on for the base package and is purchased separately. However, if you have FS2004 all 4 series are included!"}
{"product_id": "B0097CUREG", "context": "why cant i play this game on kindle ? Is there someway that i could ?", "response": "this game is only compatible with  Windows 7 / Vista / XP.  Kindle uses a different operating system."}
{"product_id": "B00IAVDPSA", "context": "Do the up and down arrows to the right of the volume change the channel?", "response": "Yes. Life is better. Promise"}
