{"product_id": "B00BXONG7G", "context": "Played BF3 all the time, and never picked up BF4.  What's the best deal to get 'everything'?  Looks like $49 + $49 - looking for a better deal", "response": "Premium technically not worth it if you won't be playing for more than 12 hours a week I just got the standard and have plenty of fun, not many servers lock in on DLC maps so still a nice selection of servers"}
{"product_id": "B0038PBF1W", "context": "will it download on window vista", "response": "It works with Vista, but its a Disc not a down load"}
{"product_id": "B002P35JMO", "context": "Does this adapter plug into the controller or the actual Xbox 360? The port in the photo looks different then the port on our wireless controller?", "response": "This adapter plugs into the 360 port. And works for any headset with the red and white audio cables. You however can only use the HDMI port for connecting the Xbox to the tv."}
{"product_id": "B0038MVFYC", "context": "I want to know if this is the original ds game that came out in 2010?", "response": "There hasn't be another one made, so I would say so"}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "\"TRITTON Kama Stereo Headset for PlayStation 4\" ummm yes to question 1 ...and Yes to question 2. :3"}
{"product_id": "B0088MVQIM", "context": "Could one plug in an electric cello or violin and learn them or is it just strictly for the bass and guitar?", "response": "No has to be rock band. Cd"}
{"product_id": "B00009WAUO", "context": "Does it come with the bonus level card?", "response": "all sellers are different so they might or might not; look at the description. mine didn't so probably not"}
{"product_id": "B006IOAHPK", "context": "Any different if i buy a used or new one?", "response": "I buy used games a lot. Just try to buy one that says it is in good shape.  One thing too is, when you buy a used game, if there were any codes enclosed for DLC they will probably be no good anymore though."}
{"product_id": "B001IYR53W", "context": "Will it work on Windows 7?", "response": "how many GHz's required for this version with window 7"}
{"product_id": "B004SJFJUA", "context": "Does it work with 2ds", "response": "Im not sure that it would since this is an after market product of the 3DS. Maybe check other sites."}
{"product_id": "B00886XQO0", "context": "This or turtle beach xp510 ? Is there differences between these two headsets?", "response": "They are basically the same thing,  one is just branded Call of Duty.   The Ear Force Tangos can be found cheaper.   I bought a refurbished set and absolutely love them."}
{"product_id": "B0094X28J0", "context": "do you need a nunchuc", "response": "Yup, what Lastylemaven said. Most games have functionality for remote only players, but many also have added functionality to use with the nunchuck. Mario Kart 8, for instance, can be played by steering with the remote in a horizontal position, or you can hook up a nunchuck and use the analog stick to steer."}
{"product_id": "B00GD962OA", "context": "Can you play movies on the wii u console?", "response": "What about Amazon streaming service? Is it available on the Wii U console?"}
{"product_id": "B0006PJAZU", "context": "How do you activate the Word Perfect Suite 8 ob a Windows XP computer?", "response": "If you did a proper install, bring it up on the programs list. Otherwise, put the CD in a drive, click on the drive to start install."}
{"product_id": "B00CPS59CE", "context": "is there a warranty on these? and also how do i know if these are authentic headsets?", "response": "Refurbished products carry a 90 day warranty. These are authentic headphones that have been refurbished."}
{"product_id": "B00FKV8AK6", "context": "Why s it rated m", "response": "It has a couple of words that some people may consider swearing. Blood and shooting. Normally you kill aliens but in multiplayer you kill other humans. Call of Duty is also M but Halo 4 is not even close to be as \"mature\" as Call of Duty\"."}
{"product_id": "B00DBCAT3W", "context": "Is Fable Anniversary like the original Fable or is it more like Fable: The Lost Chapters?", "response": "It's a direct port of The Lost Chapters version of the game, only with updated visuals and sound + tweaked controls."}
{"product_id": "B00A1Y2STQ", "context": "I'm an idiot for asking this but, is this wired or wireless? I can't find out if it is or isn't!", "response": "It has one wire that plugs into the USB port of your computer."}
{"product_id": "B0041G5SD8", "context": "will Empire and Napoleon Total War Collection - Game of the Year (PC DVD) [UK work in the us ?", "response": "Yes it will. I have a 2010 model laptop with Windows 7, and the game runs just fine in the US. Actually, it works better than the original individual games (I got this one for the expansion features)."}
{"product_id": "B00DH1KRQQ", "context": "Does it work for windows 8?", "response": "i have W7.. but i think it will work... its plug and play you just have to configure it in your emulator..."}
{"product_id": "B009UCGVZC", "context": "Could giants and original characters  and swap force work on the trap team portal", "response": "I only bought them as a collectors item."}
{"product_id": "B0050SXKU4", "context": "Will it work on a ps3 from France?", "response": "It works for all PS3s in the world no matter what country"}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yes the balance board is the same for the Wii U and the Wii"}
{"product_id": "B004RMK57U", "context": "I´m from Vzla, to activate the code in my ps4 I will need an american credit card code to use it?My PSN account is american, I have not US credit card", "response": "No need a credit card. If your PSN account is USA address its fine."}
{"product_id": "B008KE95UO", "context": "is this item region free", "response": "Ntsc version only and not listed as region free compatible."}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "No, it's one single code that gets activated on both consoles"}
{"product_id": "B00BMFIXEW", "context": "can i play with the wii plus control like a sword?? i mean if i have to move  like if i were figthing??", "response": "No, it only uses the wii u gamepad and wii u pro controller."}
{"product_id": "B00J128FPA", "context": "So I have a square enix account on my Ps3. If I get the ps4 Version can I still use my ps3 account and characters? Or do have to start over?", "response": "When you activate the game it will allow you to add ps4 to your existing account."}
{"product_id": "B00006C2HA", "context": "what is difference doom 3 for 39.99 / doom 3 bfg edition for 15.99 ??????", "response": "See my review For more info Stephen. Thanks Much."}
{"product_id": "B0000C7GHG", "context": "does it come with memory card?", "response": "nope...had to buy it seperately...it didnt even come with cords had to buy those seperately as well"}
{"product_id": "B00A9HA52W", "context": "Anyone have any problems with the buttons failing to register? I had a controller where the left click took a 2 second hold to work.", "response": "Yes, I had many problems with the controller. I returned it for a refund."}
{"product_id": "B00005NIMA", "context": "Just bought a used Sidewinder Precision 2 joystick to work with my old Combat Flight Simulator but, though it loaded, it doesn't work. Any thoughts?", "response": "go to google type in search for Sidewinder Precision 2 drives there is newer one than what came with your joy stick if that don't work go to Microsoft web site and download the last driver that they have. hope that works for you"}
{"product_id": "B00C7103DO", "context": "Have they patched out the bugs that a lot of people were experiencing?", "response": "I still had one, where I would glide through a certain area on the map, and the game would slow down dramatically, and it would start skipping.  I either waited it out, left the area, or restarted from my last save.  I can't remember which, but that's the only one I had."}
{"product_id": "B005EOOT90", "context": "if u buy the headset do u need to get an adapter or something im not sure", "response": "Depends on which console or tv your using.. Give me more info on what your using to see what you need"}
{"product_id": "B00EIM3BV6", "context": "Are these updated to the latest firmware before being shipped?", "response": "Yes they are.... I was going to and noticed it was current"}
{"product_id": "B00BT9B2LC", "context": "Is the Japanese 3DS compatible with an American 3DS charger?", "response": "Yes. There the same."}
{"product_id": "B00BI9MDSO", "context": "How many game cards can this case hold?", "response": "it will hold 4 cards,sorry for the late response it is a great case highly recammended"}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "yes, we don't have any problems at all with it.. we've enjoyed the game very much.."}
{"product_id": "B0086UK7IQ", "context": "Is it good for shooters? I really like it, but im not a big mmorpg player. So, is it good for shooters?", "response": "It helps. Being able to switch weapons in a bind and using the g shift button to temporarily lower the sensitivity when sniping and instantly go back to normal sensitivity is nice. This is the best mouse I've ever used. Feels great works great and will last for a long time."}
{"product_id": "B00166N6SA", "context": "How large is the case itself that it comes in?", "response": "The size of a standard CD case"}
{"product_id": "B00D3RBZHY", "context": "Direction of car can be controlled by motion of joy stick ??", "response": "Do you mean the controller? No it is not controlled by the motion of your hands, and I could not find a setting for it. Controls are easy to use with the analog joystick/moveable pad on the controller yes."}
{"product_id": "B000TKH6H6", "context": "does it play on mac osx10.6.8?", "response": "Can't help, I'm a Windows user."}
{"product_id": "B00BBUCCKO", "context": "Do the keys stay lit continuously?  Or can they be made to?", "response": "There is a cog looking button (sun to everyone else i suppose ha) that you press once for a low light setting and the second for full illumination.  It works wonderfully and stays lit until you're inactive a certain amount of time -- though I've never turning off prematurely."}
{"product_id": "B001EIA2LY", "context": "r there any upgrades in the last 15 yrs ?", "response": "yes. Last upgrade by Microsoft special group was 2009."}
{"product_id": "B009RXUOD4", "context": "how long is the wire?", "response": "About 15 20 feet"}
{"product_id": "B007OVHW90", "context": "Does it work with the turtle beach X32s?", "response": "Yes, this is the same type of chat cable that comes included with the X32."}
{"product_id": "B000H67DDY", "context": "Do the Rudder pedals control nose wheel steering?", "response": "Yes the certainly do, just like in the full size (light aircraft) the rudder pedals control both the nose wheel steering and the rudder on the vertical finThey also control the brakes - good for differential braking."}
{"product_id": "B00FOHP8XI", "context": "Is this PS3 Console only a vertical stand or can it be horizontal stand?", "response": "Yeah, mine is sitting flat right now, opposite of how it's pictured in the ad"}
{"product_id": "B008SBZF4Y", "context": "Do the graphics differ depending on different consoles?", "response": "Hello!  I believe so; however, we only played with these on Wii so cannot determine for sure.  The Xbox console is known to have a better graphics processor, so this is likely."}
{"product_id": "B00DC7G0GG", "context": "Can you play the campaign with two players? Or is it just one..?", "response": "You can play the campaign with up to four players"}
{"product_id": "B001KMRN0M", "context": "Does this come with a memory stick?", "response": "No, you have to buy a budle for a memory stick ,or go to Walmart or Gamestop"}
{"product_id": "B009SJR278", "context": "Razer Kraken PRO Over Ear PC and Music Headset - Green. with this model can a computer use the microphone if you plug just it into a headphone jack?", "response": "You get a splitter for mic and sound"}
{"product_id": "B002VBWIP6", "context": "We are buying 1 XBox console & we have 2 sons. Do we have to buy 2 Live memberships for them to both play online or can we just buy 1??", "response": "It depends on which XBox you are buying. If you are buying a 360, then yes, you need to buy 2 Live Gold memberships for them. If you are buying an XBox One, then up to five people can share one XBox Live Gold account."}
{"product_id": "B004XGN8W4", "context": "will the white xbox 360 fit?", "response": "yeah xbox 360 is compatible with this !"}
{"product_id": "B00GY4OAM0", "context": "is there free roam", "response": "The main \"hub\" is free roam and it's huge!  Tons of side quests to do."}
{"product_id": "B00EOPT5ZS", "context": "Is it possible to bind the Windows Volume control to this? One YouTube review said it cannot be done.", "response": "I think it is possible. One switch to increase and one to decrease volume. However, figuring out which keys to bind may be tricky."}
{"product_id": "B00BI9MDSO", "context": "How many game cards can this case hold?", "response": "3 game cards and 1 memory card :) It's a great case!"}
{"product_id": "B00C2B355W", "context": "does this headset work with xbox one", "response": "The box says it does. I think you need the chat cable. The cable that will plug into the headset then into the controller. I use this headset with my ps4 and it's completely wireless."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "Yes you can! It works for me"}
{"product_id": "B007FTE2VW", "context": "Do you have to install with origin", "response": "Yes, unfortunately. I bought the DVD version, and I still had to install Origin to activate it since it originally required Origin to be logged in and on line to play it at all! When you open the game, it'll load Origin first, then your game. Same way on my Macintosh."}
{"product_id": "B008HPAXZ2", "context": "Does this help with glare at all? Looking for a screen protector that will allow me to play it outside.", "response": "Not really, No, however you can find anti-glare screen protectors that u can cut down to the same size as the DS screen"}
{"product_id": "B00H72EMP8", "context": "Does anyone knows if it works with WiiU, nintendo 3ds,and PC? It's because I've seen one of this model Kunai(advertise of the company)saying that.", "response": "Ya I'm pretty sure it does just remember if u buy this make sure it's for someone with little ears lol"}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "Hi Clay, the XB1 controller is not currently compatible with PC. You can use an XBox 360 controller for Windows."}
{"product_id": "B000H67DDY", "context": "i want to know real weight (without case).Thank`s", "response": "I am not near my pedals so I can't weigh them for you, but I would guess around 3kg. They do not stay steady on the floor due to their weight, you have to fix a board behind them to stop them sliding away."}
{"product_id": "B000GP8448", "context": "Is it compatible with Windows 7 ?", "response": "It is compatible with windows 7."}
{"product_id": "B0098F1Y3K", "context": "will this game run on Nintendo DS XL?", "response": "of course3ds and 3ds xl are basically the same console.."}
{"product_id": "B000035Y6D", "context": "I WOULD LIKE TO KNOW THIS NITENDO COME WITH 2 Controllers ??", "response": "The system that I ordered came with two controllers and a free game, but usually these type of systems only come with one, it just depends which one you order, and it also depends on the condition of the system, mine came in good condition, and came with all the required plugs. Hope I was of help."}
{"product_id": "B009SJR278", "context": "i gave this to my son for Xmas and one of the sides just stopped working! There are no tears, cuts, etc. in the wires!  How do I fix?", "response": "Its most likely broken, you can either replace the headset or perhaps if you go to the company they may send you a new one since it isn't even 6months old"}
{"product_id": "B00D96BJSO", "context": "Will the headset work? Im using a monitor (HDMI-DVI) instead of a TV and I'm getting sound from pc speakers through S/PDIF rather than from a TV.", "response": "The sound you get in the headset comes directly from the AUX port on the bottom of the controller when the adapter is plugged in. (Adapter is included) there is no need for an external audio source like the prior TB's needed. Just plug it into the controller and it works."}
{"product_id": "B00886XQNQ", "context": "does it work on PC/Mac? and is this wireless?", "response": "It is wireless but do not know if it works with PC/MAC or not."}
{"product_id": "B00HG0B8NA", "context": "didn't download correctly  computer says it is not a correct win 32 product", "response": "I did download it after some trouble. The game was awful and Norton said it may have a virus. I deleted it from my computer. Just glad it was as cheap as it was."}
{"product_id": "B00GS1TYIO", "context": "Is the a Candy Bars Patch?I cannot install cd??Computer just wont open the disc????", "response": "I had no problem installing the CD.  It isn't a patch.  Could the CD not be compatible with your computer??"}
{"product_id": "B00EV7AYAO", "context": "i cannot turn the backlight on even when i press Fn+esc", "response": "Then I don't know. I own the red version. You should contact to the seller for more information. Good luck!"}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "This purchase was for my 2 grand children and I believe they have the newest X-Box."}
{"product_id": "B00CX9L30W", "context": "i have it for pc but would like to play on ps4. will on characters be on both or will i have to start new ones", "response": "You can transfer between consoles but you have to have a copy of the PS4 or PS3 game to play on the console. Otherwise its simply logging in as your other profile and all your characters will be there."}
{"product_id": "B004XGN8W4", "context": "Does it work the Xbox 360 E?", "response": "Yes ur doors that is what my kids use. And best gift ever two years and still in great working condition"}
{"product_id": "B00D6PTMHI", "context": "Can I install the PC version on multiple computers ?  I spend weekdays at my home and weekends at my girlfriends.   Will I have to buy a separate licence to run on my pc and also on hers ?", "response": "What is a steam account?"}
{"product_id": "B000HZFCT2", "context": "how many controllers work at a time", "response": "You can sync up to four to the computer just like the 360, each controller will also have difference light position light up. I've tried up to 3, only have 3 controllers.Source can also be found here, first paragraph.http://support.xbox.com/en-US/xbox-on-other-devices/connections/xbox-360-wireless-gaming-receiver-windows"}
{"product_id": "B00B98HBTA", "context": "how many players is this game", "response": "all the marvel super heros"}
{"product_id": "B003YC4D9A", "context": "does it have a usb", "response": "No. It plugs directly into the Wii remote"}
{"product_id": "B004X56PWK", "context": "Will this game work with Playstation 4?", "response": "PS4 is not backwards-compatible with PS3 disc-based games. They are planning to offer bunch of PS3 titles streaming, however, through Playstation Now."}
{"product_id": "B00B77OKNI", "context": "will this work on a 2nd generation kindle fire", "response": "Personaly id say absolutely but theres about 10% of me that says im wrong sence I dont know anything about tablets. Heres a link I think might answer your question a little better. http://www.pocket-lint.com/news/119870-green-throttle-kindle-fire-hd-consoleI hope this helps good luck in your purchase :)"}
{"product_id": "B002BXKJA0", "context": "Does it work on Windows 8.1?", "response": "Yes, but remember to ask the Steam community if it crashes often."}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "No. its only on the Wii U"}
{"product_id": "B004C4U1VI", "context": "Are new cables supposed to come in a box or just in a plastic bag? I just got them in a plastic bag and wanted to make sure they aren't used.", "response": "Mine came in a bag as well.  I believe that's how they're packaged."}
{"product_id": "B00F68LBE0", "context": "How long is the included cable?", "response": "Our wireless afterglow controller is wireless.  I am still looking for afterglow in purple. We have all the other the colors except purple."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "All platforms are cross playable. Meaning you can play with someone who is on PC, ps3, or ps4. If it's someone in particular though make sure they are on the same server as you."}
{"product_id": "B005CELN8W", "context": "So this game does not work on Windows 8, I presume?", "response": "I do not know I have windows 7"}
{"product_id": "B007TFOO6K", "context": "Per answer 3, description says blue switches & fully LED back lit. Are the keys back lit  BLUE?  THE DESCRIPTION SAYS YES", "response": "Switch color =/= backlighting color.No matter what, the color of the lights are red, but the mechanical switch that are under the keys are called blue switches. The switch type has nothing to do with the backlighting color. If you have further questions, come on over to www.reddit.com/r/mechanicalkeyboards and ask!"}
{"product_id": "B00A878J5I", "context": "Will the game pad fit in the dock station if you have a silicone cover on it and does it charge ok with it on it.", "response": "I don't have the cover but highly doubt it. It's a tight fit"}
{"product_id": "B00JF2FFR2", "context": "What type of Grip? Palm, Fingertip, or Claw?", "response": "Palm with a finger on the left and a finger on the right button (or vice-versa) but this is made to be for both left and right handed people so it is thicker than a right-handed mouse."}
{"product_id": "B00I4C2EKA", "context": "I already have CIV V on Steam. Will this install just the content I don't have (e.g. the expansion packs) or will it mess up my current game?", "response": "It will give you steam key it replaces your CiV V on steam with the complete edition. You lose your basic one but for that you get all the expansion and DLCS"}
{"product_id": "B008BGXYBM", "context": "Does this Razer Taipan have Dual Sensor (two holes, one optical, one laser in the bottom)?", "response": "After you response or concern I got out my flashlight and yes you are correct there is 2 optics one pointed forward and one point back. The one point back is much more counter sunk inside and I didn't notice. Sorry"}
{"product_id": "B00AK4QB22", "context": "Will this play on the Xbox One?", "response": "No and the game is awful."}
{"product_id": "B00DC7G0GG", "context": "is it worth 50 bucks?", "response": "I'm a pretty thrifty person myself and I would say, very seriously, that yes, yes it is. If you've ever played Super Mario Bros. 3 on Nintendo, it's basically that but in 3D. They somehow managed to finally pull it off."}
{"product_id": "B00DC7G2W8", "context": "Is the Mario Kart 8 Wii U bundle not being sold by Amazon?", "response": "Amazon doesn't directly sell any Wii U consoles.  It's all third party sellers.  The bundle may show up at some point, but it won't be direct from Amazon in all likelihood."}
{"product_id": "B007Y7OP8K", "context": "What format is the game in? Is it for PC?", "response": "yes it is...just insert disc and install as per any game"}
{"product_id": "B00D96BJSO", "context": "Does this headset have mic monitoring?", "response": "I believe it does.  My grandson was talking with someone while using it."}
{"product_id": "B00ECOBFA4", "context": "What is the age range on this? Would it be appropriate for a 6 yr old?", "response": "Absolutely!  Six is perfect age for it"}
{"product_id": "B00GGUMV46", "context": "What is a Season Pass?", "response": "its all of the dlc's for the game Last of Us ...except for like some hats"}
{"product_id": "B00GV0LR64", "context": "whats the difference b/w this and me using a red dry erase marker?", "response": "There's no difference except the hip shot red dot is a lot more easily to see. I did the same thing til I got my hip shot."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "Nooo not at all."}
{"product_id": "B009Q8PP16", "context": "does it work with bo2", "response": "It kind it does work would be old to buy a lags a lot and some of the features really don't work all that well it's kind of expensive control for what it does a good will be done better"}
{"product_id": "B002NILRUY", "context": "I wonder if the black one is just like the pink one ?", "response": "I saw them both in my local target actually as I'm looking for a third one and it looked the same to me.  It also comes in blue. They sell it in the store at target for 19.99"}
{"product_id": "B002I0J51U", "context": "Does this come with the charger, or do I need to buy one seperately?", "response": "Ours does not have a cable but you can use any ps3 charge cable from your other controllers.  We have changed our listing to include the camera in the bundle kit."}
{"product_id": "B00JFCA6V2", "context": "dose it come with the charger", "response": "Yes it does! And the start up guide and a manual. Everything originally in the box"}
{"product_id": "B00CJ7IUI6", "context": "Is there any nudity in this game ? (this is the only problem I have against getting the game) please reply-thank you", "response": "It is a PG13 game in that since."}
{"product_id": "B0053B5RGI", "context": "Hi. We're new to Pokemon. Just bought my daughter a 3DS. Would Pokemon X be a good game to learn about the game for a beginner? Any recommendations?", "response": "I think so!! I have been playing since I was little! It is a very linear game and easy to follow. It is a lot of fun"}
{"product_id": "B002HH9TUG", "context": "what sort of battery does this thing use? can u use AA/aaa rechargeables and get good hours on it?", "response": "This use 2 AAA batteries, yes you can use rechargeables ones to save money."}
{"product_id": "B00B98HF1O", "context": "can 3 people play this game together", "response": "No. It only allows up to 2 players at a time."}
{"product_id": "B008XHCLFO", "context": "Can the top part be taken off? I simply want the grips not the whole protection part (though that isn't bad, but i think it's ugly)", "response": "Yes it's just two separate pieces that slip on the bottom and top."}
{"product_id": "B00CX7FQ4I", "context": "The game is dubbed and subtitled in Portuguese ?. It's what I want to send my son in Brazil", "response": "It's dubbed in English and Spanish which makes no sense, but this game is bad anyway. I hope that THQ makes the next one and hopefully it's in English and Portuguese since those are the dominant fighters languages."}
{"product_id": "B00F9RGFEY", "context": "How long does it take to fully charge, and how long can you use it until it dies?", "response": "Takes an hour to charge . Lasts about 5 -10 hours once charged"}
{"product_id": "B00A9HA52W", "context": "Does the USB port also charge the controller so you can play without batteries?", "response": "No, the USB port is just to program the controller using a PC."}
{"product_id": "B001AI7CF2", "context": "Is there any lag input?", "response": "Haven't noticed any.  Been using it a lot lately.  If I sit up on the couch, one reaches fine, no lag.  Every now and then, I connect two to the remote and there doesn't seem to be a difference, still no lag."}
{"product_id": "B00F27JN8Q", "context": "How do psp games look on the big screen?", "response": "Depending on the resolution of your TV, PSP games do look a bit more pixelated. However, it's not too terrible that you would turn the game off. Essentially, it's like if you plugged a PSOne into an HDTV."}
{"product_id": "B008M4BNQG", "context": "My PS3 is connected to my stereo by HDMI so how do I hook the headset up?  What do I do with the red/white connections, once the usb is plugged in?", "response": "if you still have the original ps3 tv plug in wich is red white and yellow your supposed to connect those together.  These cables are only to control the volume of the headset. So you should be good without them."}
{"product_id": "B006NU6HAS", "context": "Are you able to get the update to the steam edition with the box version of the PMDG?", "response": "I would imagine there will be a patch on the PMDG support webpage that will address this, http://forum.avsim.net/page/index.html/_/pri-news/pmdg-products-in-fsx-se-r2710. However,  I haven't used this piece of software in over two years, so I really do not know."}
{"product_id": "B00AK4QB22", "context": "Do I have to have X Box live for this game?", "response": "No, but it really improves the experience"}
{"product_id": "B00H72EMP8", "context": "is this PS3 friendly", "response": "Yes it is, I have both a PS3 and PS4 and it works perfectly with them. With the 3 you must attach the adaptor cable though but with the 4 you can plug it straight into the controller. Hope this helps!"}
{"product_id": "B00EPZ8POY", "context": "does this game works with any ps3 console(usa)?", "response": "i dont know...i bought ps3 ultra slim and this game works well"}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "Hi Emanuele this set came in a compact cardboard folder with 3 discs. Having all 3 was games was a handy way to finish the series and cheaper than buying separately."}
{"product_id": "B0032MO77U", "context": "will it work on 64 bit cpu systems with windows 7?", "response": "It might. I do not no for sure. Try it and let me know."}
{"product_id": "B0050SYILE", "context": "Would you let a MATURE 13 year old boy play this game?", "response": "Yes, I would most of the generation of children nowadays are used to rated M which is not entirely a bad thing"}
{"product_id": "B002I0J5CO", "context": "Will this work for MacBook Pro (2014)?", "response": "As far as I know they were made for pc so they should work as long as a usb port is available and head phone capable."}
{"product_id": "B004L6C6BK", "context": "Will this work with my astros A-50??", "response": "As long as it has mini-stereo jacks it will"}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "Did an install through Origin this week with RA2 and RA2:YR and both run on Win 8.1 with no tweaking needed."}
{"product_id": "B0017HLYNC", "context": "does it work on windows 8?", "response": "Together with the Myst series, this is my all-time favorite game. I have played this game on XP, Vista and then I downloaded the game on windows 7 and it worked great. I don't have a win 8, however I believe Microsoft uses similar technology to allow backward program compatibility.  If you like this genre, try Tunguska."}
{"product_id": "B008SBZD9G", "context": "Can I use a Xbox 360 game controller for the PC version?", "response": "I'm sure you could, but why would you want to use a controller when playing on a PC."}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "I never touch the multiplayer so I wouldn't know. To the best of my knowledge this is only a single player campaign game with multiplayer being online. No co op multiplayer on one screen."}
{"product_id": "B00BY0G0YU", "context": "What's the difference between the Standard edition, the Special edition, and the Collector's edition? I have an American PS3 and I'm trying to decide", "response": "It really doesnt matter which copy you get because with limited edition all you get is really nice 24 page art book. But overall there is really no significant difference in the game. You can get either one but at the time limited edition was pricier than standard."}
{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel click into place as you scroll, or does it roll too smoothly?", "response": "It does not click, but the wheel has enough resistance that it doesn't move around too wildly."}
{"product_id": "B00CJD4HD2", "context": "Any weight balance issue? The G500 had a \"floating center weight\" that shifts and tug the mouse as you glide it, does the G500s suffers this? Thanks.", "response": "I dont notice anything like that. The mouse uses a cartridge of weights to adjust the weight. I don't use any of them, as the mouse is fairly heavy compared to my last mouse."}
{"product_id": "B00EV4O7B4", "context": "is this include Pokemon x y", "response": "Unfortunately, No Its Just The System"}
{"product_id": "B003JETPHS", "context": "Does this work with ps3?", "response": "I don't see why it wouldn't?  but im not 100% sure.  sorry."}
{"product_id": "B00D6PTMB4", "context": "Is this a single player only game, or can two people plug in and play together?", "response": "2 player local. You need 2 cables though, remember that."}
{"product_id": "B00009TW6R", "context": "Can you play using a game controller, or is it keyboard/mouse only?", "response": "You can use 3rd party software and map a controller for it."}
{"product_id": "B008YA9BVC", "context": "With regular headphones and some games and will continue playing sound through the TV unless I have it on gamepad mode. Does this headset fix it?", "response": "That option is part of the wii u. do there is nothing to fix."}
{"product_id": "B006KYYOSO", "context": "Do you need the code to play multiplayer online?", "response": "Yes but you download characters are free"}
{"product_id": "B00C710AT6", "context": "Can you play it on windows 8 a gateway computer", "response": "Yes u can play it on any windows OS"}
{"product_id": "B003O6CB6S", "context": "Do you have to install steam?", "response": "I installed Steam but not sure if it is absolutely necessary. I believe it is if you wish to game with others on the net."}
{"product_id": "B003RS1A7Y", "context": "Is it compatible with Guitar Hero: Metallica and GH 5?", "response": "No.  I haven't tried it, but according to everything I've read, pro-guitar controllers (not just this one) are only compatible with Rock Band 3.  They don't even work with older versions of Rock Band."}
{"product_id": "B00BFOEY3Y", "context": "can this be used on a mac?", "response": "This is from the Logitech website saying it's compatible: http://blog.logitech.com/2013/04/19/logitech-g-products-now-support-mac-os/"}
{"product_id": "B0050SYX8W", "context": "Can I play in online mode, if I buy a pre-owned game?", "response": "As long as you pay your monthly subscription to Xbox live you can play online."}
{"product_id": "B0009SUW4W", "context": "will this work on windows 2007", "response": "I am using Windows 7 and it works fine for me"}
{"product_id": "B0087N222Q", "context": "How do i plug this pair of headphones To the ps3 so y can speak With my friends(black OPS 2)?", "response": "http://youtu.be/PEd5iQlwimc, this shows how to set it up."}
{"product_id": "B004QRKWLA", "context": "How long is the cord?", "response": "The official length, according to Microsoft, is 9 feet.  See: http://www.xbox.com/en-US/xbox360/accessories/controllers/xbox360controllerBut mine is actually 10 feet, but that include the USB break-away dongle that is on the end.  The dongle itself adds 1 foot."}
{"product_id": "B00HPU96FI", "context": "So this came in the mail yesterday, and I'm not getting any picture. I have an audio splitter and I can hear some sound. Any idea why?", "response": "Make sure connection in the back of the dreamcast is in all the way. I had the same issue. I disconnected it and rreconnected and then it worked great ever since."}
{"product_id": "B009DL2TBA", "context": "Is compatible with move?", "response": "Yes and the playstation move is seperated by the PS3 500gb"}
{"product_id": "B006LVZEN0", "context": "Does it light up at all?", "response": "only the dpi indicator, the mode changing button and the front of the main mouse buttons light up,but there is a gap infron of the buttons, so when the mouse is resting, it looks like a cross of light is projected infront of the mouse on whatever the mouse is resting on"}
{"product_id": "B00F8W9SWQ", "context": "Is this wireless or wired?", "response": "This keyboard is wired."}
{"product_id": "B00IVHQ0KI", "context": "Do the paddle shifters actually work?", "response": "yes, the paddle shifters works well in Forza 5"}
{"product_id": "B0018YXM3Y", "context": "Does this game work on windows 7 ?", "response": "Yes ot dose work with windows 7 .. Just small recommendation also try company of heroes 2 amazing game"}
{"product_id": "B00DT55P94", "context": "does it support trophies?", "response": "Yes most of these games support trophies.Devil May Cry is the only game in this collection that does not support trophies.The rest of the games Super Street Fighter 4, Resident Evil 6, Dead Rising 2 and MegaMan 10 all support trophies"}
{"product_id": "B000PS1TG6", "context": "does anyone know if i buy this if i can use it for ps3 guitar hero game or rockband games with a guitar from the ps2", "response": "No, it doesn't. My brother bought one to use for guitar hero and it didn't work."}
{"product_id": "B001Q55D5K", "context": "will it work with windows 7?", "response": "I have no problems running GAR on Win 7 64 bit, but several problems with Win 7."}
{"product_id": "B007TMFD7C", "context": "hi. i have macbook air 2012. can i play this game well on my macbook?", "response": "that depends if the x-plane 10 you have can work on both pc & macbook . cause if that is the case then maybe the game will work on your macbook hopefully ."}
{"product_id": "B00562O8U0", "context": "would they work with the sony VPL-HW40ES", "response": "Yes -- I have that projector, and I'm using Playstation3 3D glasses with them."}
{"product_id": "B008CP6Q6M", "context": "Are DLC Vouchers still valid as of 5/13/2015 | May 5, 2015?", "response": "Hi Don,      I'm afraid the DLC vouchers have already been used."}
{"product_id": "B001GIUWX0", "context": "i have a wii system does this game work with both wii and nintendo systems", "response": "This game is for the Wii, and it can be played on the Wii U, but not other Nintendo systems such as the DS, 3DS, etc."}
{"product_id": "B00EWEHI5K", "context": "Does this mouse come with Australia power plug", "response": "You dont need a plug for it, it only needs an USB port"}
{"product_id": "B00BT9B2LC", "context": "is the LL have the same size of game cards as Xl?", "response": "They are the same size but ll only be able to run japan version games"}
{"product_id": "B009RXUNZI", "context": "When you \"stash\" the mic, does it mute? I would like this to act like PTT during games.", "response": "My Mic doesn't work at all, I don't know if you stash it if it'll mute."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "it does use AA batteries, however if you would like to purchase rechargeable battery pack, which I'm sure the other reviewer was alluding to, you can do so as well. the bottom line is that out of the box this remote uses AA batteries."}
{"product_id": "B000K9Q5NW", "context": "Do you have to use two feet to gas/brake because there's a post going down the middle?", "response": "Not really, depends on which wheel you have. I have the Thrustmaster T500 with clutch and all; it works fine 1 or 2 feet. :D"}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "the pro is for american devices"}
{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel click into place as you scroll, or does it roll too smoothly?", "response": "It clicks into place, but very smoothly"}
{"product_id": "B000B6MLSM", "context": "Does this remote work with Xbox Live? I need it to work with NetFlix that I'm streaming through my Xbox.", "response": "Yes, it works on the Netflix ap on the X-box 360."}
{"product_id": "B000TLU67W", "context": "Does this PS2 have a HDMI output or is it just AV cables?", "response": "The PS2 don't support HDMI but you can use a Component A/V Cable. Most modern Tv's still have a video components input. Search Amazon for \"playstation video component cable\" FYI PS3 and PS2 component cables are identical."}
{"product_id": "B002I0GF72", "context": "Does this game come with the gold foil cover or was that only upon release or preorder?", "response": "No the one I received came in regular plastic wrap like all other new Wii U games."}
{"product_id": "B009LGO88E", "context": "I have the Newest 3DS XL with the new tiny right joystick that seems useless at its size. Will this device work as a supplement for that?", "response": "No it will not, it will not go over the r2 and l2 buttons.  It is for the original 3ds xl"}
{"product_id": "B000SOYG8U", "context": "I place the game in my DVD RW drive and it doesnt run at all even when i go into my computer and start it that way no luck any answers guys?", "response": "Don't have a real answer for you. You can try to ask people on forums. I never had that issue before so I don't have an answer for you. sorry."}
{"product_id": "B009DYCTY4", "context": "What is the model of this console? Does this still have the original firmware version?", "response": "Yes It has the original firmware, But when you connect the console for the first time, begins to be updated"}
{"product_id": "B00ESN8YGW", "context": "Where do I enter the code it gives me?", "response": "You need to dowlnoad a steam client and once you start it, there should be \"Add a game\" option (bottom left corner of steam client). Chose \"Activate a product on steam\" and copy paste your key to Product code tab."}
{"product_id": "B00009W5WB", "context": "Judging by the picture the connector is the same connector for the wired Xbox 360 controller, so can I use my 360 controller for the OG Xbox?", "response": "Not the same I got it for my regular x box not 360"}
{"product_id": "B0044DJZ0A", "context": "Ok, thanks for response, I want to buy the Shift Keyboard in order to put my Starcraft Key set. Do you sell this Shift Keyboard? New or Used? thanks.", "response": "Used with some scratches on the bottom right. Awesome for Starcraft 2 I have wings of liberty set brand new in box and a used one only used twice. Macros work great too!"}
{"product_id": "B00005NIMB", "context": "Does it come with a power chord?", "response": "Yes it does come with Power Cable which attaches to the Stick itself."}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "Yes, it does, but I haven't played it, so I don't know anything about it."}
{"product_id": "B00DNHLFQA", "context": "do you have to make some stupid online account to play this game", "response": "EA Origin account required"}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "Si, acelerador y frenos"}
{"product_id": "B00965WK8K", "context": "Is the scroll wheel smooth or regular (tiny or normal rotation for each scroll increment)?", "response": "Based on your definition I would call it \"regular\". The increments between scroll sections are distinct and well felt."}
{"product_id": "B004HYK8Y8", "context": "is this game a mmorpg", "response": "No it is not an online game and only single player but very very addicting, if you wanted to play with a friend I suggest each create a character and when the player dies its the other persons turn lol my version of multi player I guess"}
{"product_id": "B00ERDGMT4", "context": "What is included with the game disc? Does it come with a map of Pandora?", "response": "There's no paper map included."}
{"product_id": "B008KH7NZA", "context": "Does this require a wire to the ps4 controller for chat to work?", "response": "Yes it is not a wireless headset."}
{"product_id": "B00HWMP0TU", "context": "I understand that I need an internet connection to download the game. Can I play the game offline once downloaded on my computer?", "response": "Yes, it only need to download the game itself and you can play whenever you want."}
{"product_id": "B0038PBF1W", "context": "is this just a simulator or does it have arcade play options", "response": "During setup the user has the option of selecting arcade play options..."}
{"product_id": "B00CTKHXFO", "context": "I thought that older games, such as MGS2, were not backward compatible with the PS3. Will ALL these games work on the PS3 Super Slim?", "response": "It is made to be used for ps3"}
{"product_id": "B003O6CB6S", "context": "will the game play on windows 8.1 64bit", "response": "Yes, but from what I've read online a lot of people are crashing whenever they attempt to play multiplayer. But please, save your money on this one...it's not worth the risk. Whenever Advanced Warfare drops the amount of players will be so low that it'll take hours just to find a match."}
