{"product_id": "B00GHTP7SS", "context": "do i need game controller to play or can i use a keyboard", "response": "It's possible to play with the keyboard, but the controls will be smoother with a controller."}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "The one end is NOT a 3.5 mm but a professional audio jack used for your headphones or guitar."}
{"product_id": "B00CHGYUE2", "context": "Okay what is the difference between the map pack version and the regular black ops two?", "response": "You get the map pack that has a 15$ value for 5 cents more than the original version. The map pack has 4 new multiplayer maps, 1 bonus weapon, and 1 zombies map."}
{"product_id": "B000VRCNLG", "context": "will this game work on Windows 7 64bit?", "response": "Yes, it doesn't work on windows 8/8.1 so of course it works with windows 7! :D"}
{"product_id": "B008GEH9HO", "context": "Does This Come With A Charger?", "response": "Yes. Just watch for disclaimers stating otherwise. All that aside, you buy new, it comes with one. Happy spending!"}
{"product_id": "B009DL2TBA", "context": "how can i know this will work with a 220V power input...pliz help and be very precise", "response": "Transformers aren't needed, the PS3 has a universal PSU."}
{"product_id": "B000GCJ6MK", "context": "does fsx work on windows 8.1", "response": "I flew mine yesterday on my 8.1 ALIENWARE I love this program it's the way to fly I 'm glad I own it"}
{"product_id": "B00HGLLRV2", "context": "Hi,  is there a cooperative multi-player mode?  If so,  does it require a separate console per player?   Thanks!", "response": "It is a completely single player experience."}
{"product_id": "B0047ERZ7Q", "context": "how many megapixels.. if any...??", "response": "I cannot tell you. This is a gift that I bought for a young man who lives in Haiti and is not fluent in English. He could not possible help you either."}
{"product_id": "B001444IN6", "context": "I have a HP - 19.5\" All-In-One Computer - 4GB Memory - 500GB Hard Drive could it run fine with some expansion packs?", "response": "Yes. I have run all expansion packs on an old Compaq with 2GB Memory and it did OK; we are currently running on a Dell laptop with 3GB Memory and it does just fine.I would not expect you to have any trouble."}
{"product_id": "B001444IN6", "context": "Can Sims Deluxe be played on a Window 7 64bit PC?", "response": "yep. I have Win7 64bit and it wrks fine."}
{"product_id": "B00EFFW0HC", "context": "Does this come with the China Rising pack?", "response": "No you have to purchase it from the store online............"}
{"product_id": "B00GG4BBUM", "context": "I received this for the PS4 on Tuesday via pre-order, but there is no book in the game case.  Is this normal, or was my game just missing it?", "response": "not having a physical manual sucks...i want the manual in my lap while trying to learn the game.  ughh"}
{"product_id": "B008FHL56S", "context": "does this work with E 360 slim?", "response": "yes it does im a kid I ordered it and it works perfect"}
{"product_id": "B0017Q4DGI", "context": "I'm having trouble loading this on our WiiU console. It is not letting me get click the \"TV ONLY\" button to play the game on the big screen. Advice?", "response": "This is a Wii game. Not a wiiU game."}
{"product_id": "B008M4BNQG", "context": "How is the bass if you want to listen to music on your pc? I want it for gaming but since it can also connect to PC i was just curious.", "response": "It really isn't THAT great. Its present but I would suggest getting Z11, or X12 from Turtlebeach. They are under 10$ more and they are 1. Over the ear= more comfortable and 2. have better sound canceling and sound quality. I have tried them all. X12>Z11."}
{"product_id": "B003O6N64Y", "context": "can I connect this headset to a tv,thankyou.", "response": "Yes u can...Please type in UTUBE search (turtle beach px5 setup tutorial)"}
{"product_id": "B005M2KSLC", "context": "Is the white or black version glossy? I'd don't like the glossy mice because they tend to build up grime very easily.", "response": "I really don't know. I had the black one, it's good for world of tank, and many game online I've played."}
{"product_id": "B0017Q4DGI", "context": "Are the Wii games compatable with the Wii U??", "response": "Yes -  that's what I bought it for."}
{"product_id": "B00BDS415I", "context": "Will these work for the Xbox ONE?", "response": "Yes they will work"}
{"product_id": "B0086V5UF0", "context": "Does this game requires video controller or the Active floor Mat?", "response": "You need the Wii remote controller but not the mat."}
{"product_id": "B00ATHFLZS", "context": "Does it bring an installation cd? I bought one but the box was lost the mouse freeze and I am not able to select dpi options. Thks in advance", "response": "No disk the button does the dpi options it doesn't say anything you just kinda have to go off how it moves for you after clicking it"}
{"product_id": "B00EADTVL2", "context": "I have a charging station for PS3; will it work for PS4 controllers?", "response": "No, the USB is different.  Mini vs Micro USB."}
{"product_id": "B000FQ9R4E", "context": "I got my Wii back in 2008 or 2009 will it still work?", "response": "If your game you are thinking of purchasing works it should my game wasn't any good had to send back to amazon"}
{"product_id": "B00IPTUJ8G", "context": "Any news on how much space is needed for the RETAIL copy? I'm hoping I can /just make it/ with my 4GB card!", "response": "Retail copy only requires 10 mb unless you want to download the extra content. There are 2 large downloads the come with the voucher code but the rest are tiny. I would say total you would need at least 1.5-2 gb to get everything."}
{"product_id": "B00IAVDPSA", "context": "I'll be hooking up the Tivo through the HDMI pass through. Can this remote be programmed to control the Tivo Box as well?", "response": "No. This will not control your Tivo, it only controls Xbox One apps, games, and TV"}
{"product_id": "B00F27JE1C", "context": "Anyone else having wireless issues with this unit?  See my write up on my vita slim green/white.  I'm assuming I got a lemon but would like to hear.", "response": "Sometimes i have the same issue with mines also. I got used to it i guess and really doesnt bother me anymore"}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "Sorry, I don't think so, but I'm not really sure."}
{"product_id": "B00ESN8YGW", "context": "do i need steam to play this? what if i don't have it? can't play?", "response": "Yes,this game need steam to play!If you don't have,can't play"}
{"product_id": "B0038PBF1W", "context": "is this just a simulator or does it have arcade play options", "response": "To me, it plays like an arcade game, the missions and campaigns have to be played with unlimited ammo, and invincibility, since to \"win\" you have destroy more targets than can be considered in any way \"realistic\". To be fair, the graphics and aircraft are the best I have ever seen."}
{"product_id": "B00BCEK2LA", "context": "Does this work with Windows XP?", "response": "It will still work and Logitech still provides a download for Logitech Gaming Software for Windows XP.  That being said, it is an older version and has not been updated since March 2013."}
{"product_id": "B007VTVRFA", "context": "How can I be sure I have a version that will let me play off-line. Mine still says on the box that \"persistent internet connection required\"", "response": "Works great off line, single player. Never had a glitch or failure, just boredom."}
{"product_id": "B00B3PDHBU", "context": "On Turtle Beach website it says it's compatible with XBOX One via the earforce headset adapter. Are you sure it's not compatible?", "response": "I think it's compatible but it only worked once for me. When I tried to change settings it no longer worked."}
{"product_id": "B005OSFUZI", "context": "Can this cable be used for software other then Rocksmith/Rocksmith 2014? (like garage band or some other sound recording software)", "response": "It works perfectly fine with garage band"}
{"product_id": "B00635N6YI", "context": "i travel alot so the magnet paneling on the side falls off alot and i lost it not the symbol but the whole side of the mouse can just fall off......", "response": "Call razor you may be able to get a replacement"}
{"product_id": "B00KGGJPYA", "context": "What are the dimensions of this product?", "response": "4 by 1 1/2 inches"}
{"product_id": "B00BHSTXV6", "context": "Is this keyboard wireless or wired?", "response": "Wired.  It's made for gamers."}
{"product_id": "B0000A2TPE", "context": "Does it work on Mac? Is there a version of Zoo Tycoon that works on Mac?", "response": "I'm not sure but if u read requirements it should tell you.   I think it does though."}
{"product_id": "B00D84DRNC", "context": "is this a belt pouch?", "response": "It would be nice and is possible but its just too heavy will the 3ds inside. the best think to do in my opinion is get a satchel strap or something and where it around your body."}
{"product_id": "B00FQFFPZO", "context": "will it work 4 player offline", "response": "I don't know I haven't tried it ,sorry"}
{"product_id": "B004S5TDUQ", "context": "does it come with cable and will work on PC/ Windows  7 ?", "response": "Rocksmith is marked clearly with or without cable. I have windows 7 on my pc and it is ok however every time I boot up I have Steam, ie Rocksmith right in my way."}
{"product_id": "B009DYOPK0", "context": "Can the LED's be turned off completely?", "response": "Yes, the LEDs can be turned off."}
{"product_id": "B00BCEK2LK", "context": "Does this work on Mac", "response": "Sorry don't know but I think so"}
{"product_id": "B008BGXYBM", "context": "size? how is this mouse for profile i like my mice simple High DPI low and flat", "response": "Pretty sleek of a mouse it has a decent arch but not too bad."}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "Super slim, the newest one!"}
{"product_id": "B008D7F47Q", "context": "can you play it without wifi?", "response": "I presume you mean play it without internet connectivity. The answer is yes, but obviously online features are not available"}
{"product_id": "B000VRCNLG", "context": "will this be able to run on windows 8 someday? I loved this game when I had XP.", "response": "It works really well on windows 7 pro but I haven't tried it on windows 8 or windows 8.1. windows 10 is soon to be released and they state that it will have plenty of legacy support for games of yesteryear. hopefully it will be worth the wait."}
{"product_id": "B004SJFJUA", "context": "Can you play with your 3DS while charging on the base?", "response": "I guess you could, but it'd be awkward. Just plug the cord into the 3DS directly."}
{"product_id": "B0089OBLDO", "context": "can I connect 2 controllers simultaneously? (for instance connect a PS2 and Xbox 360 controller to a PS3)", "response": "I'm pretty sure this adapter only supports one controller at a time."}
{"product_id": "B009M72E5Q", "context": "My father is disabled and bed ridden. Are there many games for this console that can be played in a hospital bed?", "response": "Yes. Bowling, table tennis, etc."}
{"product_id": "B002AQNT96", "context": "If I want to use my joystick - Logitech's WingMan Extreme Digital 3D (USB) - will I need an emulator, and do you know if this model will work? Thanks.", "response": "I used my PC Xbox controller with no problems. I didn't need a emulator."}
{"product_id": "B002Z7BE24", "context": "I want to know whether it has a slipcover", "response": "Mine did not come with a slipcover and I purchased it new."}
{"product_id": "B00AJZNUUI", "context": "Can you play wii fit with this?", "response": "I believe u can"}
{"product_id": "B00EPZ8POY", "context": "does this bring athena hades and poseidon", "response": "Yes it has all three sagas, gold saints, Poseidon and Hades"}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "One in and one out. You can use an optical swith if got multiple inputs. There are a few models sold here in Amazon."}
{"product_id": "B006JSY3MI", "context": "Can it run on any version of Windows after Windows 2000?", "response": "XP would be the only questionable one I believe. I've played with no problems on 7, 8, and 8.1"}
{"product_id": "B002I0F5I2", "context": "Is it in a box which includes the manual and the offer code", "response": "The seller i bought from had both but make sure you ask before buying"}
{"product_id": "B0085P7U0U", "context": "what games are on the disc?", "response": "Black Jack, Bridge, Canasta, Crazy Eights, Cribbage, Euchre, Gin, Go Fish, Hearts, Memory Match, Miami Solitaire, Old Maid, Pinocle, Pitch, Poker, Rummy 500, Skat, Solitare, Space Race, Spade, Spite and Malice, Space Race, Tarot, Tuxedo, Video Blackjack, Video Poker, Video Texas Hold'em and War"}
{"product_id": "B00B1MXGDO", "context": "can i plug this directly into a computer and still use it successfully?", "response": "Yes you can but the extra buttons on the back won't work, so I wouldt recommend it endless you wanted extra grip. This controller works best on the Xbox 360."}
{"product_id": "B00FATRKWM", "context": "Can I play Dance Central with this model? Is there anything else I need to purchase separately to be able to play Dance Central?", "response": "If you have Xbox 360 with the kinetic device, all you need is good space to dance on."}
{"product_id": "B006QRMR4S", "context": "Can I play Japanese games on this? Because the Japanese version can only play games from Japan... So I don't know if it's the same with this.", "response": "No, this is the U.S. version, it plays U.S. version games."}
{"product_id": "B004XGN8W4", "context": "Is this compatible with PS4?", "response": "Yes.  I can use it with my PS4.  Not my XBOX1 though."}
{"product_id": "B00HGLLRV2", "context": "is the difference between the limited edition and the standard edition significant?", "response": "I bought the limited edition for $35 and it didn't really come with anything cool. So just stick with the standard because I just checked the price for the limited and Its not worth it."}
{"product_id": "B002B9XB0E", "context": "Can you configure the buttons to specific keys? I want to program buttons for shortcut commands like CTRL+Z, for example.", "response": "With 3rd party software that maps joystick buttons to keyboard controls, yes. Emulator users find such software very useful, but I cannot give specific recommendations. Free (as in beer) options abound. A couple paid but affordable. Some may be open source, but again I can't offer any specific recommendations."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "oh I see you read the review and you were wondering if the controller worked on windows 8, yes it does that's what I was using it on"}
{"product_id": "B005L38QK2", "context": "How long is the cord?", "response": "Technical SpecificationsCompatibility: Mac and PCFrames per Second: 12000Inches per Second: 150Buttons: 7CPI: 5700Lift distance: 2mm (0.08in)Cable: 2m (6.5ft), braided"}
{"product_id": "B00FLLFGO8", "context": "Can be used for sony Z2 tablet?", "response": "Yes, you can because it can be extend very large."}
{"product_id": "B005F1ZUU4", "context": "Will this work for multi-player? Could I connect two wireless controllers to this one adapter?", "response": "Yesh, up to four"}
{"product_id": "B007WWW2C8", "context": "Is it compatible with Windows 8?  This is the complete first season or do we also need the season pass?", "response": "AFAIK it is compatible with WIN8 and yes it has all 5 episodes of season 1. There is an other 400days episode which is not included in this package but that's not part of season 1 so it is reasonable. (400days is a standalone dlc afaik)"}
{"product_id": "B00EVWZHLK", "context": "Are they all on one disc or 3 separate discs?", "response": "they are 3 separate discs"}
{"product_id": "B00DBKSN8M", "context": "is the game a download or a disk, and does it need internet to play the game.", "response": "Its a disk& no you don't need internet to play the game . you need the internet for Netflix or to go online and things like that"}
{"product_id": "B004S5TDUQ", "context": "does it come with cable and will work on PC/ Windows  7 ?", "response": "Yes.  Although this is the older version of the game, there is a new one out."}
{"product_id": "B004W1IX1G", "context": "is Wii motion required?", "response": "Yes. One motion plus for each controller."}
{"product_id": "B000YQ639M", "context": "does it have a senario maker or make your own map", "response": "As far as scenarios, you have these options:1: Play a historical battle2: Play a quick battle, there's a set number of seemingly random fights.3: Using custom battle, select a map, settlement level, factions and soldiers, etc.But no, you cannot make your own terrain. I think you could download something from here though:http://www.twcenter.net/forums/forumdisplay.php?121-Medieval-II-Total-War-General-Discussion"}
{"product_id": "B00E1L78N6", "context": "does audio pass over usb on the xbox one?", "response": "No just through the controller but you get dts sound quality"}
{"product_id": "B008VQ68C4", "context": "Is it possible to use with phones", "response": "Possibly, with an adapter, but standalone, no."}
{"product_id": "B008U5ZNIG", "context": "These use mx blues right?", "response": "Yes, these are definitely MX Blues."}
{"product_id": "B005Q1YA5O", "context": "I'm wanting to purchase this for my granddaughter.  How many downloads does this give her?", "response": "This download is just for the 'Pets' expansion pack.  It's one game, one download.  It takes a good amount of time but it works perfectly on my computer and I definitely enjoyed playing it!!"}
{"product_id": "B000OYMYZQ", "context": "Is the included battery just a standard rechargeable battery that I can use with the MS dual recharging station?", "response": "It comes with no battery pack, it is just the charging cable. However the controller will still work if you have it plugged into the charger with no battery pack."}
{"product_id": "B0081Q58AW", "context": "Is it all strictly PvP or is there some PvE as well?", "response": "Both!  I have yet to use PvP mode and there is much to do in PvE."}
{"product_id": "B003OZOAKY", "context": "do i need the original total rome before i buy the gold edition?", "response": "No you don't, you can buy this on it's own and it's the complete game"}
{"product_id": "B00009VRG5", "context": "In I Spy Fantasy, where is the scroll in the wizards room?", "response": "Hi, isn't the rolled scroll tied with a ribbon and laying right on the table beneath the window?"}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "Yes, although MGS1 comes as a digital download code and is not on one of the physical disks."}
{"product_id": "B003VAM392", "context": "can it play retro games from Sega Genesis era? any fighting games like Mortal Kombat or Street Fighter 2.", "response": "I use this to play \"Fifa\" and \"Pro Evolutio. ,,n Soccer\" only. I don't now if it can play retro games."}
{"product_id": "B009SJR278", "context": "does this on xbox one", "response": "No I dont it does. I believe its only for computer."}
{"product_id": "B009RXUOD4", "context": "Will this headset's game and chat audio work with both next gen consoles? (Xbox One and PS4)", "response": "Yes but you need purchase adapters to make the audio sound better and like with any console boy a sound processor to enhance audio, the processor makes my skullcandy slayers sound smooth and crisp as well as my turtle beach ear force tangos. I would recommend the Dolby dss sound processor from turtle beach"}
{"product_id": "B0017TFLBQ", "context": "will this work for windows 8", "response": "I know it works for windows 7 but I honestly have no idea if it works for windows 8.  Sorry I couldn't be more help."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "I've had it over 6 months all leds are still working."}
{"product_id": "B009WI7V9E", "context": "I'm wondering about sexual content because I have younger kids in the house.", "response": "Yes to that -- all 3 Bioshocks are stamped with \"Mature 17+\" due to: Blood and Gore, Intense Violence, Strong Language, Sexual Themes, Drug Reference (Alcohol and Tobacco)"}
{"product_id": "B0050SX7BQ", "context": "I just received this game today and found out there is no game manual. Am I the only one who is missing it?", "response": "no mine didnt have one either i dont know what is up with that"}
{"product_id": "B004G5TUJM", "context": "does this work on all racing games even nedd for speed games", "response": "The steering wheel is just a controller, so it should work with all games. It's important to note that this controller has a limited button set compared to a real controller -- it's missing the right analog stick for example. If a game requires that (and many do!) then this controller won't work well for that game."}
{"product_id": "B001AATQ0Y", "context": "does this work with ps2 DDR pad?", "response": "i get the controller too and works great"}
{"product_id": "B004AM5RAM", "context": "Does the epic have the TILT scroll wheel just like the epic chroma?", "response": "Latest model yes, earlier models didn't. So if you buy it now, brand new it should have a tillt scroll wheel."}
{"product_id": "B00B5QLS4A", "context": "How does it compare to the Logitech G600? I own a G600 and my fat thumb has a hard time finding the 12 side buttons. I end up only using 3 or 4", "response": "Never used G600 but really like quality and placement of buttons. I really like mine"}
{"product_id": "B00GS6A6V8", "context": "I am in Australia and have purchased the base game here (in Aus), will this DLC bundle work on my PS3 with my game?", "response": "It will work provided you're buying it on Amazon.co.au or simply from the Australian PS store. Enjoy!"}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "Can this game be downloaded to the computer so you don't have to use the disk every time?"}
{"product_id": "B003VUO6LU", "context": "Is it possible (w/o getting any special software) to use an Xbox 360 controller for the PS3? If so how?", "response": "I am sorry but I don't know the answer to that question."}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "it did not for me, and i tried a fair amount of different workarounds. but i'm far from computer literate, and if you're good with computers you probably have a much better shot than i do... and this is honestly the best joystick i've ever worked with for the price."}
{"product_id": "B007CM0K86", "context": "why is it rated M", "response": "It's got blood, guts, and c us words in it and they don't want people under 18 to by them because of little kids watching and seeing the stuff on here the kid will get nightmares and stuff like that"}
{"product_id": "B004AM5RAW", "context": "Is this the special edition Naga?", "response": "I do not believe that it is a special edition."}
{"product_id": "B003VANOFY", "context": "Can this headset be used while charging?", "response": "can this headset use to TV aplication?"}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "Microsoft has just released the official PC drivers for the Xbox One controller. http://majornelson.com/2014/06/05/pc-drivers-for-the-xbox-one-controller-available-now/?linkId=8424381"}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "It's  not a stupid question! If you use the code right away then it expires a year from the first day used. So you are good! Once your membership is up then you can use the new code."}
{"product_id": "B00AR1LX9O", "context": "My head-phones don't seem to work with I-tunes. They work with Pandora and other cites. Does anyone know how to fix this?", "response": "Sorry I wouldn't I never got my headphones but I'm sure if you go to www.skullcandy.com and hit contact us one of Their techs could help you"}
{"product_id": "B004YC4NN0", "context": "Will this work on phones, for emulators? Is it wireless?", "response": "It connects via mini usb cable (what ti 84 uses), and i have used it for gameboy/snes emulators successfully."}
{"product_id": "B00DC7O3K6", "context": "if i add a motion sensor to the back of my normal wii remote, does that work with this? or do i need a new remote all together?", "response": "no you will have to get the wii U remote with sensor"}
{"product_id": "B00HWMP0OU", "context": "Will this work on 2DS?", "response": "I believe it does."}
{"product_id": "B003V4AK8E", "context": "Can you plug in your headset to it?", "response": "No that is one of the other downfalls. You still have to use a wireless"}
{"product_id": "B00CPS59CE", "context": "How would I connect the xp400 transmitter to the XBOX 360 e console since it does not have an optical audio port?", "response": "The best answer I can give is for you to check the User's Guide, which is downloadable from the TurtleBeach Support website: http://support.turtlebeach.com/download/1157.You will find a complete diagram on pp.7 for XBOX 360 setup."}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "i'm trying to get this to work under windows 8.1 without any success. I followed the instructions and the receiver never syncs up with my xbox 360 controller. any ideas before I return this item?"}
{"product_id": "B00DGZDFO4", "context": "Is this thhe global version or in USA only ?", "response": "Yes is it.I'm from Chile, so it worjed perfect on Steam.Enjoy it!"}
{"product_id": "B004N7IIQ4", "context": "can i use this headset with my ps4 and pc?", "response": "Works with ps3 ps4 pc xbox 360 and xbox one. Check the website for more information :)"}
{"product_id": "B004774724", "context": "When I hit buy/download I see it says it is for vista/xp.  I have windows 7- will it work on that?", "response": "Yes, all Sims 3 games (Base game, Expansion Packs, Stuff Packs) Will work on Windows XP Service Pack 3, Windows Vista, Windows 7, and Windows 8."}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "Yes, it works with Windows 7."}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "I plays very well on my Windows 7, since Windows 7 comes with a utility that runs most games for XP and 98 automatically. There has only been one game that would not play, and it was on a disc."}
{"product_id": "B00030GSJY", "context": "Does this have the rudder control on the backside of the throttle like the x45 does?", "response": "Yes a roller is on the back of the throttle that can be assigned as rudder control"}
{"product_id": "B0038PBF1W", "context": "Can I play this offline?", "response": "Yes you can... During boot-up you have the option to play on line or off line....."}
{"product_id": "B00GOOSORM", "context": "Does this time card add \"Crysta\" points, since Ultimate Game Card is already voided. Just wondering because I plan to world transfer.", "response": "It's only adds game play time not Crysta"}
{"product_id": "B00GANWVJE", "context": "Does this game work with Nintendo DS?  Or is 3DS required??? buying for gift, not familiar with game systems . . .", "response": "This game only runs on the Nintendo 3DS, the Nintendo 3DS XL, and the Nintendo 2DS."}
{"product_id": "B00ANHBJBY", "context": "Will this controller work with the new Super Smash Bros. Wii U game? Does it register as a pro controller?", "response": "Yes...it is an actual pro controller, just nyko brand"}
{"product_id": "B003ESDQW4", "context": "is this a single player game or can two kids play?", "response": "Hi Lori, Spider-Man Shattered Dimensions is a single player game :) Hope this Helps!"}
{"product_id": "B00AYBKQRW", "context": "My LG remote No. 6711A20111H has broken and I need a replacement. any ideas?", "response": "The one we bought here on Amazon works great. This looks like the same one...no problems so far."}
{"product_id": "B00IP0H4GA", "context": "Exuse does this game works in any ps3 , even if my ps3 its from america", "response": "Yes I have a a copy and I live in America with a American ps3"}
{"product_id": "B007VFHIHA", "context": "can you play this game without the internet and do you get disc & software package for disc?", "response": "You have to have internet to download and install the game and updates. The game does not come with disk or packaging, but can only be redeemed through a Steam Application code."}
{"product_id": "B0001BR9Q6", "context": "will Hoyle Card Games 2005 play on Windows 7?", "response": "Yes. it works very well.  Because I have an older computer, I cant use the newer version of Hoyle.  I have had this version before in 2005."}
{"product_id": "B0050SVMYA", "context": "Does this one come with a memory card included?", "response": "All the 3ds should come with an sd memory card."}
{"product_id": "B00CJ7IUI6", "context": "I want to buy this for a friend who wants to play Skyrim with DLC's but cant access PSN will he be able to use the DLCs? without internet??", "response": "After they have been downloaded from the disk and updated from psn he'll be able to play without internet."}
{"product_id": "B003JVF728", "context": "Does this game have bad reviews because of physical problems, or are people just one starring this because they don't  like the in game features?", "response": "I didn't care for it either. Too much verbal content, story, etc. No flowing from action to action. Just didn't float my boat. Wasn't up to other Call of Duty games."}
{"product_id": "B001Q55D5K", "context": "wil it run in window 8?", "response": "If you go in and tell it to run as though in Win XP or 98 there will be no problems so long as your graphic card will handle it."}
{"product_id": "B001CC8UBG", "context": "Works on windows 7?", "response": "Yes! I have it running on Win7 myself."}
{"product_id": "B0009SUW4W", "context": "Hoyle card games What games are on the cd?", "response": "Can someone tell me if this version allows Bridge replay (jewel case)?   The older version of 2008 DOES NOT.  I love that feature..........."}
{"product_id": "B00FATRKOK", "context": "Does it come with game codes or disks?", "response": "Tomb Raider was a code. Halo 4 came as a disc."}
{"product_id": "B00JFPO7JG", "context": "do you need a graphics card to play the game and would my Toshiba satellite c55t-a work?", "response": "you need directx 11 capability at least. I don't know if your Toshiba would play it or not sorry."}
{"product_id": "B0079V29EI", "context": "I have read lots of complaints about people receiving the wrong model for their vita. I have the original vita, will this grip work for that model?", "response": "Yes. I have the day 1 model. Fits fine."}
{"product_id": "B00D9EPI38", "context": "will the 320GB hard drives for the XBOX 360 slim fit in this model? are they the same?", "response": "Yes, we replaced the 4 gb with a 320 gb in 3 systems for my boys..all three work great"}
{"product_id": "B00286BZ4Y", "context": "Is this multiple choice?", "response": "A.  Guesses,   B. Eliminate wrong answers,  C. Choices sometimes make me smile! D. Great Trivia!"}
{"product_id": "B00I9UVY7G", "context": "Is  this game going to be in English?", "response": "Yes the can be put in English, Spanish,Italian,n I believe Portuguese."}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "I have run it on Windows 8 which is on my laptop.  So, yes."}
{"product_id": "B007TMFD7C", "context": "Does this work on mac'c OS Yosemite ? And is additional h/w required such as a joystick ?", "response": "It would work better with a joystick. Works on Yosemite too"}
{"product_id": "B006NU6F28", "context": "Can I use a joystick with this game", "response": "hi and yes you can with the (logitech G27) joystick"}
{"product_id": "B004RMK4BC", "context": "I am trying to ender a psn card to my account but it is saying that it is  no longer valid but i just bought the card 20 mins ago what could be prob?", "response": "Speak to customer service"}
{"product_id": "B0087OZ5FG", "context": "When using with a PC, are you still getting 7.1 Surround sound? Or is 7.1 only work with Playstation 3/4?", "response": "I think its more about your soundcard. If the laptop has a chip that boosts 7.1 then the headphones will get it. But if not then the headphones will try to recreate what they can but not likely anything more than 5.1. But just check out what your laptop pushes and that'll be the determining factor."}
{"product_id": "B00DC7O77A", "context": "Is this game easier or harder than the wii's Donkey Kong?", "response": "Much, much harder. The game even borders on cruel at times. However, it is some of the most clever and ingenious platformer game design I've ever played. Plus, I'm a sucker for the music and style of the original games and this one manages to more closely capture the imagination of those games."}
{"product_id": "B00FJWNSWQ", "context": "what is the difference between the ultimate and standard edition", "response": "The Ultimate Edition contains the DLC that came out after the standard version was initially released ."}
{"product_id": "B0012DPHKW", "context": "Hi, we have a computer with Windows 7.  Will it work on our computer?", "response": "of course as long as you have the space."}
{"product_id": "B0061PAZUS", "context": "Can I play this with my daughter?", "response": "yes, it's more like  a workout rather than playing though :)"}
{"product_id": "B00DVEJA7G", "context": "how are these for running on treadmill? want something thats secure and wont fall off when im running", "response": "I have worn these on a treadmill, and there is no slippage whatsoever."}
{"product_id": "B00G6CLZPA", "context": "Is this any different from the psp demon fleeting game? or the same?", "response": "It's the same game but with additional content like a high school AU."}
{"product_id": "B0000C7GHG", "context": "Is this the older and bigger play station 2", "response": "i dont think so...it was a smaller size i think...kinda reminded me of a PS3...hope this helps"}
{"product_id": "B00DBDPOZ4", "context": "The description claims 30 hours of battery life, but how much did you get out of it before having to charge it?", "response": "At least three nights of playing"}
{"product_id": "B007MJSZDQ", "context": ". 1.Does this work for any Batter pack or is it just the 2 given to you?", "response": "I'm not sure if any other battery pack would work. I haven't tried any other ones, but the two batteries I received both do the same thing which cause some controls to not work"}
{"product_id": "B00GJSUUC0", "context": "Is this entire game just one level?!!!!!", "response": "What do you mean \"level\"? If you mean one map, then yes."}
{"product_id": "B00GQTZ8TM", "context": "I bought one a while ago for my brother and it didn't come with a charger. I'm assuming that this one does, correct?", "response": "Yes, the one I purchased comes with a charger."}
{"product_id": "B003O6E986", "context": "If I have the essentials edition, will my cars and progress transfer to the full version if I buy it?", "response": "It should.   Xbox games tend to be grouped by titles.  I bought marvel ultimate alliance gold and it worked with my marvel ultimate alliance saves and unlocks."}
{"product_id": "B007VH2WPQ", "context": "Will it work with an old wired controller?", "response": "I just rebuilt my old white wired controller (circa 2005) using this kit. The only thing that doesn't fit are the back and the piece between the bumper buttons. I left those white, so I have a two color controller now. It actually looks decent."}
{"product_id": "B008VXCPRY", "context": "I downloaded this game for my mac and it is not compatible. However on Steam it says its mac compatible? Any help?", "response": "It seems like you got the PC download version. There is a PC and a Mac download. Sadly, I don't think there are refunds on digital media."}
{"product_id": "B00CXI0BPG", "context": "does it work for windows 8?", "response": "Yes, I use mine on W8!"}
{"product_id": "B00AR1LX9O", "context": "are these headsets good for FPS games like Call of Duty and Battlefield", "response": "Yeah mate they are called, my little brother and I play call of duty online, they are light and good quality sound for the price, it's worth the money, I use them on PC"}
{"product_id": "B00004XRBB", "context": "does it work on Windows 7?", "response": "I've run it on Windows 98, XP, & Windows 7. I've always installed Micrcosoft WWll combat simulator first. Not sure if that matters."}
{"product_id": "B008O510Y8", "context": "Is the adjustment band made out of metal?", "response": "no plastic but it is sturdy"}
{"product_id": "B00006HYLN", "context": "does it work for windows 8", "response": "Yes. It works with Windows 8. I've had mine 4 years. Bought it used. Never had any problems with it."}
{"product_id": "B00009OY9U", "context": "whatl is best joystick for windows7?", "response": "dose it work on window xp ...i have on my pc pac-man will  it work ?????"}
{"product_id": "B00CMSCTA2", "context": "Does this have campaign mode?", "response": "There are multiple campaigns that you can do, starting with Atila the Hun through the Aztecs."}
{"product_id": "B002B9XB0E", "context": "Does it work with linux?", "response": "I had it working on Rasbian with RetroPie installed.  The device stopped working all together on any machine after 3 days though."}
{"product_id": "B00BDS415I", "context": "How long is the cable, is there any way to lengthen it?", "response": "The USB Cable it's self is 6 to 10 feet long, the headset cable that plugs from the headset into the Volume Control Unit is relatively short, probably less than a foot, but with the length of the USB cable, this will work in most rooms."}
{"product_id": "B0002EAA36", "context": "Will this Joystick work on an older computer using windows 98?", "response": "I think so. it uses a USB plug so if your older PC has a USB port thenit will work."}
{"product_id": "B00D78Q4UM", "context": "Does anyone suffer LED backlighting outage issues, like owners of the K70 do? It's an issue with the K70, so is it an issue with the K50?", "response": "I had mine K50 for like 4 months and there hasn't been any issue with the backlight"}
{"product_id": "B007WWW2C8", "context": "Does this game require internet connection to play?", "response": "The Walking Dead requires an internet connection to download both the game itself and a game distribution program called Steam. A constant internet connection is not required to play."}
{"product_id": "B00FLLFJ68", "context": "I know it says that the station will let you know when the controllers are fully charged, will it prevent overcharging?", "response": "I'm no scientist but if the device knows when the controllers are charged, why wouldnt it stop charging them? thats generally how chargers work."}
{"product_id": "B00CJ7IUGS", "context": "do i need internet connection to download dlc content onto my xbox?", "response": "No. Internet is not required to download the dlc. Its a seperate disc to download."}
{"product_id": "B00C2B355W", "context": "Can this be hooked up to my Xbox One and PS4 simultaneously?", "response": "No.  There is only one optical input.  You may use a switcher to select the input."}
{"product_id": "B002JVX5V4", "context": "Does this work with Windows 8? We have a not-so powerful desktop running on Windows 8 and have concerns about it working. Any advice?", "response": "Sorry, I have Windows Vista, and it works great. It is a great game, hope you can play it."}
{"product_id": "B00D96BORK", "context": "Can I listen to in-game sound and my mp3 player simultaneously? Like, if I turn off the in game music and leave on in game sfx and then play my mp3?", "response": "Yes u can listen to both at the same time"}
{"product_id": "B0053B66KE", "context": "does it play on a new 2ds?", "response": "Pokemon X and Y should play on the 2DS. My brother had Pokemon X on the 2DS."}
{"product_id": "B0089NVTDM", "context": "Does this work on a Wii U to play the newest Smash Brothers? Can someone Confirm yes or no?", "response": "Scott, this is an adapter for the computer, not the Wii U, you can however buy these for the Wii U, they work perfectly: Mayflash Nintendo GameCube Controller Adapter for Wii/Wii U"}
{"product_id": "B008RA5DIY", "context": "We recently bought Quickbooks Pro 2013 3-user. Can we buy single user version and have all 4 people working in the same company file at the same time?", "response": "Yes you can.....we have bought an extra license for several editions of QB....all can be connected into 3 pack....."}
{"product_id": "B002BRZ79E", "context": "Looks like a good game, just not into monthly subscriptions. Is that the only way to play this?", "response": "other than the free thirty day trial that is correct."}
{"product_id": "B00AAS88K6", "context": "will this mouse work with a new Mac Power book?", "response": "works with my Macbook Air, so I don't see why not..."}
{"product_id": "B00F8W9SWQ", "context": "Can you see the keys clearly with the back light off?", "response": "Yes I can. There is an on/off button for the backlight, no dim. The wristpad does make a difference as well, very comfortable."}
{"product_id": "B001NT9TK4", "context": "Will this wheel work with windows 7 ultimate 64 bit os?", "response": "Sure. It was my o.s. when I bougth this wheel and it worked very well."}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "Yes, I've installed it on Windows 7, 64 bit OS and it's working"}
{"product_id": "B008SBZD9G", "context": "Hi, Does this product includes the CD-Key needed to register and play?", "response": "Yes, you'll recieve a game key. You'll still need to download the game client, and set up an account, then you are good to go!"}
{"product_id": "B00CERXJNW", "context": "how wide is the keyboard?", "response": "It's 19 3/4\" inches wide and can tell you that I have owned many keyboards and this is by far the best."}
{"product_id": "B002I096AA", "context": "Can this system download movies from a PC?", "response": "It can but I do not recommend one for watching movies, the 3DS has a 10 minute limit video playback so the movie would be broken up to 10 min parts."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "You do not have to \"jam it in\" there. it fits with a gentle push. And it fits snugly, so theres no movement."}
{"product_id": "B00CH923NE", "context": "Is the dream world too cheesey? Or is it not?", "response": "First let me say that I'm a huge Mario fan!  This game is really silly though.  I stopped playing it after only one day.  For me there were too many tutorials and too much \"talking\".  Not worth the money in my opinion.  Get yourself another Mario game, unless you have them all :P"}
{"product_id": "B0029M6VKA", "context": "Does it work with Windows 7 and Windows 8?", "response": "Yes.  I am currently running Windows 8 and works great."}
{"product_id": "B0045ZB66I", "context": "Does this game run on windows 7?", "response": "Yes. I could runned on windows 7. (Now I'm using windows 8 and still works)"}
