{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "Hello. As far as I know, this one here will only work with the 1000 series. For the slim version (2000), I believe there is a proper version of the grip available on Amazon. Search for power grip slim. Hope it helped!!"}
{"product_id": "B00FZLE9JW", "context": "Will this hard drive work to play original games on my XBOX 360 Slim?", "response": "It will play Xbox 360 games but will not play original xbox games. I bought this harddrive for my xbox slim and it works great."}
{"product_id": "B00KGGJPYA", "context": "so I just bought the Gembonics Battery Back up -  how do you recharge the unit to a full charge ?", "response": "Insert the remaining end of the USB Power wire into an AC adapter connected to the wall socket or a charging computer USB port. i use my laptop to charge this device."}
{"product_id": "B00F27JDY0", "context": "What is the difference between the JAPAN version and the ASIA version?", "response": "There is none, you can choose your own time zone, language and use psn account from any country.  The only difference is in Japan, the O button is to confirm things and the X button is to go back.  Thats it."}
{"product_id": "B00GY4OAM0", "context": "Does this work on the original wii also?", "response": "No, Wii U games will only work on the Wii U. The hardware inside the system is very different, so the publisher would need to create a separate Wii version. Unfortunately it looks like there will be very few new games available for the original Wii at this point."}
{"product_id": "B007FTE2VW", "context": "does it work with windows 7?", "response": "Yes.  It works perfectly fine in Windows 7.  Just download, install, and play!"}
{"product_id": "B00CJ7IUGS", "context": "do i need internet connection to download dlc content onto my xbox?", "response": "Yes  .  Unless  you  have  the  Legendary  Edition"}
{"product_id": "B00FE8WKPQ", "context": "will the Wii U FIT  game and meter work on the Wii?  Do not have the Wii U", "response": "I am not sure.  I bought it as a gift, so I hope so!"}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "I have no idea.  If I have my way, I'll never own Windows 8.  It is one of those operating systems we didn't need."}
{"product_id": "B00D84DRNC", "context": "Does this fit New 3ds xl?", "response": "Yes, this pouch it's perfect I recomend it 100%"}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "yes, i believe it includes 5 free federal e-files."}
{"product_id": "B008GEH8LQ", "context": "Is this like a store bought 3DS XL?", "response": "if you mean like buying it at a Walmart or a Gamestop then, in my case, yes. I ordered it BRAND NEW and had it sent to my home. It came with the box and instructions on setting it up and charger. Packaged like it came sealed from the factory."}
{"product_id": "B00CRL9TU2", "context": "If I install GT6, can I still play GT5 on the same machine? I'd still like to race the awesome cars I earned in GT5 even if only in GT5.", "response": "yes, they are independent games"}
{"product_id": "B00F34LZT8", "context": "Do you need to have the DVD on the system to play this? I have a Netbook with external DVD.", "response": "No u do not...it is a \"Arc\" game now so u instal it anr can run it through the arc program."}
{"product_id": "B003Q55Y5C", "context": "Does the online still work in 2014?", "response": "Likely not. Homefront 2 was just announced and Homefront bombed so they probably stopped support for multiplayer a while back. I'd be stunned if there was anyone even playing multiplayer anymore."}
{"product_id": "B003JVF728", "context": "Does this game have bad reviews because of physical problems, or are people just one starring this because they don't  like the in game features?", "response": "My problem with the game is when I am in the Room with Castro, firing away at him point blank, he doesn't die. Instead I had to jump out the window and get away in the helicopter. I'm not a gamer so that may have been the problem."}
{"product_id": "B006RJ373K", "context": "system requirements for mac and pc?", "response": "Am not a fan of Apple but dos work . Myself I prefer PC but you need a pretty fast PC and a power full graphic card .. Awesome game .."}
{"product_id": "B00EV7AYAO", "context": "How loud is this keyboard when you press the keys? My keyboard is a very OBNOXIOUSLY loud razer that's key presses can be heard through closed doors.", "response": "This keyboard is very quiet.  My son's desk is in the same room and I've never noticed a problem with him banging away on this kb."}
{"product_id": "B008U5ZNIG", "context": "Does it work well?", "response": "Yes indeed it does, my 16 yr old is a computet and gaming geek, he loves it, its very sturdy and worth the money!!!"}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "Nothing makes these worth more than a couple of bucks. Don't buy. Seems somebody may be creating artificial demand."}
{"product_id": "B001DPZE84", "context": "Can you make your own missions?  Can you get unlimited fuel?", "response": "I do not see where you can make your own missions, but there may be a add on for it.  You can set unlimited fuel."}
{"product_id": "B000YQ639M", "context": "does this run on windows 7", "response": "yes runs fine on windows 7, I'm on 7 home premium, using a 64 bit system, and it runs great with no problems"}
{"product_id": "B009IR1SR0", "context": "If I download this game on my current computer and eventually upgrade to a new pc, will I be able to transfer the game ?", "response": "Yep, just would need to reinstall game with the cd key"}
{"product_id": "B004RMK4P8", "context": "What do I do if I'm buying the playstation card for someone do you give me a code to give them..I'm older and don't know anything about this.", "response": "Yes, you will get a digital code , which appears on the screen after purchased , you can give this code to anyone."}
{"product_id": "B00EFFW0HC", "context": "How do you get the Premium for Battlefield 4? Can you purchase the code on Live?", "response": "Yes you can purchase premium through the game main menu it will say store click that and it will bring you to abunch of options you can buy including premium...."}
{"product_id": "B00DJYK8XS", "context": "Is this for the original wii or for the wiiu?", "response": "This is for the original Wii. The Wii version will work on the Wii U, but not vice versa."}
{"product_id": "B000AOJ7FK", "context": "Is this game legit, like when you buy it you can download it and play? this is not a scam right?", "response": "If you buy it new yeah it's legit and you can play it. If you get it usd the key won't work and it won't let you play. I had to find out the hard way rather than going to steam and buying the game download direct."}
{"product_id": "B00111SFEU", "context": "does it work on a computer", "response": "Most likely if you computer has Bluetooth."}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "double check controller on other fighting games ifit workd double check controller setting in game of j stars I have had no problem with controls for this game"}
{"product_id": "B00DC7G2W8", "context": "Do you need the wii motion plus or the regular wiimote  work with this game?", "response": "Just use the gamepad-- it works the same."}
{"product_id": "B00030GSJY", "context": "i have windows 8.1 will this system work with my system?", "response": "it should, if I read correctly 8 will use 7 drivers"}
{"product_id": "B003NSLGW2", "context": "Do these work perfectly on PS3?", "response": "yes my friend They are great and fit perfect You will definetly note the difference"}
{"product_id": "B00475AYUA", "context": "How come it says it has 4 games but when i download I only have 1?", "response": "It's Civ IV with expansion packs and all of them are there. You need to do a little searching because it doesn't download to the same folder."}
{"product_id": "B00C2B355W", "context": "why is mine all crackly? do i need a new audio cord? 2.5mm to 3.5mm? Where do i get it?", "response": "It should have came with a 2.5 to a 2.5 if you are having problems I would just get a 2.5 to a 3.5 adapter"}
{"product_id": "B001E27DLM", "context": "How will I know I will not get one of the pirated copies?", "response": "Not really sure but it's not likely that you would be getting a pirated copy if you get it at a reliable sources or website, but if you're not sure don't take the risk just trust your gut."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "yes, a japanese copy of a ps3 game will work on any north american ps3, however you will need to create a japanese psn account, however the dlc, digital copies of games, and any other items featured on the japanese playstation store."}
{"product_id": "B00F4GSAYI", "context": "Do I have to have an additional internal hard drive to play the DLC's like Fallout 3 wants?", "response": "I have never had an issue with the game requiring storage on my internal HDD. Just like Tom said, I could see it possibly being an issue if you were near or close to capacity, but I only have about 4 gigs left on mine, and I've never had an issue. Hope that helps."}
{"product_id": "B00292OW1U", "context": "The keypad to the left, can we use it to move the character about similar to the arrow keys?", "response": "Yes! That is the whole point of this keyboard! I higly recomend it, and to me, this is by far the best keyboard that I have ever used! Ps, you can also costumice the keyboard keys to work as you see fit."}
{"product_id": "B000ZBZK7C", "context": "which poker games it has? I know it has?", "response": "There are about 24 different games on win-poker, too many to list.  If you want specific games list them and I'll let you know if they are on the list."}
{"product_id": "B000R9A9JG", "context": "Is this only one battery and cover for one remote? Or two for two remotes?", "response": "One. And make you speicify what color you want too."}
{"product_id": "B00BGD6LMG", "context": "As a mom I am asking... My son is 11. He has a couple of the call of duty games.  What do you think?  Can he avoid the sex stuff in \"free roam\"?", "response": "In the free roam there isn't any near thaf. But in the story mode. There is a scence or two of nudity dealing with the human trafficking story line.nothing strong as a grand theft auto."}
{"product_id": "B000HZFCT2", "context": "does it work with steam?", "response": "it works with pc games that supports xbox360 gamepads.  steam is not a game, it's a service to purchase games."}
{"product_id": "B002ZS6Y64", "context": "Do the headphones come with every accesorry needed to plug and play? Also do the the headphones need to be connected to an outlet?", "response": "Electrical outlet, No there is no AC/DC Power outlet on it. I will use the USB power."}
{"product_id": "B00DPQ6GPO", "context": "i am a call of dutty ghost on ps3 i like using shot guns., like fal pistol and sniper is the controller good for me in call of dutty ghost?", "response": "Yes its a controller if u kno how to.use the jitter feature but I recommend it"}
{"product_id": "B009M72E5Q", "context": "Can you do karaoke on it?", "response": "If there is a game for it you can."}
{"product_id": "B00D9FQ9CQ", "context": "do I need internet to play games at home? or I can buy a cd game and play and home without any problem", "response": "You should be able to play games without internet, simply playing discs you've purchased. But you'd miss out on any updates your system may need."}
{"product_id": "B00DBKSN8M", "context": "hello friend, how many gb? which are all games that brings?", "response": "Read the description, this question can not be serious. The answers are literally in the title of the product."}
{"product_id": "B00BI9MDSO", "context": "soooo, my new Vita Slim PCH-2001 won't fit in this case? Thanks.", "response": "My Vita Slim fitted just fine."}
{"product_id": "B00ANHBJBY", "context": "How would this work for Smash?", "response": "It's OK... Not great though. I have a hard time doing tilt attacks because the thumb sticks are overly sensitive."}
{"product_id": "B002I098JE", "context": "does it require xbox live gold?", "response": "If you want to play online ,Yes u need xbox live , but if u just play campaign or single player than no u don't need xbox live"}
{"product_id": "B004GINKNQ", "context": "will this work on the 4GB Xbox 360?", "response": "Yes it will. Good luck and enjoy."}
{"product_id": "B00E6OLJ88", "context": "Can i have a list of all the mods in the order of when you press the button on the back", "response": "I dont know the order I keep.on the fourth or fifth one I dont use the other ones but it is a great controller"}
{"product_id": "B00006B84X", "context": "Does anyone here have one the lasted more than 10 years?  How is it holding up?", "response": "so far this is the best stick I have had, the X55 rhino nothing but ghosting problems. I have tried them all.  I have a x52 throttle controller I use with this, and Saitek pro rudder pedals have them for the past 8 years now."}
{"product_id": "B003JETPHS", "context": "does this work with lips on xbox 360? thanks.", "response": "I think it should. I don't own an xbox nor have I used one recently, but if the xbox has a USB port then it should work."}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "No X box 360 games are not compatible. ..."}
{"product_id": "B00IJQJYHC", "context": "Does it have a good key response? I know it's not a mechanical one, but I like the mechanical, how does this compare?\"", "response": "It feels mechanical. Clicky clacky! And yet, not too loud. It's a pleasure to type with."}
{"product_id": "B00AFYAUYW", "context": "Can I play the earlier version wii games on this unit", "response": "I think so, we have some old (but not to old) we use in ours, I hope this helped"}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "It still doesn't work and was never resolved by the company. Buy at your own risk!"}
{"product_id": "B00D9EPI38", "context": "So, DOES it have hdmi output? (The Xbod itself is not a monitor so I can't \"watch movies right on it.\" I still have to connect to a screen)", "response": "Does this play sound thru the HDMI cable? My 360s did not and required the green cable to be connected for sound which on my TV was coupled with the VGA input which meant I had no sound...."}
{"product_id": "B00DE2W4PK", "context": "What do you need the Plus subscription for? is it necessary to play online?", "response": "Yes you do. You need it mainly for the online game play plus downloads of maps weapons etc."}
{"product_id": "B007VH2WPQ", "context": "Do the screws from my original case fit or do I have to buy new screws?", "response": "Yes they fit. Is the exact same controller except for the Home button which is different color and doesnt have the X on it."}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "No. Is only for Wii U"}
{"product_id": "B00BDS415I", "context": "Can this headset be used on desk top computers as well? Also is this set good for listening to music with?", "response": "Yes, I use this headset with my desk top computer. I have never owned a very high quality headset just for music but in my opinion it's great for listening to music. I can even plug them into my smartphone."}
{"product_id": "B001FBHT34", "context": "Can you make this compatible with a ps3?", "response": "I don't have a ps3, I'm sorry."}
{"product_id": "B001EYU1WS", "context": "X Plane 10 compatible? Without downlaoding any drivers and things. Look Im a rookie and i just want to plug it in set my controls and fly in xlpane 1l", "response": "Its a computer attachment si yes it should work no problem specially if you have win7 and up where driver updates are automatic."}
{"product_id": "B00CJD4HD2", "context": "Does this mouse work on Mac? I would assume so, but it only mentions Windows operating systems in the description.", "response": "Yes, but there may be missing functionality as Logitech doesn't develop the software for G-series hardware for Mac."}
{"product_id": "B00JB4WHWU", "context": "Do you have to buy the discs to install in order to play online? Or do you just buy the subscription and play?", "response": "Use disks or just do the digital download. I believe both give you 30 days free, then you must use subscription to play."}
{"product_id": "B00I5LMSE2", "context": "Will a 19 year older enjoy this game? If so, how fun is it? And approximately, how many total hours does it take to complete the game?", "response": "My son is 7 and really enjoyed it and honestly he beat it in a day in a half. The graphics were good, and the levels were fun and yes im sure a 19 year older would like it if he or she is into games especially kirby."}
{"product_id": "B00A1AQJAO", "context": "Does this also work for the Dsi XL", "response": "I have been told it does not work on all systems why I don't know"}
{"product_id": "B00G6YJ60E", "context": "I have a Satellite connection - 20 GB a month.  If I buy a games (CD not Steam), can I play withouth having the Steam take away ALL of my monthly GB?", "response": "No, this game only comes as a downloadable title, so you would lose a big part of your monthly allowance simply by downloading it."}
{"product_id": "B0000C7GHG", "context": "does it come with memory card?", "response": "Sadly no but there are some cheap ones on Amazon"}
{"product_id": "B00008J7NZ", "context": "does this game work on Xbox 360", "response": "Yes it will work with 360 as long as you have a hard drive"}
{"product_id": "B00HVYBWQO", "context": "Is this more useful than a Nintendo Power Glove?", "response": "Not sure what it is you're referring to, but if you're trying to use the Leap Motion for serious gaming, I'm afraid I'll have to disappoint you...it's not quite accurate or fast enough in its response time..."}
{"product_id": "B0002DKTY2", "context": "Random House Webster College Dictionary Will this DVD work on a 64 BIT system?", "response": "2015 still waiting for an answer to this question please"}
{"product_id": "B00CERXJNW", "context": "how wide is the keyboard?", "response": "Its as wide as a standard keyboard with a numpad but the macro keys add an extra 4 inches or so"}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "Yes you can. That's what I did"}
{"product_id": "B0095P5K8I", "context": "So i bought this mouse two months ago and now its completely not cooperative. The light turn on, but the cursor is stuck in the middle. i cant move it", "response": "I'm not sure what to tell you.  Mine has been working great since I've received it.  I would recommend this product to anyone.  Have you tried a different USB port?  Try asking for a replacement, the price is just too good."}
{"product_id": "B003O6EE4U", "context": "Once I bought Xbox 4GB option, could it be somehow upgraded to 250 GB option?", "response": "Yes, you can buy an internal hard drive and install to the console, also works with some external hard drives."}
{"product_id": "B00HG0B8NA", "context": "does this game have undo option?", "response": "Yes.Most of the games have undo button.You can undo your last move, if it doesn't let you to cheat."}
{"product_id": "B00CPS59CE", "context": "How would I connect the xp400 transmitter to the XBOX 360 e console since it does not have an optical audio port?", "response": "I would recommend contacting Turtle Beach customer support.  I use the XP400 for my PS3."}
{"product_id": "B003O6E986", "context": "is it the regular or essentials edition ???", "response": "This is the regular edition"}
{"product_id": "B00503EAG2", "context": "Does this come with a new product key for activation on Steam? (Physical copy + Product key?)", "response": "Yes it does but keep all numbers in a journal for back up just in case. Had no problems at all. On the bottom left of your steam page you will see ADD NEW GAMES. Click and follow instructions.  You will enjoy this game."}
{"product_id": "B0090WBXSM", "context": "It will work fine with Android Box Minix Neo X8H and Ipad Mini 2?", "response": "I would not buy this item.it did not work for playing games on a Neo x7   Pairing the device was a pain do some research before you buy see what others say about controllers for the Neo x 8"}
{"product_id": "B00886XQNQ", "context": "does it work for xbox360", "response": "I think so, it has a cord in the box for a xbox!"}
{"product_id": "B00ARD5410", "context": "What are the dimensions of this mouse?  In the product description the dimensions listed make this mouse bigger than my keyboard.", "response": "4 1/2 x 3 x 1 1/4 lxwxh roughly measured"}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "Your question is a little incomplete, actual creation of the game? Or the missions within the game?"}
{"product_id": "B004L6C6BK", "context": "Is there a way to mute my mic? I'm thinking of matching this mixamp with Audio Technica's ATHADG1 which requires you to hold the mute button closed.", "response": "There is no actually mute button on the device. The only way I can think of muting your mic is through the game you are running."}
{"product_id": "B004XIQN3I", "context": "is this one compatiblre with windows 8.1?", "response": "Not Sure. This was designed to run on Windows-XP, but I don't use windows 8.1. I did get to work on windows 7 using the compatibility feature, so it might work. Sorry I couldn't give you a definite answer."}
{"product_id": "B0072A4JVW", "context": "Will the grips still fit on the vita if it has a case on it? I have the eForCity snap on crystal case", "response": "I dont thinkit will as it is quite a tight fit"}
{"product_id": "B00FM5IY38", "context": "does this support chinese ?", "response": "No it does not"}
{"product_id": "B00DBDPOZ4", "context": "The description claims 30 hours of battery life, but how much did you get out of it before having to charge it?", "response": "Definitely around that amount. I usually charge around once a week and it charges in about 1 to 2 hours."}
{"product_id": "B00GU4F4OM", "context": "Does this last through the daily beatings of a WoW player?", "response": "Should be fine for wow most of your abilities should be key bound and macroed.  Should only be clicking NPCs and players name plates or using mouse overs so you don't even have to click"}
{"product_id": "B004N7HSGU", "context": "So if i were to buy these Astros, What EXACTLY would i need to buy extra to work with my Xbox One?", "response": "in your case this isnt the headset you should buy, instead of searching \"A40 + MixAmp\" search: \"A40+ M80\" m80 is the adapter for x1 controller. thats all i know :/"}
{"product_id": "B0050SZ0SY", "context": "will it work with windows 8.1 ?", "response": "im using win 7"}
{"product_id": "B00B0QONB0", "context": "is this for titanfall", "response": "No. Get something more reliable like a WD BLUE OR BLACK (black is better) This drive failed on me after only 4 months in my Xbox 360. I replaced it with a 360mb WD black after a lot of careful research."}
{"product_id": "B001WAKR3W", "context": "Can this mouse scroll right and left?", "response": "Sadly no. You can press down on the scroll wheel and use the Omni direction, but it doesn't go left or right, just up and down."}
{"product_id": "B00B3PDHBU", "context": "Will this headset work on the xbox 360 & the xbox one?  Looking for a headset that will work on both.", "response": "Yes it will. The difference is, you can use this headset full wireless (communication as well) on xbox 360 with adaptor included, but on xbox one you need to connect headset to your gamepad with a cable and adaptor which is not included."}
{"product_id": "B000ND3XXA", "context": "Will this work with Windows 8.1  ?", "response": "Yes! I use it on 8.1! Works fine download joytokey if you don't know what to do!"}
{"product_id": "B008RA5AWS", "context": "Is QB Pro 2013 with enhanced payroll offered for multi user license for 2 users", "response": "It is my understanding that they offer only a single or three-user license. They are very helpful, go on-line and  get their contact telephone number for sales they can give you the details"}
{"product_id": "B000VTQ3LU", "context": "Does this come in a Retail Package as shown? Because I received it in Bulk packaging.", "response": "i orderd one and it did not come in retail package. as long as it worked like it was supposed to, it didn't matter to me."}
{"product_id": "B000035Y6D", "context": "I WOULD LIKE TO KNOW THIS NITENDO COME WITH 2 Controllers ??", "response": "My system did not. You'll need to look in the description of each individual console because they're are several different sellers and condition and what accessories it comes with will vary."}
{"product_id": "B006W41X36", "context": "If you use it with an optical output on a Panasonic TV can you also listen to external sound? How can this be done? For people who are hearing impaire", "response": "Hello Bat, Could you please clarify what you mean by external sound? I would be glad to answer you question as soon as you do that favor."}
{"product_id": "B003YC4D9A", "context": "This is original nitendo?", "response": "No this is 3rd party."}
{"product_id": "B00DNGQQUQ", "context": "Since I'm new to DBZ I want to make sure, I heard in the show that Goku has the power to teleport, is it true? if yes than how does he do it?", "response": "Yes its called Instant Transmission.  I believe in the series he learned it from an alien race that nursed him back to health after he defeated Friza."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "It's pretty sturdy.  You'd actually have to be trying to break it in order for it to break easily. Like any other controller, make sure you don't throw it around. It can survive some accidental falls."}
{"product_id": "B00JC9SWSC", "context": "Does it play Netflix?", "response": "Yes it does. We watch Netflix quite a bit on the PS3."}
{"product_id": "B00919RM1Q", "context": "can this version be loaded on both my lap top and desk top?", "response": "previous version worked on both laptop and desktop new version i didnt load on laptop as old version better"}
{"product_id": "B0045FEEAS", "context": "is it game cube controller compatable", "response": "Sorry, I don't know what a \"game cube controller\" is."}
{"product_id": "B000B6MLSM", "context": "I have a receiver to use my 360 controller on my PC.  Will I be able to use this for my PC also?", "response": "your pc would need a compatible IR receiver."}
{"product_id": "B00CMQTVUA", "context": "Hi, Can I use this in India?", "response": "I would suggest buying from Amazon.co.uk so it has the 220V power converter :)"}
{"product_id": "B001CXYMFS", "context": "Does this have yaw control? As in, can you twist the stick clockwise/counterclockwise?", "response": "No, but I have rudder pedals which are more realistic."}
{"product_id": "B00AR1LX9O", "context": "Will this work on mobile phone?", "response": "Nah it does not work on a mobile phone, I tired but there is no connection that I can find.. Stink aye"}
{"product_id": "B003OZOAKY", "context": "do i need the original total rome before i buy the gold edition?", "response": "I installed ages of rome gold and it plays ages of rome and imperium with no problem,I did not have theoriginal game before this.Hope that helps"}
{"product_id": "B002I0H79C", "context": "if i buy this you will send me a code? first?", "response": "im dont sell game and not this game  i  bought it  but  not sell  it   you probably  mistaken  the profile  but  i  have this  game  with a manual  says  to access the full-lenght manual  go to gearsofwar.xbox.com/gameguide"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "says on package xp, 7, vista.  processor 1.5 Ghz. Memory 512 MB Ram. hard drive 700 MB free space. graphics card 256 MB 3D video card."}
{"product_id": "B00726ARTE", "context": "Does it work for ps3?", "response": "I just use it for my smart phone. Does not work for ps3. It has the wrong plugs."}
{"product_id": "B008U5ZNIG", "context": "What's the difference between the ultimate and the ultimate elite?", "response": "I believe its the back light."}
{"product_id": "B0088MVODO", "context": "if I buy the anthology on ps3 does it work on ps4?", "response": "No. Only the system listed at the top of the label (PS3)."}
{"product_id": "B00DE2W4PK", "context": "I did not come in the box PS PLUS membership. As I do in this case?", "response": "Have I not send the mail either."}
{"product_id": "B00FXOP1JI", "context": "Hello and place the order for my product, I wanted to ask, please wish my product is in its original box, I do not want another box for my other packa", "response": "I ordered mine new, and got it in the original, shrink wrapped nintendo box, just like off the shelf at any retail store, so i don't see why yours would come any other way,unless you bought it used."}
{"product_id": "B00012YI14", "context": "does it work for the pressure-sensitive gamecube shoulder buttons? like for pressing part-way down as well as all the way down?", "response": "I, honestly, don't know. I've never had a Gamecube, nor any of its accessories."}
{"product_id": "B00C7103DO", "context": "Hi, I would like to know whether it is the full game or is it the 10 GB version and we have to download the extra 8 GB?", "response": "My copy was the full game. I didn't even know there was a version that needed an additional download."}
{"product_id": "B00030GSJY", "context": "What type of plug does this Joystick use?", "response": "Mine has a USB plug that connects the throttle to the computer."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes it will. Most Japanese games are not region locked."}
{"product_id": "B00HVBPRUO", "context": "Can I use 2 headset while on my playstation3?", "response": "https://support.us.playstation.com/app/answers/detail/a_id/5244/kw/headsetFrequently Asked QuestionsQuestion: How many Gold Headsets can I use with my PlayStation system?Answer: On the PS4 system, you can use up to two Gold Headsets at a time. On the PS3 system, you can use one PlayStation headset at a time."}
{"product_id": "B00286BZ4Y", "context": "Does this come with a CD", "response": "This does come with a downloadable CD to play on your computer. It's a great game for those who like to play this game."}
{"product_id": "B004774724", "context": "does this work on kindle fire", "response": "Don't think so but I have never tried it."}
{"product_id": "B00EI4V3FU", "context": "Can this work on ps3", "response": "I'm not sure never tried it"}
{"product_id": "B0000512IE", "context": "How far are the pedals apart? i.e. the spacing distance.", "response": "21,5cm from center of pedal to center of pedal."}
{"product_id": "B0038MVFYC", "context": "I want to know if this is the original ds game that came out in 2010?", "response": "Yes, this game came out for the ds in 2010 as the remake for the Game Boy Color version. You can use it for all DS consoles even 3DS. I use it on my 3DS XL and it is just so fun, I highly recommend this game to anyone."}
{"product_id": "B009CEM332", "context": "Is this game compatible with an Xbox 360 controller? Many PC games are.", "response": "yeeeeeeeeeeeeeeeeeeeeeeeeees. No multiplayer though"}
{"product_id": "B00EV4O8VS", "context": "How many GBs is this console?", "response": "32 GB console, but there are about 2-4 missing due to the software already on there."}
{"product_id": "B002I0GF72", "context": "How bad is the violence and \"Blood\"? I have a 6 yr old dying to get this game, but I want to make sure it's appropriate. Please help.", "response": "The game doesn't have blood, and the violence is cartoony. But you might want to keep in mind that the ESRB gave it a ranking of E, meaning for 10 years and up. The puzzles and the bosses might frighten a little kid."}
{"product_id": "B00DLRLDBO", "context": "Does the headset acutally connect to an Xbox 360 controller? For chat?", "response": "It does it hooks up to the xbox controller and the computer so you can hear the game and chat."}
{"product_id": "B00DPJBTM6", "context": "i know you should buy this with the mix amp for best quality but I don't do Game Battles anymore. So is this headset great for just using stereo sound", "response": "They are decent but you will not get surround sound audio."}
{"product_id": "B00562O8U0", "context": "what does sony ps3 games mean when they say 3d compatable", "response": "3d compatible means its a 3D game. All 3D games are stereoscopic 3D, which requires both a 3D TV and a pair of 3D glasses, unless stated"}
{"product_id": "B00292OW1U", "context": "Does the keyboard blue led so you can see it at night?", "response": "Yes, the LED in the keyboard has 3 colour options, Red, Blue, and Purple. There's a button at the top for colour change and LED brightness."}
{"product_id": "B0050SWBAE", "context": "Why is this game such a ridiculous price? $92.00? Does it put your kids to bed and drive them to school the following morning? A bit steep otherwise.", "response": "Game is out of print"}
{"product_id": "B00B98HBTA", "context": "how many players can play at once?", "response": "Dont know, i just give to my grand son. Sorry"}
{"product_id": "B00ECOBFA4", "context": "does this game have access to all the characters?", "response": "After you unlock them via secret code or via playing a story mode"}
{"product_id": "B00CXCCH1I", "context": "does this game let you play with another person offline ?? if you add another control and the other person is next to you", "response": "I believe so.  I've never played against another person offline, but I believe you can as long as you have two controllers, it should work."}
{"product_id": "B00519C7JC", "context": "What does the \"Standard LTO\" edition come with and what does \"Standard LTO\" mean?", "response": "It is the game itself and inside the cover you will find the code for the first map pack so you can download it for free. Not sure what LTO means, you can just google that and you'll find out."}
{"product_id": "B00F27JDY0", "context": "can you change language to english and have everything like us version and can you use your us psn account?", "response": "Is it possible to change the language to Spanish? Since it does to be formed"}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "From the manufacturer you change the color of the whole keyboard at the same time."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "It takes 2 AA batteries or a wii remote rechargeable battery pack. I really suggest going the rechargeable route; battery pack or rechargeable AA's. The wii remote eats through batteries like crazy! You'll save alot of $$$."}
{"product_id": "B003VANOFY", "context": "Some headset will press my ears against the glasses, this makes my ears hurt after wearing for awhile. Is it comfortable to wear it with glasses?", "response": "I use to play Call of duty with these amazing headset for 10 to 12 hours straight, i never felt it was in my ears, that's why G930 is damn famous !!"}
{"product_id": "B00DE2W4PK", "context": "is this American  version  ? or Europe or middle east ? and this is 500GB ?", "response": "I bought this from America so in guessing it's the American version. This is 500GB."}
{"product_id": "B00EZPCX1A", "context": "why does the blue 2ds cost more than the red 2ds", "response": "I just got a 2DS Electric Blue with Mario Kart 7 for $99.99 at Best Buy. I would get one, while you can, this deal won't last!!"}
{"product_id": "B00DVEJA7G", "context": "So, can you listen to music you've downloaded but can you just listen to a radio station?", "response": "That use bluetooth so yes"}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "To be exact, 60 inches, or 5 feet"}
{"product_id": "B006NU6HAS", "context": "can this be used on fs2004?", "response": "i don't know ...i used it for FSIMULATOR X."}
{"product_id": "B00074TQFO", "context": "Do the pieces lay in the position that they fit together, so you don't have to rotate them. Does it have a back ground picture so you can tell if things are fitting together right.", "response": "You do not need to rotate the pieces, and yes, there is the option of a ghost picture to guide."}
{"product_id": "B00FQPQO4A", "context": "Will this game work with Windows 8?", "response": "Yes, works fine on my Dell with Windows 8."}
{"product_id": "B000TGQLYE", "context": "Does it work for reading PSX/PSOne memory cards?", "response": "Its a piece of crap that cant support more then 2 controllers"}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "No, just the Vita."}
{"product_id": "B008XHCLFO", "context": "I'm sure it won't but will this fit with a plastic case already around a 3DS XL? Please only answer if you know. Thank you.", "response": "It's a pretty tight fit around just the 3DS."}
{"product_id": "B0090ECASW", "context": "Every time I try to use the profile editor it keeps saying this \"Plug in the device you wish to configure and run the program again.\" what do I do?", "response": "Well I finally despaired and just put it in the bin..."}
{"product_id": "B00FEDP968", "context": "can you hear your own voice in the headset while chatting?", "response": "As in being played back through the speakers? That would only happen if you have your Microphone turned to \"Always Listening\" in the Windows Audio settings."}
{"product_id": "B00919RM1Q", "context": "Does the game have Elvis the King slot machine game on it?", "response": "I don't know.didn't open for me."}
{"product_id": "B007JM8ULS", "context": "What does it mean:   \"Does not allow Original Xbox game compatibility\".", "response": "The original X box 360 has a hard drive that clips in on top. The new slim 360 hard drive slides into the side panel."}
{"product_id": "B006IR6NH8", "context": "Will this work for non-racing-sim games, like Euro Truck Simulator 2?", "response": "Yeah, I play ETS2 with it. Just set the controls as you wish in the settings"}
{"product_id": "B00BQZ5EWW", "context": "how do i patch the pc version?", "response": "Patch should automatically load through Valve's Steam, which is the equivalent of EA's Origin."}
{"product_id": "B00IP0H4GA", "context": "Does can I play this game against someone else? (In the same room-not online) Thanks.", "response": "Yes. It has two player co op or versus offline"}
{"product_id": "B0050SXKU4", "context": "Is this game at all appropriate for a 13 yo boy? My son is begging me for this, and it doesnt seem appropriate IMO.", "response": "Yes and No, because there is inappropriate stuff like guns and killing but, I can see that your child wants this because it's fun. Just tell him to not do inappropriate stuff,"}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "Nintendo just announced an official adapter today! Release date pending... http://kotaku.com/nintendo-made-a-gamecube-controller-adapter-for-wii-u-1583342868"}
{"product_id": "B006QRMR4S", "context": "Can I play Japanese games on this? Because the Japanese version can only play games from Japan... So I don't know if it's the same with this.", "response": "You cannot play Japanese games in U.S. 3DS."}
{"product_id": "B004H7P0B6", "context": "Is this just one piece or is there a rubber attached to each piece that is removable?", "response": "They are one piece, no rubber.  Unlike the original ones there is no rubber coating on the top of the stick, they are one solid price of hard plastic"}
{"product_id": "B005CELN8W", "context": "Do you need an internet connection to play this game?", "response": "yes, you must be connected to internet. any game that shows DVD usually needs internet to work. get the ones that show CD and they will work off line or online. some games will play if you leave the disc in your computer"}
{"product_id": "B00EV4O8VS", "context": "How many GBs is this console?", "response": "32GB, just like the deluxe version. About 3GB is used by the system, but you still get about 29GB"}
{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "I am not sure. I run Win 7. Suggest you use forums to find answer."}
{"product_id": "B00965WK8K", "context": "How is this mouse for fingertip grip? Isn't the thumb area too narrow of a space with the buttons and the rest taking too much space?", "response": "I bought it as a gift, so I can't speak from lots of experience but it didn't seem to bad for a fingertip grip when I tried it out. I didn't really know where to put my thumb at first but it's not that much of a change in style for me to complain about it."}
{"product_id": "B00CD90R4K", "context": "how many players can play at a time?", "response": "On one system? You can have up to four people playing. Ultimate online season can only have one person playing though unless you do a single player season instead of online."}
{"product_id": "B007VTVRFA", "context": "How can I be sure I have a version that will let me play off-line. Mine still says on the box that \"persistent internet connection required\"", "response": "That is because EA never updated the box art they simply updated the game files to support offline, u should have no problem playing off lineIf u do just update the game"}
{"product_id": "B0098W4ZD4", "context": "Does this work with Linux?", "response": "Yes, however, RAT profile does not load automatically and speed of mouse is bad"}
{"product_id": "B006W3ZXEW", "context": "Is that a 7th button in the middle of the 6 side buttons or is it just a nub for resting your thumb.", "response": "It is just a nub for resting your thumb."}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "I honestly got this on sale, but there is no difference the sale is the only reason I bought it here ."}
{"product_id": "B008XHCLFO", "context": "does this fit the new 3ds xl?", "response": "Yes it fitMe and my grandson love itIt's not as bulky as it looks on the pic"}
{"product_id": "B006W41X1S", "context": "do these head phones actually allow you to hear the game play audio or just voice chat ?", "response": "Both. The downside is the batteries last for about 12 hours. The upside is you hear everything!"}
{"product_id": "B004JKZUJI", "context": "Does this work when playing games on the Wii Shop Channel?", "response": "Honestly I don't recommend getting this one. It ended up being a cheap knockoff of a Wii Controller and the buttons stopped working within like a month and got sticky."}
{"product_id": "B00C710AQO", "context": "Can I play it in spanish language?", "response": "I think there is a Add-On that you can Download from the PlayStation store that allows you to have Spanish speaking announcers in game."}
{"product_id": "B00GY4OAM0", "context": "is there free roam", "response": "Yes.  If you are not in the middle of a level you can freely roam. You can explore the Shire, Bree and many other way points."}
{"product_id": "B00D3TRMD8", "context": "is this the full version game or is this just the online code that I need to play this game.", "response": "This is the online code that you will need to unlock the game on the Steam platform. You will need to open a Steam account (free) and login to play. You will need an internet connection each time."}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "No, the item does not include the download code."}
{"product_id": "B007VPZR5U", "context": "Had a Razer Naga MMO mouse...it died after a year.  Any suggestions on what should I buy from Logitech to replace it?", "response": "Logitech G600 is a similar model, but I didn't used it, so I don't nothing to say about it."}
{"product_id": "B00DLRLDBO", "context": "does this work for the ps4?", "response": "Yes but it is still a piece of crap"}
{"product_id": "B002J9GDXI", "context": "Hey guys I was wondering how quiet this mouse is? Are the clicks very loud at night? thx", "response": "If you're using the mouse in the same room as a light sleeper, the clicks may disturb him/her.  They're not particularly loud -- I'd rate the click noise as a bit below average for mice."}
{"product_id": "B004S5PBM0", "context": "Is this for a 13 year old beginner?", "response": "All ages can play this game. When in game play the game will adjust it's difficulty automatically  to a level comfortable enough for the player."}
{"product_id": "B005EQE0YM", "context": "Are these headphones wireless?", "response": "Diane, no they are not. I specifically bought them for that reason because I have heard from owners of wireless headphones that the battery does not last that long and in order to keep using them after the battery dies, you have to buy another battery (which aren't cheap). Hope this helped."}
{"product_id": "B000H67DDY", "context": "Do the pedals work properly if I plug them in the Saitek Pro Yoke instead of my PC? I have a shortage of USB ports in my PC.", "response": "Yes that's how I have them hooked up"}
