{"product_id": "B003XNU1JQ", "context": "Is this the same game as the original, or is it a remake?", "response": "It is the exact game that you remember playing on snes!!"}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "Cable Length is 150cm (4\"9 ft)"}
{"product_id": "B00B5GZORW", "context": "What is the name of the other bonus games?", "response": "This game also includes: Girls with Secrets, Judge Dee The City God Case, Night in the Opera"}
{"product_id": "B004JKZUJI", "context": "Does it work with wii u?", "response": "Sorry for responding so late, but yes it does! It works for all Wii VC games and any other game that requires it. It also works for titles like Wind Waker HD, Mario 3D World, and DKC Tropical Freeze to name a few."}
{"product_id": "B004JKZUJI", "context": "how long is the cord", "response": "Over three feet. It plugs into the bottom of wii remote so cord length is not an issue"}
{"product_id": "B00G0OYHCW", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "It has the original battery that lasts 3-5 hrs."}
{"product_id": "B001CXYMFS", "context": "Does this have yaw control? As in, can you twist the stick clockwise/counterclockwise?", "response": "Yes it does and actually I have to disable it in X-Plane because it is just so much easier to use than my rudder pedals that I bought."}
{"product_id": "B003ZSN600", "context": "Does the wired controller can connet to PC through USB directly? or I need other tool support ?", "response": "This controller is PC and USB ready. It'll connect to any PC in a snap; no drivers or peripheral cables needed! The controller is a bit pricey, but very much worth it."}
{"product_id": "B001DNGCN2", "context": "How loud is it? only reason i'm looking at this because the current built in fan of my ps3 is too loud for my taste", "response": "It is not loud .. but it did not prevent my PS3 from overheating .. it might work for you .."}
{"product_id": "B002672Z80", "context": "Does this come with two remote controllers?", "response": "One remote and one nunchuk."}
{"product_id": "B002I0H2AG", "context": "I have a 4GB xbox 360e but I have a 36GB flash drive do I need a hard drive to play this game", "response": "If your gamer profile and game saves save to your flash drive I believe that should work fine."}
{"product_id": "B0065NP6NC", "context": "Is this version more, or less buggy then the regular edition? Less crash/freeze prone?", "response": "I have played this game for 50 or 60 hours so far. It has frozen up only a few times."}
{"product_id": "B007YLUCME", "context": "How do you turn it on after unplugging the usb?", "response": "Make sure the device driver installed when you plugged the USB into your computer."}
{"product_id": "B007WWW2C8", "context": "Is it compatible with Windows 8?  This is the complete first season or do we also need the season pass?", "response": "yes, it is compatible with 8 and this is only the game without DLC. The only DLC for this season is 400 days cost about 5 bucks on steam."}
{"product_id": "B001DPZE84", "context": "How realistic is this game? Would hours of playtime = the ability to(in an emergency situation) fly a plane crapily and live to tell the tale?", "response": "I like it and it makes me think I could fly a big plane if necessary.  Maybe just my ego though.  I have flown a couple of small plane but never pursued my pilots license.  I think it is realistic."}
{"product_id": "B00D6PTMB4", "context": "Could someone suggest a good guitar to use this with? Something cheap yet not horrible and sold on Amazon? Thanks!", "response": "Epiphone SG junior is a good beginner guitar and can be bought for about $110 shipped on amazon. It's a simple light guitar with a single humbucker pickup and an easy to play low action neck."}
{"product_id": "B0076DO5A0", "context": "Do I have to have Steam to play this game?", "response": "I use Steam to play this game. As always, may have to use a password, but I never had any problems with it. I have several games also on Steam and to-date no issues with it. Good game to relax with! Enjoy!"}
{"product_id": "B003JVF728", "context": "It may be a stupid question, but if I buy the disc version does it still use Steam?", "response": "Yes but I found this game very disappointing."}
{"product_id": "B004C4U1VI", "context": "Will this fit SCPH-70012 PS2 Slim models? Asking because I see various people saying it fits their PS2 Slim and some that say theirs do not.", "response": "I bought it for my PS2 Slim last year and it works well. I dont know what is the model number of my PS2 though."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "Yes that is what I have. Enjoy, I love it!!!"}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "Yes it does, no issues so far with Windows 8"}
{"product_id": "B002TLTBN0", "context": "is this controller wireless", "response": "No, u have to connect it to the wii remote"}
{"product_id": "B00BFOEY3Y", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "It's a free-spinning scroll wheel but be prepared because it does have some recoil to it. For example, if you touch it gently it may sometimes scroll back upwards again. I used to think it was just mine being defective but I have read forums that say it's a common issue."}
{"product_id": "B002I0K3PM", "context": "is this appropriate for 6 year olds", "response": "in my opinion is this is not Appropriate for 6 year olds as children copy imitation behaviors of the characters played as bad"}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "Absolutly. I have a galaxy s5 and it can hold my phone vertically.  A great buy"}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "You cannot, only one or the other, as soon as you plug in 3.5 mm audio it cuts off the wireless audio"}
{"product_id": "B0057S9SYY", "context": "does it work with the xbox one console?", "response": "Audio works because it still uses an optical port. However, as far as we can tell the mic doesn't work"}
{"product_id": "B0018YXM3Y", "context": "does this this game run on windows 8?", "response": "Yes it does you pleb."}
{"product_id": "B00FQFFPZO", "context": "can you turn cautions off", "response": "Yes you can. Go to the race settings, go to options, go to cautions and black flags, and the go to left until it says off. I hope this helps."}
{"product_id": "B00ANHBJBY", "context": "Does anyone know how well this holds up in games like Super Smash bros? The responsiveness and durability for example.", "response": "I doubt it the buttons on it are pretty crappy.  You have to push them very hard to get them to register.  Didn't play smash with it but it was pretty bad for mario kart."}
{"product_id": "B008VQ68C4", "context": "Would this headset be compatible with an Astro Mix Amp? Would it be suggested to buy an Amp with this headset?", "response": "I believe it should work with the astro amp with its USB Input but I used it without an amp and it worked excellently with good hefty sound right out of the box on its own."}
{"product_id": "B00CH923NE", "context": "Is the dream world too cheesey? Or is it not?", "response": "I'm sorry I can't give you a good answer. I bought the game for my grandson who just turned nine. He loves the game!"}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 7? I might as well ask if it works with Windows 8 although I am not a user of that operating system.", "response": "It works great on windows 8."}
{"product_id": "B00AFYAUYW", "context": "can you play wii u games on this???", "response": "Sorry, I purchased this for my daughter and not sure what works with it.  I hope someone else knows. Sweetpea"}
{"product_id": "B00GU4F4OM", "context": "How big is this thing?  I have large hands and FPS gaming can be a pain because my thumb and pinky usually drag on the mouse pad causing my shots to..", "response": "I came from a Logitech G9X mouse, and this mouse is noticeably bigger. I have smaller hands but I was able to get use too the size of this new mouse. I love the mouse, I can't believe the price I paid compared to the Logitech Mouse. Does not feel cheap."}
{"product_id": "B007CM0K86", "context": "Do it has scary zombies?", "response": "Its not that their scary per say just really creepy and they do jump scares which scared me."}
{"product_id": "B00F27JDUY", "context": "If you play a game where there is multiplier, would you be able to play with someone who is on an Xbox?", "response": "No you would it is a playstation based system so one couldn't play with people on xbox."}
{"product_id": "B00G6YJ60E", "context": "Can it be played on Windows 8.1?", "response": "should work. just make sure you have a good virus program. this hit me pretty good. but needs to be fixed asap. everything is fine..."}
{"product_id": "B009AFLXZM", "context": "I was thinking of using this microphone for something else. What type or size of plug in does it have?", "response": "It's actually a USB plug. XLR would be nice, though."}
{"product_id": "B00B3FIXJQ", "context": "the synk button is not working", "response": "Try taking a pen and pressing it with that if that doesn't work open the controller up and lift the button yourself."}
{"product_id": "B001E93IWI", "context": "Can it be used on pc>", "response": "No, strictly Xbox, sorry :/"}
{"product_id": "B00CX8VYM0", "context": "Can I play this on the PS4?", "response": "Xbox games cannot be played on a PlayStation console."}
{"product_id": "B008CXTW5G", "context": "What support is there for Mac OS X?", "response": "There's only basic support, sorry."}
{"product_id": "B00JC9SWSC", "context": "hello, its the fat version or slim version?", "response": "It's the super slim, top-loading model."}
{"product_id": "B002JVX5V4", "context": "Does this have a bigger board? An older person wants this and said that she's tried a couple Scrabble games and the board is really tiny.", "response": "Yes. The board is very easy to read. It opens in its own window and you can make it full screen or minimize it. I think she would like this one."}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "The adaptor already comes with it at no extra charge."}
{"product_id": "B009S4JZKK", "context": "can you create your own layout? or world? and is their a website for downloading other yards, engines, and or cars? and can you also upload your world so other can play? what you have created?", "response": "You might ask someone that is more skilled with this"}
{"product_id": "B005UI8V6C", "context": "can i play this game solo", "response": "I play sole all the time.  Once installed I don't even need an internet connection or the distribution disk loaded to run the game."}
{"product_id": "B004QRKWKQ", "context": "In the \"i need the receiver for play in pc?\" question, somebody stated that it no longer comes with a receiver. Is this still the case?", "response": "I do not know how the controller can work with the PC if there is no receiver. I do not know about now but common sense says yes, it still does come with the receiver"}
{"product_id": "B00DUANBQM", "context": "Did this version of the psp fix the awful ghosting issues the original version suffered from?", "response": "The one I ordered for my grandson has had no problem."}
{"product_id": "B004N7IIQ4", "context": "is the mix amp compatible with xbox one", "response": "Yes. It works just the same. You would just need the Microsoft Chat Adapter."}
{"product_id": "B00FOGFP0A", "context": "I have heard that PS3 games are not region locked? This game only came out in the UK and i have a US PS3, will it work?", "response": "Yes the game works 100% lucky me I didn't know it was the EU version only thing that does not work is any PSN codes u get as they are EU only: /"}
{"product_id": "B00ERDGMSA", "context": "does it work with win8 or win 8.1", "response": "Yes it does work with windows 8 and 8.1"}
{"product_id": "B00E9I1FPI", "context": "Can you play the Anthology on MAC?", "response": "Sadly no. Its a PC only."}
{"product_id": "B004XIQN3I", "context": "Does it work with any joystick? Which ones?", "response": "Sorry, I gave up on it also. Couldn't get it to work with my joystick."}
{"product_id": "B00G0OYHCW", "context": "in the wii u can i play with that games of the wii and gamecube like in the wii?", "response": "yes you can play wii games on the wii u but just make sure when it is lighting or thundering or raining plug everything out of the wii u"}
{"product_id": "B004QRKWLA", "context": "Although this controller is meant for the pc, can it still be used for the console as well?", "response": "Yes actually. My friend had his xbox 360 and one controller and I put in mine and worked perfectly."}
{"product_id": "B00B0QONB0", "context": "Can you tell me your  actual experience about this HDD, ? How many time do you have one ? And,  still working ?", "response": "It Works perfect. Thanks! but. I got the HDD about a month."}
{"product_id": "B0002GTXDM", "context": "If you and a friend were playing Gameboy Color games, would this still act as a connection?", "response": "No it will not it only worked with some gameboy advance games."}
{"product_id": "B001DU25UO", "context": "According to the May Flash website under the support/driver download sections it says it supports windows 8 as well", "response": "I use it on windows 8 every day. It works a little different though. You have to go to control panel and game controllers, double click it, and it will initialize the driver properly. Works well for 4 players at once!"}
{"product_id": "B009LGO88E", "context": "Will this function with an American 3DS XL, or is it only compatible with Japanese 3DSXLs?", "response": "yes. it is region free.. the best investment you'll ever have 10/10"}
{"product_id": "B003O6C0V4", "context": "Does that work on the wii mini ?", "response": "I don't know. I don't have a Wi mini. Sorry!"}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "Just checked out Gamestop and they have it listed as November 25, Black Friday.  Seems unlikely but it may or may not be out then."}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "It will pair with the Xbox for about 5-10 min and then something glitches. But I have no problems at all when I use any other type of battery pack."}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "I dont have a Wii U so I have no idea sorry"}
{"product_id": "B005BLAIGE", "context": "what types of games are there?", "response": "Is Freecell on this"}
{"product_id": "B00B5QLS4A", "context": "This mouse is 100Hz or 1000Hz? Just wondering if it was a typo or not.", "response": "Here's the specs from Corsair's website:1000Hz/500Hz/250Hz/125Hz"}
{"product_id": "B009DL2TBA", "context": "does it play Japanese games", "response": "I don't know. To my knowledge I've never had a Japanese game."}
{"product_id": "B0087ZMAUS", "context": "Are these open eared?  Will i be able to hear whats going on around me and myself talk? Thanks.", "response": "You can only hear what is going on around you if the volume is off or low."}
{"product_id": "B004AM5RAM", "context": "when you recieve the box will the box be the regular razer box or an amazon box, and will it have a wire to play wired itstead of wireless.", "response": "Normal box and it come wired or wireless which ever one u want"}
{"product_id": "B0098W4ZD4", "context": "Is the Precision Aim Mode button programmable, or can it only be used to drop the DPI?", "response": "It's non-programmable. I tried using it for WoW. Nothing."}
{"product_id": "B0081Q58AW", "context": "Is this key redeemable on steam?", "response": "No you have to buy through steam use their game"}
{"product_id": "B00BS520SG", "context": "Why does my start button not work when i use this to play super smash bros brawl? Neither the start button on the gamecube controller or the + button.", "response": "Double tap start button for proceeding and hold start button for home menu"}
{"product_id": "B002I0HJG8", "context": "Does the PC download version come with the codes? or do you actually have to purchase the physical copy which requires waiting for the shipping?", "response": "I am not sure if the download version gives you codes. All I do know is that the Hard copy comes with the code inside the case. I would recommend not taking a chance and just waiting for it."}
{"product_id": "B002CJ8Z04", "context": "you can play this on the gameboy color right?", "response": "No, it's gamboy advance, gamboy advance SP, and DS compatable."}
{"product_id": "B003S9WJ9A", "context": "Can you use it to permanently connect an old 360 hdd for saving games and such?", "response": "In the directions it explicitly says 'not intended for long term use'. So I would say no, but I haven't tried."}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "yes it does work with windows 7"}
{"product_id": "B001DNGCN2", "context": "I have the 2nd/3rd gen. \"fat ps3\" my cable ports are spread out on the back of the ps3, how high is this fan connected to the PS3 in the back?", "response": "It covers the back of the PS3 completely and is flush with the system. Doesn't really work though as it actually caused my PS3 to overheat faster."}
{"product_id": "B00C710AQO", "context": "does anyone has this problem: when i play it and then turn off the ps3... and then i try to play it again it doesnt work! it gets stuck. Any help?", "response": "It does that sometimes. u have to remember to save it before u turn it off"}
{"product_id": "B002YVD3KM", "context": "Does this work on a Mac?", "response": "I use it with the newest version, OS X 10.9.2, and it works great. Plug and play right out of the box."}
{"product_id": "B00FAN4LRA", "context": "can I use these with xbox one ? someone please answer", "response": "No, this is a PC only headset, unless you can find some adapters."}
{"product_id": "B00656HLGO", "context": "Just to confirm, will this work with the Xbox 360 Arcade console?", "response": "I own a gen 1 Xbox 360. The very first white one. and this HDD works perfectly with it."}
{"product_id": "B00IAVDPSA", "context": "Does it uses battery or is rechargeable???", "response": "It takes batteries, AAA I think."}
{"product_id": "B007XVTR3K", "context": "Are the opponents humans or zombies?", "response": "The only time the opponents are zombies is when you play the zombies game. It's separate from multiplayer where you play bots or people online"}
{"product_id": "B000OYMYZQ", "context": "How many charge-and-play kits can be plugged in at the same time to the Xbox 360 250gb console?", "response": "3. two front, 1 rear of original design (white or black). 4. two front, two rear of Slim.Using rear ports loses at least 15\" of distance from haveing to wrap around the rear of the xbox and up a side."}
{"product_id": "B007FTE2VW", "context": "Does this game have a product code? You need one to play it.", "response": "yes you need to register. you can now play offline so you may not need to register but I bought mine when it was online only. there have been a few updates so you may not be able to get the updates without registering."}
{"product_id": "B00HWMP0TU", "context": "Does the PC DVD version require any downloading or is it all on the DVDs?", "response": "I used the DVD to load the whole game onto my computer. However, Steam immediately downloaded an update once I logged on. I'm not sure if you can just play it out of the box without updating or not. Hope this helps."}
{"product_id": "B002DUCF8A", "context": "Works on X plane 10 without downloading drivers?", "response": "I don't know, I use only flight simulator."}
{"product_id": "B0072A4JVW", "context": "Does this get rid of having to use the rear touch pad?", "response": "No, you can still use the rear touch pad"}
{"product_id": "B004AM5RAM", "context": "Do you notice any latency between clicking and games responding? I have had terrible wireless gaming mouse experience.", "response": "Sorry, my mouse is not wireless so I can't answer that.  I don't like to click and have nothing happen or have the battery die at inopportune times."}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "It is the smaller one. Not that big of an palm rest on this keyboard."}
{"product_id": "B0050SY4DG", "context": "Is this download only or the physical disk?", "response": "It's just the physical disk"}
{"product_id": "B00DBDPOZ4", "context": "The description claims 30 hours of battery life, but how much did you get out of it before having to charge it?", "response": "To be honest I haven't really timed the battery life. However you can pretty much charge it anywhere that has USB."}
{"product_id": "B000BTBMWA", "context": "does this have the hdmi link to the xbox and component for the tv?", "response": "No. Just component or std video with std audio RCA connections."}
{"product_id": "B00AQ2BLI2", "context": "when recruiting units is it like Rome 1 that is 1 unit per turn or can it be multiple?", "response": "It can be 1 per turn depending on how upgraded the castle and province is. Generally ashigaru (commoners with weapons) units are recruited quickly. (1 turn = 1 season) More skilled units (Samurai, Kisho Ninja, Warrior Monks) will take longer 2-4 turns."}
{"product_id": "B000K9Q5NW", "context": "Do you have to use two feet to gas/brake because there's a post going down the middle?", "response": "Yes. But I use two feet. You should probably check out the Playseat where the steering wheel base comes out for the seat instead."}
{"product_id": "B00CMC6HZ6", "context": "Is Cincara on 2k14 or 15?", "response": "Sin Cara is in 2k14 most likely 15 as well"}
{"product_id": "B009LGO88E", "context": "good I want to know because it says console not included in case it is not a nintendo 3ds xl ??", "response": "This is not a 3ds XL. It's just an attachment that you put on your 3ds xl that you already own in order to add a second circle pad for specific games that use it."}
{"product_id": "B009GZX49Y", "context": "good morning I wanted to know if this trilogy are video games or play 3 games .... if they would make the purchase ... excuse my English I am from Ven", "response": "The disc allows you access to each individual game.  Each game will have to download to your PS3 once before you are able to begin playing.  Hope this helps."}
{"product_id": "B00F68LBE0", "context": "can i plug the charger in and charge the controller while playing?", "response": "Yes you can I do it all the time"}
{"product_id": "B003O6G5TW", "context": "Want to buy my nephew a Battlefield game and #4 seems to have to many glitches. Between #2 & #3 was wondering which was the better game?", "response": "Buy #4. Despite the few glitches it is for much more the best one of all. I own it in pc version and every day i play is just an amazing new experience."}
{"product_id": "B0050SVMYA", "context": "can we play gameboy advance games on the 3ds and 3ds xl?", "response": "No the 3ds takes the smaller disk. The regular gameboy games are to small. Jenny McAllister"}
{"product_id": "B0029LJIFG", "context": "Can I send electronically to someone?", "response": "It depends on who you send it to,for family and friends as a gift  buy the card send them the 26 digit code on back of the card thru email or cell phone, once code is used card is no good,if it's for selling to a stranger,it won't work."}
{"product_id": "B00004XRBB", "context": "Anyone run this on windows 8.1", "response": "I have Windows 8.1, but I am waiting to install it in this platform, as son as I try it I will send you an answer..."}
{"product_id": "B004X56PWK", "context": "Will this game work with Playstation 4?", "response": "I'm not sure because we have a PS3"}
{"product_id": "B0000512IE", "context": "Could this be adapted to be used in racing games also?", "response": "tes... they come with a adapter that prevents the pedals from moving back and forth allowing you to use the toe brakes as a gas/brake pedals"}
{"product_id": "B0038PBF1W", "context": "Can I play this offline?", "response": "You can play offline all the time"}
{"product_id": "B002B9XB0E", "context": "Does it come with a CD to configure controls or does it have plug and play compatibility?", "response": "Plug and play. You may need to configure it in your control panel,  but I didn't."}
{"product_id": "B003O6CBIG", "context": "Hello, can anyone please tell me if I can play as Michael Myers in this COD? or is it only the ps4 version? Thank You!", "response": "Yes you can play as Michael Myers on the map Fog"}
{"product_id": "B002VBWIP6", "context": "We are buying 1 XBox console & we have 2 sons. Do we have to buy 2 Live memberships for them to both play online or can we just buy 1??", "response": "You can have them share an account. Only thing is that you can't have them both signed in at the same time, so if they wanted to do 2 player online then it would be better to have 2 online accounts"}
{"product_id": "B005S0KH7I", "context": "Is this compatible with windows 8?", "response": "I only used it for windows 7. Although from experience with the windows 8 platform you want the windows key to be nice one and this one does have a dent in it so it would also depend on how you feel about having a not flat fairly heavily used key."}
{"product_id": "B00CMC6HCY", "context": "in the storymode do you HAVE TO DO THINGS  to move on in the story line", "response": "In story mode you will need to play certain characters and win certain matches as those characters to move on.  Thank you kindly for your inquiry and have a great day."}
{"product_id": "B001V9PTVE", "context": "Can the games run on windows 7?", "response": "Fallout 1 and 2 ( w/ color issues) can but Tactics requires a patch which may or may not work. IT will install but give you a disk error message. If you have the patience to troubleshoot your PC then go for it."}
{"product_id": "B00GANWVJE", "context": "Is it different enough from ALTTP to where I won't feel deja vu?", "response": "I say no. It's very similar, from the layout of Lorule to the placement of all of the dungeons that I constantly had a feeling of Deja Vu. However, the Deja Vu isn't what I would say is the worst part of this game."}
{"product_id": "B004G5TUJM", "context": "does this work on all racing games even nedd for speed games", "response": "It does, it is really only a controller. It does not do force feedback"}
{"product_id": "B00FQFFPZO", "context": "do you need the steering wheel and foot controls to operate this game?", "response": "No I don't think so. I think you should be able to use the hand held controller in all aspects of the game."}
{"product_id": "B00B3PDH5G", "context": "What exactly do you need to make this compatible w/ Xbox One (of note--you are talking to a video-game ignorant mom here)?  Thanks!", "response": "If the headphones are brand new, they will come with everything you need. It's usually just a 2.5 mm to 3.5mm jack that plug from the headset into the controller although I have a feeling that XBOX ONE doesn't even need that cord."}
{"product_id": "B0065NP6NC", "context": "Which one is better fallout 3 or new Vegas", "response": "New Vegas.  There are several DLC packs that enable you to start out with more equipment, so you aren't left hanging with no ammo, etc.  This game is better, but Fallout 3 was okay."}
{"product_id": "B00IRHE892", "context": "Is this compatible with Mac?", "response": "Yes, it has specific Mac software (as of Dec 2015) that allows you to customize all the buttons, tracking speed, surface, macros, etc. You can store them on the mouse or computer; I store them on the mouse and have had no trouble so far."}
{"product_id": "B00DPJBTM6", "context": "Does it work on the ps4?", "response": "Yes if it's the usb version"}
{"product_id": "B00IVJ1M7M", "context": "I saw one review saying that this may only work for UK versions of games, is that true?", "response": "No that's not correct, I use it now on all my US games. (Pokeman Y, Sapphire, Kid Icarus, Starfox, etc etc etc."}
{"product_id": "B001O3066U", "context": "Replies indicate this edition will play on Windows 7 Home Premium.Reviews in other places indicate there are problems. What do you think?", "response": "The box says its compatible to both windows 8/7.  I have windows 8 so I can't answer the question about 7"}
{"product_id": "B00CJ7IUI6", "context": "Is the DLC in the disc or is it a download code?", "response": "The disc includes the DLC"}
{"product_id": "B004SJFJUA", "context": "Does it work with 2ds", "response": "no, it only works with the original 3ds. It will not work with a 2ds or a 3ds XL"}
{"product_id": "B007W8S2MG", "context": "is this in English speaking when played? or English subtitles?", "response": "The spoken dialogue is in English.  The characters still have Japanese names such as \"Yosuke Hanamura\", but all the dialogue is in ENglish."}
{"product_id": "B000RA778G", "context": "I love this game but now Im not able to play it and Im not sure why please help I miss my game", "response": "You may want to try to uninstall and reinstall again that fixed my program i hope it works for you !"}
{"product_id": "B005M0KSIM", "context": "Does the game download from the disk to my PC, or do I have to use Steam? I wont use Steam on my computer.", "response": "You have to use Steam to play this game."}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "Yes it does an xbox brand hdmi which is high quality!!"}
{"product_id": "B00D6PTMSW", "context": "Do I need to have a hard drive installed on my Xbox 360 to run this game?  I have a version of the Xbox without the hard drive.", "response": "Yes, a hard drive is required for your xbox 360."}
{"product_id": "B00I4C2EKA", "context": "I already have CIV V on Steam. Will this install just the content I don't have (e.g. the expansion packs) or will it mess up my current game?", "response": "Gill,It appears to install the expansion packs you don't have.  The game I had in progress continued from where I had left off, although it was obvious from the opening screenshots that new content had been added overall.  Hope this helps."}
{"product_id": "B0032MM2P4", "context": "is there a shuffle feature during the game?", "response": "I just answered your question,but If you click onto Scramble at the top of the game it will shuffle the game while you are playing it."}
{"product_id": "B00CRL9TU2", "context": "cAN i USE THIS GAME ON A PLAYSTATION 4?", "response": "Just buy the PS4 version of the game. PS2, PS3 and PS4 diskc can only be played only on the console for which they are made and are so marked. Some new games for PS4 are also released for PS3. Gran Turismo is one such game. I hope this helps."}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yes, it fits, comfortably."}
{"product_id": "B001EYU1WS", "context": "Is this product compatable with windows 8", "response": "Yes!!, have to upgrade the drivers in Saitek web page!"}
{"product_id": "B00B70WKUK", "context": "can i redeem this on steam", "response": "sorry, but I don't know the answer to this"}
{"product_id": "B00EF1OGOG", "context": "When used to charge an Android (Nexus 5, in particular), does it show up as \"Charging (AC)\" or \"Charging (USB)\" in the Battery menu?", "response": "On my Nexus 4 it says charging (AC)"}
{"product_id": "B007VFHIHA", "context": "I have a desktop windows 7 thats been upgraded from XP will this game work on it?", "response": "The game is compatible with Windows 7, however, if your computer does not have a video card it will not run well - the game will be slow."}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "This controller is for the Wii U only and will not work when playing Wii games on the Wii U."}
{"product_id": "B00DBDPOZ4", "context": "Can you use the cable to connect to a windows PC?", "response": "I just plugged it into my laptop and it's charging my controller, so I'm going to say yes."}
{"product_id": "B0071NH8B8", "context": "is this unlocked for any carrier??", "response": "I don't believe it is locked. My Vita when I bought it from here came with a sim card for at&t; so I'm guessing that you could just put another in because Sony says it's not locked to any specific carrier."}
{"product_id": "B00F4GSAYI", "context": "I know there is a second disc for the dlc's. Do I need to install the second disc and play them with the first disc?", "response": "Yes, to play the dlc content the second disc needs to be installed to the systems hd"}
{"product_id": "B00HWMP0OU", "context": "This game is for girls or you can also create a boy protagonist?", "response": "Hi, if your mii that you built is a boy there should be no problems playing as a boy. I am pretty sure you can build a boy too, it has been awhile since I built mine. A fun game for sure, have fun with it"}
{"product_id": "B008X73CE8", "context": "Where's the manual?  I purchased/downloaded the game, but no user's guide?", "response": "It is in the folder titled support/manual/english."}
{"product_id": "B003O6G5TW", "context": "what disc region is this game?", "response": "The disc is locked for USA used only."}
{"product_id": "B00BDX1M00", "context": "Is there a way to set this up with the ps4?", "response": "I'm not sure you can check YouTube and see"}
{"product_id": "B00EZKNT5O", "context": "How is the quality on these? I'm aware it's a licensed controller, but I'm still curious. PC gamer, have had Logitch F310 fail on me in under a year.", "response": "My son says his still works and works well."}
{"product_id": "B00I4BGNVM", "context": "does this game works on windows 7 or 8?", "response": "The Game works on Both"}
{"product_id": "B000LQ4HTS", "context": "what are the box dimmensions?", "response": "Was like 22 x 12 x 9 something like that. Not massive. But not,tiny by any,means"}
{"product_id": "B000J18SR2", "context": "Will this play with a 2D video card and Windows 7?", "response": "It will not work on anything newer than Widows XP, maybe Vista.  But not Win 7."}
{"product_id": "B00H8NS1K8", "context": "What systems do these work with? or just PC?", "response": "In aux output device, phones tablets, PCs, PS4 and Xbone console, mp3 players..the like. On the PS4 the controllers have an aux port on them so it works for game sound and voice chat. And it will pick up your voice. Same goes for that Xbox one controllers as long as you have the stereo headset adapter."}
{"product_id": "B00BT9B2LC", "context": "Is the Japanese 3DS compatible with an American 3DS charger?", "response": "Yes. That's what I am using now."}
{"product_id": "B00I9UVY7G", "context": "in order to play the worldcup tournament should we connect to xbox live or we can the play the game witout connecting xbox live?", "response": "Puedes jugar sin conectarte a xbox live"}
{"product_id": "B00005NIMB", "context": "Will this work on Win8 64bits?  I will play mostly the \"Battlefield\" games.", "response": "If win 7 64 worked for it 8.1 should as well"}
{"product_id": "B00FQFFPZO", "context": "Can I play my career as other drivers eg Jeff Gordon etc?", "response": "yes you can. you can pick any of the sprint cup drivers"}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "Yes I run it on a Win 7 Machine with no problems I also run it on a windows 8.1 machine with no problems."}
{"product_id": "B001BZ2F56", "context": "Does it work for a Mac computer?", "response": "I doubt it.  In the system requirements, under OS it only says Windows XP and Windows Vista."}
{"product_id": "B00HVBPRUO", "context": "is there a separate volume button for chat sound and game sound?", "response": "No, there is a master volume button and a game/chat load balancer button.  So with one you can control overall volume, then you can use the other to raise game volume or chat volume as needed."}
{"product_id": "B00FM5IY4W", "context": "will this play on the 360?", "response": "Nope no one game work on 360 currently. =["}
{"product_id": "B007W8S2MG", "context": "Is this a code for downloading or a game card?", "response": "this is a game card that is the actual physical copy."}
{"product_id": "B00HK74G2E", "context": "Where is the All-Stars Battle Royale game?  Is it downloaded or CD included?", "response": "the game is included in the box"}
{"product_id": "B00DH1KRQQ", "context": "What Games can you use this for?", "response": "Pretty much anything that is not locked to a specific game type"}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "It's definitely better than the stock trigger."}
{"product_id": "B00EM5UFF4", "context": "I bought this on the 360 can I upgrade this to the x1 without having to pay full price again.", "response": "stats still dont transfer.. sucks .. I was a level 70 on the 360 and was shocked when I was bumped down to level one. Barely a 37 now."}
{"product_id": "B0086UK7IQ", "context": "Did they iron out the firmware on this mouse, eliminating the weird motion skipping it suffered from?", "response": "I don't know if they ironed it out but I have not noticed any motion skipping at all."}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "No, it doestn't even work with an android phone. This thing was a waste of money."}
{"product_id": "B001BYMZ5W", "context": "can this hook up to ps3? ps4? i have a monitor with headphone jack, that works?", "response": "If you only have one input, you will need to use a Y connector. If you have one for speaker and one for mic you will be able to plug it in without an issue. It uses the 3.5mm ends."}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "No. Fat version only (1000 series)"}
{"product_id": "B006IOAHPK", "context": "Does this game contain a printed manual? Does it have any insert in the box?", "response": "No manual or insert."}
{"product_id": "B003O6CB6S", "context": "Is it 2 player?", "response": "not on the same machine. How ever it can be up to 64 player on line."}
{"product_id": "B005VA5D24", "context": "does this hard drive is compatible with the xbox 360 s console dont know if is first or second generation how do I find out", "response": "2nd Gen 360. The 1st Gen is rectagularish, 2nd is square like this. You can find out by simply looking at the top of your 360."}
{"product_id": "B00EIM3BV6", "context": "I have plugged in the cord from the headset to the controller, and while the mic icon is on the mic is not working. Any hints?", "response": "Bring up and down the mic see if that works if not then you must have a bad wire or headset"}
{"product_id": "B00C2B355W", "context": "Do I need the transmitter to use the headset? In other words, can I listen to music without the transmitter stand from my phone?", "response": "unfortunately u need plug ur phone to the tansmitter. But  can leave the phone by the transmitter and listen music around all ur house."}
{"product_id": "B0006PJAZU", "context": "I have some old file from Windows 5.1 will this software open them?", "response": "I doubt it - the 2 programs I purchased wouldn't work for ,e"}
{"product_id": "B000IZAQD8", "context": "can it play ps1 games", "response": "Hi Jodi, Yes it can play ps1 games."}
{"product_id": "B00DWXUYN0", "context": "Is this case compatible with the New 3DS XL?", "response": "Yes, I have the XL with a case on, and it still fits"}
{"product_id": "B008KH7NZA", "context": "Does this work with the Xbox One? I bought the Chat adapter and I get game audio but no chat. I also updated the controller.", "response": "No it's only PS3 PS4 and Xbox 360"}
{"product_id": "B005BLAJ68", "context": "does it play pitch?", "response": "Yes it does!  I play it all the time."}
{"product_id": "B00B0QONB0", "context": "Are you able to play original Xbox games on this hard drive?", "response": "Yes, of course,, for example ghost recon future soldier, gta v , sniper ghost warrior, call of duty ...etc ...is good hard drive"}
{"product_id": "B004W1IX1G", "context": "Does this work with the Wii U?", "response": "I wish I had the answer, but I don't know if the Wii and the Wii U games are interchangeable.  A family member had Wii Sports Resort on their Christmas list as they have the Wii game system."}
{"product_id": "B00D6NPFDK", "context": "What language is this game in? I recently purchased a differnt one in Spanish accidentally and I need an English version.", "response": "I ordered this for my sons bday and it was in English"}
{"product_id": "B00CTKHXFO", "context": "which to buy, Legacy or HD Collection? do I need both? differences? thanks in advance ~ from: a noob.", "response": "this legacy collection comes with several games in one. i'm unfamiliar with the hd collection. thanks for your question."}
{"product_id": "B0015PHMFU", "context": "Does this fight stick work with Mortal Kombat X on PlayStation 4?", "response": "I may be wrong, but no, it does not."}
{"product_id": "B004RMK4BC", "context": "Do i have to have a real  US address to purchase this item ?  Thank you ..", "response": "the code you enterd may not be correct ormay no longer be valid>>> that what i receve"}
{"product_id": "B00886XQO0", "context": "Can I use this on PS4", "response": "The Tango headset model is compatible out-of-the-box for surround-sound game audio on the PS4 console. Chat compatibility will require a PS4 Chat Cable or PS4 Talkback Cable (sold separately) connected from the headset to the bottom of the PS4 controller."}
{"product_id": "B007CM0K86", "context": "What is the difference between the Standard and Survival Edition?", "response": "Survival edition not only comes with not only the game, but extras like an art book and comic."}
{"product_id": "B007W8S2MG", "context": "In terms of the story line, will everything still make sense if I haven't played Persona 1, 2, or 3?", "response": "Each game in the persona series starts anew with their own independent story, so just like with final fantasy no persona game so far has been a sequel to any in terms of story. Just a little spoiler warning in terms of story P1-P3 have pretty dark stories, P4 is golden for a reason."}
{"product_id": "B000NJBD90", "context": "Can this be used to connect a PS2 controller to a PC?", "response": "Yes. That's the main thing I do with this adapter. Just be sure to press the analog button on the controller for it to work properly. Also, the controller may not work by default in newer games due to the way they are programmed. Using a program called x360ce can allow it to work in those games as well."}
{"product_id": "B000SOYG8U", "context": "is it about the clone wars pleace answere", "response": "Unfortunately, no. Although it could have been, LucasArts chose not to do any Clone Wars campaigns in this game. Pity. The Clone Wars had a lot more variety of ships and troops to choose from, and who wouldn't want to take Torrents against droid fighters? Not to mention seeing how a Banking Clan frigate stacks up against a Venator!"}
{"product_id": "B00BGAA29M", "context": "I have a PS4 and looking for games for my 5 year old son. Would he be able to play this if not do you suggestions?", "response": "I feel that it would be a good game for kids.  It doesn't have any blood or gore.  It's more along the lines of the old fashioned type video games."}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "Not that I can see...  wondering why I bought this..."}
