{"product_id": "B00009ECGK", "context": "Do I have to pay monthly or yearly to play WOW and how much is it?", "response": "Sorry, I don't play online."}
{"product_id": "B00A7VK16A", "context": "Does the ps4 fit in the case?", "response": "Just tired it and it can hold a PS4."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "I tried it on my windows 7 64 bit, and it wouldn't work said it was not a valid win32."}
{"product_id": "B0050SX9I2", "context": "Does this work with the PS4? If not, is there a PS4 remote available?", "response": "No, it doesn't work with the PS4. This is the entry from the list of compatible accessories (link provided):PlayStation Media / Blu-ray Disc Remote Control - PS4 supports CEC (HDMI Direct Link) and can use your TV's Remote.http://community.us.playstation.com/t5/PlayStation-Peripherals-Support/List-of-Compatible-PS3-Accessories-for-PS4-Updated-2-7-2014/td-p/40831841"}
{"product_id": "B00A1AQJAO", "context": "Does it have a place for inserting the cartridge or do you insert the action replay then remove the action replay once the codelist is loaded?", "response": "You insert it once so that the code list can be loaded."}
{"product_id": "B004G5TUJM", "context": "does this work on all racing games even nedd for speed games", "response": "Yes it seems to work with all of our games"}
{"product_id": "B0045FEEAS", "context": "Can this particular model play GameCube games?", "response": "Absolutely,the red Wii is backwards compatible. I did have to buy a Gamecube controller and memory card. Not all Wii's are able to play Gamecube games but this model does."}
{"product_id": "B006W41X36", "context": "can you pair wireless headphones to it", "response": "You can connect the audio output on this unit to the input of the unit for the wireless headphones and it does work. I used x32's in this fashion and it works perfectly."}
{"product_id": "B004QRKWKQ", "context": "In the \"i need the receiver for play in pc?\" question, somebody stated that it no longer comes with a receiver. Is this still the case?", "response": "The one sold by Amazon does. The one sold by GPStock does not.  Read my review it explains everything in detail."}
{"product_id": "B00FA6YFTQ", "context": "Is the key for Metro: Last Light  the complete edition?", "response": "I wanna buy this Game in Steam Version. It Is 007 The LegendHelp Me :("}
{"product_id": "B008NMPSEU", "context": "After installation, would I need the disc to play?", "response": "I didn't need the disc.  However, on some of these games, it requires a disc."}
{"product_id": "B003JVF728", "context": "Does this game have bad reviews because of physical problems, or are people just one starring this because they don't  like the in game features?", "response": "I Don't Like  because is not crossplatform,   i like to get my money back , i don't want this licensed, or sell to another one or change for another licenced like star craft 2"}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "Well I don't know if it works on all smartphones But with the LG phones it tends to cut off on its own Even in the middle of a conversation and then it'll reconnect after a while"}
{"product_id": "B008O510Y8", "context": "Any difference between PC 350 and PC 350 Special Edition? Which one to buy?", "response": "There may be other differences, but the most notable difference for me was that the PC-350SE, like the PC-360, has a volume adjustment knob on the right ear-cup and the microphone mutes when you swing the boom up. On the PC-350 the mute switch and volume-adjustment are on an in-line fob."}
{"product_id": "B000HZFCT2", "context": "does it work for minecraft?", "response": "Minecraft for PC never came with a gamepad option, you'll need to use a program called JoyPad to play MC... But that goes for any gamepad not just this."}
{"product_id": "B0050SYDEQ", "context": "Can we tune and upgrade cars like on the track based forza versions?", "response": "Upon searching game facts for Forza Horizon, we found that you can upgrade cars but cannot tune cars.  Thank you kindly and have a great day."}
{"product_id": "B00FM5IY0Q", "context": "Is this a FPS game?", "response": "No. It's a third person survival game."}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "It does not work on Windows 8.1.  Gets an error and I have not found a workaround and EA has not replied how to fix it."}
{"product_id": "B004N7IIQ4", "context": "Is the mixamp compatible with PC ?", "response": "i have not used it but am 99% sure it is if you go to the astro website and hit chat they are super tesponsive"}
{"product_id": "B00C71034I", "context": "Does this game allow split screen mode?", "response": "no.   I see my kid plays by himself.  The system wouldn't let split screen mode to turn of so his brother cannot sign in to play with him.  I just see one big screen."}
{"product_id": "B00FEDP968", "context": "Does anyone know if this headset works with the ps4 either through Blutooth or by the cable?", "response": "Unfortunately the only thing the Bluetooth is able to connect to is a smart phone. As for cable connectivity, it is not intended for consoles. If you want a headset that is surround and for consoles then I would suggest something along the lines of astro, triton, or turtle beach headsets."}
{"product_id": "B008TP1OKI", "context": "My xbox 360 S hard drive has a model number --1451. Is that what this product is also? Model 1451?", "response": "If you have the newer xbox 360 with the internal hard drive then you will need this harddrive"}
{"product_id": "B00IRHE892", "context": "Can you change the color of the lights?", "response": "No, the lights on this mouse are blue. You can't change the color. However, you can turn the lights completely off."}
{"product_id": "B00B98HF1O", "context": "Is this the Avengers?", "response": "Yes, it is. All the characters in the game are involved in the Avengers team."}
{"product_id": "B00286BZ4Y", "context": "Does it work on a Mac?", "response": "Hi,  No, the one you are looking at is for Windows.  To find a Mac one, go to the Amazon Search and type in Jeopardy Deluxe Mac and you should find them.  The box is white for the mac, blue for the windows.  Thanks. Rocky"}
{"product_id": "B00D6PTMSW", "context": "Does the game help you tune your guitar?", "response": "Yes There is a tuner built in that quite honestly is better than my $50 Korg. As well most of the songs have different tuning so you retune frequently and you can stop during a song or exercise to use the tuner if you think you are out of tune."}
{"product_id": "B009GZX49Y", "context": "Are all three games on the disk or is only one on the disk and the rest have to be downloaded?", "response": "All three games are in the disc, but AC 2 and Brotherhood have to be installed on the PS3's or Xbox's HDD and the disc has to be in the console in order to play those games, Assassin's Creed Revelations doesn't install as it plays directly from the disc"}
{"product_id": "B00ATF5YYI", "context": "if I buy the PC Download, (I just want to make sure so I get my money's worth), I can download this on steam, im still a bit confused", "response": "No, this will not work with steam."}
{"product_id": "B003O6JKLC", "context": "I ordered this today and i am confused.  Is this the \"E\" model or the \"slim\" model?", "response": "I honestly do not know. Its a regular Xbox. Not slimmer than my other one. I'm sorry. I bought it for my 10 yr old. I'm not to game console savvy."}
{"product_id": "B0050SXKU4", "context": "Is this US version? like will it work on a ps3 from usa?", "response": "Of course. I got it same day as US release. My PS3 is US bought as well. Happy gaming."}
{"product_id": "B0053B5RGI", "context": "Hi. We're new to Pokemon. Just bought my daughter a 3DS. Would Pokemon X be a good game to learn about the game for a beginner? Any recommendations?", "response": "You shouldn't worry about your child not being able to learn how to play because all pokemon games have a intro about how to play. In simpler words the beginning of the game teaches you how to play."}
{"product_id": "B00F9RGFEY", "context": "I have two game systems. PS3 and PS4. This team works for both?", "response": "Yes it does work for both. I also have those two systems and use the headphones for both of them, if they aren't working, maybe you need to check how you connected them"}
{"product_id": "B000R9A9JG", "context": "Is this the replacement for the Nyko Charge Station Rechargable Battery Pack Item # 87000-A50-0107?", "response": "yes, and they work great and are at a great price!"}
{"product_id": "B008IYCVK2", "context": "I am playing this, is there any way to save the game state?  I haven't figured it out or, for that matter how to exit gracefully.", "response": "When you are in middle of the game... no matter what screen you are, tap \"Esc\" on your keyboard, that will pop up the menu, and there you'll see the save option!"}
{"product_id": "B008O510Y8", "context": "Is the adjustment band made out of metal?", "response": "Can't say exactly but it looks like it is made of thing spring steel."}
{"product_id": "B007WWW2C8", "context": "Where do I put in the game code?", "response": "At the top of the main Steam window, Click on Games then \"Activate a Product on Steam.\"  You enter the code there and proceed through a couple of screens to trigger the download and install of the game.  Enjoy."}
{"product_id": "B003O6EDSM", "context": "So it comes with all the Mass Effect Games? Right ?", "response": "Correct. And they are all incredible."}
{"product_id": "B007FVVXXA", "context": "Can you use one of the ports to hook up a external hard drive to the PS3?", "response": "Just make sure that your drive is formatted in FAT32."}
{"product_id": "B00GS6A6V8", "context": "How would this work if buying as a gift?", "response": "I loved it I'm in my teens"}
{"product_id": "B008TP1OKI", "context": "Will this Hard Drive fit my \"Xbox 360 E\" not slim, but \"E\"? DO I need anything else or just the drive?", "response": "Yes, it will fit.  That's what I have and it works great.  Shouldn't need anything else with it."}
{"product_id": "B007VTVRFA", "context": "Isn't this game now allowed to be offline (which was the main criticism)?", "response": "It is now!!! You can play offline. Added feature a few months ago."}
{"product_id": "B00B77OKNI", "context": "Since this is Bluetooth, will it work on a pc or laptop with bluetooth?", "response": "No, you can't use this controller if u buy it now. You need an app in order to use the controller and they took the app down from the google play store. U seriously can't find any copy's of the app at all, so don't waste your money on this useless brick of a controller like I did!"}
{"product_id": "B001DPZE84", "context": "How realistic is this game? Would hours of playtime = the ability to(in an emergency situation) fly a plane crapily and live to tell the tale?", "response": "The page on Amazon claimed it wad compatible with Windows 7.We were not able to install it so returned it to Amazon. Thus I can not answer your question. Sorry."}
{"product_id": "B00CD90R72", "context": "Is playing the game with the move controller as enjoyable as playing it with the dualshock?", "response": "I bought a Fifa15, not 14"}
{"product_id": "B00DC7FWRE", "context": "Can this game be used with the original wii if you don't care or want the u game pad", "response": "I'm not 100% certain, but I highly doubt it. It's a WiiU game, there's no reason it should work on the older Wii console. If you're looking for a similar style game on Wii, consider Wii Party."}
{"product_id": "B007XVTR12", "context": "Are there any other FPS out right now that you might recommend after having played this game? Also, does this work with the XBOX PC controller?", "response": "I am not sure if COD can be used with the Xbox controller as I have not tried it. I do know that most of the Resident Evil series for PC can use the controller. Good luck and happy gaming."}
{"product_id": "B007A7UJ4S", "context": "If I could buy this game, would it have English subtitles? I'm hearing-impaired, so I don't enjoy playing games I can't understand.", "response": "What my son reads is all English. On many of the games you can choose English as the language of preference he said."}
{"product_id": "B003N3HEU0", "context": "We have the older Wii.  Will this game work on it?", "response": "Yes, it should I don't believe they have upgraded the game, to prevent it from working on older models. Hopefully this has helped. Happy Holidays :) !!!"}
{"product_id": "B00CPKUV9I", "context": "Will this game work with a joystick?", "response": "I can't say \"yes\" with absolute authority- SINCE I NEVER GOT THE DAMN GAME TO WORK ON MY COMPUTER- but previous Windows-based versions of Wolfenstein worked with a joystick, so I would guess that this one would, too."}
{"product_id": "B009XZ1CTQ", "context": "my grandson is 5 - can he do this game?", "response": "Sure, with a little help from you. At first he might not understand what implements to use for different crops, but neither did I. You can get tips from the game and from the forums. I now have Farming Simulator 2015 and I like it much more than 2013. It is a time consuming game."}
{"product_id": "B00009W5WB", "context": "can i use a xbox 360 controller if i dont have a original controller?", "response": "Unfortunately no. An original Xbox console controller is required. The cable worked great for my needs though."}
{"product_id": "B00GU4F4OM", "context": "Will this mouse work with Windows 8.1? I have been seeing some reviews of some that have issues with 8.1 for some reason...", "response": "Yes, it works without any problem... Tested for 4 months"}
{"product_id": "B00BI4VVGY", "context": "Is it a 2 or 3 pin fan controller?", "response": "It is three pins connecter 2 pins for the power connecter, and the other one is for the fan control speed"}
{"product_id": "B0029LJIFG", "context": "I just received card in the mail to give as a gift and it says Made in Singapore and has both English and Asian language written on it. Will it work?", "response": "Yes it worked fine. I was worried also,but it worked fine"}
{"product_id": "B00IRHE892", "context": "Is this compatible with Mac?", "response": "It may work as a basic mouse, but Logitech lists Windows as a requirement on their site and the G software seems to be Windows only as well."}
{"product_id": "B00CERXJNW", "context": "Is the wrist rest removable?", "response": "Yes there are two screws on either side."}
{"product_id": "B00CMQTUY2", "context": "So there is an Army base here in Hawaii, why won't it ship here,", "response": "I don't know but the listing is just for an XBOX One wireless controller no plug and charge kit."}
{"product_id": "B009RXUNZI", "context": "How's the overhead band size, and the size of the ear cups? Looking for headset that I can wear for hours and for gaming.", "response": "The band is pretty comfortable, as well as the ear cups. I wear this for hours, and I have average is not slightly large ears."}
{"product_id": "B00EM5UFF4", "context": "What's the difference between physical disk and digital download? Why the physical disk one is more expensive?", "response": "Hi BiuBiu, I can't answer you cause I don't know anything about digital game and its features or disadvantages/ advantages compared with physical game. Sorry."}
{"product_id": "B008RA5DIY", "context": "If we purchase the actual disc, are we able to download also?", "response": "No, not through Amazon. You may be able to call Quickbooks support for them to give you a link but you'd have to have the license info already and that comes with the disk."}
{"product_id": "B0094H8H7I", "context": "can you save games that are part of the 80 original", "response": "I dont believe you can.  Only thing with my game, i'm having trouble with, is that the wires have a short somewhere and is very touchy.  Kinda sucks cause i just bought this recently.  Maybe thats why they sold it.   Hmmm"}
{"product_id": "B005QUQP80", "context": "Which keys are mechanical and which aren't", "response": "All of them.  Actually, there's a FAQ on their website.  All EXCEPT the top row (Esc - F12) and the 9 key home group (PrtScn - Page Down)."}
{"product_id": "B0050SYK44", "context": "Is this game enjoyable to play as a single player game?", "response": "Yes I find Borderlands 2 enjoyable single & multi-player."}
{"product_id": "B005G4CXPK", "context": "I see the package is wider than usual, is there 2 different cases for ac1 & ac2 or 1 case with 2 cd inside?", "response": "It's the size of 1 regular music cd. It's packaged in a cardboard sleeve with the discs in white paper disc envelopes."}
{"product_id": "B006JSY3MI", "context": "Can I add PC version to Steam?", "response": "It's required actually, steam is how it delivers updates."}
{"product_id": "B00B3PDHBU", "context": "Will this headset work on the xbox 360 & the xbox one?  Looking for a headset that will work on both.", "response": "Fully wireless in an Xbox 360, but tethered to the controller via an adapter for the Xbox One. Great digital surround sound game audio on both systems. So if you want chat on the Xbox One you need to purchase an adapter, and we make two really good ones: http://www.turtlebeach.com/products/accessories/xbox-one-adapters"}
{"product_id": "B00EWEHI5K", "context": "Are the side buttons easily pressed accidentally? Is the feel of those buttons \"clicky\" or \"mushy\"?", "response": "The side buttons are well designed and will not be accidentally pressed easily, no matter what type of wings you choose. And the feel is clicky."}
{"product_id": "B0089NVTDM", "context": "Does this have Steam support? Like, would I be able to play most games with this?", "response": "if it has controller support it should. use joy2key if not."}
{"product_id": "B00DGZDFLW", "context": "Should I play this with a touch screen?", "response": "If you did and completed the game, you would be honored as a hero."}
{"product_id": "B00CBQO930", "context": "Weight and Size. Is it light and cheap or does it have a nice weight? Is the size big enough to be comfortable for people with large hands?", "response": "Its the smallest gaming mouse I could find. That being said its not small really, its a little lighter than other bigger mice but its not flimsy or cheap feeling"}
{"product_id": "B00FNNQREC", "context": "What is a good age for this game?  Can younger kids play it?", "response": "Any age really because all u do is drive around and wait for stuff to grow and fees animals like on farmville"}
{"product_id": "B003VAHYQY", "context": "Anyone know if this is Linux Compatible? Is this controller Linux Compatible? Specifically I would like to use it for the Mupen64Plus emulator on Ubuntu. Thanks for any helpful response.", "response": "Works for me on Steam OS beta and Ubuntu 13.10."}
{"product_id": "B00JFCA6V2", "context": "Can you play games off of the game cards without purchasing a Sony memory card?", "response": "I don't think so?"}
{"product_id": "B000OPOCFU", "context": "Where on the DVD is the product key.I tried entering and it still wont take it", "response": "The product key on my item was on the back of the manual."}
{"product_id": "B002TLTBN0", "context": "Will this work with Wii U titles?", "response": "On some titles such as Super Smash Brothers 4 and Super Mario 3-D World.  Maybe Mario Cart 8...However, it works on every Wii game that supports that controller usage."}
{"product_id": "B00DNGQQUQ", "context": "Can this be played on xbox One?", "response": "not that i know of so no...as far as i know xbox one or ps4 don't play there last gen predecessors"}
{"product_id": "B008OQTUKS", "context": "How can I get single player to play? It does not show any way to launch single player ,can anyone help me with this?", "response": "in http://battlelog.battlefield.com/bf3/ click campaign!"}
{"product_id": "B003O6N64Y", "context": "can I connect this headset to a tv,thankyou.", "response": "Yes you can, if the tv have bluetooth, everything with bluetooth you could"}
{"product_id": "B003O6C0V4", "context": "can I add this to my current EA active 2 system so a friend can work out as well", "response": "Yes, but this package comes with the game disc as well.  It seems like more than you need."}
{"product_id": "B00DC9SWWE", "context": "The rating says it has \"strong language\" is there anyway to turn that off?", "response": "Not to my knowledge. The storyline is so shallow, you could just turn the audio off and the music up and not miss a thing."}
{"product_id": "B0009PRCNO", "context": "Is this ps3 60gb backward compatible? and what is it's model number? thanks!", "response": "Yeah it's compatible with 1 and 2 ps, and the model number I believe isn't the same of the other"}
{"product_id": "B00EZKNSTQ", "context": "what do they mean by 3rd party controller?", "response": "It doesn't come from that company but from an other 2 company"}
{"product_id": "B0057WDBHA", "context": "Am I able to upgrade the joystick? It's a little wobbly and I prefer it to be a bit tighter. Personal preference.", "response": "im sure its possible,i didnt do anything to mine. just do your research. maybe joining some forums like shoryuken.com may be a good way for finding good tips on how to get this done. sorry that im not able to be of more help."}
{"product_id": "B00GZ1GUSY", "context": "Is there a wireless headset I can use with the voice commands?", "response": "I believe you can use the ps4 headset included with the system or any other compatible headset."}
{"product_id": "B00IPTUJ8G", "context": "Is there a disc version available? Huge bl fan and i have this version via psn download  but would like disc as backup.", "response": "Yes, this is a physical copy of the game"}
{"product_id": "B0006PJAZU", "context": "How many computers will I be able to install WordPerfect 8?  Would like to load on both of my computers.", "response": "*Legally,* unless it's a network version, you can have it on only one computer at a time."}
{"product_id": "B003EUPCZG", "context": "Hello, Anybody have the actual dimensions of the mouse itself? I have larger hands/need larger mouse. Currently, have Logitech G500. Thx!", "response": "~4\" long by ~2\" wide.Sidenote: From what I've seen, people with smaller hands will buy the G500, since the DA is too big for them. I also have fairly large hands (6\", heel to fingertip), and this mouse fits comfortably in my palm."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "No. I think it would be to mature for a 10 year old."}
{"product_id": "B00B1N07QM", "context": "Wife tried Nostromo and her small hand felt slightly strained to hold  in the WASD position. Is this better for smaller hands?", "response": "I would go to the Tartarus instead, Its really hard to reach the last row even with normal sized hands."}
{"product_id": "B009DL2TBA", "context": "I was looking in my cellphone in the Amazon's app and in the feature and details is writing that this ps3 comes with 3 games. Is it true?", "response": "no disculpa no viene con juegos solo viene el sistema ps3 con todos sus accesorios. espero haberte ayudado"}
{"product_id": "B003O6CBIG", "context": "Does this game have the bonus map?", "response": "No, unfortunately this copy does not."}
{"product_id": "B000KMCF0G", "context": "Can this game be played with Window 8?", "response": "I played on windows 8 and it seemed to handle it alright, but I think I had to change some computer settings."}
{"product_id": "B00HGAWFJG", "context": "Can you turn the light off? Or, does it turn off while in stand-by mode?", "response": "Not that I know of but the light stays on, unless you just want to unplug the usb?"}
{"product_id": "B00CX7FQ4I", "context": "The game is dubbed and subtitled in Portuguese ?. It's what I want to send my son in Brazil", "response": "Yes. It has an option for Portugese audio. Being Brazil dominates most classes in mma it would be very disappointing if it didn't."}
{"product_id": "B00HGLLRV2", "context": "Hi,  is there a cooperative multi-player mode?  If so,  does it require a separate console per player?   Thanks!", "response": "No multiplayer. Just single player campaign."}
{"product_id": "B0050SYR74", "context": "Does it interfere with wi-fi?", "response": "No, I does not interfere with wi-fi at all"}
{"product_id": "B00B67ZTUW", "context": "Can this game be played co-op?", "response": "No. The game is not co-op it is a single player game only. The AI controls more then one party member that joins you. You only control the main character you decide to choose."}
{"product_id": "B009AP23NI", "context": "Does this take AA batteries?", "response": "No, the controller contains a lithium ion battery that is rechargeable. It comes with an adapter that can be plugged into any USB port to recharge!"}
{"product_id": "B008CXTW5G", "context": "Is this keyboard really 24\" wide?", "response": "It is about 22 1/2\" inches wide. Which I guess is close enough."}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "There is only violence in the Michael Vick DLC."}
{"product_id": "B003OZOAKY", "context": "Will Rome Gold Edition work with Windows 8 ?", "response": "I have planned the game on both Windows 7 and Windows 8 and the game works fine on both."}
{"product_id": "B00IP0H4GA", "context": "so it definitely plays on us ps3's?", "response": "Yes, the Playstation 3 is region free. (It can play games from any region)"}
{"product_id": "B00KAI3KW2", "context": "Does it play Blue Ray movies?", "response": "Yep. Just download the blu-ray app for free and it will play blu-ray discs."}
{"product_id": "B00IYWV5HS", "context": "Does this version come with the new pre-order rewards?", "response": "Yes but not all that the Deluxe comes with.  You can find the bonus items on the wildstar homepage.  This version does not get bonus Eldan items where Deluxe does.  But you also do not receive these items until launch.  They do not show up during pre-order beta events which are also now surpassed.Thanks,jeremy"}
{"product_id": "B00DFB99UI", "context": "How many degree does it turn", "response": "90 left and 90 right....works great in the short time i have had it... you can set steering in game for more or less response which replaces the need to turn 180 left & 180 right"}
{"product_id": "B00H1FCUBY", "context": "Do these headphones have that typical annoying flashing blue light!?", "response": "The blue light is directed downwards, and it is quite dim. It doesn't bother me, and I suppose it doesn't bother people around me."}
{"product_id": "B002DUCF7Q", "context": "Does this work with X-Plane?", "response": "Yes, after installing the drivers and such on the Saitek site and running through a tutorial I googled I got this working in X-Plane."}
{"product_id": "B008GEH8LQ", "context": "Is this like a store bought 3DS XL?", "response": "Yes as,e exact thing  his was my first bought second at GameStop same thing"}
{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "No the campaign is multiplayer with a backstory."}
{"product_id": "B008XHCLFO", "context": "Hello, I have a new Nintendo 3DS (XL) rather than an original 3DS XL. Will this grip work with the newer model?", "response": "Unfortunately no. Basically because of the layout but I do think that the size of the console will also interfere, since it has grown some millimeters..."}
{"product_id": "B000BTBMWA", "context": "does this have the hdmi link to the xbox and component for the tv?", "response": "No, it isn't a HDMI cable.  It has a bigger end which the older Xbox 360's (white ones) have."}
{"product_id": "B008EZ3PBY", "context": "Does the xbox reset if you switch your tv to cable or something else with these aftermarket adapters. Do you have that problem with this one?.", "response": "Also to say one other thing with any cable, always connect them when the system is completely off, if your not sure if it is on, disconnect the power from the wall this will ensure any damage for any product. even computer items, unless it is USB."}
{"product_id": "B00FLLFJE0", "context": "Is it worth it", "response": "It is totally worth it!!! I haves saved so much money on batteries! It's cool and it's efficient! Hope this helped!"}
{"product_id": "B00HWMP0OU", "context": "hello, is multilingual, I need it in Spanish", "response": "I do not recall seeing the language option, Jose. I think it may be in English only."}
{"product_id": "B00GBCLG0E", "context": "I know the games come as their own discs, but can you tell me is the online code inside the paper case packaging or is it found in the manual/paperwork?", "response": "Sorry, but in my case, the disc doesn't came with the console. Really shame. Amazon must be send me this game."}
{"product_id": "B001E27DLM", "context": "Is this the original game, but ported to DS?", "response": "Yes it is. They have some new dungeons and features you can use with the touch screen but you can shut that off."}
{"product_id": "B008BGXYBM", "context": "Can you change the color of the lights on this, or is it only green?", "response": "http://www.razerzone.com/licensed-and-team-peripherals/battlefield-4-razer-taipan/You can buy a BF4 edtion its an orange. http://assets.razerzone.com/eeimages/products/14205/razer-taipan-battlefield-4-gallery-4__gallery_thumbnail.png"}
{"product_id": "B008CP6Q6M", "context": "How many CDs are in the Pack?", "response": "2 discs (one game on each) and a third game as download content. 3rd game alone is worth the price of the collection in my opinion."}
{"product_id": "B00A1AQJAO", "context": "Does this also work for the Dsi XL", "response": "Yes, it runs on DS,  DSi, DSi XL, 3DS, 3DS XL, and 2DS."}
{"product_id": "B00CX9L30W", "context": "I have a question, even if this is an MMO, does this have a universal goal?", "response": "Well yeah it have its own many story line. A lots of sidequest. Best of all. It will never be pay to win. Got to put some effort to get the best things."}
{"product_id": "B00GZ1H07Y", "context": "Will this game play on the PS3 console?", "response": "No. It says in the product description that it only plays on the Playstation 4 console."}
{"product_id": "B0097CUREG", "context": "will this work on a mac?", "response": "I do not know."}
{"product_id": "B00B1OK3TC", "context": "does it work on xbox", "response": "Mine didn't work on anything.  Spend the extra money and save yourself the headache!  The software I got wouldn't even load.  Not worth the trouble.  Bought a Roxio, and loved it."}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "Well just found out my estimated delivery date would be June 6th.  They tried to tell me \"when something is shown as temporarily out of stock\"... um yeah, IT NEVER ONCE SHOWED THAT!  This has truly been a pathetic experience with amazon.  I am incredibly disappointed."}
{"product_id": "B00B1N07QM", "context": "DOES A GAMING KEYPAD REPLACE A GAMING KEY BOARD?", "response": "No... But you really won't need a gaming keyboard if you can use the keypad primarily. Razer made it to help you keep your hand on the keypad during game play and not worry about hitting the wrong buttons."}
{"product_id": "B001IYR53W", "context": "Do you have to have the CD inserted to play the games after installation?", "response": "No, my husband downloaded the cd, put an icon on the front screen and all I have to do is click on the icon. The game menu comes up and I can select the game I want to play. Really cool!!"}
{"product_id": "B00EPZ8POY", "context": "I bought the odin seiya DLC but even though i have it installed on my ps3 I cannot use it? anyone else having this problem with DLC?", "response": "Nope it works fine on mine..Make sure u have up dated programs and enough memory"}
{"product_id": "B00FLLFGO8", "context": "Works to place tablet 8.3 inch LG G PAD?", "response": "would it work with the sony xperia z2 tab?"}
{"product_id": "B0050SXFKE", "context": "This game has subtitles in Spanish?", "response": "No, there are no subtitles that I know of."}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "It has English sub , but talk in Japanese"}
{"product_id": "B00EZKNSTQ", "context": "does it work with pc?", "response": "Yes works with the PC no problems - kids love them"}
{"product_id": "B0086V5UF0", "context": "Where can the \"just dance 4\" be played? Because I can't play it on DVD/CD player.", "response": "It plays on a Nintendo Wii game player."}
{"product_id": "B004JQK2E0", "context": "hey do i have to have steam to download port royale 3 on pc", "response": "When I bought it they sent me a CD in a package like the picture it installed directly from there no Steam involved."}
{"product_id": "B0094H8H78", "context": "Does this have internet access such as facebook page?", "response": "No it cannot access the internet."}
{"product_id": "B000A2R54M", "context": "Does it work well on 2DS?", "response": "As long as it doesn't specify 3DS, it will work on the regular DS."}
{"product_id": "B002I090AG", "context": "Does it work with ds games?", "response": "Yes, but action replays for the ds won't. U have to get one specific for the 3ds, but normal ds games work just fine."}
{"product_id": "B009DYOPK0", "context": "Does Roccat have a warranty? I've read horror stories about not honoring warranty?", "response": "I haven't had any issue of the sort and my friend who had to RMA his didn't have a problem during the procedure, either."}
{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel have left,right and middle click on the scroll wheel ? I really like this feature", "response": "No it does not. It just has the wheel click. Personally mice that have the side wheel clicks feel a little flimsier to me."}
{"product_id": "B00006B84X", "context": "my X52 is being sent back, too many driver issues where in the middle of playing DCS World, the sticks lights up flashing and fails to work.", "response": "This CH stick would be a good replacement. It's my DCS control and has never failed. No driver issues. That, and it's very easy to tweak!"}
{"product_id": "B00519C7CE", "context": "Does it come with the zombie pack?", "response": "It comes with first strike which is ascension only"}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "yes it comes with everything you need"}
{"product_id": "B001DPZE84", "context": "Isa this fsx gold + Accleration pack?", "response": "Gold includes acceleration. Yes"}
{"product_id": "B0002DKTY2", "context": "does this dictionary have Audio pronunciations?", "response": "When I bought this dictionary I didn't Know that it only works on a 32 bit machine, My new machine is 64 Bit. I had to buy the Merriam-Webster's Multi-Reference Dictionary made to work on a 64 bit program. At time I bought this dictionary you can only down load it, it doesn't come on a disk."}
{"product_id": "B008RA5DIY", "context": "We recently bought Quickbooks Pro 2013 3-user. Can we buy single user version and have all 4 people working in the same company file at the same time?", "response": "Unfortunately you will need a user for each computer.  We have a server--that does not qualify as a user--and 5 computers that pull from that server--each computer had to have it's own account from Quickbooks.  So we have 1 user left over for a rainy day."}
{"product_id": "B00BDS415I", "context": "How durable is this headset? I want one that can last me a few years.", "response": "I must have gotten a lemon.  Mine broke between the ear cup and the head band after 13-months.  It was only ever used at my desk, and I typically handled it with care."}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "i don't think so!"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game.", "response": "Yes, but this bundle contains most of the figures."}
{"product_id": "B00AK4QB22", "context": "where is the manuel?", "response": "There isn't one, at least mine didn't come with one either. Sadly, those days of the good ol' 30 page NES manuals are long gone."}
{"product_id": "B0050SZBP6", "context": "does the game only last for 30 days and then you have to pay like 10$ dollers every month or is it permanent?", "response": "Yeah, once you install it you get some free days then you have to pay to play it, it can be monthly or every 6 months. The game is permanent once you install it."}
{"product_id": "B0032MM2P4", "context": "Can I use this on Windows 8?", "response": "Sorry I cant answer this as I do not have windows 8?"}
{"product_id": "B003O6EDSM", "context": "If I buy the Mass Effect trilogy from the Playstation Network, which DLCs would I have to buy in order to gain all of the possible trophies?", "response": "There is no dlc for the first mass effect game and for the second there is the arrival dlc. For the third game there is the alternate ending. Now only when you buy dlc or download it is when new trophies are installed."}
{"product_id": "B00CWFUHT0", "context": "Does it come with a controller?", "response": "Yes it did come with a controller, as well as all the necessary cables. The only thing was the extrememy poor packaging, with nothing to protect the items.."}
{"product_id": "B0058GMO0A", "context": "will it work on vista?", "response": "I do not recommend this product.  Tried installing it on 2 Windows XP computers and it wouldn't work. Junk."}
{"product_id": "B002DUCF7Q", "context": "Does this work with X-Plane?", "response": "Yes...these do work with X-Plane.  However you will have to go to the following link to get the plugin:http://forums.x-plane.org/index.php?app=downloads&showfile;=14646"}
{"product_id": "B0018YXM3Y", "context": "do you have to download the game of the disk.", "response": "In the normal set up, the entire game is downloaded to your computer.  You don't need the disk after the original download to play the game, just click the desktop shortcut icon."}
{"product_id": "B003ZJ1VD8", "context": "what color is the switches?", "response": "Supposively they are Cherry blues, but they fail so often in this keyboard that I'm not convinced this information is true. Had three of them, all three had their switches fail after about a month. I have three other keyboards with Cherry switches and none of them has that problem."}
{"product_id": "B006IR6NH8", "context": "Does this wheel need to be attached to some other unit? Or is what is advertised here all that is needed?", "response": "It works with accelerometers, so you don't need to attach it to anything at all, unless you want to."}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "Yes, PC & PS3 both. All the info you need is available on the Thrustmaster website."}
{"product_id": "B00DC7O77A", "context": "Does this game have multiplayer mode?", "response": "is it just two players or more?"}
{"product_id": "B0094H8H7I", "context": "Does it play Sega MegaDrive carts?", "response": "Yes, this ATGames produced Genesis console will play Japanese Mega Drive games without the need for it to region modded (which is a plus in my book)."}
{"product_id": "B00ENFVS5Y", "context": "What voltage is using: 120V or 220V?", "response": "120v  the power block is now internal so all you have is about a 5 foot power cord."}
{"product_id": "B002JTWODG", "context": "come with blue tooth dongle Does this mouse come with a blue tooth dongle?", "response": "No it does not."}
{"product_id": "B00919RM1Q", "context": "Can this verison be used on Windows8?", "response": "I don't have windows 8.  Sorry."}
{"product_id": "B0087ZMAUS", "context": "Are these open eared?  Will i be able to hear whats going on around me and myself talk? Thanks.", "response": "well, these have over the ear cup but it is not noise canceling. you can hear what is going around you and hear yourself talk granted you don't have the volume too loud."}
{"product_id": "B00503EAG2", "context": "can I put this on steam?", "response": "yes, steam should accept all Call of Duty games. sorry for the delay."}
{"product_id": "B00BHSTXV6", "context": "Can the macro keys activate AutoHotKey scripts?", "response": "Yes....Overall a nice looking board.  Customer support is slow and, as I said in my review, the key paint does not hold up."}
{"product_id": "B008BGXYBM", "context": "if you use the mouse with your right hand can you set the pinky forward and back button to different keybinds then the thumb? huge wow pvper***", "response": "you can keybind anything in Wow."}
{"product_id": "B00BY0G0YU", "context": "Does this version offer Japanese audio?", "response": "Sorry, this does not support dual audio."}
{"product_id": "B00HPU96FI", "context": "I know that light gun games do not work with HDTV's. But...becase this is connected through VGA has anyone tried to see if light gun games work?", "response": "Light guns don't work on HDTVs because they have too much input lag. This cable won't change that; light guns still won't work with an HDTV."}
{"product_id": "B00HWMP0OU", "context": "Will this work on 2DS?", "response": "I'm positive it does. Anything made for the 3DS is also made for the 2DS, but NOT the original DS."}
{"product_id": "B0058FAEAS", "context": "Is it compatible with Mac?", "response": "Absolutely!  I wondered that too and it works fine."}
{"product_id": "B00CRL9TU2", "context": "Does this version offer wheel support, specifically the Driving Force Wireless Wheel?", "response": "Here are the supported racing wheels for this game:THRUSTMASTER® T500 RSTHRUSTMASTER® T300 RSDriving Force™ GTG27 Racing WheelG25 Racing WheelDriving Force™ ProGT FORCE®Driving Force™Driving Force™ EX"}
{"product_id": "B00IU3MSF4", "context": "How many USB ports does the 360 E have?", "response": "Hey I'm sorry but we are not talking about that specific xbox360 but thx for the question and remember to leave a like"}
{"product_id": "B002P35JMO", "context": "Is this a special 360 HDMI connector or would this work with other devices that have HDMI?", "response": "It is specific to only the 360. It works great, I am using it right now."}
{"product_id": "B0087OZ5FG", "context": "How's the wireless range on this thing compare to the gold version?", "response": "about 10 or so metres"}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "Maybe NOT if you're running Windows 10. I see many complaints about Saitek/MadCatz Windows 10 Issuese.g. https://www.reddit.com/r/hotas/comments/3h0xx8/x55_on_windows_10/"}
{"product_id": "B000LQ4HTS", "context": "Does the throttle work on it's own, since I'll be using a different stick?Thanks in advance.", "response": "Not had a chance to try, sorry ."}
{"product_id": "B00B67ZTUW", "context": "is this in english", "response": "Yes, both text and voice dialogue are in English."}
{"product_id": "B00BY0G0YU", "context": "Does this version offer Japanese audio?", "response": "no is does not but if you have a ps4 i would recomend you purchase the ps4 version it has better colors and full native 1080p."}
{"product_id": "B000TLU67W", "context": "you can play ps 1 games on the original ps2, can they be played on the ps2 slim?", "response": "Yes you can as long as you stay within the same region. So this device play ntsc ps1 and ntsc ps2 games."}
{"product_id": "B00DC9SWWE", "context": "My son is about to be 11 and is dying for this game.  I've never bought him an M rated game.  How is the violence and language in this game?", "response": "The only other consideration is what other people say while they're playing online. Obviously that has nothing to do with the game's rating, but if you've never heard people playing something like Call of Duty, you may want to listen in first. It can get pretty vulgar."}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "Yes played it on my Windows 7 pro 64bit. Good game. Make sure your video card and memory can handle it."}
{"product_id": "B000R0SRNU", "context": "Do u need xbox live to play this?", "response": "No you don't, you can play local coop with another person on your xbox."}
{"product_id": "B000P46NMA", "context": "I bought AC2. My friend now says I \"Have\" to play 1 to get the entire storyline understood? Without spoiling it, should I really start from the first?", "response": "It depends on you.I think it's not necessary you have to play AC1 if you only play AC2.But if you play the Ezio trilogy you'd better paly the AC1"}
{"product_id": "B005764CWO", "context": "I can't seem to get it to connect. Any help/suggestions/directions?", "response": "Connect it to both usb ports and then push the ps button in the middle. If that doesn't work then push the other two buttons. If that doesn't work then you have a faulty controller and you should send it back"}
{"product_id": "B00DHF39KS", "context": "Just getting into these games; are there levels of difficulty on this game so a newbee can learn easily???", "response": "Yes it has multiple levels and this game is fairly straight forward, you wont have to worry about pushing a lot of buttons"}
{"product_id": "B000VRCNLG", "context": "what air combat game ww2 will operate in windows 7 64 bit", "response": "I have been using \"combat flight simulator 2  WW2 pacific theater\"  Have tried getting my favorite (C.F.S. WW2 Europe Series) with the help of professional P.C. people but sadly it can not be done as you probably know.  I have C.F.S. 3 but it is a mystery to me how anybody gets this nightmare to work."}
{"product_id": "B0000AFQRR", "context": "Will this work in Windows 8.1?", "response": "I am running Puzzle Master 4 on my Windows 8 PC with no problems.  I would expect the same results from the Puzzle Master series."}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "My grandson doesn't know. He is only 13."}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "Of course it works on Wii, so do your SNES cartridges, cassette tapes, frozen pizza's and lazerdiscs. I'm surprised by all the misinformation out there."}
