{"product_id": "B008FHL56S", "context": "Does this work with Destiny?", "response": "Sure does. It will ask him when he first starts the game(any game) where he wants to save the data to."}
{"product_id": "B005F1ZUU4", "context": "Will this controller work for windows 8?", "response": "It will, but I had to find drivers through the pre-installed folders of Windows 8. It was kind of a hassle, but it does work fine!"}
{"product_id": "B009SJR278", "context": "Do I need to buy a splitter for pc gaming?", "response": "I am sorry Chris, I have no clue!!! I purchased the Razer for a 14 year old who specified exactly what he wanted."}
{"product_id": "B009OYUFMG", "context": "Does this product work on World at War?", "response": "yes you can i have play with no problems and many other games great mouse."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "The new slim will not fit in this case because it has different dimension then the old vita, which this case was molded for."}
{"product_id": "B00E1L78N6", "context": "Does these include the boom mic?", "response": "As of Dec 2014, the boom mic is included"}
{"product_id": "B00FXOP1JI", "context": "CAn you transfer the pre installed game to a bigger sd card?", "response": "Yes.  Register the device with Nintendo.  It can be transferred, from card to card, but I was unsuccessful. (even tried calling Nintendo support)  Fortunately, once your device is registered, you can download the game for free from the eshop."}
{"product_id": "B007CM0K86", "context": "why is it rated M", "response": "There is some langue on there and some graphic stuff. I didn't think much of it, but I know  now a days kids can sensitive to this kind of stuff....parents too."}
{"product_id": "B008YA9BVC", "context": "can the mic be detachable for other use ex. MP3 player?", "response": "nothing is detachable on the headset."}
{"product_id": "B006NU6HAS", "context": "Are you able to get the update to the steam edition with the box version of the PMDG?", "response": "Yes, you can. Go to the Aerosoft forum http://forum.aerosoft.com/ and register or sign in."}
{"product_id": "B005YR1VP2", "context": "Does it come with all the av cables and have an easy setup?", "response": "Yes it is all there and very easy to set up."}
{"product_id": "B006YDPU48", "context": "I really want to play this game but I'm sort of leery of the difficulty level I keep hearing about. Is it so hard it's frustrating?", "response": "The more patience you have, the better you'll play. This game requires tons of patience, but is not really that difficult. :)"}
{"product_id": "B009DYOPK0", "context": "What is the longest you have used this mouse (not just owning) without having any problems (espeically in the scroll wheel department)?", "response": "Every once in a while the mouse will \"wander\" or \"drift\".  It's correctable by unplugging it then re-plugging it in to the USB port.  I've not noticed any problems specifically with the scroll wheel.  I've also never mapped any of the other buttons, so I can't say how well they work."}
{"product_id": "B000YMQGWU", "context": "Will this work for connecting a PS2 dance pad to the PC, or does it suffer from that problem where it renders the step pad controls as axes?", "response": "It will likely make them be axes.  I purchased one to convert my yamaha ms1 handlebars to PC.  It worked great for that."}
{"product_id": "B008M4BNQG", "context": "How is the bass if you want to listen to music on your pc? I want it for gaming but since it can also connect to PC i was just curious.", "response": "Yes, thes bass feels great. You can also adjust the bass settings on your PC to your liking.you can't adjust the base from the headphones, so you will to do it through your PC. I hope this helps"}
{"product_id": "B0050SYX8W", "context": "do you have to have xbox live to play this game?", "response": "To play online yes you need to be a gold member. But to play the game alone no you don't need Xbox live"}
{"product_id": "B00DPQ6GPO", "context": "i am a call of dutty ghost on ps3 i like using shot guns., like fal pistol and sniper is the controller good for me in call of dutty ghost?", "response": "Yes. ..I bought this product and works great try rapid fire and silencer"}
{"product_id": "B000YMQGWU", "context": "Would this work with a Macbook Air?", "response": "Yes, it would work, but may be limited to certain capabilities."}
{"product_id": "B007JDMPOK", "context": "If i have an account on tera already can I use the stuff from the collectors edition on that account?", "response": "Yes, definitely can, and absolutely worth it too! (You even still get Founder's status added to your account, heh. I bought it for the toon unlocks, and that plus the mount alone was worth it, let alone the other cool stuff in the box)"}
{"product_id": "B00CTKHXFO", "context": "If I buy this game today, will I be able to download the content or did the codes expire?", "response": "The code does not expire. The game series is epic!"}
{"product_id": "B00FLLFJE0", "context": "I tend to leave my items charging, does this have an tickle charge or auto shut off?", "response": "The Nyko charge base has an auto shut off feature. So you should be good with leaving your items charging."}
{"product_id": "B000AOJ7FK", "context": "Does it require steam?", "response": "If you want to play online it requires Steam, if you just want to play on your computer it does not. If you purchase Counter Strike Source, when you register it automatically downloads Steam, no additional cost."}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "Yes.  On steam (PC) a multiplayer version just came out."}
{"product_id": "B006NU6HAS", "context": "Does it come with any liveries other than the default shown on the package?", "response": "No. You get four planes. An 800 and 900 series with or without winglets but they are all the same PMDG colour scheme."}
{"product_id": "B005YR308S", "context": "Does this game come brand new, factory-sealed in the plastic?", "response": "I bought a fulfilled by Amazon version and it was totally brand new and sealed. It did not include the booklet unfortunately but the game was excellent!"}
{"product_id": "B00BU3ZLJQ", "context": "is it the full version with redstone?", "response": "sorry I cannot answer your questions...this was a gift for my grandson and I do not have a clue...He was thrilled to get it and plays it all the time but that is all I can tell you! Hope somebody can answer your question."}
{"product_id": "B00EOI2MRS", "context": "Does this controller come with the cord? I understand from the description it is used only with a wire, just asking if the cable is included.", "response": "The cable is included,  Permanently attached"}
{"product_id": "B001GIUWX0", "context": "Does this $18 used Mario Cart Wii game come in the original packaging including instructions?", "response": "You would need to check the products description from the seller if they have that included. Most don't, but if you look under \"Collectible\", there will be more used copies of the game that include original casing, manuals, and game."}
{"product_id": "B00ARCWQOO", "context": "Why does the game not allow you to have full control of fielding?", "response": "Go to ur settings it should let u cuz I have full control is it not letting u run to catch the ball ? Are throw?"}
{"product_id": "B00BMFIXKQ", "context": "The game is in English or multi language? has any subtitles at least? Which?El juego esta en inglés o tiene múltiples idiomas o subtitulos ? Cuales?", "response": "The game is in multi language subtitles also you can read it and hear it while the character speak I use most Spanish"}
{"product_id": "B004TTNTYW", "context": "Does the charger burn and create smoke?", "response": "We've had this charger for about 3+\\- months & have had no problems with it."}
{"product_id": "B00D96BJSO", "context": "Does this headset have mic monitoring?", "response": "No it doesn't have ..."}
{"product_id": "B007MJSZDQ", "context": "is it good and last along time", "response": "I brought two different sellers they do not work with any of my remotes, I have a xbox 360"}
{"product_id": "B008BT2FWI", "context": "does it work on window 7", "response": "Also works fine on Windows 8 64-bit"}
{"product_id": "B00H8NS1K8", "context": "Anyone else's ear cup joints a little loose/wiggly?", "response": "They siwel 10 degrees"}
{"product_id": "B00004XRBB", "context": "Anyone run this on windows 8.1", "response": "I tried--it didn't work."}
{"product_id": "B009RXUOD4", "context": "Will this headset's game and chat audio work with both next gen consoles? (Xbox One and PS4)", "response": "It barely works for currwnt gen or anything for that matter this is a no go"}
{"product_id": "B008RA5AWS", "context": "how do you know if software processes 0-3 employees versus unlimited ?", "response": "The cost of yearly subscription is according to number of employees you are processing."}
{"product_id": "B00004VUFG", "context": "can I use this with my xbox 360?", "response": "I do not know. I never had that system and have not had this wheel for a few years."}
{"product_id": "B003Y5AHPG", "context": "Where are the L & R buttons on the controller?", "response": "The Super Nintendo \"L\" and \"R\" buttons are mapped to the \"Z\" and \"C\" buttons respectively. Not gonna lie, it's kinda awkward."}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "Yeah your right the left side is louder"}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "All parts separately and they are all original"}
{"product_id": "B003EUPCZG", "context": "The buttons are already \"swapped\", or software is required for that?", "response": "By default, the button on the left is treated as \"right click\" and the button on the right is treated as \"left click\" (so backwards from a traditional moue).  With the Razer software you can set up a profile to auto load that switches this, sensetivity, macros, etc."}
{"product_id": "B001E27DLM", "context": "it works on Nintendo 3ds?", "response": "Absolutely on all Nintendo3D models"}
{"product_id": "B003O3EFY2", "context": "i need some type of adaptor to connect this unit to my TV,  saw some on you tube but don't want to waste any more money, any solutions??????", "response": "it comes with standard rbg (av cable)"}
{"product_id": "B009IR1SR0", "context": "Does this game download work on Windows XP too?", "response": "I had that game installed on Win XP and it worked perfectly :) , now im on Win 7 x64 and i dont see any problem."}
{"product_id": "B001EYU1WS", "context": "Does this connect with USB?", "response": "Yes.  It works with X-Plane as well.  You may have to set up each switch depending on the plane you're using."}
{"product_id": "B0007MZWQS", "context": "Does it work on a modern TV?", "response": "Hey,  I have an old Genesis and I have it plugged into my Sony Bravia HD 1080i HD tv and it works.  You need the proper cables."}
{"product_id": "B000GCJ6MK", "context": "Does it work on Mac?", "response": "I have heard that some Mac's can run Windows. So, unless your Mac is running Windows XP, Windows Vista, Windows 7 or Windows 8, I would have to say no."}
{"product_id": "B009ZDPYKO", "context": "Can this skylander be used with the new skylanders trap team new traptanium portal?", "response": "It sure can!! My son and I have the Trap Team and Traptanium portal. This is one of my five year old daughter's favorite characters. You should hear her stand up and yell, \"Be afraid of the bark!\""}
{"product_id": "B00001IVRD", "context": "Does this work on Windows 8 x64?", "response": "i couldn't even get it to work on windows xp. so i am not the one to ask."}
{"product_id": "B0009WPZOA", "context": "Does this game have offline multiplayer (splitscreen)?", "response": "Short answer, yes.The offline experiance is much better if you finish the career first."}
{"product_id": "B00DC7O77A", "context": "Is this a Gamepad only game or can a Wiimote be used with it?", "response": "Wiimote can be used too! :)"}
{"product_id": "B00ECOBFA4", "context": "is there a free play mode", "response": "Yes, Cynthia. There is a free play and story mode. Its easy for kids, as well as adults, to get around."}
{"product_id": "B008KH7NZA", "context": "Is this headset PC compatible? Why doesn't it specify?", "response": "Itis compatible but u have to use the 3.5mm cord... alot of wired connections though."}
{"product_id": "B0050SX7BQ", "context": "The item isn't the special edition. The special edition is a steel box version. am i wrong?", "response": "the special edition and the standard edition all the same thing theres nothing really different set for the case.i have both i say it is all the same"}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "It reduces the time between trigger engagements by half and stops your trigger at the exact contact needed to fire in most fps; making shooting fast, however, it is only designed for semi-auto weapons."}
{"product_id": "B00FM5IY38", "context": "How long did it take to install yours? Mine's going on 5 hours, and it isn't installed enough to actually start a game.", "response": "Mine took about the same amount of time give or take a minute...  Very long and slow to install..."}
{"product_id": "B00IIHU44E", "context": "is the xbox works on 110 or 220 volts?", "response": "In the US it's 110 volts"}
{"product_id": "B000QJ1NS8", "context": "When I turn on my gameboy sp it says the internal battery has run dry and clock-based events will no longer occur.  will this fix my problem?", "response": "No, that is the battery within the game cartridge,  which is a watch battery."}
{"product_id": "B0050SVNP8", "context": "Do you have to have played the first version to play Black and White 2?", "response": "Not \"required\", but I would suggest playing it first. It sort of pieces the story together."}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "The 120 GB system plays PS2 games. The 500 GB system can play PS1 games and PS2 games as well as PS3 games."}
{"product_id": "B0065NP6NC", "context": "Can I play a previous save from the original Fallout New Vegas or will I have to start over from the beginning?", "response": "Yeah, if you backed them up on a flash, etc."}
{"product_id": "B00009ECGK", "context": "Do I have to pay monthly or yearly to play WOW and how much is it?", "response": "World of war craft the last I check it was 15"}
{"product_id": "B0094H8H78", "context": "can you save your games ?", "response": "No. Waste of money"}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Hyrule Warriors?", "response": "dont have this game but it works with other wii u games. enjoy."}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "All the text is in English with Japanese voice."}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "It should.  The game itself is downloaded on to the computer and stores the data there, so it should be compatible on anything."}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "I think the graphics in some ways are better.  I enjoyed them both but I liked the tomb raider storyline a little more.  But then I've always liked tomb raider."}
{"product_id": "B002BSA20M", "context": "Can this be played without an XBOX Live membership?", "response": "Yes, it has single player campaign, firefight, and multiplayer options. This is one game that let's you do pretty much everything without needing Xbox live."}
{"product_id": "B0002EAA36", "context": "I am assuming, it is analog? Want to us it as an economical substitute for an E-brake on a racing sim.", "response": "Yes, i use it for my warplanes on warthunder and it works like a ps3 controller would work, you just have to program the controls right"}
{"product_id": "B0050SX7BQ", "context": "This game is in language or subtitles in Spanish?", "response": "I did not see Spanish on my game. Sorry"}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "Everything but the Address book. I have tried eveything and the address book does not work"}
{"product_id": "B00AIALGZK", "context": "does it drive thru Ireland?", "response": "I don't know of any maps released for Ireland.  Russia, Eastern Europe and a couple stand alone maps. Be sure you check the compatibility for maps. Some require a new driver profile and no other maps in that profile."}
{"product_id": "B00E6OLJ88", "context": "How fast is rapid fire", "response": "I brought this for my grandson, he loves it"}
{"product_id": "B002L6HJCI", "context": "Did everyone find a cd key?", "response": "I already had one from my cd pack was just missing a couple CDs"}
{"product_id": "B00GOOSORM", "context": "I'm new to this.  I've never heard of a time card.  Can someone explain what it is please?", "response": "Game requires a fee"}
{"product_id": "B008UQWX0Q", "context": "what is the age group of this?", "response": "You can get games for 5 plus... My son had one as a six year old and it was fairly sturdy... We were impressed."}
{"product_id": "B008WZRZJY", "context": "Does this game run on Windows 8.1? Thank you for an answer", "response": "I do not know. I use windows 7."}
{"product_id": "B001IYR53W", "context": "will it work with Windows 8.1", "response": "It did not do well for me with windows 8."}
{"product_id": "B0057S9SYY", "context": "are these wired or wireless because somebody said and i quote \"These are wired but can come wireless\"", "response": "Hello! These are wireless."}
{"product_id": "B00GHTP4ZY", "context": "does this include the main game plus the expansion or just the expansion???", "response": "It included the main game and expansion but don't waste your money. Wait till all the updates for SimCity come out and then buy the complete edition when EA releases it for a tenth of the cost. Remember if it's made by EA, you can be sure they will gouge the price you pay."}
{"product_id": "B002672Z80", "context": "Does this come with two remote controllers?", "response": "No. This comes as 1 full remote with nunchuk."}
{"product_id": "B00FLZ4FS2", "context": "Hi! Will this code work on a foreign account or just on an american one? Also, how long after the payment confirmation till the code is emailed?", "response": "Code is sent via a physical card, not through email. As for foreign accounts, I'm not sure."}
{"product_id": "B002Q4U5DK", "context": "Is it eligible for a laptop?", "response": "yes it is functional with a laptop. you need USB port. It's also eligible for super saver."}
{"product_id": "B0072A4JVW", "context": "I heard about the damage that give the ps vita shoulder trigger. Is that true? I really want to buy this hand grip but the review left me uncertain?", "response": "the trigger grips are really worth it. Like all products, there will be wear and tear but it depends on how much and how vigorously you use them. Honestly I used them so much, that I can't play without them. Get them bro."}
{"product_id": "B009WI7V9E", "context": "Is the DLC on a separate disk or download via codes?", "response": "They're preloaded.  No codes needed, just play the game and any DLC will already be present in the game.  What a concept, pay the price for a game and get everything without worrying about paying to play for more of the game."}
{"product_id": "B00HG0B8NA", "context": "does this game have undo option?", "response": "you can only undo your last move.  It has 13 games. It has hint."}
{"product_id": "B00CPS59CE", "context": "Does this come with the bluetooth wireless chat adapter as shown in the photo?", "response": "Yes it come a with a wireless adapter for an Xbox 360 controller."}
{"product_id": "B0095C0I4W", "context": "Does this work on Windows 8?", "response": "No, I have not been able to get any of the games to work on Windows 8 at all.  They download but you are unable to play them.  I have tried re-installing the game with no luck.  DO NOT BUY IF YOU HAVE WINDOWS 8"}
{"product_id": "B00004XRBB", "context": "Anyone run this on windows 8.1", "response": "Not that I know of. It works on windows 7. It might work on windows 8.1."}
{"product_id": "B00FOHP8XI", "context": "do it play dvds", "response": "Yes. And blue rays"}
{"product_id": "B0095P5K8I", "context": "Does this feel exactly like the blue e-blue cobra? Same size, weight, etc?", "response": "Yup they are exactly they same outside of the color you fancy."}
{"product_id": "B00CX8VY4S", "context": "Is this watch dogs a disk or download", "response": "Hi leo, it's both.... you can buy the disk or download for Xbox One and also Xbox 360. http://www.xbox.com/en-US/games/watchdogs#fbid=-nNsNr5aBkK"}
{"product_id": "B00A8HIGSS", "context": "Is Motion Control required to Play this?", "response": "Not at all. If you have it you might want to try it out and see what that is like but you don't need it to play it. So don't worry!"}
{"product_id": "B00IJQJYHC", "context": "Does it have a good key response? I know it's not a mechanical one, but I like the mechanical, how does this compare?\"", "response": "I really like the feel of this keyboard, very positive engagement and I can type my full 60 wpm with this thing. I'm quite surprised. It isn't perfect (a bit odd spacing to the return key), but it is very, very good."}
{"product_id": "B0099OZR9W", "context": "After installing, I get disc reading errors and it takes multiple tries for it to read. If I remove it, it reads the disc fine. Is it a bad drive?", "response": "Sorry to tell you, yeah it's a bad drive. These aren't official Microsoft hard drives, so sometimes they won't work. Try returning it. Mine works pretty nice, but had I known that it wasn't actually produced by Microsoft, I wouldn't have bought it."}
{"product_id": "B00G21VQ2M", "context": "Is there an english version?", "response": "Nope. For now it is japanese only."}
{"product_id": "B007SRM5MO", "context": "are this games safe for kid 14 yrs old", "response": "Sure..no bad language.Batman and allies beating up bad guys...no killing.Good puzzles and challenges to solve"}
{"product_id": "B002CZ7P04", "context": "I was addicted to the Island Cycling game on Wii Fit Plus.  Is this game as fun in your opinion?", "response": "I have never played Island Cycling but I will say I got pretty addicted to this one!"}
{"product_id": "B008CXTW5G", "context": "What is it made of? Is is plastic or some kind of metal? I am referring to the main chassis", "response": "it's made of high quality plastic, with a metal plate on the inside of the keyboad, it's pretty heavy and does not feels cheap or filmsy, but beware of the other problems this keyboard has, look out for my review."}
{"product_id": "B002I0H2AG", "context": "Can I still enjoy it as a purely single player experience (for the price)?", "response": "Yes, the singleplayer took me about 8 hours to complete"}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac OS Mavericks? If so, how smoothly?", "response": "Sure does, running it right now. If you're loading up a big game it'll be a little slow to start but I've found that to be the case regardless of platform or OS. Hope this helps"}
{"product_id": "B0094H8H7I", "context": "What genesis cartridge games will not work on this?", "response": "Some games which do work, but are considered unplayable due to graphical glitches include OutRunners, Contra Hard Corps, and Castlevania Bloodlines.Games that will not work at all include Virtua Racing (due to it's use of the Sega Virtua Processor chip)"}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "A.L.V. nailed it.  The cover isn't really effective though as it only covers the RGB camera and not the infrared one."}
{"product_id": "B000FQ9R4E", "context": "After playing about 3 games, the game seizes up and won't let you play anymore and you must shut the whole Wii off. Anyone else have this problem?", "response": "I've never had that problem with the game"}
{"product_id": "B00FAN4LRA", "context": "What is the type of connector called? The one that kinda looks like a micro usb......", "response": "It's not micro usb ... it's actually smaller & has more pins. It plugs into the SteelSeries usb mini-sound card or one of the included headphone/headset adapters. One with mic & headphone connectors or one combined connector for cellphones/ipods."}
{"product_id": "B00FYAQUPU", "context": "Can you buy the dark characters seperate from the starter pack? I have the Swap Force game and portal but want to buy the dark characters?", "response": "I'm don't think you can, unless you found someone that was selling the characters by themselves. I don't believe they're sold individually like the other characters."}
{"product_id": "B005HN5LKY", "context": "Will this work for european plugs?", "response": "I don't beleive so, no"}
{"product_id": "B00519C7CE", "context": "Call of duty black ops LTO Edition x box is it  black ops 1", "response": "Yes its black ops 1 it just has a code for you so you could download the accension DLC"}
{"product_id": "B002L6HJCI", "context": "Is it a reductions version of all 3 AOEIIIs, or a better and expansion of AOEIIIs?", "response": "I do not know! I have never played AOE in the past and just bought it for fun"}
{"product_id": "B0086V5V8G", "context": "how much of the game is stealth  or can you go in guns a blazeing", "response": "Hello sir, the game is very realistic and strategic, You cannot go with a gun and shot everybody like other games, you need to move with care and make good shots when you do it, I really love it !!!"}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "The 2013 is the recommended version for Windows 8 , Version 2012 also works on Windows 8 but with minor compatibility issues."}
{"product_id": "B00GBCLG0E", "context": "hello tell me the console includes control, hdmi cable, and the game you see in the box?", "response": "It came with the last of us, batman arkham origins, the controller, the PS3, and the red whit yellow audio video cords. There was no hdmi cord included."}
{"product_id": "B00IVJ1M7M", "context": "will this product work for me in australia?", "response": "Yes. it's English version only, but not regional games from another country."}
{"product_id": "B00FB4BUMW", "context": "is the keyboard rgb?", "response": "No it is not RGB"}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "The head set connects to the controler with a wire. Is wireless from there on ok."}
{"product_id": "B00FM5IY4W", "context": "What cars do you start with?  Can you get a Mustang?", "response": "Yes, the 2015 mustang is a free dlc"}
{"product_id": "B00ATHFLZS", "context": "what the design on it called?", "response": "The design on the top resembles the power lines from a circuit/motherboard."}
{"product_id": "B0016HG4H4", "context": "Is this set wireless", "response": "Kind of. There is a USB dongle that attaches to the Wii itself with a wireless receiver button on it. You press that button and the sync button on the drum set to 'wirelessly' sync the drum but it still requires use of one of the USB ports."}
{"product_id": "B00EV4O8VS", "context": "does the wii u have  a hdmi port to play instead of the red white an yellow wires", "response": "I bought the game x my daughter in college. I saw them playing and as usual is to me the same horse manure"}
{"product_id": "B00ENFVJJO", "context": "Will this work in the US? Also does this have a trickle charge or auto shutoff?", "response": "It does work in US. I'm in IL and it works great! The charger will shut off onc it notices the battery is already charged."}
{"product_id": "B005G4CXPK", "context": "Will this run on windows 8.1?", "response": "Yeah, it worked for me!"}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "You can definitely play it without Xbox live. That's what I am doing right now because I haven't updated my live membership yet. You only need online play for extra side \"activities\" like trading fleets, multiplayer, and battling your friends online. But the normal storyline works fine without a membership."}
{"product_id": "B00BCEK2LA", "context": "Does this work with Windows XP?", "response": "Yes. I have used it for XP and Windows 7 without any problems. Excellent mouse. It just stops working in a short period of use."}
{"product_id": "B00BGA9YZK", "context": "Is the game a disc or just a digital download", "response": "I know is that this only disc"}
{"product_id": "B001DU25UO", "context": "According to the May Flash website under the support/driver download sections it says it supports windows 8 as well", "response": "Yeah this does work with windows 8.1"}
{"product_id": "B003Q9RGRW", "context": "Does this come in the original box as shown in the picture??", "response": "When I got this it came with the box and hard plastic (not the clamshell stuff) over the hardware."}
{"product_id": "B000RA778G", "context": "Can you add your own puzzles?", "response": "I believe you can only play the puzzle in the game no way to add your own."}
{"product_id": "B00BQWTGIS", "context": "My husband really likes this game.  Can someone please suggest a couple of other games that are similar?  I'm Christmas shopping.", "response": "gta 5 (ask him if he already has it)assasins creed unityfar cry 4call of duty: advanced warfare (a shooter game, but still one of the best games of the year)or search on google and/or amazon: open world games"}
{"product_id": "B003RS1A7Y", "context": "Does this work with Lego Rock Band for PS3?", "response": "No. It only works with Rock Band 3."}
{"product_id": "B00ERDGMSA", "context": "wait so does this come with all dlcs and skins for pc?", "response": "well its most dlcs beside 3 hunter packs and1 dlc with +10lvls, and no ekstra skins at all :) all of this must be bought separately"}
{"product_id": "B009SJR28W", "context": "Does it still light up without the use of the synapse software?", "response": "Yes it does. And you can change the light brightness on the keyboard. FN+F11 and F12."}
{"product_id": "B007OVHW90", "context": "will it work with the px5", "response": "Probably not, since the controller input for the 360 and PS3 are different sizes."}
{"product_id": "B00CX9L30W", "context": "What does the PC Download Collector's Edition come with? I purchased it and I don't see any of the in-game exclusives, nor do I see anything sent .", "response": "If you have gotten the collector's edition you need to go to a Moogle Mail NPC somewhere in town. Look on your mini-map for a sealed letter icon, and you should be able to pick all the items out of your mailbox. Hope that helps."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "I got two months with mine and I love it!!! Leds are fine!"}
{"product_id": "B00009ECGK", "context": "Does this need a CD key?  Will I be ok if I buy a used copy?", "response": "It does have a CD key, but the code can be reused. I have used mine to download it onto many different computers."}
{"product_id": "B00CD90R72", "context": "How this year's version compare to the 2013 version? Is the learning curve steep to someone new who hasn/t played fifa before?", "response": "Hi, the differences are in graphics, players, the online game mode, celebrations, etc. The controls never change between versions. If you have the 2013 game the control settings doesn't change."}
{"product_id": "B0091A3AHA", "context": "is a tv or what ever that screen is included", "response": "Its a monitor that is included, not a TV...its awesome i love this thing"}
{"product_id": "B00IJQJYHC", "context": "So, this keyboard doesn't have those stands in the back? So is it just FLAT on your desk? Isn't that uncomfortable?", "response": "No it doesn't which is the only thing wrong with this keyboard. The keys are comfortable and we love it even without the stands"}
{"product_id": "B00GHTP7SS", "context": "This is only the code? Where do i download the game from after buying the code?", "response": "you can redeem the game on steam."}
{"product_id": "B0050SVNP8", "context": "I wasn't able to play the first Pokemon B&W due to Nintendo cutting the wifi access, will this game spoil the experience of the first game?", "response": "the game was a gift. I didnt play it. But my nephew loved it.the internet support is not present for this one either. From other reviews, it seems there isn't much difference between parts one and two.not to say a spoil, but it sounds as though u would be better off jus starting with two."}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "Only because of the fact that it's a japan import and not in America yet when it hits North America it'll be the same as he black controller"}
{"product_id": "B0090WBXSM", "context": "It will work fine with Android Box Minix Neo X8H and Ipad Mini 2?", "response": "Yes, as far as the mini box has Bluetooth. On both with games that support a gamecontroller"}
{"product_id": "B00FM5IY38", "context": "Can this game be played entirely with Kinect? I saw a trailer advertising it as a Kinect game but all gameplay video show the player using a remote.", "response": "This game is played with controller, but Kinect voice is optional for game play."}
{"product_id": "B002I0K3CK", "context": "How many hours does it take to play this game from start to finish?", "response": "Depends on what your goal is. If you're just playing through the game normally, it could take a couple/few hours.100% completion is a different story..."}
{"product_id": "B00A378L4C", "context": "How does the '00' key work in numpad mode? Is it a distinct key code, or does it just send '0' twice?", "response": "The latter, it sends the \"0\" digit twice. Not sure how useful this is for you but I rarely use it."}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "It should be compatible.  Really awesome game"}
{"product_id": "B0072A4JVW", "context": "Does this get rid of having to use the rear touch pad?", "response": "It does not, the only way to not have to use the back touch pad would be buying games that don't use it. This does however prevent accidental slip ups when your fingers just happen to touch it. Also makes the system fit larger hands way better."}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "It depends on the model of your Wii, the newest versions doesn't have the controller slot or the GameCube memory slot."}
{"product_id": "B00BY0G0YU", "context": "I see that there is special strategy guide for FFX. Now is that because the game has new content or does the guide itself have something extra?", "response": "It seems like there might because of the new content. Looking at the difference between the old X-2 guide and this one, there is more content with a slight change in layout. The basic information is still the same. Nothing really more then the game other then the other guide."}
{"product_id": "B008VQ68C4", "context": "How long are the cables? I plan to game on the couch with these bad boys, but I need to make sure I don't have to be close to my tv.", "response": "I just stretched it across my room to measure it for you and i ran out of room lol. It's over 15 ft. Very long."}
{"product_id": "B00EZAWV6W", "context": "is it better on pc or xbox?", "response": "I would say most games are better on an Xbox but the pc version of this game works really well. The graphics are great, colors are vivid and there's no lag time in play. I bought this version so our son could play it and not tie up our big screen TV. It was a great compromise for us."}
{"product_id": "B00GZ1H07Y", "context": "Will this game play on the PS3 console?", "response": "No, PS4 is not backwards compatible. I'm sure if there is a PS3 version, that would work."}
{"product_id": "B002QHDKE8", "context": "Should I play skate 1&2 before Skate 3? I usually like to play games in order but I only have $40 to spend and my friend was telling me about how awes", "response": "Skate 2 has a lot of spots and I play skate 2 a lot more than skate 3 because of it, skate 1 is good but the camera angle is low and you cant switch it but it is still fun. I would buy skate 2 first if you skate street"}
{"product_id": "B0050SYDEQ", "context": "Is this better than the second one on Xbox 360?", "response": "No the second game has better graphics and better cars."}
{"product_id": "B009AGXH64", "context": "Can I use the original Wii controllers (The ones that are NOT \"plus controllers\") with the Wii U?", "response": "Yes, any sort of remote that works on the Wii works on the Wii U (except for gamecube controllers...for now)"}
{"product_id": "B009DYOPK0", "context": "How big is this mouse? Full grip? I have big hands and don't like having to use claw grip when mice are too small.", "response": "I have large hands as well and I comfortably use a near palm grip. You can full palm grip it though."}
{"product_id": "B00BGAA29M", "context": "Hello. How many players can play?", "response": "I believe just one can but it's a fun game though"}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "I am not sure if it is compatible with Windows 8. It is not a great game. You may get bored after one use. Good luck."}
{"product_id": "B00H1FCUBE", "context": "Is there a mute button for chat?", "response": "It dos not work as Bluetooth device at all. Works as wired head phone. Even touch control does not respond for muting."}
{"product_id": "B003VH5Z2C", "context": "I have a 21 inch all in one. Can I hook it up to it?", "response": "Yes. I purchased this product though and it did not work, it would hook up to the TV and turn on but it would not read any games I put in it. I tried multiple games none would work."}
{"product_id": "B005EOOT90", "context": "can theses be used on a pc", "response": "I have no clue. Havent tried it. my son used it for xbox."}
{"product_id": "B001NT9TK4", "context": "Does the stick shift move just like in a real car?", "response": "Yes its a six speed and reverse you push down and far right downwhere sixth gear is.Personally i never use it but their are people that do.I use the paddle shifters."}
{"product_id": "B00GU8W5AE", "context": "Can the scroll wheel be moved right/left for horizontal scrolling (like in some Logitech models)?", "response": "Yes it can. While the scroll wheel itself does not go from left to right or vice versa to scroll the page, you can hold in shift. I think that by holding in shift it's a function of your operating system, and not the mouse itself. I was unaware that Logitech's mice scrolled left to right."}
{"product_id": "B008CP6Q6M", "context": "Is it a free roaming game?", "response": "Yes. As you progress through the story, more areas open up, but they are all free roam. Think of inFAMOUS as a sandbox superhero game."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "It takes 10-20 minutes to install you don't need an internet connection however you do need it to download and install the updates. Obviously the game won't be the same with the updates I recommend updating as it has several improvements to the game and adds more content (Cars, Guns, etc)"}
{"product_id": "B00EEMLRTS", "context": "is this worth the price", "response": "I think it was worth it because the original price was $200 and I got it for half of that but the game itslef isn't that great"}
{"product_id": "B000OLXX86", "context": "Does this come withthe bonus content disk?", "response": "I don't know for sure if EA has changed the contents since I bought it, but if it's the Platinum Hits edition, the bonus disc SHOULD come with it."}
{"product_id": "B005EQE0YM", "context": "Are the cups on this headset circumaural (fit around the ears) or do they lay on the ears?", "response": "I would say they fit around the ears unless you have really large ears"}
{"product_id": "B000K9Q5NW", "context": "does it come with g 27 gear shift holder", "response": "No you have to purchase it separately through amazon"}
{"product_id": "B00FEOR4MY", "context": "It looks as if you can play on it without taking it out of the case?  Has anyone been able to do that?", "response": "Yes, you could play it in the case but it might hinder some gameplay"}
{"product_id": "B00HWMP0OU", "context": "hello, is multilingual, I need it in Spanish", "response": "Yes, it is. :)"}
{"product_id": "B002I0K6X6", "context": "Is this PC compatible?", "response": "no it is not only for the ps3"}
{"product_id": "B004UJNN5G", "context": "do you need to buy the sims 3 before this?", "response": "Yes. This just an add on"}
{"product_id": "B00002SANH", "context": "One of the reviewers mentioned having prostitutes at the end of the game. I am looking to buy this for my grandchildren. Are there prostitutes?", "response": "Prospectors, maybe but NO prostitutes :-)"}
{"product_id": "B00005B8G3", "context": "On a scale from 1 to 10, how bright is the screen?", "response": "The screen is not overly bright.  It is good for playing games.  I do not remember if there was a brightness control.  I hope this description is good enough without resorting to a scale."}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "I had the same problems as the others when I first loaded the program. After some research I went back online and updated my DirectX drivers and the program worked fine. I thought my drivers were already up to date but some additional files were installed. I tried the same process on another computer with success."}
{"product_id": "B0050SVMYA", "context": "do we can play a ds games in a ds3?", "response": "Yes, the Nintendo 3DS, 3DS XL, and 2DS can play 3D games. The regular DS or DSi cannot play 3D games, however."}
{"product_id": "B00EF1OGOG", "context": "How long does one charge last without charging it again? I guess if I leave on standby, how long will the charge last?", "response": "I don't understand your question."}
{"product_id": "B00BA9AWTO", "context": "After installation, would I need to have the disc to play?", "response": "It has been working for me without the disc in, but I have other WMS games also installed and as long as I have one of their discs in, I can switch to the other games without switching discs."}
{"product_id": "B00GD962OA", "context": "Can you play movies on the wii u console?", "response": "No the Wii U will only play Wii U games and Wii Games."}
{"product_id": "B0053B66KE", "context": "Is Pokemon X and y a good entry for someone who has never played any Pokemon game at all but does love to play RPG's?", "response": "Yes.  As a person who has played almost every pokemon game and many other RPGs, Pokemon x and y are easy to learn."}
{"product_id": "B002BRZ9G0", "context": "Myself and one other person I know purchased this game when it was first released. Now when we load it in Wii it won't work, says it's not readable(both games, no damage to them) ??", "response": "I purchased this game for my grandson.  It works great, no issues."}
{"product_id": "B00D9EPI38", "context": "Can i play dvds from it?", "response": "I had owned an older model off the Xbox 360 that did but this one is saying I need some other program. I do know that they do play dvd's I'm just not sure exactly why this one doesn't."}
{"product_id": "B000GCJ6MK", "context": "does fsx work on windows 8.1", "response": "Is this an expansion kit, or is the full FSX installation? This price on this way cheaper than the Gold and Standark packages I see for sale here on Amazon. Thank you!"}
{"product_id": "B0050SWBAE", "context": "My 5 year old loves the Pikmin mini game in Nintendoland do you think Pikmin 3 would be too advanced for her?", "response": "I think it could be hard.  The Learning curve will get harder after the early stages."}
{"product_id": "B00ATF5YZM", "context": "I downloaded the game COD 4 MW but steam isnt working and i cant get to my game!!!!", "response": "fortunately or unfortunately, you must download Steam, and register to play the game thru them. this is in addition to any other problems you may or may not have."}
{"product_id": "B00AAS88K6", "context": "If I swapped the batteries with Rechargeable Eneloops, would this be able to charge them over the wire like the Logitech MX Performance mouse can?", "response": "I'm not totally sure (I haven't tried rechargeable batteries in mine) but I don't think it would charge them. As far as I know, Razer uses their own battery packs in their rechargeable mouses."}
