{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "It does require batteries. My husband uses the rechargeable. It's wired to the controller. :) Hope that helps! (and I'm sorry for the delay - this email was lost!)"}
{"product_id": "B0081GA50U", "context": "Does this Work with 2000 series?", "response": "Yes it do work"}
{"product_id": "B0009PRCNO", "context": "is it cracked or it takes only original games? like does it take copied games?", "response": "Well I never tried it with copy game, but it plays 1,2,3 ps game"}
{"product_id": "B001AATQ0Y", "context": "can i plug in the original play station 4 way multi tap and that way i can play 4 controllers on one plug?", "response": "I would think so. It works with my dancepad and other peripherals."}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "No, however there is a stand alone expansion appropriately called \"Don't Starve Together\" that's in early access on steam."}
{"product_id": "B00FE8WKMO", "context": "Does the Wii balance board work well on carpet?  I notice all the pictures show it on hard surfaces like wood, tile, etc.", "response": "I use my wii balance board on the carpet and I do not have any problems with it."}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "Loose means not in original packaging."}
{"product_id": "B002I0JZIS", "context": "can i play with someone on the ps3 with the vita", "response": "No, I tried it and it didn't work"}
{"product_id": "B00G0OYHCW", "context": "What does this deluxe set come with besides the games? Does it include the charging station?", "response": "It comes with a cradle that only holds the gamepad, a cradle that you plug the charging cord into to use as a charger, and the cord to use when you're charging and playing at the same time. It comes with everything you need."}
{"product_id": "B00E1L786S", "context": "26.5 pounds ? but other webside said it just 4kg,are you sure about this?", "response": "I would say its less than 10lbs....shipping is under 15 lbs with all of the packaging"}
{"product_id": "B008JHH5RC", "context": "Does the circle pad pro work with this skin?  I wouldn't see why not, but would like to know.", "response": "It does work with the skin."}
{"product_id": "B00030GSJY", "context": "How will this work with Elite Dangerous?", "response": "It will work. Almost every single control can be assigned to something. Either you can set it up, or download a profile from Saitek. Personally, I use it more for X-Plane and Flight Simulator, so this isnt my top-quality response, but it will work with Elite Dangerous. Try watching some videos ;)"}
{"product_id": "B00B67ZTUW", "context": "Is there any option to set this game to Japanese language with English subtitles?", "response": "No, but it's still a great game."}
{"product_id": "B000J18SR2", "context": "can it run on windows 7 or 8.1", "response": "Yes Windows 7, but it is full screen, no window. F3 can pause the game, but you have to get the volume level right before you start because you can't adjust it during the game."}
{"product_id": "B00CH923NE", "context": "Does it come with the PIN for the Nintendo shop? I can't seem to find the code anywhere.", "response": "I recently found out that Nintendo no longer prints an individual piece of paper with the pin. Now they use the the same game cover sleeve.http://en-americas-support.nintendo.com/app/answers/detail/a_id/2330/~/where-do-i-find-the-pin-or-serial-number%3F"}
{"product_id": "B0061PAZUS", "context": "Is this easy for beginners to follow?", "response": "Yes, it takes some practice at first and then the routine gets easier."}
{"product_id": "B0065NP6NC", "context": "Are the missions like Call of Duty (mission 1 must be completed before mission 2) or like Far Cry (you can complete missions in different order)?", "response": "Whatever order you want really, just not when they have chain effects. Too early and you ruin later missions."}
{"product_id": "B0087N222Q", "context": "How do i plug this pair of headphones To the ps3 so y can speak With my friends(black OPS 2)?", "response": "This is the problem we had. You don't plug it in. You have to sync it with PS3. We were able to do that through audio settings, however we couldn't get the thing to work. Very frustrating! If you do figure this out please let me know. I'm sorry I couldn't be of any help."}
{"product_id": "B008BGXYBM", "context": "Can you change the color of the lights on this, or is it only green?", "response": "It is only green, although the green led on this mouse is something I wanted in a mouse, it would be nice to customize the light on a high end mouse like this though :/"}
{"product_id": "B006YDPU48", "context": "IS THIS GAME ONLINE ONLY?", "response": "No. Very much playable offline. Missing out on core parts of the game such as invading other peoples games, and having friends help you with bosses. If able too, online would be prefered."}
{"product_id": "B00IP0H4GA", "context": "does this play on American console?", "response": "Yes!!! and it works perfect"}
{"product_id": "B001FBHT34", "context": "Can you make this compatible with a ps3?", "response": "Sorry but I don't know if you can or not.  Sorry!  :-("}
{"product_id": "B0017KIBAI", "context": "Is this the type of plastic that will turn yellow after a long time of use?", "response": "Has'nt turned yellow on me... I always make sure my hands are clean before use. Seems like they are nice reliable controllers."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "I have used it for Netflix and Hulu.  It works for both of them."}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "I am not an expert or anything but i have a US PS3 and it worked fine. Though I would take Note before buying this  that you have a HDTV and HDMI Cord because this game can only be played in 1080p."}
{"product_id": "B0094H8H78", "context": "is the screen backlit? In other words will I be able to play the games in a dark room?", "response": "Yes, it is backlit."}
{"product_id": "B0050SZ0SY", "context": "Will this work with Win 7??", "response": "Yes. I had zero problems to install and run it on my standard Dell machine with Win7"}
{"product_id": "B00C710AT6", "context": "does nba 2k14 work for mac", "response": "As far as i know, no"}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "Yes, the belt is necessary BUT it already comes included with the game. I found this out after I purchased an additional belt. I love this zumba though! Have fun!"}
{"product_id": "B0009VXBAQ", "context": "Is this just the regular Wii?  I had one but my daughter took it when she left and now I can't watch Netflix or use the Wii fit.  I have the disks.", "response": "Um, the one I bought that is like this lets me watch Netflix on it. I don't really use Wii fit. It doesn't play DVDs, but you can do Netflix online."}
{"product_id": "B008YRITPO", "context": "How long is the wire on this keyboard?", "response": "I measured mine... it's five feet long."}
{"product_id": "B00CERXJNW", "context": "how wide is the keyboard?", "response": "19 3/4\" wide6 1/4\" deep measured at the base of the unit"}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "I have it running on Windows 8 so I'm thinking 7 would work too."}
{"product_id": "B005OSFUZI", "context": "Does it work on Windows 7 OS?", "response": "Yes it plugs straight in and works once it sets up the driver. You can use it with Audacity, but there is latency so if you plan to record, lay the guitar track down first without headphones!"}
{"product_id": "B0090WBXSM", "context": "Does this work with the Fire Stick?", "response": "Each time I've 'paired' this controller with either the FireBox or the FireStick, I've had problems getting it paired (took many attempts) but once it finally paired up with the Fire Device, it worked OK..  If I had it to do over again I would purchase the Amazon Controller."}
{"product_id": "B00D4WTO1M", "context": "Hello , good afternoon , the game that sold you sell in physical or digital ?", "response": "Is good game if u want to play online is a problem they camp together and running together and I stop playing online"}
{"product_id": "B00GOOSORM", "context": "I'm currently stationed in Japan right now but I have an account registered in the NA region. Would I be able to use this to add days to my account?", "response": "Yes it will work since you will be using the English website of Mog Station to use the code."}
{"product_id": "B0017HLYNC", "context": "Is this for adults or would it be appropriate (language, content, scariness, etc) for a 10 yr old? We've enjoyed the Nancy Drew games.", "response": "The first disk is ok, but I was not happy with the second , because sadly they started to use some rather strong language especially near the end of the game. I would say the parent should first play disk 2 and decide."}
{"product_id": "B002I0K3PM", "context": "Is the game worth the price?", "response": "I'd say so because it's the best [original] Lego game so far.There's a huge con about the game, which is, the loading times take about 30 seconds to 1 minute, in fact the pre-game loading times takes really more than 1 minute (I timed it)."}
{"product_id": "B00DRKJBC8", "context": "How do you use it?", "response": "You need a Steam account (it's free, in case you don't have one) and then you just need to activate the code you receive in your e-mail, from Amazon.It's not harder than that!"}
{"product_id": "B00C7103DO", "context": "Have the season pass and/or DLC's been integrated in one single game/CD yet or do you still have purcahse them separately?", "response": "i got the game as part of the 'last of us' ps3 bundle last december and did receive a code for an online pass for batman but i can't say if buying the game seperately you would get this."}
{"product_id": "B0096L2SJ0", "context": "Does this fit with the phone, when it has a case on?", "response": "Perfectly! All the way to a Galaxy Note. This thing rocks. Good investment and makes games so much easier. Just get REAL BATTERIES. No cheap ones orb it won't connect at all."}
{"product_id": "B00EOUL7T0", "context": "Will this work with a Universal Afterglow headset", "response": "Yes it is used for xbox for the controller"}
{"product_id": "B00FYAQUPU", "context": "Can you buy the dark characters seperate from the starter pack? I have the Swap Force game and portal but want to buy the dark characters?", "response": "unless you find someone willing to break apart their starter kit, I don't think the dark characters were offered separately. its a \"special\" edition type of thing as far as I know."}
{"product_id": "B00BGAA29M", "context": "What type of game is this?  Is there strategy involved?", "response": "Minimual Strategy. Like some puzzles and timing jumps and runs."}
{"product_id": "B009RXUOD4", "context": "do you recomend something else", "response": "I bought it as a gift.  I have since heard that it is an awesome headset and performs better than others."}
{"product_id": "B001GIUWX0", "context": "Can I play this game with the Wii U gamepad or do I need a classic Wii controller?", "response": "I just had my son test it. You can NOT use the game pad you need a Wii remote"}
{"product_id": "B0094H8H78", "context": "Can you play music while playing a game?", "response": "Not that I can tell."}
{"product_id": "B0050SZBP6", "context": "Do you get 30 days access to the game with this expansion?", "response": "No you don't. Only the first bundle gives you free time"}
{"product_id": "B000B6MLTG", "context": "will it work with the xbox 360 E?", "response": "It will work with an Xbox 360 elite"}
{"product_id": "B00EEMLRTS", "context": "Will the camera run off of USB power when the battery is 100% drained?  Like how a PS3 controller will?", "response": "Yes it will but don't buy it's crap"}
{"product_id": "B00F4GSAYI", "context": "Do I have to have an additional internal hard drive to play the DLC's like Fallout 3 wants?", "response": "I don't believe so since it never ask me for one.  It just uses the internal that is there.  the only reason I can think of why it would require an additional hard drive is if your drive is full.  you might want to check that and delete any old saves you don't need any longer."}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "Yes, that is what I'm running at home and it works perfectly."}
{"product_id": "B007Y7OP8K", "context": "What format is the game in? Is it for PC?", "response": "yes, this game is for windows pc game"}
{"product_id": "B009XZ1CTQ", "context": "Does the game already have the pick up trucks in them or is that an added mod?", "response": "No trucks, just farm implements and tractors"}
{"product_id": "B004N7IIQ4", "context": "is the mix amp compatible with xbox one", "response": "Yes but you need a xbox one chat adapter"}
{"product_id": "B00B5QLS4A", "context": "I have a SteelSeries 4HD mouse pad,would this work well with a plastic coated pad? I currently have a Naos 5000 that's getting worn out.", "response": "i cant say i've tried that particular pad, but i would think so. i use mine right on my plastic coated desk. i also tested it on my plastic laptop just for good measure. works on paper and cloth mouse pads too. i dont see any reason why it wouldn't and would be very surprised if it didn't."}
{"product_id": "B00EW6QT76", "context": "Does this include Playstation Plus?", "response": "No; just the PS4 (which comes with a controller) and an extra controllerIt does some with $10 of PS Store money"}
{"product_id": "B007LQG9A6", "context": "is this remote fake or really from microsoft?", "response": "Not Genuine xbox 360 controller"}
{"product_id": "B007FTE2VW", "context": "I've heard that there is now a single-player does that mean that if the internet somehow goes off and I am on single player will I still play.", "response": "Correct. The other advantages of single player mode are that the space center work is not bugged and that the prices of the goods are steady and do not swing around. The one disadvantage is that you don't get achievements."}
{"product_id": "B002I0J5CO", "context": "Will this work for MacBook Pro (2014)?", "response": "However you do have to take some steps before they will work. There are guides you can find on the internet that will be helpful."}
{"product_id": "B0081GA50U", "context": "Does this Work with 2000 series?", "response": "Yes Bro The Trigger Grip Is Really Awsome N The Good Thing Bout It Is That It Is Less Cash Add Me On Ps Vita So We Can Play Together DREW_FRO5T N Yu The Trigger Grip Is Awsome"}
{"product_id": "B004XGN8W4", "context": "Does this work with a PS4?", "response": "I don't see why not. It might need some adjusting. There is a bottom molded pad for the console that hugs it securely in place. It may be a bit difficult to fit for the ps4."}
{"product_id": "B0089OBLDO", "context": "I just want to confirm,  I want to use my xbox 360 controller on ps3, and I want to use this wireless,  this should be no problem right?", "response": "You cannot use wireless."}
{"product_id": "B0088MVODO", "context": "How are the graphics for RE 1,2,3? Are they at least like the Game Cube versions?", "response": "I've never played the Game Cube versions but I've played the original PlayStation versions and that's exactly what it looks like."}
{"product_id": "B00B70WKUK", "context": "can you play this game on windows 8", "response": "I have NOT played it on Windows 8; I have been playing it on Windows 7 Professional and it runs pretty smoothly...."}
{"product_id": "B00E8RVP0U", "context": "Can you use this game on a euopean wii player? Is it multi 5?", "response": "thank you,  best regards"}
{"product_id": "B005UI8V6C", "context": "How do you get all three games to download only the Traitor Soul will download?", "response": "The other 2 are on there, you have to access them through the portals."}
{"product_id": "B00CRL9TU2", "context": "Is this NTSC or PAL?", "response": "This particular one is NTSC. Most, if not all U.S releases use NTSC. Here is a link to a handy list http://shop.sandbag.uk.com/OneGiantLeap/PALNTSCInfo.html"}
{"product_id": "B00HLT0YT0", "context": "Why is this 100 dollars cheaper than a Vita without any games?", "response": "The ones without games are Japan imports, plus there were limited supply so their prices rose."}
{"product_id": "B0038PBF1W", "context": "is this just a simulator or does it have arcade play options", "response": "It does have an arcade mode which I normally useIt does have an arcade mode, great game and graphics"}
{"product_id": "B001GIUWX0", "context": "i have a wii system does this game work with both wii and nintendo systems", "response": "The Wii is a Nintendo system. The Nintendo systems it works on is the Wii and Wii U."}
{"product_id": "B002I0H79C", "context": "Does this work in Colombia?", "response": "That is the region 1 version of the game you have to look up what region you live in to see if you can play it"}
{"product_id": "B00503EAG2", "context": "can I put this on steam?", "response": "DLC is Steam, so yes, you have to."}
{"product_id": "B00JC9SWSC", "context": "Does it play Netflix?", "response": "Of course, as long as you are connected to a good WiFi signal !!"}
{"product_id": "B00BZOBE78", "context": "Will this work with Civ 5: Gods and Kings?", "response": "Yes, civ 5 is a conglomeration of 3 discs, if you have stream version, you can update and add much more to the game"}
{"product_id": "B004RMK4BC", "context": "I am trying to ender a psn card to my account but it is saying that it is  no longer valid but i just bought the card 20 mins ago what could be prob?", "response": "Not quite sure. U should contact psn with the code and find out when and how the card was redeemed."}
{"product_id": "B0086UK7IQ", "context": "Did they iron out the firmware on this mouse, eliminating the weird motion skipping it suffered from?", "response": "I would assume so, seeing that I've never had that problem."}
{"product_id": "B004RMK5QG", "context": "When does the year starts running? When I buy the card or when I redeem the code on the PS4?", "response": "When you Redeem the code"}
{"product_id": "B003O6EE4U", "context": "Is it possible to watch DvD's with the Xbox 360?", "response": "Yes you can watch dvd movies.   Not Blue-ray though."}
{"product_id": "B003O6JJKY", "context": "If you buy this can you buy a kinect sensor separate and then hook them up together or do you have to buy one with it built in?", "response": "Any xbox 360 that is a slim model and later can use a kinect and you can buy it separately"}
{"product_id": "B002I0JZIS", "context": "can i play with someone on the ps3 with the vita", "response": "No, you can't :/"}
{"product_id": "B00FATRKLI", "context": "Can I watch amazon streaming videos with this xbox 360 holiday bundle?", "response": "According to Amazon Prime, yes.http://www.amazon.com/gp/feature.html/ref=amb_link_359558142_4?ie=UTF8&docId;=1000739191&pf;_rd_m=ATVPDKIKX0DER&pf;_rd_s=center-3&pf;_rd_r=1RC67KMV8SCQGG02AMFT&pf;_rd_t=1401&pf;_rd_p=1395801862&pf;_rd_i=1000739191#HowToWatch"}
{"product_id": "B000035Y6D", "context": "Does it come in the original box?", "response": "Mine did not, Im sure you can find one that is but mine was in very good condition even though it wasn't in the box"}
{"product_id": "B00JB4WHWU", "context": "Do you have to buy the discs to install in order to play online? Or do you just buy the subscription and play?", "response": "You have to buy the discs or a game key plus a subscription in order to play."}
{"product_id": "B00BMFIXKQ", "context": "My son is 12 years old and really wants to get this game. Is this game appropriate for his age? Should I wait a year or two? What say you???", "response": "It gets pretty edgy at times. But overall I'd say it's not an overly inappropriate game. The only inappropriate things in the game would be alcohol and tobacco use, and profanity."}
{"product_id": "B0032MM2P4", "context": "I want this to work on my laptop. Will it?", "response": "My brother-in-law has a laptop and puts games in them all the time - I don't see why this would be a problem for anyone but I am no expert."}
{"product_id": "B00AU80ZSY", "context": "Once Ticket to Ride has been downloaded, will I be able to play without an internet connection?", "response": "Yes, you can play it offline or online. offline you can play against either computers or i believe you can even play a turn based game on the same computer with friends."}
{"product_id": "B006QRMR4S", "context": "Can This replace my DS lite? Will I still be able to play my original DS games?", "response": "Yes, you will still be able to play the original DS games."}
{"product_id": "B00CMC6HCY", "context": "Is this game easy enough to pick up and play? My son is 6, loves WWE, but I'm not sure if this is too advanced for him.", "response": "It may be too much.  It has a pretty steep learning curve.  There are lots of move situations and kicking out of pins requires good timing. I might suggest WWE All Stars instead.  It is more of a fighting game and really easy to pick  up and play."}
{"product_id": "B00I4BGNVM", "context": "does this game works on windows 7 or 8?", "response": "I'm running Windows 7 Home Premium, 64-bit, no problems here."}
{"product_id": "B005BLAJ68", "context": "does it play pitch?", "response": "Yes, but I have not played that one."}
{"product_id": "B00BMFIXT2", "context": "does it have any downloadable content?", "response": "yes it does, thanks"}
{"product_id": "B00DJYK9L4", "context": "does the game require wii motion plus", "response": "This game works on the wii u an long as you have all the pieces that go with the wii u there is nothing additional needed to run the game"}
{"product_id": "B007JDMPOK", "context": "Is it worth buying this when I already am playing for free? I have heard buying this gets you founder's status, but will i have to start over again?", "response": "Yes it's worth buying.  You get extra character slots, extra bank slots, 2 mounts, and few things you can sell for like 2k gold.  All in all an exceptional value compared to buying each of those things separately."}
{"product_id": "B002B9XB0E", "context": "How long is the USB cable? I can't seem to find that on Amazon or Buffalo's site (my Japanese is pretty much nil).", "response": "I don't have a measuring tape in front of me but I would estimate it to be about 6 feet long."}
{"product_id": "B00DC7FWRE", "context": "Will the wii u pro controller work with this game?", "response": "No, only wii motion and motion plus remotes."}
{"product_id": "B00111SFEU", "context": "does this play the game sound or just chat", "response": "Just chat, and only once for a short period of time (in my case). It's such a gamble if this product is going to work. I'd look elsewhere and save yourself the frustration and risk."}
{"product_id": "B006IOAHPK", "context": "I have a PS4, How can I play this game?", "response": "This is a PS3 game, so far the PS4 is not backwards compatible for previous console games."}
{"product_id": "B00B1N07QM", "context": "DOES A GAMING KEYPAD REPLACE A GAMING KEY BOARD?", "response": "Depends on the game, you can't plat a RTS game with this one, but you can play every MMORPG, MOBA, FPS without a problem with better performance."}
{"product_id": "B00HS5FETM", "context": "I have COD black ops II xrays for my PS 3, Will this allow the xrays to work with PS 4??", "response": "Yeah It should work.. I'm using the xp400 turtle beach works great"}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "There is a cover on the right back side that you pull off. Pull out the old drive and plug in the new."}
{"product_id": "B00D3RBYM0", "context": "Does this game have multiplayer mode", "response": "The whole thing is multiplayer. There is no offline single player mode. 6 people get put in the same map, and you can race heads up vs other racers, or do your own missions."}
{"product_id": "B000VRCNLG", "context": "what air combat game ww2 will operate in windows 7 64 bit", "response": "Donald-  I finally got CFS3 to work on my Win7-64.  I had to go into the control panel to software installation.  Run compatibility program."}
{"product_id": "B004JKZUJI", "context": "how does this one works with monster hunter ?", "response": "its ok but its best get the one made by Nintendo (sometime the button do not respond)"}
{"product_id": "B00ARD5410", "context": "Which is better M60 or M65? I heard some complaints about M65 acceleration,iso I want to know which one you recommend, especially for gaming?", "response": "My roommate uses the M60 Ive got the M65. Ive used both and hardly notice any difference in acceleration. I have ZERO complaints about the M65 and would recommend it for gaming any day."}
{"product_id": "B00D4WTO1M", "context": "have this game a español version?", "response": "No we don't. Sorry"}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "This game will not work no matter what you do.I got a refund on it because of no upload when purchased.I don't recommend this game to anyone.Too bad it has kitty glitter on it because I like that game.Don't Buy It!!!"}
{"product_id": "B00ARD5410", "context": "Which is better M60 or M65? I heard some complaints about M65 acceleration,iso I want to know which one you recommend, especially for gaming?", "response": "Never used the m60. Have had no problems at all with the m65.  Either mouse is gaming grade. I like the m65 because I play a lot of fps and it is tuned for first person shooters."}
{"product_id": "B000VTQ3LU", "context": "does this have the tv clip or do you need one", "response": "No you don't need a clip and it does not have a tv clip. It can sit on top of the tv or where ever you want to put it."}
{"product_id": "B009RXUNGM", "context": "does it do both chat and game audio on the xbox one when using the adapter", "response": "I don't have an XBox but on my PS3, I put it all the was to game then i give it one click to the voice side. For added volume on the PS3, you can adjust voice volume under accessory."}
{"product_id": "B00B23MO9Y", "context": "Hello, I ordered this game and when i tried registering for my playonline account it said the Registration code was invalid/used.", "response": "If you bought the game used, then yes you would need a new registration code and if you bought the game new, then id file a claim with amazon that the seller misrepresented the item you bought."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 8.1 64 bit", "response": "I tried playing it on 8.1 64 bit and it didn't work."}
{"product_id": "B00E447L8C", "context": "Assuming I have the correct USB to lightning cable, will it work with an iPhone 6?", "response": "Yes.. works with anything that has a USB cord."}
{"product_id": "B004IK24MU", "context": "How long does it take to fully charge the batteries? Also is there an indicator to let you knowthey're charged?", "response": "I don't know, I bought it for a Christmas gift"}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "Yes it does. The logitech website has a patch for windows 8 that you will need to download. I would recommend buying this keyboard vs. The regular one due to this being thirty bucks cheaper."}
{"product_id": "B004RMK5QG", "context": "Hi guys, I'm from Bolivia, I created a US account in my PS4, I don't have a credit card from US, only from Bolivia, will this work for me?", "response": "Yes that is why these cards were created so you don't need a credit card."}
{"product_id": "B00E1L78N6", "context": "Does this come with boom mic", "response": "I had to request it from Polk"}
{"product_id": "B004774724", "context": "Do I have to have the regular sims 3 game in order to get this, or is this a game within itself?", "response": "As with all Sims expansions you need the base game in order for them to work."}
{"product_id": "B00B98HBTA", "context": "how many players is this game", "response": "2 from what they told me."}
{"product_id": "B007OVHW90", "context": "Will it work for the phantom model?", "response": "Yes, this type of cable can be used for Xbox 360 chat with the Phantom headset."}
{"product_id": "B000NJBD90", "context": "I know it says PS2 to PS3, but it's a USB, do you think it'll work if i plugged it into my Xbox 360?", "response": "I have used this to hook up my ps2 controller to play computer games though"}
{"product_id": "B00B23MO9Y", "context": "i have the 2008 version which is missing this expansion plus 6 add-ons, if i buy the codes online will it work by using just this disc?", "response": "Yes. After you install the core game, you will download all updates to your Xbox HDD once you log into the Playonline Viewer. Then, you can install the Seekers expansion disc."}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "No it's just made to hold the vita itself and some games nothing extra"}
{"product_id": "B00FLZ4FS2", "context": "code for xbox because one does not work? I feel cheated", "response": "You have to input it into your xbox 360 and after the download is done. You can download it onto your xbox one ( in the xbox one don't reenter the code just go onto the store and look for call of duty ghosts)."}
{"product_id": "B00DGZDFO4", "context": "not opening and im trying to get help but NOBODY is helping me..I have windows 8????", "response": "Having Windows 8 should not cause any issues. Do you have Steam installed? If so, go into your steam folder, find the game, and run MK Launcher.exe(C:/Program Files (x86)/Steam/steamapps/common/MortalKombat_KompleteEdition/DiscContentPC/MK Launcher.exe) If this doesn't work, uninstall it and reinstall it through Steam, as sometimes the game attempts to launch before the necessary files have been downloaded."}
{"product_id": "B00F27JNGS", "context": "What is the difference between PSvitaTV and regular PlayStationTV?", "response": "Nothing except the color and name. They are both the exact same thing."}
{"product_id": "B004SJFJUA", "context": "Can this be used for a DSi?", "response": "I highly doubt it. The size of the battery isn't the same, therefore it won't fit properly."}
{"product_id": "B00BQWTGIS", "context": "My husband really likes this game.  Can someone please suggest a couple of other games that are similar?  I'm Christmas shopping.", "response": "Assassins creed games, GTA5 (not out yet on PC), just cause 2 (kind of similar)"}
{"product_id": "B00005NIMB", "context": "Does it come with a power chord?", "response": "Yes. Either way, it's directly compatible with a standard 2-pin power cord.Take a look: http://images10.newegg.com/productimage/12-519-025-02.jpg"}
{"product_id": "B001CXYMFS", "context": "Would this work on Star Citizen alpha?", "response": "Yes, it works, but last I tested it was mapped a little strangely by default."}
{"product_id": "B000B9RI00", "context": "Hello, are these cards still valid? Because there is a newer version (the green one) Thank you.", "response": "Daniel, I purchased this card more than a year ago.  Every year I had to purchase a new one and they always worked. I am not sure about the newer version as I do not purchase these cards anymore."}
{"product_id": "B00DUANBQM", "context": "Hello, May I ask ?   Does the old games in my PSP 1000 play in this PSP 3000 console ? Thanks !! :}", "response": "I don't know, I'm sorry. Any question?"}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "It is correct size for my electric guitar. Maybe you have to use adapter?"}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "Yes. Its the exact same as american cards, just larger capacity. Not sure why Sony hasn't started selling them here yet."}
{"product_id": "B009AFLXQQ", "context": "Compared to the other controllers, does this one have the motion stuff?  (Can i steer a car my tilting or shake it for Wii U Party)", "response": "No. It has rumble, but no motion sensors or accelerometers."}
{"product_id": "B0076DO5A0", "context": "Do I have to have Steam to play this game?", "response": "It won't play on my machine unless I do have steam, annoying but necessary!"}
{"product_id": "B00BCEK2LA", "context": "Hi, is this mouse blue or grey?   Thanks.", "response": "Yes, both.  It's grey around the outside, the top where you rest your fingers is a dark blue-grey with black stripes."}
{"product_id": "B0053B66KE", "context": "Which languages does it have? Is Spanish included?", "response": "It has a choice of 7 languages. Spanish is one of them."}
{"product_id": "B00BGAA0SU", "context": "Is this game 3rd person only?", "response": "It is 3rd person only."}
{"product_id": "B00005LBHM", "context": "I have a GBA and tried playing on that but after a few minutes the game will crash and all my progress will be deleted", "response": "Your save battery inside the game case is probably dead. Check on YouTube how to replace pokemon save batteries"}
{"product_id": "B005UI8V6C", "context": "Does it work on windows 8?", "response": "I don't see why it wouldn't. If you can do Wild Tangent games it surely can."}
{"product_id": "B009AFLXQQ", "context": "Will this game work with Wii games such as Super Smash Bros. Brawl on the Wii U?", "response": "Sadly, no, the Wii U Pro Controller is currently not compatible with any original Wii software. An update which could patch in functionality is possible, but not likely. Your best option is the Classic Controller Pro originally designed for the Wii, which also works with the Wii U."}
{"product_id": "B001O3066U", "context": "Replies indicate this edition will play on Windows 7 Home Premium.Reviews in other places indicate there are problems. What do you think?", "response": "Works OK on my windows 7."}
{"product_id": "B00GBCLG0E", "context": "can i play super audio cd's on this", "response": "Yes you can, you can also play blu Ray"}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "Tom: I was not able to install the disk like any conventional software,---but some how I was linked to a \"free\" download of Flt Sim X.Not enough time for trying it out, or instructions tp enter the product key to make it legal. Just been too busy with other things."}
{"product_id": "B00A8HIGSS", "context": "will it play on sony ps3 north america?", "response": "Yes. The ps3 is region free"}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Mario Kart 8? And Bayonetta?", "response": "Mario kart 8 yes, the other I dont know"}
{"product_id": "B001UIG6M2", "context": "where are you located?", "response": "Hello, All of my product is held in Amazons warehouse so if you buy amazon will pack and ship it for me. thank you!"}
{"product_id": "B009CEM332", "context": "Is this game compatible with an Xbox 360 controller? Many PC games are.", "response": "Yes, it's absolutely compatible, right off the bat. You just need to plug the controller (or turn it on, if using a wireless controller + a wireless usb dongle), and when you boot up the game, you can control it with the controller."}
{"product_id": "B00ERDGMT4", "context": "What is included with the game disc? Does it come with a map of Pandora?", "response": "No there's not a map of Pandora... The game comes with all the DLC's and 2 additional characters. Krieg the psycho and Gaige the mechromancer."}
{"product_id": "B00DC7G2W8", "context": "Will I be able to play this game on my regular Wii?  Or do I have to have the Wii U console?", "response": "As others stated, Wii-U games are only playable on a Wii-U console. The Wii-U however is completely backwards compatible with all Wii titles, Wii Virtual Console titles, and Wii-Motes/Nunchucks, except a few dance games/accessories that may require the GameCube controller ports. The Wii-U is not backwards compatible with GameCube games or accessories."}
{"product_id": "B0087ZMAUS", "context": "Sorry not to ask again, but, I want to get a good idea before making a purchase. Do these feel sturdy or more flimsy?", "response": "No worries. They're quite sturdy!"}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "No there is not a warranty. My son picked it out."}
{"product_id": "B000BTBMWA", "context": "Can you fit an HDMI cable under it? I have an A/V cable and when I try to plug an HDMI cord in it won't fit. So can you fit one under this cable?", "response": "You shouldn't need to use any other cable to get it to work with your TV. To answer your question, Yes there is enough room for both cable to be hooked up."}
{"product_id": "B002BRZ9G0", "context": "Does this use the classic controller?", "response": "No it doesn't. You can only use the Wii remote. You can either have it turned on its side, or have the nunchuck hooked up to it."}
{"product_id": "B0000512IE", "context": "How far are the pedals apart? i.e. the spacing distance.", "response": "4 inches. They are also at an awkward angle which is quite tasking during extended sessions."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "As long as you pre ordered like you said and either have a prime account and selected the free shipping or if no prime paid for the release date shipping you will get it on the day of release :)"}
{"product_id": "B000FP0K0U", "context": "Will this work with Windows 7?", "response": "I don't know. I have Windows XP."}
{"product_id": "B00503EAG2", "context": "How long does this take to install complete?", "response": "with cd 15 to 20 mins"}
{"product_id": "B00009TW6R", "context": "work for Windows 7 Home ?", "response": "That's what I use, and it works just fine."}
{"product_id": "B00BI9MDSO", "context": "why do half of the people say the vita 2000 fits, and the other half say it doesn't?", "response": "After looking around on the web, it seems that the official description for the case states that it fits both the 1000 and 2000 models.http://www.bestbuy.com/site/insignia-vault-case-for-playstation-vita/3663009.p?id=1219092663712&skuId;=3663009&st;=categoryid$pcmcat306400050010&cp;=1&lp;=3What Amazon has may be a slightly different product, since best buy also has an identical looking case made by rocketfish."}
{"product_id": "B000R9A9JG", "context": "Wil this work or a 87048-E14", "response": "Yes it will work with any wii remote,it also worked with mine"}
{"product_id": "B00DNGQTFI", "context": "Is the offline mode single player only?  My son wants this game, but I'm pretty sure he will want me to play couch co-op with him if possible.", "response": "I'm sorry to bring the bad news but yes, playing offline mode is single player only. The only way to play together would be to play online with another system and game :("}
{"product_id": "B00E88G054", "context": "Wired or Wireless? (one star reviews say they recieved wireless instead of the wired version)", "response": "Obviously you see the wire hanging out the back of the mouse genius"}
{"product_id": "B00ENFVS5Y", "context": "I really want to get this wheel since it's the cheapest force feedback option for Xbox One but the durability issues concern me. Is it worth risking?", "response": "I own a fanatec csw v1, a logitech g27 and the Tx, this wheel is solid, and the reliability issues they had were fixed with firmware and hardware updates since they launch it. I use it as my main wheel over the fanatec"}
{"product_id": "B00GD962OA", "context": "Do you need to buy a controller in addition to this bundle in order to play games?", "response": "No, this was the best wii deal I found on internet. Go for it, I love mine."}
{"product_id": "B00FJWNSWQ", "context": "Will this work on the new XBOX 1 connect?", "response": "No, It stinks but the Xbox one cannot compute older Xbox games. And even on the 360, Injustice can't use Kinect."}
{"product_id": "B00E8RVP0U", "context": "We would like to have a group of kids use this. Can this work?", "response": "it will definitely work if it's just to have the kids dance and have fun. They don't even realize they are working out :) ..not sure how you can score multiple kids though since we only have 2 controllers."}
{"product_id": "B00GU8W5AE", "context": "can you program the keys for forward and backward during web browsing?", "response": "Yes, you can program any of the buttons for that functionality. However, the top two buttons behind the scroll-wheel already function that way. The front one move forward, the back button moves you backward."}
{"product_id": "B0050SX7BQ", "context": "I just received this game today and found out there is no game manual. Am I the only one who is missing it?", "response": "I have one that came with my game, you could always just look online at one"}
{"product_id": "B00ANHBJBY", "context": "So does this controller register as a Pro Controller or Classic Controller? Is it wireless?", "response": "It registers as a pro controller so it is only useable as a pro controller on the Wii u it's not compatible the old wii games"}
{"product_id": "B00B70WKUK", "context": "is this like a CD and you put it in the computer and all good will be able to play  or i have to install program and be online .?thanks", "response": "it is a dvd-rom, but u need to update the game online for a new version in Steam."}
{"product_id": "B00B70WKUK", "context": "can you play this game on windows 8", "response": "yes it works fine on windows 8 :)"}
{"product_id": "B007WPM9GO", "context": "Do these cases fit the DSi XL?", "response": "This did NOT fit our dsi xl's.  Fortunately I was able to return it."}
{"product_id": "B005BLAJ68", "context": "does this game have the characters that talk to you like capt. scurvy the pirate parrott", "response": "Yes, the characters talk, sometimes too much for me.  It is fun at other times, though.  Hope this helps."}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "http://www.wpcentral.com/guide-use-xbox-one-controller-pcthis gives an unofficial step by step guide to hook an xbox one controller to a PC"}
{"product_id": "B00BHSTXV6", "context": "Is the space bar much louder than any other key?", "response": "From memory I would have to say yes."}
{"product_id": "B001BYMZ5W", "context": "Do these headphones offer sidetone? That is, can you hear your own voice through the mic?", "response": "Not by them self. You would have to select it on your sound card."}
{"product_id": "B0076DO5A0", "context": "Can this be played on windows vista 32 Bit?", "response": "From everything I am seeing and reading it will not run well. In some of the forums they give to tricks and twists to try but they don't sound too easy or appealing to me. I guess it boils down to how badly you want to play it. I hope this helps."}
{"product_id": "B00FLLFJ68", "context": "Is is possible to power this with a USB cord running from the PS4?", "response": "i dont know, mine has a power cord to teh wall, i have never tried that."}
{"product_id": "B003O6JJKY", "context": "is it working good?", "response": "Yes it is working perfectly"}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "The season pass only covers the answers, not the full game.  Full game sold separately"}
{"product_id": "B007WWW2C8", "context": "dose this include all the seasons or just the first", "response": "just the 1st one wendy!"}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "no and it takes about 25 min"}
{"product_id": "B0088MVODO", "context": "I would like to know if there is just 1 CD or if the quantity is different, just because I heard there is a version of 3 CD's", "response": "It's just 1 disc. Games 1 through 5 are downloadable content only, from the online Playstation store."}
{"product_id": "B00C2B2Y9A", "context": "So far ive read it works on the PS4, Xbox1, PS3, and 360? Is it wireless for all systems? just plug them in the controller for sound and chat?", "response": "No, Xbox you need to plug in and play station is wirelless..."}
{"product_id": "B00475AYUA", "context": "Can I download this game to a flash drive to install on another computer?", "response": "I don't know why not. It is about 2 Gig. I downloaded it at my cabin and then took it home on a external drive. I had no problems."}
{"product_id": "B0065NP6NC", "context": "Can you transfer your progress on the original fallout new vegas game to this new game?", "response": "Yes, the ultimate edition has the original game plus a 2nd disc with all the dlc for you to download. You would be able to use the content from the original game and not lose it."}
