{"product_id": "B00002SANH", "context": "I have Windows 8 on my computer. will this work?", "response": "I don't know. Usually the older software will work on newer Windows. If it says it will work on Windows on the spec, you'll PROBABLY be OK. It's a fun game! Good luck!"}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "Sadly,only some specific ones, go on Sony's website for specific information"}
{"product_id": "B00EM5UFF4", "context": "Can I play the Xbox 360 version on the Xbox One?", "response": "You can't. It's not compatible."}
{"product_id": "B00E3667XQ", "context": "Is it worth it even IF I cannot use the streaming feature?", "response": "If you like Android gaming or emulation it's still worth it. I can use the streaming feature, but I personally use it to play Android and emulated games more than streaming from my PC."}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "Working on Win 8.1 after following Cabbits instructions. Thanks!"}
{"product_id": "B0081Q58AW", "context": "Is it all strictly PvP or is there some PvE as well?", "response": "There is a ton of PvE content. I just didn't find it compelling."}
{"product_id": "B0050SVNP8", "context": "This is the U.S. version of pokèmon right? Does it matter?", "response": "Yes the u.s. version"}
{"product_id": "B001L5TIR4", "context": "Is the Rise of Atlantis compatible with Windows 7?", "response": "Yes, it does work"}
{"product_id": "B0056JPS84", "context": "Is this for xbox 360 phat or xbox 360 slim?", "response": "It is for the arcade or phat."}
{"product_id": "B006JSY3MI", "context": "Are the controls for the PC version easy to use?", "response": "The PC controls are easy as pie ... you use the WASD keys to move your character around and the mouse to click on objects on screen."}
{"product_id": "B00C2B2Y9A", "context": "I plan on using this for PS4, XBONE, and PC.  Can I leave the USB for the headphones plugged into my PC and have it still work with the consoles?", "response": "Yes the usb is just the power,but your just have to switch the optical cable to the system your going to use."}
{"product_id": "B00012YI14", "context": "I have a Xbox 360. Will this adpater work with the Logitech G27 Racing Wheel  system?", "response": "no it wont because its for the old original xbox not the 360"}
{"product_id": "B008O510Y8", "context": "My computer doesn't have a microphone jack, so I'll need an adapter. Any recommendations? Should I be looking at 3.5 mm (female) to USB adapters?", "response": "If you are using a Mac, there is a hardware device called iMac you can use. I believe a 3.5 mm would work though."}
{"product_id": "B00DFB99UI", "context": "How many degree does it turn", "response": "90 left to right"}
{"product_id": "B006W41X1S", "context": "Do these let in alot of background noise?", "response": "Virtually no background noise"}
{"product_id": "B00D6PTMSW", "context": "What elements of the game does Kinect enhance? It says it is better but not required to play with Kinect. How?", "response": "I asked the same question and I found out that it only helps with voice commands instead of having to use the controller.  I don't use the Kinect and I have no problems."}
{"product_id": "B00F8W9SWQ", "context": "Can you see the keys clearly with the back light off?", "response": "Yeah. And it occurred to me I had never seen it without the light on before I checked it for you. It looks just like a standard keyboard."}
{"product_id": "B00GJ2HZ7E", "context": "Do you get separate Steam keys for each game?", "response": "Yes, each key is separate."}
{"product_id": "B0000695GX", "context": "Is this game playable on Windows 7?", "response": "Yes I play on windows 7."}
{"product_id": "B00I9UVY30", "context": "Is there coop online? meaning from the same PS3 system can 2 people play against someone online?", "response": "Yes, it is online coop 2 players."}
{"product_id": "B002XLR0JI", "context": "My palm is a little big, so is this mouse small, mid, or big size??", "response": "To me this seems like a totally normal sized mouse.  I've seen bigger and smaller, but this seems...normal, mouse sized."}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "It would be fine for a 13 year old i just finished the game there was no nudity and the only bad words i can remember was damn i have 3 kids and my oldest is playing it now"}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "Good question!  I've been watching since April when my 2nd G7 stopped working correctly.  It's time for something new, and this looks like it, but I'm not buying without at least some other user reviews to read first."}
{"product_id": "B00HVBPRUO", "context": "Can I use 2 headset while on my playstation3?", "response": "If you are using multiple player profiles, yes. When you connect the headset it asks which player logged in is it connected to just like a controller. This is for ps4 only. On PS3 you can have 2 headsets but only one may chat the other is just for audio."}
{"product_id": "B00E9I1FPI", "context": "Are any of the physical manuals included?", "response": "Nope just the maps"}
{"product_id": "B000266786", "context": "Will this cd play in the car cd player?", "response": "Hi,  No, you need to play it on a pc or laptop or tablet with a Windows or Macintosh operating system.  Thanks for asking."}
{"product_id": "B008WZRZJY", "context": "Does this game run on Windows 8.1? Thank you for an answer", "response": "barely.....with much work and lots of patience...but once you get it to download...it works fine.  OH..appreciated the Trojan virus that came with the program (thank god my virus software is good and caught it).  That alone should get you prosecuted."}
{"product_id": "B00CJ7IUGS", "context": "How much space do the DLCs take up on the hard drive once they've been installed?", "response": "584MB for Dawnguard , 791MB for Dragonborn , 74MB for Hearthfire, Totaling 1.42GB!"}
{"product_id": "B004IK24MU", "context": "can someone help me im trying to get them to sync", "response": "Are trying to sync them with the Wii U? If so, you must press the sync button on the Wii U first, then press the sync button on the Wii mote. Hope this helps you out,happy gaming!"}
{"product_id": "B00DVEJA7G", "context": "I have a Sony non Bluetooth CD player and I was going to order a Bluetooth transmitter for it. Will these headphones pickup from that transmitter?", "response": "I have no idea .... Bluetooth is Bluetooth for a reason . I  have not had luck with transmitters . I did buy these headphones for my iPhone and my polar heart monitor that is Bluetooth it works well but I could not get the headphones to sync with my iPad ,  :("}
{"product_id": "B00BCEK2LU", "context": "Can you change the color and/or turn off the key lights for specific keys or is it all or nothing? ie. only light up WASD and a few others in games?", "response": "No, its all or nothing. They can be any color you want but not individual keys. The WSAD keys are physically different colors on mine though (Grey wsad vs black)."}
{"product_id": "B005OSFUZI", "context": "Can this cable be used for software other then Rocksmith/Rocksmith 2014? (like garage band or some other sound recording software)", "response": "Not that I tried or heard sent message to ubisoft and the cable works with rocksmith product  only"}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "The boxed set of Silent Hunter 3 came with disks and does nor require the internet. I don't know about the downloaded version, but it may not require the internet either. Try asking Ubisoft, the publisher."}
{"product_id": "B00AFYAUYW", "context": "Is this an updated version of the old WII? We had a WII a few years back.", "response": "The only updated item is that you get the newer Wii Remote Plus controllers.These controllers are so much more comfortable to hold when playing games.You get only one Wii Remote Plus & one Nunchuck."}
{"product_id": "B000H67DDY", "context": "where can I find list of supported games? and does it support Elite: Dangerous?", "response": "If you're talking about Elite Dangerous, yes it definitely does support! Other games that it surely supports are Rise of Flight and DCS"}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "Yes it does! :)"}
{"product_id": "B007VPZR5U", "context": "Do the Naga drivers work with Windows 8.1", "response": "I'm using Razer Synapse 2.0 with Windows 8.1 just fine, with the exception that my mouse has a hardware issue (as I stated in my initial review of the product)."}
{"product_id": "B00HVBPRUO", "context": "is there a separate volume button for chat sound and game sound?", "response": "You can adjust the volume and chat sound to make each loader or quieter, or turn off each all together."}
{"product_id": "B009K7U6IK", "context": "2 Questions: 1. Any problems with keys sticking on this keyboard? 2. Is the wrist support piece removable? Thanks.", "response": "1. Yes, in my experience the rubberized keys can get stuck if you don't clean them. Keys are easy to wash. 2. Yes."}
{"product_id": "B00EV4O7B4", "context": "My sons 3DS XL broke, does this come with a warranty?", "response": "It does have a year warranty for manufacturing defects, not broken or damages from the user."}
{"product_id": "B008BT80O0", "context": "does this support the Logitech G27 Racing Wheel?", "response": "Good day, I have not personally used but I understand that if it works, I recommend the brand to see what map is on PS3"}
{"product_id": "B00CMC6HCY", "context": "Is Ultimate Warrior on this game, and can you play as him? I've read contradictory-sounding things...", "response": "Yes, he is an unlock able character when you complete the wrestlemania challenges. There also seems to another ultimate warrior you can purchase"}
{"product_id": "B00IRHE892", "context": "Is this compatible with Mac?", "response": "Yes the mouse is a USB mouse"}
{"product_id": "B002B9FIUU", "context": "Does this work on Windows 8?", "response": "Yes, we are currently using it with windows 8."}
{"product_id": "B00BGHUS58", "context": "Is the game worth it to buy it new, or is used a better deal? Also, does it have any istallation issues?", "response": "I was exposed to fraud this seller is reliable"}
{"product_id": "B002ZS6Y64", "context": "This works with any PC right ?", "response": "It has to have a optical out with USB. If only USB you will only hear voice not game sound or music."}
{"product_id": "B00FLLFGO8", "context": "I have Sony Z3 since its a clip is it going to hit the power and volume buttons?", "response": "Nope it works well. It will touch but the spring action that keeps top clamp down is strong enough to keep the phone in place, but not enough to depress the power. The to pad will cover the power and volume. I haven't had any issues using it with my Z3"}
{"product_id": "B00004XRBB", "context": "Does it work on  64-bit Windows 7 and is a joystick compadible with it?", "response": "after meny tries i could not get any of my old or new fighter programs to work on 7 -64 bit."}
{"product_id": "B0049B2FP4", "context": "How do you fix the mod installer and download mods for windows 8.1?", "response": "You can't... the amazon download never came with it. The LA mod and a few others don't use the mod installer so you can get those"}
{"product_id": "B00292OW1U", "context": "What are the overall dimensions ?", "response": "Sorry I hate to say it but don't know the overall dimensions of this keyboard but i will say this it does not fit on a standard keyboard tray so just a heads up. Sorry I couldn't be more helpful."}
{"product_id": "B002QHDKE8", "context": "Should I play skate 1&2 before Skate 3? I usually like to play games in order but I only have $40 to spend and my friend was telling me about how awes", "response": "My boys ages 9 and 12 bought this game without ever playing the first two. They love it and had no problems catching on."}
{"product_id": "B001UIG6M2", "context": "will this device work on ps2 model number SCPH - 77004?", "response": "should work on all ps2 models...i dont see why it wouldn't, the only difference between the fat and the slim models is the size, all programming and software are the same."}
{"product_id": "B00DNHLFQA", "context": "Can I play multiplayer games? online games?", "response": "I don't think the online servers are still there (I have never tried to access them) - CNC 4 may be an exception.  You can play multi-player on an internal network."}
{"product_id": "B009SJR28W", "context": "How big are the keys? The keys on my current keyboard (regular letter keys) are 1/2 an inch across measuring from left to right on the top surface of the key. Does this at least have 1/2 an inch keys?", "response": "I'd say it's a touch larger than that, perhaps 9/16\" or 5/8\". Don't have a ruler or anything handy to be precise, but yes, it's at least that."}
{"product_id": "B002I096AA", "context": "is it a ok product for kids", "response": "Yes I bought it for my 7 yr old nephew.  He loves it"}
{"product_id": "B0002FGFHU", "context": "does this game have  mutiplayer mode ?", "response": "Negative there is no multiplayer function available with this game."}
{"product_id": "B00H1FCUBY", "context": "Are these headphones compatible with Bluetooth 4.0 devices?", "response": "They are suppose to be, but I can't figure it out."}
{"product_id": "B00HLT0YT0", "context": "The description for the included game, Borderlands 2, says you can have 4 players. I've read elsewhere that it is really only 2 players. Is it 2 or 4?", "response": "Yea, they changed it to 2 player co-op only."}
{"product_id": "B001E27DLM", "context": "Is there any difference between this version of Chrono Trigger and the PS version?", "response": "No it has all the goodies the ps version has. All the added anime videos and extras."}
{"product_id": "B004GINKNQ", "context": "Does this hard drive come with the caddy as pictured or will I need to buy the hd caddy seperate?", "response": "I have returned this device since it is not worked with my Xbox properly ."}
{"product_id": "B0072HYRNK", "context": "What is bulk packaging?", "response": "It isn't in it's own fancy box. I ordered two of these and got them in the mail yesterday. Although I believe them to be brand new. It was just simply wrapped in bubble wrapping. So I believe the bulk packaging means the way it is shipped, and packaged with safe bubble wrap from the warehouse, or manufacturer."}
{"product_id": "B00562O78S", "context": "Vesa mount? I'd pre order now if I knew this thing had a vesa mount or not.", "response": "most likely since the stand is removable it will be wall mountable"}
{"product_id": "B005M0KSIM", "context": "I am thinking of buying the physical copy (since the pc download feature seems unavailable.) If i get the physical copy can i use it on steam?", "response": "you have to have \"steam\" to install the game. You are not suppose to need it after you do.  I could not get it to work with  internet or with out it. If you purchase it. It takes a great deal of time to install it. Sitting with your computer running. Find a book to read."}
{"product_id": "B002I0J5CO", "context": "How long is the cord?", "response": "12 ft. or about 3.65 meters.  It really is as long as they say it is."}
{"product_id": "B00F27JN8Q", "context": "Can the Japanese Vita TV's AC adapter plug into a US wall socket without problems?", "response": "Yes not a problem"}
{"product_id": "B004NRN5EO", "context": "Does this require an internet connection to play? (not update/install)", "response": "Only for pvp. Mine is hooked up to our wireless network and connects on boot up. So I can't b positive."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "ABSOLUTELY!....Windows 7 or 8 was not out at the time of the game release."}
{"product_id": "B00FJWNSWQ", "context": "Is there an actual story line or just fighting tournament style?", "response": "Yes. There is an story Mode that follow an interesting storyline"}
{"product_id": "B00EVWZHLK", "context": "Must I install the games or can I directly play them from disc?", "response": "it has three disc inside so just play from disc"}
{"product_id": "B0088MVQIM", "context": "Does it work fine with Bass or is focused only in guitar with some Add-on for Bass, I'm a bass player but I want it to practice and have fun.", "response": "Yes, this game works fine with bass, you will get a kick out of it!"}
{"product_id": "B007W8S2MG", "context": "does this game have a setting where i can have japanese dialogue but english subtitles?", "response": "No unfortunately it does not. :( The is English VoiceOver is fantastic though, I was never a fan of dubs however the English voice actors did an amazing job!"}
{"product_id": "B004XIQN3I", "context": "Does it work with any joystick? Which ones?", "response": "Sorry, I never got it working. Gave up on it."}
{"product_id": "B009ZDPYKO", "context": "Does he work with swap force?", "response": "Any generation will work with the Skylander swap force game. This is a giant so he doesn't detach but because he is a giant he helps unlock levels."}
{"product_id": "B007JM8ULS", "context": "Can i play Titanfall with this hardrive", "response": "It's definitely big enough to store the entire game, if that's what you're asking."}
{"product_id": "B0053BCML6", "context": "I've never played any of the Animal Crossing games before. Do you have to have played the previous games for this one to make sense?", "response": "No! The game is mostly plotless honestly. Its very relaxing and the goals that one can obtain within the game require no alternative knowledges from previous versions!"}
{"product_id": "B0094X28J0", "context": "I have an older Wii console, will the new Plus remote work with it?", "response": "Our wii is about 5 years old and it works great with it."}
{"product_id": "B000J18SR2", "context": "Is this compatible with windows 8?!", "response": "Sorry  but I haven't tried it yet"}
{"product_id": "B00AAS88K6", "context": "If I swapped the batteries with Rechargeable Eneloops, would this be able to charge them over the wire like the Logitech MX Performance mouse can?", "response": "No, the USB cable is use for data purposes only and is not directly connected to the battery so it can't charge it."}
{"product_id": "B005FMLZQQ", "context": "Does it work with XBOX ONE aswell ?", "response": "Technically no, because XBOX One doesn't have Windows Media Center Extender.  However, I would assume the power, A/B/X/Y, etc. buttons would work."}
{"product_id": "B005LN5UOC", "context": "as much as the totally loaded battery lasts", "response": "I'd say about 10 hours"}
{"product_id": "B001444IN6", "context": "does it work for windows 7 and 8", "response": "It does NOT work for Windows 8, which I know from experience. It does, however, work on Windows 7."}
{"product_id": "B00005QEFD", "context": "does it comes in with the original box", "response": "It will say in the description of the item what it all includes."}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "Yes, they stack.  I bought two of them around Black Friday and activated them both immediately."}
{"product_id": "B00166N6SA", "context": "Can it work with Windows 8.1?", "response": "I'm not sure about windows 8. I have windows 7."}
{"product_id": "B003JVF728", "context": "if i buy used will it still work with steam?", "response": "If u buy it new yes it will work with steam !!"}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "Wii U only, sorry. Wii U games do not work on the Wii. However, Wii games work on the Wii U."}
{"product_id": "B007Y7OP8K", "context": "What format is the game in? Is it for PC?", "response": "It's works on XP, Vista, not sure about windows 7 or 8 but probably they're usually pretty good about that."}
{"product_id": "B003O6CB6S", "context": "will the game play on windows 8.1 64bit", "response": "Yes as long as you have the 64 bit Windows, you can play it on 8.1."}
{"product_id": "B006NU6F28", "context": "does it work on windows 8 at all?", "response": "Yep. Playing on Windows 8!Brian"}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "Well, no...Its a $50 Dollars PSN Card..."}
{"product_id": "B004GINKNQ", "context": "will this work on the 4GB Xbox 360?", "response": "Pretty sure that's what I have. I know it's a 360 and I think it was the smallest storage space when I bought it. It installed just fine once I figured out where it went"}
{"product_id": "B008B3AVPC", "context": "Is this really worth it? I heard this was the second worst CoD out there! And should I just get the Standard Edition or with 1st DLC collection?", "response": "Yes it is. My son play it everyday and is very happy with it. I bought ir with the dlc. Hope you enjoy it."}
{"product_id": "B00EW6QT76", "context": "can it charge both controllers at the same time?", "response": "You have to have an extra usb cord, cause it only comes with one. But if you have two chords there are 2 ports on the console, so you can charge both at the same time."}
{"product_id": "B00030GSJY", "context": "I'm interested in a career as a professional Helicopter pilot, is the X52 a good choice for someone who wants to practice Helicopter flight without pedals?", "response": "i would advise that you get yourself a set of used pedals on ebay or craigslist.  i have used these sticks with pedals and it is much more realistic in my humble opinion"}
{"product_id": "B008UQWX0Q", "context": "can normal nintendo ds games work on this?", "response": "YES, IT PLAYS DS GAMES ONLY"}
{"product_id": "B00005NIMB", "context": "Will this work on windows XP?", "response": "Yup, I have used it for many years on XP."}
{"product_id": "B00FE8WKMO", "context": "will this game work on the regular wii?", "response": "No it's for the Wii U only unfortunately"}
{"product_id": "B007VTVRFA", "context": "Will this game work with Windows 8.1?", "response": "Yes, I run windows 8.1 and it runs great."}
{"product_id": "B000R9A9JG", "context": "Does this work with the Wii Plus remotes?", "response": "I'm not sure what Wii Plus remotes is. The one I purchased for is the Wii remotes that came with my Wii. My Wii is the first one that came out, sorry I really don't know if it works on the Wii Plus."}
{"product_id": "B00CX8VY4S", "context": "So you can just play straight campaign even if you have an Xbox live membership? Or are you forced to play online?", "response": "You can play it however you choose to play it. Online or not."}
{"product_id": "B0053BCML6", "context": "Will this game play on a 2DS?", "response": "No, I don't think so."}
{"product_id": "B00919RM1Q", "context": "cards large enough for vision impaired viewer?", "response": "You can use the full screen option to make cards big enough - I would think this should work for you."}
{"product_id": "B00EZAWV6W", "context": "So, is it possible to play against the computer only, or are you always playing against other people online? (I know nothing about shooter games)", "response": "Yes it is possible but you have create a private co-op match where you just fight waves of zombies by yourself."}
{"product_id": "B00D96BORK", "context": "Is the wire just covered in the rubber coating or is it the higher end cloth/braid wrap?", "response": "The Shadow uses a thick rubber coated cable. The next version up in this line, the Spectre, uses the braided cloth."}
{"product_id": "B001FBHT34", "context": "Does this work with a Mackbook pro?", "response": "This does *not* work with a MacBook Pro. I ordered one for my Mac without realizing the input jack on the laptop is line-level. The mic-level output is insufficient meaning no sound can be heard when speaking (although the headset *can* be used for listening). The Mac requires a USB or Bluetooth headset."}
{"product_id": "B009LGO88E", "context": "Does this work with Smash 4 as a c-stick?", "response": "No, it does not work with Super Smash Brothers 4."}
{"product_id": "B00BQWTGIS", "context": "will it work on windows vista?", "response": "Yes but... It needs to be SP2 64bit and If you're running vista, you likely have an old graphics card. This needs a pretty good card. Read the specs before buying otherwise it won't run and most sellers don't accept returns on PC games."}
{"product_id": "B0029M6VKA", "context": "Does it work with Windows 7 and Windows 8?", "response": "Not sure about Windows 8, but runs fine on Windows 7."}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "There is no co-op."}
{"product_id": "B003ZSHN0O", "context": "can i play this gme on my laotop,with windows7", "response": "my husband is able to play it on his laptop, guess it depends on the strength of your computer."}
{"product_id": "B00DE2W4PK", "context": "What's the difference between the US and the Japan version of the PS4?", "response": "I have no clue... maybe the setting are in Japanese and the us in English? Maybe.....?"}
{"product_id": "B002B9XB0E", "context": "Has anybody tried this with an emulator on Android?", "response": "I've used 3 of them on various raspberry pi projects with 100% success. I would guess that if your android device has USB Host, you should be fine."}
{"product_id": "B00DC7O3K6", "context": "will this game work with a normal wii, or only wii u?", "response": "It will only work with wii u"}
{"product_id": "B005Q1YA5O", "context": "In your opinion which expansion pack is better, the Pets or Supernatural. Not looking to buy both so would be helpful to get some opinions", "response": "I don't have supernatural but I really do like pets."}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "The drivers just came out today, so you can now use it too for PC."}
{"product_id": "B00886XQO0", "context": "hi this work on mobile ? plz i need fast answer ^^ ty", "response": "Yes, you can connect to a mobile device using Bluetooth or with the included mobile adapter cord."}
{"product_id": "B000H67DDY", "context": "Do the Rudder pedals control nose wheel steering?", "response": "Yes it does if you have it set up to do so.  It comes with software to change what control surfaces do"}
{"product_id": "B002I0H09Y", "context": "does this game have a training mode or local match with bots?", "response": "yes hard bots to play its straight"}
{"product_id": "B00BGHUS58", "context": "can i choose spanish in language setting?", "response": "Yo lo compre y el juego me lo configuro de inicio en ESPAÑOL"}
{"product_id": "B00FM5IY38", "context": "does this game require the kinect", "response": "Nope. Not at all."}
{"product_id": "B00D6NPFDK", "context": "Does the portal & the usb connection cable come with the starter pack?", "response": "Yes.  The portal platform with USB comes with this set."}
{"product_id": "B00CBNV7UQ", "context": "what type of language does this game have???", "response": "For me it was in English, but I think that there's a way to change the language if you want, but I don't know how to change it."}
{"product_id": "B002I098JE", "context": "can you turn of blood", "response": "yes you can is the options"}
{"product_id": "B004TTNTYW", "context": "How long is the cord?", "response": "same as a stock one 10-12 foot."}
{"product_id": "B00E1A1SP6", "context": "Will the new one come with an sd card, wall charger, stylus, etc?", "response": "It will not come with a charger. The charger from the previous model will work on it though"}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "With generic drivers, yes. It works fine."}
{"product_id": "B00F27JN8Q", "context": "If I buy the US version, do I have access to compatible digital vita titles I purchased in the PSN store? If so, must I stream them?", "response": "if you purchased the titles through PSN you can download them to the PS TV just like you would your Vita"}
{"product_id": "B000VRCNLG", "context": "Is it compatible with windows 8?", "response": "No, Microsoft Combat Flight Simulator 3 is only able to be played on Windows 7/XP."}
{"product_id": "B00CMC6HCY", "context": "Is there only male Wrestlers?", "response": "The proper question is; Are there only male wrestlers?"}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "Works with all apps on the Xbox one."}
{"product_id": "B008YRITPO", "context": "What is the size (Length and Width)? I was wondering if It could fit in the pull-out tray of my desk.", "response": "Unfortunately I don't have a tape on me, but if I were to guess I would say roughly 21\"x 9\". It's about an inch and a half at its highest point. Hopefully that helps."}
{"product_id": "B000YMQGWU", "context": "Would this work with a Macbook Air?", "response": "No am not sure,because it did not work with my pc."}
{"product_id": "B009K7QB8O", "context": "Someone said that the CD is a mini CD. I have an HP TouchSmart 300. The CD not have a tray, the CD's slide into a CD slot. Will I be able to use the mini CD?", "response": "As long as you have Wi-Fi, you're good. You can download the keymapping software from the company's website at: http://www.sharkoon.com/"}
{"product_id": "B00ACMM9BO", "context": "So this works for call of duty black ops 2?", "response": "Yes... I'm playing black ops 2 with it rt now"}
{"product_id": "B008M4BNQG", "context": "How is the bass if you want to listen to music on your pc? I want it for gaming but since it can also connect to PC i was just curious.", "response": "Not the best.. Haha :)"}
{"product_id": "B00009WAUO", "context": "How many levels are in the game?", "response": "It's a complete redo of Super Mario Bros. 3 for the NES. So how many levels are in that, those are in this game. I played through every single level so I know they are all there."}
{"product_id": "B0050SXLQC", "context": "Thinking of buying this used, but what is the Downloadable Content needed to play this game? Is it worth buying without dl content?", "response": "The dlc is just costumes and multiplayer.  Not  needed to play the game with...unless you want to play death battle and mercenary mode.so ah it's worth buying without dlc."}
{"product_id": "B00IYWV5HS", "context": "Is this just a code or will any portion of the game files be downloadable from amazon? I am having a great deal of trouble using NCsofts client.", "response": "This is just a code that allows you to download the client directly from WS website. I didn't have any issues."}
{"product_id": "B008XHCLFO", "context": "Is everything properly aligned and easy to access like buttons and holes for the charging port and stylus holder ?", "response": "Yes, everything is easy to get to. All of the buttons, 3D slider, Sound, stylus, camera, speakers, is open. The picture and shipped product match. I have big man hands, and this fits."}
{"product_id": "B003O6E986", "context": "would this be appropriate for younger kids too? Does it use trashy animation or bikini girls in the game? I am looking for a fun family friendly game", "response": "nothing inapproprate in game play"}
{"product_id": "B00E1L78N6", "context": "I use the Xbox One to watch TV, when I use the TV app does it play through the headsets?", "response": "Yes l. As well as through your tv. If you don't want it to play through the tv as well... you mute the tv."}
{"product_id": "B003ZSHN0O", "context": "will this work on windows7", "response": "I never got it to work on anything. It is a piece of crap"}
{"product_id": "B004774724", "context": "Do I have to have the regular sims 3 game in order to get this, or is this a game within itself?", "response": "no this is not a game in itself you need the the Sims 3 in order to play this expansion pack."}
{"product_id": "B00AR1LX9O", "context": "what is the battery life for this product?", "response": "OK well they do last a good half to full day use if fully charged. But if you are asking what is the life expectancy for the battery, I really don't know except that this product is far better than turtle beaches. Far more comfy and slick design. Just thoughts to help u out."}
{"product_id": "B006JKARP8", "context": "can i charge my samsung  galaxy tab 2 with this portable charger? i have a ps vita too, but i would like to know if i can use it with my tablet and my iphone 5.", "response": "I have a vita. Which I use it mainly for. But it works with my samsung galaxy mega and my girlfriends iPhone 5s great... use a couple times in desperate situations.  Lol.   Forgot my charger."}
{"product_id": "B003O6N64Y", "context": "We have never been able to get the microphone work for my son's ps3 - he can hear , is there something special we need to do for this to work on ps-3?", "response": "Need to turn Bluetooth off then on in pairing mode and go to audio settings to voice settings and connect there"}
{"product_id": "B0038PBF1W", "context": "Can it be played witth mouse only control", "response": "I believe so is is an old game"}
{"product_id": "B0050SX7BQ", "context": "I just received this game today and found out there is no game manual. Am I the only one who is missing it?", "response": "I did not have one in mine either but I don't really see the need for it. I never look at them anyways."}
{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "No, its does not. It also requires xbox live."}
{"product_id": "B008VQ68C4", "context": "Im guessing pc definitely has the 7.1 surround sound, but is the audio the same on consoles? Or is it only default stereo sound for my PS4?", "response": "Not sure. I can, however, tell you that the chat volume switching did not work for me on my PS4. The volume of the headset was also kind of low. I ended up returning mine and got an Afterglow headset that GameStop currently has on clearance. Check for these in your area. They are clearance priced down to $149.99.http://www.imgur.com/IH1P0m1.jpeg"}
{"product_id": "B009IR1SR0", "context": "Only English version or full language version?", "response": "I have no idea...The one sent to me is in German..."}
{"product_id": "B00BT71S4K", "context": "can the galaxy s5 fit in this gamepad?", "response": "Why not? Sure it works, supports 4.4.4  kit kat"}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "Klondike is my favorite, the old-fashioned game.  Free Cell is another good one.  I haven't really tried too many of the others.  Hope this helps."}
{"product_id": "B00656HLGO", "context": "I keep reading reviews about not working with \"original title games\", what does that mean? If I don't have any games over 3 yrs old will this work?", "response": "It worked AWESOME on my 360. It works with all the 360 games I have. The original title games are the original Xbox games. It will work with original title games but you have to look it up Google \"Xbox 360 Partition 2\". This hdd ROCKS right out of the box! Buy it, store it, play it, love it."}
{"product_id": "B00E3667XQ", "context": "Is it worth it even IF I cannot use the streaming feature?", "response": "Only if you like emulation. It is great for a handheld N64 or Pokemon and Pokemon Romhacks, but beyond emulation? I probably wouldn't recommend it. Its shape isn't conducive to mundane things like Reddit, or Facebook, so that's right out. It's FOR gaming, and the gaming on it is lacking, unless you emulate."}
{"product_id": "B00DBCAT3W", "context": "Is Fable Anniversary like the original Fable or is it more like Fable: The Lost Chapters?", "response": "This is the original fable in a new box."}
{"product_id": "B00FZ12F34", "context": "Will this Infinity Bundle work with the Infinity 2.0 that comes w/ the super heros?", "response": "Yes all the characters work with Disney Infinity 2.0. Just the play set pieces from 1.0 can not be used with 2.0 game."}
{"product_id": "B001PO2BJI", "context": "We have the \"Wii Remote Plus: Princess - Peach\" - will these work with that model of remote, please?", "response": "Yes it will work with all wii controllers"}
{"product_id": "B00CBQO930", "context": "How do you pick a color when you order it?", "response": "It changes color according to DPI setting. Hitting the DPI plus/- button adjusts the DPI, each DPI level is associated with a certain color."}
{"product_id": "B00CTKHXFO", "context": "Does it include MGS: Twin Snakes?", "response": "i'm afraid not, it's for gamecube only"}
{"product_id": "B00DB9JYFY", "context": "Does anyone play this game online anymore?", "response": "I actually never got it to play.  I contacted Xbox and they were no help.  Sorry I couldn't help."}
{"product_id": "B006SVUQNQ", "context": "My current hard drive keeps saving corrupt data and slowing the xbox down, for some reason my xbox wont read any game that has the corrupt data on it. Will this happen with this hard drive?", "response": "I would encourage anyone with an XBox slim to pick up this hard drive. I have had this HDD for over 2 months thus far without issue."}
{"product_id": "B00002JXBC", "context": "does this have force feedback", "response": "No it does not"}
{"product_id": "B00E1L786S", "context": "Is this an ok front center speaker for a 7.1 surround sound system?", "response": "No. This is a powered sound bar. You would  do better with a typical center speaker."}
{"product_id": "B009Q8PP16", "context": "Will this work for TitanFall?", "response": "I have not tried every feature of the controller, but the \"Rapid Fire\" does work with Titanfall."}
{"product_id": "B00GANWVJE", "context": "I want to buy this game but it says 3Ds, is it eligible with a regular DS or just 3Ds", "response": "Just 3DS, you can algo play this in a nintendo 2DS"}
{"product_id": "B00DPJBTM6", "context": "Are these wireless? I read somewhere that there is something to make the A40's wireless", "response": "No, the A40's aren't wireless.  However, the A50's are."}
{"product_id": "B002RYLG4Q", "context": "how well would it work on a samsung flat screen tv?", "response": "Light gun games (like Duck Hunt, Gangster Town, or Shot Put [for Summer Games], etc.) do not work with laser, projection, plasma, lcd, or led TVs. They only work for CRT TVs, which is probably why this system (rightfully) omits them."}
{"product_id": "B0009VXBAQ", "context": "All I use it for is net flix.  What unit do you suggest?", "response": "If you have the Wii, then you should be fine with NetFlix.  But if not, then perhaps getting a Wii U might be a good choice."}
{"product_id": "B002J9GDXI", "context": "How much does this mouse weigh when the weights are taken out?", "response": "G500 without the Weight Cartridge tray is 161 g (5.68 ounce) and with the Weight Cartridge tray empty is 164 g (5.78 ounce). G500 technical specs: http://logitech-en-amr.custhelp.com/app/answers/detail/a_id/14191"}
{"product_id": "B00GOOSORM", "context": "What exactly is this item and how does one use it?  btw: I have the ps/3 trial installed but expired", "response": "Note that xiv costs 12:99 USD and 15 USD for more then one character so if you plan to Sub for 2 months total is 26 USD not 30. This also has to be deliver but it's convenient for those not wanting to use CC or gift."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "You live in Hawaii, why are you playing games? Get out of the house, go to the beach, surf, board, etc... Do what most of us can't do... and thats why we are home playing games :("}
{"product_id": "B005QUQP94", "context": "Can you adjust the light intensity and the color? or is it just blue?", "response": "The intensity is adjustable, in 3 levels if I recall correctly. The color cannot be adjusted, however, I believe that they have a model that is adjustable. The Raptop K40 and K50 have 16.8 million colors for the LED backlight, listed in the comparison of models here: http://www.corsair.com/en-us/gaming-keyboards#divCompare"}
{"product_id": "B004RMK5QG", "context": "what is the different between ps plus code and the code which included with the cd ??", "response": "If you buy a PS commonly they will give you 1 or 3 free months, it depends on the promotion, it is included on the bundle, but it will expire then you will not be able to play some games, this code will give you a full year, you can use it when your subscription expire."}
{"product_id": "B007MM9E42", "context": "What controllers are needed? Do I need the classic controller or will the regular one and nunchuk work fine?", "response": "The regular controllers work with the regular nunchuk... the nunchuks like in the game are optional."}
{"product_id": "B009AP23NI", "context": "Does this take AA batteries?", "response": "No it's rechargeable and the battery is one of the best lasting about 80 hours sometimes more"}
{"product_id": "B000B78F72", "context": "Mainly want simple Spider Solitaire for WIndows Vista - will this suffice?", "response": "Yes it probably will be overkill for just one game---Yank"}
{"product_id": "B002I0K3PM", "context": "Is the story line or jobs any different compared to the version that is out for the Nintendo DS 3D?", "response": "Yes, I don't have the DS version, but I've seen previews of it.  The Wii U version is much more HD, open, roamable world, and more challenging.  I recommend it."}
{"product_id": "B00ATHFLZS", "context": "Just ararived and does not work at all. tried several computers, not a problem on my end, the mouse is dead. unless there is some secret magic dance..", "response": "mine worked fine had no problems with it"}
{"product_id": "B002YVD3KM", "context": "What kind of emulators does this controller work with?", "response": "I use it with Jnes, but I think it would work with many."}
{"product_id": "B007MM9E42", "context": "Have to have the paintbrush", "response": "No need to spend the extra money on the paintbrush.  Game works off of the Wiimote/ nunchuk."}
{"product_id": "B009K7QB8O", "context": "For what keys are there rollover support?", "response": "Don't buy it!!! It's a piece of junk. The keys on the keyboard rub off. I had the keyboard less than a year and 10 of the keys became unreadable. They where gone. I sent in a support ticket and got no response!!!"}
{"product_id": "B00ERDGMSA", "context": "Can you use an xbox controller/gamepad?", "response": "Yah you just need the xbox wireless gaming receiver found here on Amazon"}
{"product_id": "B008XHCLFO", "context": "If I put my 3ds xl in this case would it be able to still fit in here?: HORI Retro Mario Hard Pouch for NEW 3DS XL and Nintendo 3DS XL", "response": "yes, it is perfect case for 3dsxl"}
{"product_id": "B001BYMZ5W", "context": "can this hook up to ps3? ps4? i have a monitor with headphone jack, that works?", "response": "These will work with anything that outputs through a standard headphone jack.  That being said, these headphones sound best when used with a decent amplifier. Using just a headphone jack will allow for sound in your ears but the mic will require a dedicated mic jack in addition to the headphone jack to use the microphone."}
{"product_id": "B00F27JE1C", "context": "Anyone else having wireless issues with this unit?  See my write up on my vita slim green/white.  I'm assuming I got a lemon but would like to hear.", "response": "Naw no issues at all"}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "oh really? The customer rep. was like okay and she did it right away... I mean it hasn't even been released yet and the price went down so I think its only fair for those who have been waiting for months for the item."}
{"product_id": "B002VBWIP6", "context": "if I buy 2 of these, and entered both codes, do I get a 2 years subscription ? or do I have to store the other code until the first one expires?", "response": "You are correct you would have a 2 year subscription. You can pre-load a total of 3 years."}
{"product_id": "B00DHF39KS", "context": "Just getting into these games; are there levels of difficulty on this game so a newbee can learn easily???", "response": "Yes there is. I played on the default difficulty and had a lot of fun. My fiancé who is not very good at shooters played on the second easiest difficulty and beat the game.  I believe there is 5 difficulty levels so anybody can have fun with it."}
{"product_id": "B00IU3MSF4", "context": "are the games downloads or disks, and does it need internet to play the games", "response": "They are on disks, and no, you do not need internet to play them."}
