{"product_id": "B00EV7AYAO", "context": "Is it a mechanical keyboard?", "response": "It is not a mechanical keyboard. Just a regular standard keyboard with the Key WASD and the arrow keys are color redish orange."}
{"product_id": "B00ENFVJJO", "context": "How do you know when it's done charging is there like some light or something", "response": "Light is either blue or off on the controller. I know when I first plug it in its an orangish color."}
{"product_id": "B00CX8VY4S", "context": "Is this game appropriate for my 12 yo son? Haven't looked into it yet.", "response": "No, way too nasty and violent, don't expose your 12 year old son into this game."}
{"product_id": "B00BGA9V2Q", "context": "Can I continue where I left off in the demo if I buy the physical copy, or do I have to start all over again?", "response": "No, you continue where you left off.  You even get some nice items."}
{"product_id": "B001AH8YSW", "context": "Is the \"Enhanced\" physical copy the same as the download \" Enhanced directors cut\" version?", "response": "No. Buy it on Steam. I wish I had. This disc does not run well on windows 7."}
{"product_id": "B0041RY3W4", "context": "does it plug into a wall outlet or does it have to be pluged into to ps3 station?", "response": "It plug's into a wall outlet."}
{"product_id": "B00GV0LR64", "context": "will this work on a crt television. (older non flat screen tv)", "response": "ive used it on only flat screens so far butjudging off the texture and stickness of pressure cup...it should hold fine with a little saliva"}
{"product_id": "B009UCGVZC", "context": "6yr old nephew only wants Skylanders for Xmas.  He tells me is Action Figures (Wii).  Is Legendary 3 pack a good choice for starters?", "response": "Hello. There is no straight forward answer to this question as its a personal choice. Just be sure what skylanders game he has. There are four games now and each game has different characters for it."}
{"product_id": "B009DYCTY4", "context": "does the product come with a controler", "response": "Yes but only one"}
{"product_id": "B00CX8VY4S", "context": "Is this watch dogs a disk or download", "response": "Its a disk... I'd like to think that wouldnt batter but yeah a disk."}
{"product_id": "B008EZ3PBY", "context": "Does the xbox reset if you switch your tv to cable or something else with these aftermarket adapters. Do you have that problem with this one?.", "response": "Nope it's worked fine"}
{"product_id": "B00475AYUA", "context": "can more than one unit occupy the same space of land at a time?", "response": "Yes, if they belong to the same Player."}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "No, You can only activate the game on one Xbox live account. So if you activate it the Xbox 360 copy on your account, the same account will be allowed to download the Xbox one edition. You can sign into your friends Xbox one and play from there, but he wont own the game."}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "You need a device that comes with the Skylander Giants game, which is available in all consoles."}
{"product_id": "B002YVD3KM", "context": "Does it work for all PC games or just NES Simulators?", "response": "I only used it for the NES Simulator, so I couldn't say."}
{"product_id": "B001TOQ8X4", "context": "Do you provide the code to activate the game via email? Or will I have to wait for the physical copy to arrive to get the code?", "response": "If you didn't order a download, then yes the code will arrive in the box, you will have to wait until the package is delivered to you"}
{"product_id": "B007VH2WPQ", "context": "Will it work with an old wired controller?", "response": "Fundamentally the face should fit however I wouldn't take the back off. it was a snug fit for my wireless so it might not fit a wired."}
{"product_id": "B001444IN6", "context": "I got the game today and when i opened it had no booklet in it so i cant get the product code. What do i do?", "response": "Contact the seller that you purchased the game from."}
{"product_id": "B00AWEMODK", "context": "Receiving \"7-Zip Error\" No Archive Found during installation process. Unable to install the program. Solutions?", "response": "I would download a copy of Winrar: http://www.rarlab.com/download.htm    Use Winrar to extract the zip package to your desktop, and install that way."}
{"product_id": "B0057S9SYY", "context": "Will this work on my PC? I have another headset I want but the battery packs are cool. If it works on pc, is it wireless?", "response": "**CORRECTION** this is the wireless version of the Tritton \"Triggers\" that I have. I haven't used these so I wouldn't know. Sry I couldn't be of more help"}
{"product_id": "B008XHCLFO", "context": "Can the top part be taken off? I simply want the grips not the whole protection part (though that isn't bad, but i think it's ugly)", "response": "Yes.  The top is separate from the bottom.  No problem using only grips."}
{"product_id": "B00CPKUV7K", "context": "Is there a single player mode that doesn't require an internet connection?", "response": "You do not need an internet connection for the single player."}
{"product_id": "B000266786", "context": "Will this cd play in the car cd player?", "response": "No. It is a computer program for computers."}
{"product_id": "B004GINKNQ", "context": "Will it be compatible with the 360 slim, i got one once but it crashed.", "response": "Yes it fit fine in my slim but mine corrupted my files. So I might have just had a defective one but your best bet is the Microsoft brand because it is made specifically for it and is the most durable"}
{"product_id": "B000ZKA0J6", "context": "Will this update some how create this hacked copy  the only benefit to buying it is Multi-player access online ? And allow me to play solo campaigns?", "response": "It's not a hacked copy and yes you will be able to play multi-player and solo campaigns."}
{"product_id": "B008SBZD9G", "context": "Do you have to pay a monthly subscription to play this game, and if so, how much?", "response": "Yes,  It is the typical $15 a month for 30 days, $14 a month for 60 Days ($28 total), or $13 a month for 180 days ($78 total)."}
{"product_id": "B00DBDPOZ4", "context": "Can it charge when Xbox One is turned off?", "response": "i've never tried but i think it would leave xbox on"}
{"product_id": "B003O6CBIG", "context": "will online work or do i have to buy it myself, because online is the best part of Cod games", "response": "yes, with the PS3 version of the game, online play is included at no charge. However, I have had some issues with system freezes while playing whereas I don't with Black Ops II."}
{"product_id": "B007W8S2MG", "context": "is it region free?", "response": "Vita in general is region free"}
{"product_id": "B00HN9LS48", "context": "Would the Xbox 360 Kinect clip work for the Xbox One Kinect?", "response": "only fits xbox one console"}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "None. I play Spider Solitaire and like it a lot. I occasionally play Freecell haven't tried any of the others yet."}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "Yes, it's the slimmest version."}
{"product_id": "B000AOJ7FK", "context": "Is this game legit, like when you buy it you can download it and play? this is not a scam right?", "response": "This game is totally legit. for the price of Counter Strike: Source, you also get Day of Defeat: Source, Half Life 2: death match, and The last chapter of Half life 2 which some people might say is the ending of part 2. but not many people know about it."}
{"product_id": "B001EYU1WS", "context": "Is it as complex as the picture?", "response": "It's hard to be sure what you mean. Complexity of Setup: Easy...just a USB plug. Complexity of Panel Switches: Not at All. It's a decent-looking panel, but has a \"lightweight\" feel, which could be good for some, bad for others. Be aware, though, (since I wasn't), that this panel is only compatible with FSX, and possibly Prepar3d."}
{"product_id": "B00D96BNGM", "context": "can this unit be substituted for comuter headset", "response": "If your asking can it be used for computer headsets , than yes.I use mine for everything xbox play station computer tv and yes they are worth the money"}
{"product_id": "B0057S9SYY", "context": "do these headsets drop the sound every few seconds like the turtle beach x32's??", "response": "The headphones are amazing. They are not wireless, but the sound is fantastic and doesn't drop out at all. Every time I play a game on my 360, I have the headphones on because the sound is so good. Mic works as well as anything else. These are a definite buy if you don't mind them being wired in."}
{"product_id": "B00ATF5YZM", "context": "Do you need steam to download this game?", "response": "Yes it is a Steam key that you are given."}
{"product_id": "B00E3667XQ", "context": "I have two question: is it able to play offline any game? does support steam application?", "response": "It does support the steam app.... Only games that don't check for Internet connection can be played offline.... Emulators and stuff like that can be played offline.... Same with the streaming from computer as long as your computer is connected to your router"}
{"product_id": "B0050SXKU4", "context": "I heard a rumor that this game will no longer work properly on the PS3. I have a 500 G system. Will it work?", "response": "it is true, i have the ps3  slim 300 gb and the screen is all frozen when  the character is on the streets or driving a car"}
{"product_id": "B008BT2FWI", "context": "does it work on window 7", "response": "I wish I could help you but I can't.I have window vista."}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "No. Probably you're controller."}
{"product_id": "B00IURGGA8", "context": "How do I download this to my Mac? I received it as a gift so I did not buy the game myself, but I have the code and am just not sure where to enter it", "response": "You have to download Steam (free) and input your code through there."}
{"product_id": "B008KH7NZA", "context": "Does this require a wire to the ps4 controller for chat to work?", "response": "No, although the directions in the box say to connect it, you do NOT need to. There is no difference when you plug It in or keep it out."}
{"product_id": "B006YDPU48", "context": "Do I need to play the first one to understand whats going on?", "response": "No, but you should play the first one anyways."}
{"product_id": "B0032MO77U", "context": "Does it try load other junk onto your computer as does another Jewel Quest 2 disc that I purchased and had to toss out?", "response": "mine never loaded anything other than the games. sounds like you got one messed up before. if you get one from Amazon like that, they would make it good."}
{"product_id": "B00FM5IY4W", "context": "Do you need a steering wheel to play this or can you use the standard controller?", "response": "You can use the Standard controller"}
{"product_id": "B003NVMEVQ", "context": "When you click the mouse is the sound, soft or loud?  I need one that has as low noise as possible when clicking.", "response": "Unfortunately, the quietest alternative to using a mouse is a trackpad. However, this mouse is exceptionally quiet compared to others in the same price range."}
{"product_id": "B003ZJ1VD8", "context": "What colour is the back light?", "response": "On the one I got, the keys unfortunatey didn't light up. But the logo down at the bottom of the keyboard glowed blue."}
{"product_id": "B00030GSJY", "context": "does it work with mac", "response": "I do not believe so. After checking on the Saitek website for drivers, you seem to only be able to download drivers for Windows."}
{"product_id": "B0009WPZOA", "context": "is it two players?", "response": "The campaign isn't but you can race with two players in noncompaign modes"}
{"product_id": "B00B1N07QM", "context": "Can you use the joystick to scroll? Ideally I would like it to be able to vertical scroll and horizontal scroll for webpages and excel.", "response": "You can link any key on the keypad, (including the Joypad and the space and thumb button) to whatever you wish for. be it a media function, a keyboad key, a mouse function...basically, if you can do it with something on your PC, you can link any key on this keypad to do it."}
{"product_id": "B00B98HBTA", "context": "how many players is this game", "response": "1-2 players can play."}
{"product_id": "B002I0GF72", "context": "How does it differ from the original  (game cube) game?", "response": "The new game has updated visuals and small tasks such as location of items changing. Otherwise the game is mostly the same from the original. Having played the game cube version I still strongly recommend picking this up if you have a wii u as it's a blast with replay.ability"}
{"product_id": "B0099OZR9W", "context": "Stupid question but i need to know if there are directions for the install?  I'm not tech savvy at all  lol", "response": "Not a dumb question at all. It is super easy. There is a port on the console, you just slide the drive right in, and the Xbox recognizes it. Foolproof."}
{"product_id": "B00GS1TYIO", "context": "Is the a Candy Bars Patch?I cannot install cd??Computer just wont open the disc????", "response": "Installed with no problem or issues. Maybe the one you have is defective?"}
{"product_id": "B0006PJAZU", "context": "Will Suite 8 work on a XP computer?", "response": "Yes, if you change compatibility level of software when installing."}
{"product_id": "B00CMQTVK0", "context": "can it be turned on its side like the xbox 360 can. or does it have to be kept flat like in th pictures", "response": "Must be kept flat at all times."}
{"product_id": "B006JKARP8", "context": "Will this work with the new vita to be released on may 6th?", "response": "You'll need to buy the old cable.  You'll need to make sure you have high enough output USBs to charge it using the old cable."}
{"product_id": "B000YMQGWU", "context": "Are these compatible with Mac iOS X?", "response": "Sorry I only own a pc."}
{"product_id": "B007MJSZDQ", "context": "Does this also charge fully or is it like the charging cable where it says it is done charging and about 5 minutes later it dies on you?", "response": "Up to now, when the charger indicates fully charged, the batteries are fully charged and they last several hours before running down."}
{"product_id": "B00F27JE1C", "context": "can it play american games?", "response": "yes, its not regionlocked"}
{"product_id": "B002I0GF72", "context": "This or Super Smash Bros?", "response": "I know that he loves this game... Not sure about the other game.."}
{"product_id": "B00DJYK8XS", "context": "Is this for the original wii or for the wiiu?", "response": "I have the original wii"}
{"product_id": "B00DH1KRQQ", "context": "how is this controller for playing lego lord of the rings pc game", "response": "Spend a few more bucks and get a logitech gamepad.  You'll get much better drivers and customer support.  This one is kind of a pain in the butt."}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "Just the dlc's.   This is the best place to get them. The game should be cheaper now too. The dlc's are worth getting. (I don't like spending too much money on games..so legit- get this,yo!)"}
{"product_id": "B001AATQ0Y", "context": "Does it work for the PS2 Slim? My controller ports don't work, Would it work to plug in my controllers using this device instead of the standard port?", "response": "The playstation wouldn't recognize the usb device. This device is just a cheap way of getting ps2 controllers to work with your pc."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "You need to factor in Mt Dew consumption as well. If'n you like them Cheetos, well that's a whole other monster."}
{"product_id": "B00002SANH", "context": "will this work on newer computer like 8.1?", "response": "No it won't, not out of the box. There is a work around that you can look up online though, after that it runs fine. I've done the modification myself and it works with my windows 8.1 64bit laptop."}
{"product_id": "B008BT2FWI", "context": "Will it work with Windows 8.1", "response": "NO, it will not work with windows 8.1. windows 8.1 does not recognize the existance of the CD in the drive."}
{"product_id": "B00DBCAT3W", "context": "do you have to be online to play this game?", "response": "Nope, there are no multiplayer aspects."}
{"product_id": "B001DPZE84", "context": "work with windows 8.1?", "response": "yes it does. also you dont have to do this but when you have it install it make sure you run it as admin i find it more stable."}
{"product_id": "B002DUCF7Q", "context": "Does this work with X-Plane?", "response": "Don't know. I Don't have X-Plane."}
{"product_id": "B00D84DRNC", "context": "Is this real leather?", "response": "No, but it's pretty decent faux leather."}
{"product_id": "B008YA9BVC", "context": "can the mic be detachable for other use ex. MP3 player?", "response": "No.  It's permanently attached."}
{"product_id": "B00EWEHI5K", "context": "Does anyone know if it comes in the hard-shell briefcase if I purchase it directly from Amazon?", "response": "As far as I know the hard shell brief case only comes with the reviewer purchase. All other standard purchases probably come in the clear cube case."}
{"product_id": "B003O6JKLC", "context": "is this the old version,or the slim new one? cause the picture on the box show the new one but the description on top says that it is the old version", "response": "Sorry bought this used so it was an older one."}
{"product_id": "B005G4CXPK", "context": "Will this run on windows 8.1?", "response": "Yes it will. A friend of mine has it on windows 8. I run it on windows 7. I have a gamers pc and graphics r awesome"}
{"product_id": "B00005QEFD", "context": "I'm sorry, I've looked at all the questions and answers but I thought I should ask again: Does it come with all the necessary wires and one controller", "response": "Yes! At lease mine did works great too .Hope this helps"}
{"product_id": "B00EI4V3X2", "context": "just got this headset and so far I love it but I can't turn chat volume down. As soon as I go into the party the voices are really loud", "response": "I would check the PS4 settings for chat volume. The headset has chat control on the right side of the headphone. Hope that helps"}
{"product_id": "B0029M6VKA", "context": "Does it work with Windows 7 and Windows 8?", "response": "Definitely works with Windows 7. Most likely works with Windows 8 as well."}
{"product_id": "B009AFLXZM", "context": "Does this work with a regular wii system as well as wii u?", "response": "No, only for WII U"}
{"product_id": "B00005NIMB", "context": "Does it work with mac?", "response": "It does work with Windows 8 with default Drivers, I don't think Microsoft had made new drivers available for MAC. You might have to use built in default Drivers to make it work. Also without Microsoft Driver suppose you will not have FORCEFEEDBACK feature turned on."}
{"product_id": "B00BA9AWTO", "context": "After installation, would I need to have the disc to play?", "response": "yes you would need the disc to play if you have no other slot games installed from wms slots."}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "Yes it will pair to any blue tooth compatible phone"}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "If you have a Wii U, then the console doesn't have slots for gamecube controllers. However, Nintendo recently came out with an adaptor that you could pick up at your local gamestop or toys'r'us. If you have a regular Wii, then the slots are on the top of the console behind a flap."}
{"product_id": "B00CPKUV7K", "context": "Why is it rated M?", "response": "There are a few sex scenes that don't show private parts, and cursing."}
{"product_id": "B005HN5LKY", "context": "Will this work for european plugs?", "response": "No, US standard outlets only. Sorry"}
{"product_id": "B00G42KO0Y", "context": "will this controller work with samsung galaxy s4 and are you able to use this controller to play minecraft pocket edition on android cell phones?", "response": "This contoller will work on just about any android phone in my experience, including the S4.  I do not play minecraft, so I am unsure of this."}
{"product_id": "B000H67DDY", "context": "where can I find list of supported games? and does it support Elite: Dangerous?", "response": "Hello, Some of the popular sims that are supported with our Pro Flight Rudder Pedals are Flight Simulation Software Compatibility: FSX - Flight Simulator X, X-Plane 10, Prepar3D® 2.2, and Most Other Flight Simulation Software. The pedals will work with Elite Dangerous with supported drivers."}
{"product_id": "B00GY4OAM0", "context": "Can you play this game on a regular wii?", "response": "No you could have looke this up on google"}
{"product_id": "B00FM5IY38", "context": "Is there any sexual content or obsene language in this game.", "response": "I can not remember if there is any bad language but as for sexual content YES there is. At one point you are in what I can only call a strip club from back in the day. I mean they are not completely naked but they are almost naked. Hope this helps"}
{"product_id": "B0049B2FP4", "context": "Why doesnt the LA mod work?", "response": "What LA mod are you trying to install if its LA 2.5 then its the wrong one. go to this link to find your answer...(emergency planet .com)"}
{"product_id": "B003EUPCZG", "context": "Hello, Anybody have the actual dimensions of the mouse itself? I have larger hands/need larger mouse. Currently, have Logitech G500. Thx!", "response": "5(L) x 2.76(W) x 1.73(H) in / 127x70x44 mm"}
{"product_id": "B00286BZ4Y", "context": "Do you have to type in your answers?", "response": "No. You get four options to choose from for your response."}
{"product_id": "B000BT4CF4", "context": "compatible with vista 64bit? Can someone tell me if this will work with vista 64bit?", "response": "The only distinction made on the MS site's details about it is for XP 64bit... so I'm guessing yes?"}
{"product_id": "B00B15EXJC", "context": "how does it connect in the bluetooth setting or do i just plug it in with the usb wire and it automatically syncs?", "response": "Just plug it in and it's fine"}
{"product_id": "B009AGXH64", "context": "Is the game pad the only controller compatible?", "response": "It is backwards compatible with ALL Wii mote controllers (original and with Wii motion Plus), along with all the accessories for the Wii Mote (like classic controller Pro). It does not natively support GameCube controllers but with the new adapter (shown in E3 2014) it will support both wired and wireless GameCube controllers."}
{"product_id": "B006W41X36", "context": "Can you use external speakers (like through a stereo receiver) instead of headphones and still get the same surround effect?", "response": "The DSS2 surround-sound processor was designed specifically for headsets. It is not recommended for use with external speakers (e.g. a home theater surround-sound system)."}
{"product_id": "B0053BCML6", "context": "what ages is it for?", "response": "All ages - though it will be less frustrating if they can read.  Though this game did help my 5 year improve his reading skills so he knew what to do next or fulfil an animals request."}
{"product_id": "B00EWEHI5K", "context": "If I remove the battery, and plug in the USB cable - will it work?", "response": "Yes it works, but using it as a wired mouse is very cumbersome because the cable is stiff."}
{"product_id": "B000BT4CF4", "context": "Games What games work with this controller?  I really like the Xbox 360 controller and like to play my computer games with it.", "response": "I don't have mine yet but from what I've read, most games will be compatible. Many newer games are even being made with this specific controller in mind so that helps."}
{"product_id": "B009GWLSFY", "context": "Does it have Galaga?", "response": "No, not on this collection.  Try Namco Museum instead."}
{"product_id": "B00D96BNGM", "context": "Is there a port mic jack wher I can plug my mp3 up to it and play music while I game..Thanks??", "response": "Yes you can but I dont think both at the same time I never tried it"}
{"product_id": "B005THAX5Q", "context": "Why is this game is this game so horrible", "response": "Everything really. The graphics stink. The controls are terrible. And you spend more time shooting people than aliens. I think I paid $10 for it. And I still feel ripped off. I'm a huge Aliens fan. But as a first person shooter it just fails."}
{"product_id": "B00CJ7IUI6", "context": "Does it require internet?", "response": "No it doesn't. The last update is included on the disc (at least supposedly from what I read). The latest and last update was version 1.9; without this installed the game will most likely be unplayable."}
{"product_id": "B00AAQRNQ8", "context": "Can you program one of the buttons (side button preferably) to drop the DPI to a specified level only while being held then back to normal on release?", "response": "No you cannot. I know Corsair has a couple gaming mice that have that feature that you are talking about."}
{"product_id": "B00503EAG2", "context": "Does it work flawlessly on Window 8.1, 64 Bit ?", "response": "I have windows 8 and it works great! Do not know about the 64 bit. However, I had vista 64 bit and it worked flawlessly on it."}
{"product_id": "B00CWFUHT0", "context": "Does it come with a controller?", "response": "Yup it did white one been playing diablo 3 r.o.s. like crazy."}
{"product_id": "B009O8HH3M", "context": "What are the headphone cushion material made of? Some photos make it look like it's made of a cheap foam and the others make it look like fabric.", "response": "Foam-like material similar to earphones with foam inserts..."}
{"product_id": "B0087ZMAUS", "context": "Is this a USB headset, or does it have 2 x 3.5mm TRS connectors (Audio and Microphone)?", "response": "It has 2x3.5mm conncectors. But comes with an external soundcard that has those connectors and has usb to connect to the computer."}
{"product_id": "B002I0KP4G", "context": "I'm buying this for my boyfriend and I'm clueless, is buying the collectors edition worth it? What weight does it hold?", "response": "It really depends on if he also plays Diablo 3 or World of Warcraft. Collectors editions come with bonuses for all 3 of those games. For example, this one would give his D3 characters special wings & also an in-game pet for WoW."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "My slim does not fit in this case.  I think if I pushed real hard i could get it in there but not going to do that. I may do a little cutting to make room as it is a great case."}
{"product_id": "B009GZX49Y", "context": "Does this have the templar lairs dlc from Assassins Creed 2?", "response": "No, doesn't seem so. I wish it did but then that'd be too good to be true now, wouldn't it? worse for under $20? I doubt they'd be so generous... actually.. i'm hearing now that it does... if it does this is unbelievable value for money!!! a MUST GET if you are considering it!!!"}
{"product_id": "B0050SVHZO", "context": "Does it come with the gamepad?", "response": "Yes it comes with the chat pad and red rubber case."}
{"product_id": "B00BXONG7G", "context": "is the controller support better than BF3? i rember the controller support being horrible in BF3. i played BF4 on PS4 is the PC version different?", "response": "Yep. That issue is resolved. You can toggle your running, and crouch also has toggle support."}
{"product_id": "B004NRN5DU", "context": "The Game Has Spanish Language", "response": "no idea, it doesent works in my xbox"}
{"product_id": "B002I0J4VQ", "context": "does it come with cords", "response": "The one I ordered didn't come with AC Audio cord or the cord to charge wireless controller. Cost me an extra $25 at Best Buy"}
{"product_id": "B005M0KSIM", "context": "Will this work on a computer running windows 8?", "response": "Yes, I had Windows 8 and it worked great. Upgraded to 8.1 and still works great."}
{"product_id": "B00GS1TYIO", "context": "Is this Windows XP compatible?  I didnt see it on the description.", "response": "I checked my package and it is compatible with Windows XP."}
{"product_id": "B005VA5D24", "context": "Is this hard drive compatible with the Xbox 360 Original Console?", "response": "The one with the external HD? No. This is exclusively for the later Xbox 360 model."}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "Label on mine says it was made in Europe. Below that it indicates the UK."}
{"product_id": "B00ARD5410", "context": "Does the scroll wheel scroll left & right?", "response": "Sadly, these people are lying to you. You can in fact scroll side to side"}
{"product_id": "B005BLAJ68", "context": "DOES IT HAVE BID WHIST CARD GAME?", "response": "No, it doesn't. I'm sorry."}
{"product_id": "B003O6CBIG", "context": "Can I Change the language???for example spanish?", "response": "Yes you can, on the console settings, my ps3 is configured in spanish so the game voices are in spanish, but if i change the ps3 language to english the game also change to english"}
{"product_id": "B00EF1OGOG", "context": "Can you charge the battery and a phone simultaneously by connecting them in series?", "response": "No. Our Astro 2nd Gen batteries cannot be charged and discharged at the same time for protection of the battery."}
{"product_id": "B00EFFW0HC", "context": "I have a xbox 360 4GB will that hard drive be big enough to play this game??", "response": "My son also has that Xbox and I had to buy him an extra hard drive for him to be able to play this game"}
{"product_id": "B005L38QK2", "context": "What are the difference between this one and the Steelseries Sensei RAW Mouse?. and is this an optical or laser mouse? Thanks.", "response": "I think not difference, laser"}
{"product_id": "B004UJNN5G", "context": "it can work on any mac right", "response": "Yes. They used to be separate games, but now they all work on both platforms"}
{"product_id": "B00ECOAX34", "context": "Do any of the Lego Games have a Sandbox mode? I would love to find a Lego game with a Sandbox just to play around making things..", "response": "Further details.   Lego Indiana jones 2 has a level builder.  You can find videos of it by googling \" Lego Indiana jones 2 level editor\"."}
{"product_id": "B008YA9BVC", "context": "What size jack does it have? I've tried every headset in the store with a 3.5mm jack and it doesn't fit my tablet or Nintendo 3ds xl.", "response": "The XL has a 3.5mm audio port http://www.engadget.com/products/nintendo/3ds/xl/specs/  and the NLa has a 3.5mm 4-pole audio jack, so it should work with your XL and any typical phone or tablet. You can get a 3.5mm to 2.5mm converter if your tablet for some reason will only take a 2.5mm jack."}
{"product_id": "B000K9Q5NW", "context": "Flight Sim Seat Possibility? Is it possible to get a pair of the Playseats Gearshift Holder Mounts to put on both sides of the playseat and have a flight sim cockpit?", "response": "Do you have more pictures... I do not see anything... Will you sell these?"}
{"product_id": "B00DPJBTM6", "context": "does this work on ps3", "response": "No unless you but the one with a mixamp."}
{"product_id": "B000PD0HQE", "context": "what games will this xbox 360 come with?", "response": "Hi Tanya, games included:Batman Arkham CityCall of Duty Black OpsCall of Duty Modern Warfare 2Call of Duty Modern Warfare 3 Call of Duty Modern Warfare 4FIFA 08Gears of War 2Halo 3Halo ReachLost PlanetRed Faction"}
{"product_id": "B00886XQNQ", "context": "Are these compatible with the Xbox one", "response": "Yes and no....while you can use them for headphones on the Xbox one, the chat capabilities don't work.Take a look at turtle beach website. I think there is an adapter you can buy for chat, but its only for certain devices."}
{"product_id": "B00B1MXGDO", "context": "Is this work for windows 8?", "response": "Sandras talking rubbish, it works with Windows 8 and 8.1 perfectly."}
{"product_id": "B0091A3AHA", "context": "Can you plug Xbox into TV when in the uNsc vanguard case", "response": "I am not sure,..I think so,..but he is deployed..will ask him when avail.."}
{"product_id": "B00HS5FETM", "context": "So I have x12's for the 360 and I lost my chat cable, if I were to buy this will it work on my PS4?", "response": "Yes im using the TB Tangos,  and this cable plugs into.the xbox 360 port and the other end plugs into the ps4 controller,  works flawlessly"}
{"product_id": "B00009OY9U", "context": "how long is usb cable?", "response": "My usb cable is around 80 inches"}
{"product_id": "B0041RY3W4", "context": "Can this be used to charge a single Sixaxis controller?", "response": "yes also a cell phone with a usb plug"}
{"product_id": "B00E9I1FPI", "context": "Does it works in w8.1?", "response": "Not sure-- we have 7 but it seems likely that it would."}
{"product_id": "B007SO6USW", "context": "Does it come with a charger?", "response": "No, It does not. My boyfriend already had a cord to charge his controllers from the play station. He uses the same cord for the charging stand. If you have one of those it should be fine."}
{"product_id": "B00002SANH", "context": "does it read to the player or does the player have to do reading on each page to understand what to do next? My child is not proficient enough to read", "response": "I think if you click a button it will read to you but I'm not 100% sure"}
{"product_id": "B00I4C2EKA", "context": "It says it uses steam for DRM so I cannot play this on the MAC? even though I have steam on my mac?", "response": "We got this game for my son's PC so I am not sure how it will run on a Mac.Sorry"}
{"product_id": "B001EIA2LY", "context": "Do I need a joy stick to use it on my laptop?", "response": "No you can use the key board and mouse but a joystick makes it a lot easier.  If you using windows I have all kinds of problems. iT SHUTS OFF  in the middle of flights.  If I knew when I purchased it I would not have wasted my money."}
{"product_id": "B007CM0K86", "context": "why is it rated M", "response": "Are you serious? Because of the Content of the Game!! DUUH!!"}
{"product_id": "B00G6CLZPA", "context": "Exactly what kind of game is this?", "response": "You get to read a manga style comic book.  You will get to make some desicions that will affect the outcome.  You may wanna check out some game play video on you tube."}
{"product_id": "B004EJ0L8E", "context": "What do you put the headset into USB or audio jack?", "response": "Audio and Microphone Jack"}
{"product_id": "B00GJXMRX0", "context": "hey does anybody know how to replay a video scene that was accidently skipped?", "response": "As far as I know, you'd have to just replay the memory sequence through the progress tracker."}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "I always use the disk. Some programs allow you to load program and then play off of your hard drive."}
{"product_id": "B00C2B2Y9A", "context": "I plan on using this for PS4, XBONE, and PC.  Can I leave the USB for the headphones plugged into my PC and have it still work with the consoles?", "response": "No, they have to be plugged into the device you are using. You can use them for the three but they must be plugged into the one you are using them for!"}
{"product_id": "B00HKCKA0G", "context": "We plugged in theadset to controller for ps4 but in Settings, then Sound and Screen, then audio output settings, no \"output to headphones\"...help?", "response": "THE ROUTE IS: Settings>Devices>Audio Devices>Headset and Headphones; there you can choice chat only or all audio for the feadset output."}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "It should work. I have an original OLED Vita I got from the U.S. I popped the memory card in and it worked."}
{"product_id": "B00D96BJSO", "context": "Is the xbox one stereo headset adapter included?", "response": "There's an adapter to the one controller that comes with it"}
{"product_id": "B00BFOEY3Y", "context": "does the scroll wheel have a page forward, page back left and right thing?", "response": "The scroll wheel does have left/right functionality. By default it's \"scroll left\" and \"scroll right\" (forward/back are mapped the the buttons by your thumb by default), but you can program them to do whatever you want."}
{"product_id": "B001EYU1WS", "context": "Does it work with X-Plane 10?", "response": "Yes...but you must download the XSaitekpanels plug-ins in order to make Saitek products work with X-Plane."}
{"product_id": "B00DBDPOZ4", "context": "Is there any type of warranty? I bought one barely 5 months ago and the cord isn't charging the controller anymore.", "response": "No warranty. But check to make sure it isn't the weather or anything bothering the current of electricity"}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "it does work for the wii-u but you need to have the gamecube adapter for it to work on the wii u but it dose work on a game cube and and a regular wii"}
{"product_id": "B00D6PTMSW", "context": "Do you have to have kinect on your xbox to use this lesson game?", "response": "No you do not have to have Kinect. However if you do it allows you to use voice to navigate the menus. I personally do not use it I just use my controller and is does not affect any of my gameplay experience."}
{"product_id": "B00EZKNT18", "context": "How long is the usb cable?", "response": "Hi Frank, the cable from the shell of the controller to the tip is 10 feet."}
{"product_id": "B00DPJBTM6", "context": "what cables have to be connected to the pc itself?", "response": "There is a microphone and headphone jack"}
{"product_id": "B00CMSCWGS", "context": "does this work for windows 8?", "response": "does this work for windows xp?"}
{"product_id": "B00DNGQQUQ", "context": "Since I'm new to DBZ I want to make sure, I heard in the show that Goku has the power to teleport, is it true? if yes than how does he do it?", "response": "In this game only super sayin 2 and 3 goku can teleport"}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yes- I definitely did!!"}
{"product_id": "B0088MVODO", "context": "I would like to know if there is just 1 CD or if the quantity is different, just because I heard there is a version of 3 CD's", "response": "there is a version"}
{"product_id": "B00GGUMV46", "context": "What is a Season Pass?", "response": "Is a way of you buy all the DLCs (in case of TLOU) paying less than if you buy each one separate."}
{"product_id": "B00J6DLPLK", "context": "Japanese voice & English subtitles  Support?", "response": "No. The only option is English voice with English subtitles. Cannot turn off subtitles."}
{"product_id": "B00D7UHT0E", "context": "Just Dance Nintendo is Ok to use with regulat TV?", "response": "Yea, as long as u have the plugs to hook up the wii on your tv its fine. It uses the red whith and yellow wires. If your tv dosnt have these u can buy a box that hooks into the cable feed at walmart, radio shack, etc."}
{"product_id": "B00FE8WKPQ", "context": "Does the balance board work well on carpet?", "response": "Yes, we use it on carpet and it works perfectly. There are foot extensions that come with it specifically designed to allow it to work on carpet."}
{"product_id": "B005CELN8W", "context": "Do you need an internet connection to play this game?", "response": "No internet is needed for this game enjoy"}
{"product_id": "B000BAVN14", "context": "Will this work on Windows Vista?", "response": "Yes. Install the game and when your done, right click the Sims icon and go to administration and click yes."}
{"product_id": "B003S9WJ9A", "context": "Would it work if I have a 320gb hdd first generation of Xbox's for I want to transfer my data from my 60gb to the 320gb?", "response": "Yes, I used this to transfer my 60 gb HDD to a 120 gb HDD. I'm sure it would work fine with a 320 too."}
{"product_id": "B005MQ3BSK", "context": "are the instructional videos on frtz 13  complete, or at least more complete than the miserable video 'snippets' on frtz 11", "response": "Snippets. The company that produces Fritz has full instructional videos for download or DVD, but you need to pay for them."}
{"product_id": "B0000C7GHG", "context": "Does it come with all the games and controllers and other stuff as shown in the picture or is it just the console and is it compatible with rockband?", "response": "Just the controls1 and wires w."}
{"product_id": "B0076DO5A0", "context": "what are the system requirments on this game?", "response": "Core 2 duo or similar AMD4gb tanDvd and 500 HDDVideo gane card Nvidia o ati radeon"}
{"product_id": "B00DRKJBC8", "context": "I'm currently hospitalized and on a netbook. If i buy this will I be able to transfer this to my home computer?", "response": "Hi Robert, yes you can. You get a download code, so the game gets added to your steam library and you can download on any computer as long as you log in with your steam account.Hope you enjoy!"}
{"product_id": "B006IR6NH8", "context": "Is the item durable?", "response": "Yes, you can tell it is well made."}
{"product_id": "B00J6DLPLK", "context": "What is required to get Branch A in Drakengard 3?", "response": "Kik me better  Hayaween95"}
{"product_id": "B00519C7CE", "context": "Why is this game rated m?", "response": "His game is rated m because of the blood and goreDrug reference Alchahol reference ViolenceSo it's for a mature audience"}
{"product_id": "B0050SY77E", "context": "How long is this  campaign?", "response": "If you've played any of the series, the campaign is fairly long, as those. I would guess, 4-5 hours."}
{"product_id": "B003S9WJ9A", "context": "I was told that you need a utility disk to make the transfer happen.  Does the cable come with the utility disk?", "response": "I didn't need any disk.  Just followed the instructions, plugged it in, and transferred my files."}
{"product_id": "B00BGGIWZM", "context": "is the pc/mac version be used for mac and pc, is that what this means? or only the mac version be only for mac", "response": "It means it can be used for either."}
{"product_id": "B00AWEMODK", "context": "Will this run on Windows 8.1?", "response": "It should. You can always check if it can run on yours on canyourunit.com ;) I hope that helps. I've been playing it on my crappy HP laptop for over 8 years. Have fun with it!"}
{"product_id": "B00HWMP0TU", "context": "So if you don't want to use the disk to play you can play via steam right?", "response": "Correct but if you are a steam user you can get the game through them and avoid the DVD, free frisbee."}
{"product_id": "B00BMFIXEW", "context": "I have read that this gameon PS3 can be made to have less blood and language by using parental controls settings. Is this true also on Wii U?", "response": "Not true that would make the game unplayable since it would not be able to play,for the resstrictions.the game would have to be designed this way to prevent blood from appearing.my game spils blood all around."}
{"product_id": "B000HZFCT2", "context": "Does it work with Xbox One controller ?", "response": "Yes it does work with xbox one controller."}
{"product_id": "B000B9RI00", "context": "im going to get an Xbox one do you recommend this card to play online", "response": "I have both an Xbox 360 and an Xbox One, and when you use this for either, it works for both. Xbox only sees the numbers on the card. The printing of \"360\" on the outside means nothing to the system."}
{"product_id": "B00DRKJBC8", "context": "Is this the whole game or just a code for items?", "response": "yes it is the whole game and it is a translate vertion of the japanese vertion so you get the full game therefore more items to unlock and such"}
{"product_id": "B008OQTR3S", "context": "does it have offline multiplayer?", "response": "I believe so as my grandson would want to play with someone"}
{"product_id": "B0090ECASW", "context": "I noticed in a video that this keyboard has a power outlet i want to know if it is a Bi Voltage keyboard (110v  and/or  220v)", "response": "Yes Bruce. This was a big concern of mine as well.  I am stationed overseas and was worried I would have to use a transformer.  It supports 100-240V."}
{"product_id": "B006JKARP8", "context": "where is the other cable for the portable charger", "response": "You have to use the cord that came with the vita. No cords are sent with the charger."}
