{"product_id": "B000IBELZG", "context": "Does this camera work with the PS Vita?", "response": "Not that i know of...."}
{"product_id": "B002BRZ852", "context": "what age is it appropriate for", "response": "I would play this with my 7 year old niece and nephew, but generally I'd say 10 and up. There is no swearing or anything like that i think it is a \"family friendly\" game.. if your kids are already exposed to zombies and gore it shouldn't be a big deal."}
{"product_id": "B00EOI2MRS", "context": "does this controller work on pc?", "response": "Yes my son uses it on his laptop. Windows 8.1 lenova laptop"}
{"product_id": "B0081Q58AW", "context": "Is this the physical version or the cd-key version? I would like to purchase the box version if possible.", "response": "This is the boxed version."}
{"product_id": "B008OQTUKS", "context": "If I buy the disk can I download the game from there or do i have to use the disk every time I want to play the game?", "response": "i'm pretty sure that you have to use the disk every time. i got the downloadable version and it is a lot better because u can download it on any computer once you have your origin account."}
{"product_id": "B008J16AH4", "context": "can 2 players play at once?", "response": "No you can not have to take turns on the same controller but it would be nice to play at the same time"}
{"product_id": "B004MR3QY4", "context": "What is the difference with the black edition?", "response": "The original deathadder (blue glowing scroll wheel) but the black editions is just about the same thing (just with no glowing).The old versions use actual drivers. the new 2013 version requires the use of the synapse 2.0 program.You need to create an account and it attempts to connect to the internet. you can disable the auto-connect to internet feature."}
{"product_id": "B0081Q58AW", "context": "Is this the physical version or the cd-key version? I would like to purchase the box version if possible.", "response": "It appears to be the physical box version like the one I own.  I hope that helps."}
{"product_id": "B00F2ENJY8", "context": "Does it come with everything you need to hook it up?", "response": "Yes it comes with ask the wires nicely together the controller the notion sensor and a game and it's easy to put together as a single mother I was able to do it all on my own no instructions and in under ten minutes"}
{"product_id": "B00D9FQAM0", "context": "Can you add the purchased hard drive on the side like the arcade model? My son had the arcade model and the hard drive on the side?", "response": "Like the other person stated, the hardrive goes in a slot which is inside of the xbox. And if your looking to purchase a hardrive, it takes the same one as the Xbox Slim."}
{"product_id": "B00HN9LS48", "context": "Does the Kinect actually clip on and become secured to the unit or does this item just act as a wide table for it to sit on?", "response": "This does clip on to the Kinect. It is a surprisingly stable and steady mount"}
{"product_id": "B00030GSJY", "context": "i have windows 8.1 will this system work with my system?", "response": "is the perfect flychoke for FSX and is programable"}
{"product_id": "B00DB9JYFY", "context": "Is this and Dead Rising 3 worth an xbox one?", "response": "Titanfall yes definitely yet. Not so sure about DR3 as we don't currently own it. We did rent it once though and the storyline alone is sort of boring and out of context with the other storylines. It was much more serious. Graphics and the rest are on the same high end line with xbox360."}
{"product_id": "B00AJILG1K", "context": "This is labeled as a 901 but does not have the US key layout pictured. If I order it will I receive the proper keyboard?", "response": "Yes, when it arrives in the mail it should be the one with the US key layout."}
{"product_id": "B004RMK4P8", "context": "I cannot buy the ps+ $50 card because of where I live but tell me people.. If I buy this $50 gift card would I be able to buy the ps+ direct on my ps4", "response": "You don't have to buy the physical card.  You can purchase the digital code.  When you get the code you can enter it directly on your ps4."}
{"product_id": "B003VAHYQY", "context": "How long is the length of the cable?", "response": "Its about 6ft....a lil longer."}
{"product_id": "B001GIUWX0", "context": "How many can play at one time", "response": "There can be up to 4 players at one time."}
{"product_id": "B0061PAZUS", "context": "Is the game in Spanish?", "response": "On my Zumba--the songs are of Spanish/Latino origin--Very fun and fast music :)"}
{"product_id": "B00E447L8C", "context": "Assuming I have the correct USB to lightning cable, will it work with an iPhone 6?", "response": "Yes it will, i have the prior iphone to yours and i just bought the adapting cable. Works wonders, charges very fast. Highly recommend it."}
{"product_id": "B003OZOAKY", "context": "do i need the original total rome before i buy the gold edition?", "response": "My son only has the Gold Edition and plays it just fine."}
{"product_id": "B002AQNT96", "context": "Can I get this delivered to Australia", "response": "Yes we can. Please order it and check our rate also"}
{"product_id": "B004X56PWK", "context": "Can the entire game be played in classic side scrolling fashion?", "response": "I do not know I bought it as a Christmas gift for my kids so they haven't played it yet."}
{"product_id": "B004G5TUJM", "context": "does this work with NASCAR 14?", "response": "It works with other nascar games,  it works very well."}
{"product_id": "B001Q24UAM", "context": "Does Play! have the actual games or just one-hr. trial versions with the opportunity to buy the real games?", "response": "All of our games are full version games. If anyone sees a trial popping up on the screen, they may perhaps have downloaded the game from another site. We suggest uninstalling all trial games from the computer before installing this collection for the best experience."}
{"product_id": "B000B78F72", "context": "Mainly want simple Spider Solitaire for WIndows Vista - will this suffice?", "response": "This version has several spider  games and the original too.  This should be great for you."}
{"product_id": "B007TFOO6K", "context": "I wanted to find out, is the blue switch keyboard BLUE led? they are showing red, it doesn't say on the description.", "response": "No it's only red, all of them are red, individual key soldered LEDs so if you want to replace them, it would be a big pain"}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "As long as your flat screen has a standard AV input, you should be fine. The only thing is the light gun does not work on the newer television sets, so you will be unable to play Duck Hunt."}
{"product_id": "B00EZKNT18", "context": "anyone know what size LEDs are in this remote i kinda wanna play with mine and mod it up a bit", "response": "The only thing that I could find was this: Gu5.3 LED Bulbs, Light Lamp, 50w 60w Equivalent. The wattage seems a little high but the LEDs inside these contrallers are crazy bright. I never have mine on but my kids think that its cool."}
{"product_id": "B002I0KP4G", "context": "Does the latest version of 13 inch retina 128GB works for this game?", "response": "It should but I'm not a MAC user; it will probably have an update that will if the original doesn't though."}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "It does have full controller support. Simplest setup for that is a wired 360 controller. It is mostly personal preference though."}
{"product_id": "B005G4CXPK", "context": "Is this the Director's cut and Deluxe Editions?", "response": "As far as I know after looking at the packaging and the discs themselves they are just the standard retail releases. Also If you buy this make sure to try and install the second game when the collection arrives because my Assassins Creed 2 disc wouldn't even install or autorun and its been an issue many others have had."}
{"product_id": "B009AFLXZM", "context": "I know that the box says \"no,\" but will this mic work with the wii (as in not the wii u)?", "response": "I just tried to use it on the Wii U to play a Wii game on it and it wouldn't let me."}
{"product_id": "B00CMQTVK0", "context": "in the details it said the it doesn't come with the converter do I need that to play to console and what is the converter", "response": "If you live in the US and buy from Amazon it will come with everything you need to get up and running in minutes"}
{"product_id": "B00EVWZHLK", "context": "is this game package brand new not used and in original wrapping", "response": "It's three separate disks. It will probably come in three cases"}
{"product_id": "B003O6C0V4", "context": "I just got mine today in the mail and the leg sensor WILL NOT SYNC AT ALL!! I used 10 different batteries, and stood there for 30 minutes pressing the", "response": "The Sensor was broken in my so I got a Full Refund after having to ship the second one back"}
{"product_id": "B007WPM9GO", "context": "If the hinge on the DS is already broken, will the nerf hold it in place?", "response": "It looks like it will because from looking at mine, the case snaps together and the DS just lays in it."}
{"product_id": "B000GP8448", "context": "Is it compatible with Windows 7 ?", "response": "Yes and it works with 8 too. This wheel is the best set Ive ever had. And Ive had it for going on 5 years with HEAVY usage. Still works like new. This will be the best wheel investment you will ever make."}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "yes, according to the description and/or requirements, this game should play on either version of Windows."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 7 64 bit", "response": "I have windows 7 and it works fine."}
{"product_id": "B007VTVRFA", "context": "I am looking to gift this for a friend. Will I get a CD Key when I purchase this or will it just give me a download?", "response": "CD key for Origin"}
{"product_id": "B00GPH7Y8S", "context": "Does this game require online subscription?", "response": "No, it does not."}
{"product_id": "B0086V5UF0", "context": "I want to use this with a group of girls.  Do I need a remote controller for each of them or can they just follow the choreographer on the screen?", "response": "You need a controller for each of them, but really you could do it without, and they could take turns"}
{"product_id": "B0088MVPFQ", "context": "Does the game still work if you live in another country? Or does it only work on American 3DS consoles?", "response": "I didn t have a gaming console in a  another country"}
{"product_id": "B001GIUWX0", "context": "Does this $18 used Mario Cart Wii game come in the original packaging including instructions?", "response": "Yes , my game came in the original packing and instructions."}
{"product_id": "B004GINKNQ", "context": "I have a black xbox 360 S Model 1439. We just got Destiny, which needs a hard drive. Will this do the trick?", "response": "prior to setting up game to play your xbox should display how much memory you need for that particular game if its less than 60 gb you should be good to go."}
{"product_id": "B00GJSUUC0", "context": "please can anyone tell me if this is a blue ray CD or PSN code?", "response": "This is the physical BluRay.Just as a heads-up: anytime Amazon lists a game that is simply a digital code, that caveat is listed in the product title if not as an option when selecting your platform (i.e. Both PS3 and PS3 Digital Code being available options)."}
{"product_id": "B009IR1SR0", "context": "is it included command and conquar zero hour ?", "response": "اي طبعا yes ofcourse"}
{"product_id": "B000OYMYZQ", "context": "Is the included battery just a standard rechargeable battery that I can use with the MS dual recharging station?", "response": "that included the battery standard and its rechargeable"}
{"product_id": "B000B78F72", "context": "I'm looking for simple games such as Number 10, Coppermine, Buffalo Bill.Does this or any other software have these?", "response": "I could never get it to download on my computer, so I don't know what games it does have.  chris"}
{"product_id": "B0071NH8B8", "context": "can i use it with a different provider besides AT&T?", "response": "I'm not sure why exactly but only AT&T; provides the Vita's 3G capabilities. I just use mine on wifi when available."}
{"product_id": "B005OSFUZI", "context": "This may be a dumb question but is this is like a legitimate cable for recording guitar on a laptop? Not just for the game but fo recording software?", "response": "I tested it on Garageband, Ableton on windows 7 and it gave me Awesome results. Ubisoft made the best of two worlds. A little latency but nothing serious."}
{"product_id": "B0087OZ5FG", "context": "does it have a cable just in case the battery dies?", "response": "It does come with a 3.5mm jack, which you can connect to the PS4 controller and still hear the audio and chat. The only downside to that is that the features won't work, like the awsome bass."}
{"product_id": "B00D3RBZHY", "context": "Does this game have a split screen option for two players?", "response": "No. One player or multiplayer online only."}
{"product_id": "B009GZX49Y", "context": "Do you need to download patches like the stand alone disc releases of the included games?", "response": "This is a great buy. Other then the first upload of the games to your system there has been no other downloads needed. Just insert disc wait for system to receive data and play."}
{"product_id": "B006IR6NH8", "context": "Is the item durable?", "response": "Yes, it seams to be well built and has a good feel to it. It has about the right weight without feeling like toy."}
{"product_id": "B00FAN4LRA", "context": "do these have an inline on off switch? And, is there one wire or two leading to the headset?", "response": "They have an inline Mute swtich, with volume control. There is only one wire leading to the headset."}
{"product_id": "B0036VO4XO", "context": "will this work with a 32 bit os?", "response": "I use mine on a Dell Windows 32 bit machine running Windows 7"}
{"product_id": "B009O8HH3M", "context": "Is this compatible for xbox 360?", "response": "no, there is a 360 version of this headset though"}
{"product_id": "B00BXONG7G", "context": "can ı use in europe ?", "response": "I don't see why not since it's a game download, not a physical copy with region restrictions."}
{"product_id": "B009YKVRYA", "context": "does it work with windows 8", "response": "Yeah, it worked for me. I have 8.1."}
{"product_id": "B003V4AK8E", "context": "are the triggers switched on this controller like how the 360 cont is, that is the only reason I'm looking to get one?", "response": "Yes they are but if u are playing fps games I don't suggest this controller the gun shoots way after u let go of the trigger just a heads up"}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "its the super slim one"}
{"product_id": "B004G5TUJM", "context": "does this work on all racing games even nedd for speed games", "response": "Sorry I can't answer that because I haven't try it."}
{"product_id": "B00HWMP0TU", "context": "Does it work with Windows 8?", "response": "I don't have Windows 8.  I can't answer your question."}
{"product_id": "B00DBDPOZ4", "context": "Is this product essentially the same as putting 2 aa rechargeable batteries into the controller and just plugging a micro usb until charged?", "response": "Yeah pretty much, and that's how I ran my Xbox 360 controllers, but I do recommend this, because changing out the batteries and charging them is annoying, this is a much better solution in my honest opinion."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "Yes. However, it stopped working almost 1 week after being delivered. I assumed there was an active warranty, I received no response from the company after repeated attempts."}
{"product_id": "B004S5PBM0", "context": "Does this include the real tone cable?", "response": "I'm not sure what the cable is called but it does come with the cable needed.  I didn't need to buy anything additional."}
{"product_id": "B00503EAG2", "context": "can I put this on steam?", "response": "When I got mine, it required steam, so yes."}
{"product_id": "B005VO5ZVY", "context": "does this cover fit the 3dsxl", "response": "no only the 3ds"}
{"product_id": "B00F27JDY0", "context": "Can you change it to American or is it only in japanese?", "response": "You choose the language in the initial set up.  Really the only difference is color and you use circle to confirm x to go back in the OS menus (in games its normal)."}
{"product_id": "B009D3HSTG", "context": "Does it work on Windows 8.1 and does it come with a CD?", "response": "I have Windows 8.1 and it works great with it. I don' remember if it comes with a CD, but I'm sure I didn't use or need to use CD to make it work."}
{"product_id": "B003VH5Z2C", "context": "Can you use original NES controllers?", "response": "Yes, I do, as well as the original NES joystick controller."}
{"product_id": "B00CJD4HD2", "context": "Would this be a good mouse for playing League of Legends?  Looking to purchase it as a gift.", "response": "It has excellent precision, is super comfortable and very customizable. So I would say definitely. I don't play LoL but plenty of Starcraft and DotA2. I love this mouse."}
{"product_id": "B00GHTP7SS", "context": "This is only the code? Where do i download the game from after buying the code?", "response": "Steam or Amazon game library."}
{"product_id": "B002I0K6X6", "context": "Is it best to have two move controllers, or one controller with this move navigation controller?", "response": "If you are the only one playing, one is enough. It all depends on the number of possible people playing. We're a family of 3, so we bought 3."}
{"product_id": "B000H67DDY", "context": "Is this device HID compliant? Or does it rely on the included setup software for assigning controls?", "response": "Saitek always provides the appropriate drivers, or at least makes them available to download, but you can just use Windows' to configure them under Game Controller > Properties.  It is a common enough product that Windows also may recognize automatically and install it's own drivers."}
{"product_id": "B00286BZ4Y", "context": "Does it work on a Mac?", "response": "This does work on an Apple/Mac."}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "Yes, but the adapter is included with the headset."}
{"product_id": "B00CD1FCAC", "context": "A key's light already went out after a month. Is this a normal problem or i there a way to get a new one from the warranty?", "response": "So far we haven't had any issues with lights going out.  I would encourage you to contact the manufacturer and enforce the warranty."}
{"product_id": "B007XVTR12", "context": "i want to get bo2 on pc but if i get it in physical form will this come in a code so i can download it since my pc doesnt have a dvd writer/reader", "response": "If you get a CD then you have to have a CD reader. Just buy it online and you will be able to download it as an ISO image to your PC"}
{"product_id": "B00FNNQREC", "context": "whats so great about this game?", "response": "It is very realistic..and fun to play"}
{"product_id": "B00F4GSAYI", "context": "How long is campaign", "response": "Long enough to enjoy but not so long you will lose interest."}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "Yes, it plays on Windows 7, which is my operating system."}
{"product_id": "B004JKZUJI", "context": "is it needed to play call of duty black ops", "response": "No, but why would you want to play a broken game anyway... >_> another thing. Why would you want to play a FPS on a Nintendo Console? ._. It is not needed to Call of Duty: Black Ops."}
{"product_id": "B0091WIOJ2", "context": "these headphones work with ps3", "response": "check this link for compatibility http://www.astrogaming.com/compatibility-console/compatibility-console.html"}
{"product_id": "B00C2B355W", "context": "why is mine all crackly? do i need a new audio cord? 2.5mm to 3.5mm? Where do i get it?", "response": "I haven't had a crackle at all from time to time I get an echo but I fix it by turning the receiver off and on, give  that a try. Sorry I can't be of more help."}
{"product_id": "B00AKIPBNS", "context": "My son purchased 3ds in usa but found that the 3ds games purchased here in Australia are not compatible . What 3ds  does this game work on?", "response": "3DS is region locked. So a Japan can only play Japan and USA can only play USA and so forth. If you had gone with Sony Vita you would not have to go through this problem, its region free."}
{"product_id": "B00BGA9X9W", "context": "Why doesn't this come with a USB cable to charge it?", "response": "I believe the answer to that is to save on cost, and the fact that the PS4 and almost every other device nowadays comes with a USB cord. Personally, I just use my cell phone charger if I'm not using the usb cord that came with the PS4."}
{"product_id": "B00001LDCK", "context": "will it work with vista?", "response": "Yes but you may have to download the windows 98 or XP emulator and run it off that on Vista...........I ran it direct but W7 requires the XP emulator to run within it...... http://windows.microsoft.com/en-IN/windows7/install-and-use-windows-xp-mode-in-windows-7 copy and paste this address into your search engine and windows will explain it all..... good luck!!!!¬!¬!"}
{"product_id": "B00A0EPNPI", "context": "Does it have a mic?", "response": "No, it doesnt.. What does it have is a couple of jacks for the mic and the headphones! Hope can help you!"}
{"product_id": "B003VH5Z2C", "context": "Does this work with Famicom (Japanese) carts?", "response": "Sadly i haven't been able to try. I doubt they put a lockout chip into these like the old NES had but I honestly don't know. I haven't even seen it mentioned online anywhere."}
{"product_id": "B00DLDEKOK", "context": "Does the volume box move up so its not so close to where ya plug it ino the controller??", "response": "No it does not move. IT is actually at a good place right by your thumbs. It plugs into the base of your controller."}
{"product_id": "B002HH9TUG", "context": "Can I invert the x-axis with this controller? Some PS3 games don't offer this option, making these titles unplayable/unenjoyable for me.", "response": "I use it on my pc, allowing me to go in to the calibration of the controller which allows me to insert the axis if needed.   I don't have any experience with ps3 so I wouldn't be able to help out much there."}
{"product_id": "B00BV72X1U", "context": "can i connect more then one Xbox 360 controller (2) at the same time??", "response": "My son was able to connect multiple controllers and it shows player 1, 2, etc.  He has not played a multi player game but is confident it will work."}
{"product_id": "B0000AFQRR", "context": "will this work on microsoft vista?", "response": "i'm using Microsoft 7, no idea about vista, might be worth a shot, but I love the puzzles."}
{"product_id": "B000FRU1UM", "context": "Has any one had problems playing/installing GTA or is it just me?", "response": "I Have not had a problem with that, Emma"}
{"product_id": "B000VTQ3LU", "context": "So it can be used as a regular webcam on a Windows 7 laptop with some free driver downloads,  Will work immediately as a webcam/cam on ps3?", "response": "I wouldn't doubt it ,I use to have a playstation eye and sold it cause I sold my PS3 back in 2012, I've use it as a webcam in my computer all you have to do is connect it and the driver should automatically upload ...  Any more questions please email me @ abovenbeyondinfinity@icloud.com"}
{"product_id": "B002BSA298", "context": "This items comes with the power supply cable for the old console?", "response": "Power cord and usb connection for an xbox 360"}
{"product_id": "B008TP1OKI", "context": "Is this an official microsoft product? Will it play original xbox games?", "response": "No to both ?"}
{"product_id": "B00DYAQHTQ", "context": "Is the included artbook the same book as this? The Art of Watch Dogs", "response": "I Don't think so, the one you linked to is 144 pages and the one with the LE is maybe around 80 pages long, and even the cover doesn't match."}
{"product_id": "B00EV7AYAO", "context": "Is there really a difference between a gaming keyboard and a regular keyboard?", "response": "Very much so, these things can be everything from being decked out with keys of certain sizes and pressure limits on those keys to trigger action. Sometimes it's just little stuff, like back-lighting, or custom-binding keys. Could be any, or all, or even something unmentioned, but yes there is a difference between gaming keyboards and standard stock keyboards."}
{"product_id": "B0006PJAZU", "context": "Will Suite 8 work on a XP computer?", "response": "After seArching the internet several people say that it runs under :-P just fineBut there were a few who had problemsInstalling pit should be the same as you install any softwareMake sure your on Xperia with admin rights"}
{"product_id": "B00FOHP8XI", "context": "do it play dvds", "response": "Yes, Leonard, the PS3 does play dvds. It also play Blu-Ray dvds as well."}
{"product_id": "B00005LBHM", "context": "The game comes with the all box stuff?", "response": "Depends on what you mean on \"box stuff\"If you mean that if the game comes with all that is said on the box, then yes."}
{"product_id": "B00IVHQ0KI", "context": "is this can use for PC?", "response": "No, it's for an xbox one"}
{"product_id": "B00FB4BUMW", "context": "I see the WASD comes highlighted by default. Can I change that default to ESDF instead?", "response": "yes you can change it to whatever you want each key has its own individual light so be creative lol"}
{"product_id": "B00821ME4O", "context": "it weight really 5 pounds?", "response": "No, I use it for action games (not shooters) and it works very well."}
{"product_id": "B00BXE4W4C", "context": "cant get pickaxe shed wont open", "response": "sorry, haven't received mine yet."}
{"product_id": "B00BZOBE78", "context": "do you need the original Civ V to play this?", "response": "yes, you need Civ V, b/c Brand New World is an expansion pack to Civ 5"}
{"product_id": "B00I14395A", "context": "Is there two charging cables?", "response": "Only one cable is included."}
{"product_id": "B005EQE0YM", "context": "Are these headphones wireless?", "response": "No, these are wired headphones. Very good quality by the way."}
{"product_id": "B00HKCKA0G", "context": "We plugged in theadset to controller for ps4 but in Settings, then Sound and Screen, then audio output settings, no \"output to headphones\"...help?", "response": "They just did an update on P'S network. My friends headset wasn't working either. Mine worked fine. Sorry."}
{"product_id": "B005T3GSBS", "context": "does this game have English subtitles or is it only in Japanese", "response": "It's in Japanese, but the dialogue is translated in the boxes."}
{"product_id": "B00B98HBTA", "context": "how many players is this game", "response": "Hi, you can play with two players at the same time."}
{"product_id": "B00IPTUJ8G", "context": "never played this is this a shooter? or rpg?", "response": "It is both. A shooter with rpg elements such as health and a very robust looting system. Millions of different guns generated randomly."}
{"product_id": "B00HN9LS48", "context": "Does it work for Samsung curved TVs?", "response": "Based on the design of product, I would have to say no. But I guess it would depend on how big the curved tv is. If the center of tv has at least 4-5 inches where it is not curved, I  believe it might."}
{"product_id": "B00GV0LR64", "context": "will it work with ps4", "response": "It should work with the ps4. Because it only draws a little power to use it. Nothing more. So yes it will work"}
{"product_id": "B00DWXUYN0", "context": "I have a 3ds with a small case on it. Would it fit well inside of this carrying case?", "response": "YES! My XL has a case on it and it fits perfectly. As long as it's not bulky, its fine."}
{"product_id": "B003O6CBIG", "context": "Does this game have the bonus map?", "response": "I bought the onslaught edition map pack tried several times but never could get it to work"}
{"product_id": "B0029LJIFG", "context": "I have two grandsons. Do I need to get a card for each of them or will one card for the Xbox 360 work for both of them?", "response": "If they have separate Xbox's then yes. If they are sharing one Xbox then no."}
{"product_id": "B007YLUCME", "context": "how can I make the gamepad vibrate, I do not get into settings", "response": "Send it back it is useless"}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "If it's on Steam, it should support the platforms specified. You can check all other games by going to the Steam Store page and check. But yes, it is supported on Windows 8.1."}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "No it does not fare well with Win 8.1 Pro, it keeps requiring me to go online as it requests me for internet connection. Unlike the previous version (2012 running in compatibility mode); I cannot play this offline and worse I get lots of loop backs."}
{"product_id": "B00EFFW0HC", "context": "I have a xbox 360 4GB will that hard drive be big enough to play this game??", "response": "You will need a larger Hard Drive. The game is quite large and if you intend to play online, you will need more space for the online content, patches, and map packs. I would suggest that you upgrade your hard drive and move your data to the new drive and work from there."}
{"product_id": "B0050SX7BQ", "context": "The item isn't the special edition. The special edition is a steel box version. am i wrong?", "response": "Hi Shelly, thats right, this isnt the special edition, its the standard one. And yes, special edition has steel box..."}
{"product_id": "B00GPH7Y8S", "context": "Does this game have starforce?", "response": "No starforce just an accumulation of the first Britzkrieg. I was actually surprised since some of scenarios are new to me."}
{"product_id": "B00EF1OGOG", "context": "How do you recharge", "response": "it seems to be \"touchy\" about what kind of cable you are using to recharge it. It is way too unreliable to take it on a oversea trip. World Power by \"blue flame\" seems to work all the time, but you still need to buy a dedicated cable if you have an Apple product."}
{"product_id": "B007LQG9A6", "context": "does it work on a xbox 360?", "response": "yes it works awesome"}
{"product_id": "B00CERXJNW", "context": "Can you record text macros on the 'G\" keys?", "response": "Yes, it is possible :) I think you can even record a novel on it...  I don't know the limit of characters, but it's not short."}
{"product_id": "B006IOAHPK", "context": "Can kids play this game or not ?", "response": "If they watch the show than its on par with the language the violence and everything else. But it is rated m so I wouldn't let kids play this game"}
{"product_id": "B002FY0CM0", "context": "Will this fit the Sega Genesis system model number MK-1631 9 pin?", "response": "Sorry, this cable is for what is known as a 'Model 1' Genesis. You have a 'Model 2' Genesis. What you need is here (copy & paste the following link into your address bar):   Sega Genesis 2 & 3 Standard AV Cable (Bulk Packaging)  | Sega Genesis 2 & 3 Standard AV Cable"}
{"product_id": "B00001LDCK", "context": "does it work on Windows 7?", "response": "i don't know.  i'm running it on xp.  just a heads up: it's an easy game to learn, but a hard game to play."}
{"product_id": "B00GS1TYIO", "context": "Is the a Candy Bars Patch?I cannot install cd??Computer just wont open the disc????", "response": "No, the cd I ordered installed without a problem.  Are you running Windows 7 64 bit?  I think  I had to get a patch because I have 64 not 32 bits.  Check that out."}
{"product_id": "B00F27JDUY", "context": "Could i change the language", "response": "yup definitely, but can be limited to a certain number of language based on the region of the ps vita model"}
{"product_id": "B00BI4VVGY", "context": "are you able to switch fans off with this and is it possible to run 2 of these in the same build?", "response": "Yes to both questions."}
{"product_id": "B0054JGGGY", "context": "Does this mouse have the same input lag as a wired mouse compared to my DeathAdder? I would love to use it for CSGO", "response": "Yes it does, I actually use this mouse when I play CSGO and it's pretty much the perfect mouse for that game."}
{"product_id": "B007W8S2MG", "context": "Is this a code for downloading or a game card?", "response": "A game card~ You are Chinese right~ then you will really love this game!!! It's a really fun Japanese RPG! I spent almost 2 weeks on this game and I'm only at two third about this game ~"}
{"product_id": "B00FZLE9JW", "context": "does it work for titanfalls", "response": "Yes it works with Titanfall."}
{"product_id": "B00DJYK8XS", "context": "How does this game compare to the Zumba workout DVDs? If you're a total beginner, which would you recommend trying first?", "response": "The game will teach the variety of steps before you can actually go along with the dance routines of the game. I recommend the game. I have a DVD for Zumba and I rarely put it in because the game is so much easier to follow along."}
{"product_id": "B0009WPZOA", "context": "is it two players?", "response": "It sure is. One of the ONLY racing games that seem to be now a days...."}
{"product_id": "B0041RR0TW", "context": "How does this compare in physical size to the PS3 controller? I'm looking for a controller smaller than the 360 one, hopefully PS3 size.", "response": "i think its about the same size,  maybe slightly larger, but a fair bit heavier.  I actually like the weight, feels sturdy."}
{"product_id": "B006SVUQNQ", "context": "My current hard drive keeps saving corrupt data and slowing the xbox down, for some reason my xbox wont read any game that has the corrupt data on it. Will this happen with this hard drive?", "response": "I would say this is an internal error and that the hard drive will be fine. Before playing your next game install to your console."}
{"product_id": "B009Q5XGO2", "context": "Does this work with the Energizer 3x Charing station?", "response": "No, you have to take it off before put in Energizer charging station. The Uboost changes the dimension of the gamepad..."}
{"product_id": "B0050SZ0SY", "context": "It said in the fine print that this would work with Win XP, Vista, and Win7,.... even the instructions with the disks had instructions for use with XP", "response": "It should, however if your system is using xp and you are having problems running the game, the problems are more likely to be hardware related. Too little ram or not enough power in you video card. This game is intensive on older systems."}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "It does not have onboard memory.  You can save the profile as a file and load it onto the new computer.  The mouse requires a dedicated program to run."}
{"product_id": "B00IU3MSF4", "context": "can this play original xbox games", "response": "No, it is not backwards compatible."}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "Titan Quest does not use any kind of DRM.  Just enter the CD keys for the game and its expansion during installation and you're set.  You will to load the disc into your PC's optical drive before playing but that's it."}
{"product_id": "B002DUCF7Q", "context": "Does this work with X-Plane?", "response": "Yes it works with x plane.  Go to the x plane forum to download the driver"}
{"product_id": "B002I098JE", "context": "can you turn of blood", "response": "is there local multiplayer or do you need live."}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "Because the nintendo 3ds is region locked!"}
{"product_id": "B00886XQO0", "context": "For PC Users do i need to buy a bluetooth adapter? or can this connect into plain USB? I have evga x58 3-way classified board (which is a usb 2.0)", "response": "The Tango isn't really designed for PC use, but if you have a Bluetooth adapter installed then you should be able to get it to work (results *not* guaranteed). Additional details regarding PC setups are available in our Knowledge Base:http://support.turtlebeach.com/entry/830517212/"}
{"product_id": "B00E4MQODC", "context": "Is there a slot in the battery compartment to store the USB nano-receiver when on the road, as with other Logitech gaming mice?", "response": "Yes there is, which makes it a great mobile mouse."}
{"product_id": "B00008J7NZ", "context": "does this game work on Xbox 360", "response": "Hi:  Yes it did most people told us that it wouldn't but my son had no issues playing it."}
{"product_id": "B00D4WTO1M", "context": "Hello , good afternoon , the game that sold you sell in physical or digital ?", "response": "Hi physical copy for me always...yours to own then."}
{"product_id": "B009AFLXZM", "context": "I know that the box says \"no,\" but will this mic work with the wii (as in not the wii u)?", "response": "Sorry, I believe this microphone is only intended for the Wii U. However, I do think the Wii has a microphone that was released a few years back. I hope this answer helps you."}
{"product_id": "B0000C7GHG", "context": "Is this the older and bigger play station 2", "response": "yes the older one the big one"}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "it DOES work on the pc.. only wired though... the wireless driver (or receiver) is not available yet."}
{"product_id": "B00B5GZORW", "context": "What is the name of the other bonus games?", "response": "Answer here...The other games are: Girls with Secrets, Judge Dee: The City God Case and Night at The Opera. I have not played any of these games yet.  Hope this helps.CJ"}
{"product_id": "B003O6N64Y", "context": "We have never been able to get the microphone work for my son's ps3 - he can hear , is there something special we need to do for this to work on ps-3?", "response": "I have only ever used it with my pc and ps4. The best advice I can offer for the ps3 is to look at the official support. Hope it helps.http://support.turtlebeach.com/entry/830517337/"}
{"product_id": "B0065NP6NC", "context": "Which one is better fallout 3 or new Vegas", "response": "Fallout 3 and Fallout New Vegas are both really great games, they also take place in two completely different places. Fallout New Vegas is the newest Fallout from Bethesda. But I would highly recommend playing Fallout 3 before New Vegas just so you can get the full effect of the current status of the Fallout world."}
{"product_id": "B00EV4O7B4", "context": "My sons 3DS XL broke, does this come with a warranty?", "response": "It depends on the seller. I would ask them first to make sure."}
{"product_id": "B004TTNTYW", "context": "Is this original Nintendo or generic?", "response": "Generic but works great"}
{"product_id": "B00DC7O77A", "context": "Does this game support the use of the wii u pro controller instead of the gamepad?", "response": "Yes it does!  That's what I use to play this game! :)"}
{"product_id": "B0040QCPYY", "context": "Does this product work with the PS4? I have one and can't figure out if it works.", "response": "I purchased this for my Nephew who had a PS3 which it works fine. It suppose to be compatible with PS4,XBOX, etc. Google your question and I'm sure you will find out how to link it. Also, try the Gioteck EX02s website for more info to link up."}
{"product_id": "B009GWLSFY", "context": "Would this be over kill for games such as this? Qanba Q4 Q4RAF Ice Blue PS3 & Xbox 360 & PC Joystick (Fightstick)", "response": "I don't think so, in fact, it will get you closer to the feel of the original arcade games. Hope this helped."}
{"product_id": "B00292OW1U", "context": "DOES IT WORK WITH WINDOWS 8 AND 8.1?", "response": "The keyboard will type, but the program to bind keys to other functions will not work at all."}
{"product_id": "B00F27JDY0", "context": "A friend of mine said that the materials used for the Japan version are \" less reliable\", is this true?", "response": "No, not true. Japan version is the same as US version. Except the Japan version's x and o buttons serves different purpose."}
{"product_id": "B00CD1FCAC", "context": "do the keys fade? I have bought several keyboards where the keys scratch easily and the letters fade off revealing a white plastic underneath.", "response": "I've had it only for a month and a few days so I can't say if they will fade while time passes. So far, they are like new."}
{"product_id": "B002L6HJCI", "context": "Could you tell me if this comes with all expansions for Age of Empires 3?", "response": "yes i am positive i bought it. u have 0 worries."}
{"product_id": "B00E9I1FPI", "context": "How big are the map posters that are included in this set?", "response": "The maps are about 14\" x 20\" opened up.  Five maps total."}
{"product_id": "B00DNGQTFI", "context": "has the version in Spanish?", "response": "Yes theirs a version in Spanish"}
{"product_id": "B002L6HJCI", "context": "Will the software work on windows 8 ?", "response": "No, it is for Windows XP only.  I found out the hard way.  I didn't realize that until I purchased and downloaded it and it will not work on my Windows 7.  After I downloaded I found the fine print that said Windows XP only."}
{"product_id": "B00821ME4O", "context": "Is this controller also a mic?", "response": "No, it's just a controller."}
{"product_id": "B0091WIOJ2", "context": "Can I use it for xbox one?", "response": "You should be able to. Just plug the fiber optic cable to the back and you'll be good to go."}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "All parts in Sony color box."}
{"product_id": "B000ZKA0J6", "context": "Can I instal on my two PC? Or is only for one PC?", "response": "its for 1 PC 1 Account only"}
{"product_id": "B001BZ2F56", "context": "Does it work for a Mac computer?", "response": "We had a Dell and HP at the time.  It should say it in the system requirements, etc. that they give.  I don't like too many computer games but this one had lots of positive aspects and our boys really enjoyed."}
{"product_id": "B0057WDBHA", "context": "Will this work with the Disney Infinity games? I bought a different one specifically to use with those and for some reason it won't work.", "response": "I agree with Calors A. Mendia I dont know much about the Disney Infinity games either. I just know it works well with fighting games, I recommend using a different controller too."}
{"product_id": "B0095D1CM8", "context": "How long of a cord does it have?", "response": "Roughly two meters, but I'll tell you, this mouse doesn't last. It is not worth the money."}
{"product_id": "B009RXUNZI", "context": "will it work with xbox one", "response": "You're going to need a adapter for this product so it works on an Xbox One."}
{"product_id": "B00A2WP4UC", "context": "Does this system play Game Cube games?Does this system have the Game Cube controller ports on the side?", "response": "no it doesnt, to both"}
{"product_id": "B00005QEFD", "context": "Does your system come with all the cords and controller?", "response": "Yes, it did and still does. Came with one controller."}
{"product_id": "B00GO4PTR0", "context": "could help me please my question is how I sent the code is by email or serious", "response": "Yes You can send the code by email just make sure you type it correctly"}
{"product_id": "B000BD1AFA", "context": "is it works on windows 8?", "response": "It's compatible but there are a lot of people complaining that it doesn't work worth a crap. I'd stay clear of it"}
{"product_id": "B003ZSN600", "context": "Does this work with Windows 8.1 computers?", "response": "Yes, no problem installing or using it."}
{"product_id": "B00005B8G1", "context": "Is the backlit screen annoying?", "response": "My GBA doesn't have a backlit screen. All the colors of the GBA don't have a backlit screen."}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "If its for the Wii u I would recommend buying the new ones they came out with. They would be included in super smash bros Wii u bundle, which is like 100$"}
{"product_id": "B0057WDBHA", "context": "does it have L1 and L2 buttons? the picture doesnt show any", "response": "In the top next to the PS and start button I believe."}
