{"product_id": "B002I090AG", "context": "Does it work with ds games?", "response": "yes at least that is what my grandaughter told me. and I just purchased her a game pokemon black 2 which is for the nintendo ds"}
{"product_id": "B00ERDGMT4", "context": "Can you use characters from original boarderlands 2 disc?", "response": "This just comes with dlc. You can still play as the gunzercer, siren, assasin, and soldier, but it adds the mechromancer and psycho. You meet the characters from the original game in the story."}
{"product_id": "B00519C7JC", "context": "What does Lto meanWhat does Lto mean?", "response": "I believe LTO mean \" Limited Time Offer\""}
{"product_id": "B003OZOAKY", "context": "do i need the original total rome before i buy the gold edition?", "response": "Hello, you do not need the original version as the gold edition has the complete original game.  It is a lot of fun and provides lots of game time.  I highly recommended it both for those who enjoy battle games and city building as it is a blend of the two."}
{"product_id": "B009M72E5Q", "context": "Can Netflix be viewed on this unit?", "response": "We live rural and our service can't handle NetFlix without lots of buffering, but Netflix is on the Wii main menu."}
{"product_id": "B00CTKHXFO", "context": "I see it has MGS 3 HD. Is that snake eater or subsistence?", "response": "Listed as Snake Eater."}
{"product_id": "B00HGAWFJG", "context": "just got this today, was excited, but then connected it and to my surprise the lights on the stand won't come on even though the PS4 is turned on", "response": "It must be defected mine come on!"}
{"product_id": "B002L93F0A", "context": "When I plugged my controllers into the sockets on my Wii I still can't navigate the menu or click anything. Anybody know what is wrong?", "response": "The GCN controller ports don't let you control the Wii Menu, it's a limitation of the Wii. If you have homebrew on your wii it can control a hacked channel like Wiiflow, but not the system menu."}
{"product_id": "B0040UAYI4", "context": "does it work with PS4 ?", "response": "No Idea, but I doubt if it will, due to the touch pad features on the PS4 controller. Unless the developer has updated the software to allow PS4 compatibility- unfortunately cannot check, since I don't own a PS4  ;)"}
{"product_id": "B003O6E986", "context": "We don't have connect but I was thinking about getting this game for my son for his birthday. Can he still play with a regular controller?", "response": "Yes you can. Have fun!"}
{"product_id": "B001H4NMNA", "context": "Does it come with the chargable batterypack for the controller ?", "response": "You can charge one or two controllers at the same. Doesn't take too long to fully charge one or two controllers"}
{"product_id": "B00AJZNUUI", "context": "Can you play wii fit with this?", "response": "To be honest I'm not sure. My husband n I bought it for your 6 year old girl. I see why not she has just dance 4. But I would look into it...sorry I could be more help"}
{"product_id": "B0050SVMYA", "context": "Is the \"virtual console\" or eShop available on this version of the 3DS? I wanna play and download the original Gameboy classics", "response": "No you have to buy  DS lite and 3DS games"}
{"product_id": "B0002EAA36", "context": "Is it usable in the left hsnd?", "response": "It is molded to fit the right hand.  So it would be awkward."}
{"product_id": "B00DUANBQM", "context": "Hello, May I ask ?   Does the old games in my PSP 1000 play in this PSP 3000 console ? Thanks !! :}", "response": "This is my son's game system and I do not know if older games are compatible. Sorry."}
{"product_id": "B00BDX1M00", "context": "What is the product warranty on recertified headsets?   Are they backed by the manufacturer or by your company?", "response": "I'm not sure but the manufacturer or company should have a warranty."}
{"product_id": "B00FKV8AK6", "context": "does it have fotus armor included???", "response": "The Fotus armor is only available for the male and female avatars through the Xbox store."}
{"product_id": "B0050SZ0SY", "context": "Can I play this game with an Xbox controller?", "response": "Yes, if you have a USB enabled XBOX(360/1) Controller. The game supports Game Controllers(USB Paddles,Console Controllers) with 360 Controls built in. - Although your accuracy will be much lower than mouse controls due to not having aim-assist in the PC Version."}
{"product_id": "B005DKZSVS", "context": "I bought one but the software can not run correctly. It doesnt work now. Where can I get help? I have visited the website of mad catz and ambx", "response": "Are you installing the software or the drivers first? Do you have Vista 7 or 8"}
{"product_id": "B000VLNXRU", "context": "Will these work with the PMDG 737NG ?", "response": "I don't know this device or program, sorry"}
{"product_id": "B001AWBYRA", "context": "Can u play modded zombie maps ?", "response": "I don't know I have not played any zombie games."}
{"product_id": "B000TLU67W", "context": "you can play ps 1 games on the original ps2, can they be played on the ps2 slim?", "response": "My grandson has a PS2 for PS2 games and a PS3 backwards compatible to play PS3 games and most PS2 games. I do not know about the PS1 games."}
{"product_id": "B005EQE0YM", "context": "would I need to by an audio adapter for this headset or just plug in and its ready to go out of the box?", "response": "You need a sound card either by internal pc components or add-on soundcard. One line goes to the USB port while the other goes into the line input i think.. read your document for further instructions."}
{"product_id": "B00DWXUYN0", "context": "Can you fit the charger in the case as well ?", "response": "No it isn't big enough to put the charger in it. Just has room for the ds and 5 games"}
{"product_id": "B00KGGJPYA", "context": "will this charge samsung galaxy tablet?", "response": "WAT KIND OF PLUG DOES IT USE?"}
{"product_id": "B00A750QIE", "context": "is it a fun game for a 9 year old boy", "response": "Easy game for not very experienced players. I've been playing since I was that age and I enjoyed it. If he likes baseball then this is the game for him."}
{"product_id": "B00BV72X1U", "context": "will this work for xbox live?", "response": "It will not work when connected directly to an xbox. It is designed for a PC and requires a software download."}
{"product_id": "B002JVX5V4", "context": "do I need to leave the disc in the computer to play this scrabble game?", "response": "No. I have installed it on my computer and took the disc out and it works fine on its own. Runs under XP and Windows 7, not sure about 8"}
{"product_id": "B00I4C2EKA", "context": "Can I play this game on a non-gaming laptop that is just a couple years old, or will it run slowly?", "response": "Would have to see the specs, but yes you can. I play it on my HP Pavilion dv7 laptop just fine. Of course load times are longer and late-game when there's a ton of units and the entire map is explored it will lag a bit, but it's definitely playable!"}
{"product_id": "B00HWMP0OU", "context": "Will this work on 2DS?", "response": "I have no idea if it will work on the 2DS or not.  Not really familiar with the 2DS."}
{"product_id": "B009UCGVZC", "context": "Will the Skylanders giants work on the existing original power platform that came with our Skylanders game? Or do we have to purchase a larger one?", "response": "Both giants and spyro's will play on the original...all will play on the new (larger) one"}
{"product_id": "B0006PJAZU", "context": "How many computers can this be loaded on?  Interested in the number; like only one computer or up to three computers  .", "response": "I really don't know. WordPerfect licensing is less restrictive than other brands but I do know that WordPerfect Suite 8 is a very good inexpensive program for general word processing. I'll look in the literature that came with it when I get home and get back to you."}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "That's an easy one, it's because you touch yourself at night ^_−☆"}
{"product_id": "B003RS1A7Y", "context": "Is it compatible with PAL system?", "response": "As far as I know, it's only dependant on system (Xbox/PS) and should work in any region. That being said, I only tested the regional functionality on keyboards (wich work well US->EU). Cheers!"}
{"product_id": "B00EHBKUTE", "context": "Will this work on my Alienware alpha? can I use it for elder scrolls online? Will I need a separate mouse? I hear it crashes, is it a easy fix?", "response": "I have never had it crash. Just make sure to properly install it and it will rock your world dude. It should work with it so long as it's not an xp os system.."}
{"product_id": "B00A7VK16A", "context": "What's the maximum dimensions for the console for it to fit? I want to use the case with an alienware x51, it's only a bit larger than an xbox/ps3, I need to make sure it fits.", "response": "The Xbox 360 fits but its tight."}
{"product_id": "B00C71034I", "context": "Does this game allow split screen mode?", "response": "No it does not although you can play multiplayer online and the single player is very fun"}
{"product_id": "B007Y7OP8K", "context": "Does this game come with a manual or insert?", "response": "My copy just came with the disc. You don't really need a manual just insert the disc and the install process is pretty quick and easy."}
{"product_id": "B00GPH7Y8S", "context": "is this game compatible with windows 8.1 ?", "response": "Yeah, so far I've played through the first one and Rolling Thunder with no problems."}
{"product_id": "B00B77OKNI", "context": "Is it updated to new firmware, to the one it makes it an HID-compatible?", "response": "***DO NOT BUY***The software has been discontinued and it is very hard to hack. I now have a useless controller due to that fact."}
{"product_id": "B00FLLFGO8", "context": "I have Sony Z3 since its a clip is it going to hit the power and volume buttons?", "response": "It shouldn't. If it does just slide the phone from one side or the other."}
{"product_id": "B00292OW1U", "context": "Is is compatible with Macs?", "response": "Direct Form The Manufacturer Website, The Merc is NOT Mac Compatible.."}
{"product_id": "B009NQPGOW", "context": "If you switch it to English language can you play American game So?", "response": "Yes, you can still play English games with no problem."}
{"product_id": "B000J18SR2", "context": "can it run on windows 7 or 8.1", "response": "Yes it can on both OS"}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "Yes, it comes with all needed wires, they even included an extra long usb to mini-usb cable."}
{"product_id": "B00FRESQYG", "context": "I think this might be redunant, but does this include a free month of game time as well?", "response": "yep if youre a new subscriber"}
{"product_id": "B00EVWZHLK", "context": "Must I install the games or can I directly play them from disc?", "response": "You can play directly from the disk. There are three discs, one for each game"}
{"product_id": "B000SOYG8U", "context": "Can you download a mod to change it to the clone wars?", "response": "There are a lot of nods for it. So probably."}
{"product_id": "B00D6PTMSW", "context": "Do you have to have kinect on your xbox to use this lesson game?", "response": "i have Kinect but i dont need it for this game, it comes with a chord that you plug in to a real guitar to play this game. requires a controller though."}
{"product_id": "B004QRKWKQ", "context": "does it work with a mac", "response": "I don't know about a mac.  It is a Microsoft product you might be able to find out from the Microsoft site."}
{"product_id": "B0038PBF1W", "context": "will this work on windows 7", "response": "Yes it works perfect in windows 7"}
{"product_id": "B008TP1OKI", "context": "Does it work with Destiny?", "response": "Yes it does. I brought this for Destiny and it has been working great, installed all of my other games as well, enjoy Destiny! and don't believe reviews that say it is Dead, It is not World of Warcraft, but the PVP is awesome!"}
{"product_id": "B001Q55D5K", "context": "wil it run in window 8?", "response": "I have played in on Windows 8 no problem. I haven't had any games fail to run on Windows 8, for that matter; I think pretty much any game published after Vista came out runs fine on Windows 8."}
{"product_id": "B009DYCTY4", "context": "Does the product come in it's original packaging?", "response": "It comes in the box shown on Amazon. The games come in cardboard type sleeves."}
{"product_id": "B0007TJ7TE", "context": "will this keyboard work with windows 8 or only 7", "response": "Yes it will. Plug it in and it will install just fine. Obviously give it a few seconds when you plug it in and your good to go it will get all it needs from Windows update so no worries."}
{"product_id": "B000WCCURW", "context": "I have windows 7 can I install it? I just bought it", "response": "Win7 runs it like a circus pony. Great game and easy to pause or save for dinner or the phone-wife-kids. FUN but doesn't DOMINATE your life. Real RPG."}
{"product_id": "B00IAVDPSA", "context": "Can I use this remote to instantly turn off the XBOX One when my son refuses to stop playing?", "response": "I purchased this item for an adult child who says thank you because he no longer has to yell xbox stop. It works wonders in the movie phase, but I have seen him just turn the system off to leave the house. Just pull the plug always works too if they refuse to listen."}
{"product_id": "B00DUANBQM", "context": "Did this version of the psp fix the awful ghosting issues the original version suffered from?", "response": "No ghosting issues.  Been using it for 2 years."}
{"product_id": "B008HPAXZ2", "context": "Will it work with a New Nintendo 3DS XL?", "response": "I just placed this screen protector on a US New Nintendo 3DS XL and it fit just fine, like how my older 3DS XL fit this screen protector before. Great!"}
{"product_id": "B00DC7G0GG", "context": "Can you play the campaign with two players? Or is it just one..?", "response": "You can play with up to 4 players."}
{"product_id": "B00GJXMRX0", "context": "What is actually the difference between gold steam and standard steam for PC download? Thank you.", "response": "The gold stream has EVERY DLC that is available. Don't bother buying any of the other dlc on stream as they are all included on the Gold version. (I have the gold version, so this reply is verified, not a guess)"}
{"product_id": "B002I0H2AG", "context": "does this game really suck ballls", "response": "The game is dead, not many people play it online, not more than 100 people.  not as good as the others."}
{"product_id": "B00GO4PTR0", "context": "this code works for ps4 to or onlyy for ps3 and how do you send the code?", "response": "Works on anything. They send the code I think in the mail and you redeem on the playstation store"}
{"product_id": "B00519C7CE", "context": "do people still play online", "response": "Are there a lot of hackers online for this like on PSN or do they still maintain the servers on XBL?"}
{"product_id": "B00FB4BXGA", "context": "Is the red one actually fully red LED or is it blue LED? Because the picture shows blue LED.", "response": "The illumination is blue.  Red refers to the type of mechanical switch -- see here: http://www.keyboardco.com/blog/index.php/2012/12/an-introduction-to-cherry-mx-mechanical-switches/"}
{"product_id": "B00D4WTO1M", "context": "why does it lag so much on multyplayer? its like the ps4 cant handle the memory requirements for the size of the map?", "response": "I have noticed it lagging a lot more lately. It didnt do that before Advanced Warfare came out. It may be because of the lack of people playing it now which would result in the lack of good connections."}
{"product_id": "B00A8HIGSS", "context": "Is Motion Control required to Play this?", "response": "No it is not. All you need is a ps3 controler. I'm currently not sure if it works with the PS move controler. I imagine it would, but it's not required. (And the game is not just in Japanese, it's also in English. I believe it goes off the language you have your ps3 set to. An awesome bonus!)"}
{"product_id": "B00CPKUV9I", "context": "What are the controller options? Will the Xbox 360 Controller for PC control it properly?", "response": "Wade, I did get the wired controller. Don't know if the wireless unit is as good. Enjoy Wolfenstein...amazing graphics and great story line with tons of REAL challenges."}
{"product_id": "B0009VXBAQ", "context": "what games go with it", "response": "Originally from retail it came with wii sports, but used it is likely none.  It all depends on the seller.  Just read item descriptions carefully and you are likely to find one or two reasonable bundles.  There are also separate listings for wii consoles that do include games directly in their respective catagory."}
{"product_id": "B001PO2BJI", "context": "Would you check the description on item? It is for a silicone cover for an x box controller.", "response": "Dear, thank you foryour questions, there were no silicone cover for the x box controller."}
{"product_id": "B00H72EMP8", "context": "How long is the regular 3.5 mm headphone jack before being attached to the in-line controls?", "response": "Its length is approximately three feet or one meter."}
{"product_id": "B004C4U1VI", "context": "It doesn't seem to accept HDMI input which is what an Xbox One has. Not sure it will work there?", "response": "you are correct. this cable doesn't have HDMI."}
{"product_id": "B0007MZWQS", "context": "Does it work on a modern TV?", "response": "Yes however it looks like crap on a new TV. If you can play it on an old school TV if you can't it's no big deal you can still play it on a new TV."}
{"product_id": "B009AGXH64", "context": "Why is this one $10 more than the one that comes with mario and luigi U?", "response": "It depends on where you buy from, a lot of different online stores in amazon charge different prices. If you are comparing 2 prices from amazon, one console might be on sale."}
{"product_id": "B00BI83EVU", "context": "is blue ray DVD? or to download the code for psn?", "response": "The blue Ray DVD"}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "The primary trigger is single stage, but you do have two pinky finger buttons that can be bound to act as a modifier for the primary trigger."}
{"product_id": "B00IP0H4GA", "context": "does this play on American console?", "response": "Yes it does :)"}
{"product_id": "B00DHUUTEM", "context": "Does it come with software to configure the programmable keys? If not what software did you use to configure them, and was it easy?", "response": "It comes with instructions on how to program - no software necessary as far as I know - looks like a series of keystrokes. Love this keyboard so far. Only complaint I have is that it didn't tilt up enough for me."}
{"product_id": "B00JF2FFR2", "context": "What type of Grip? Palm, Fingertip, or Claw?", "response": "Its a palm grip mouse, the mouse is rather large, almost 4 inches long and 2 wide."}
{"product_id": "B0099OZR9W", "context": "I have a 4GB xbox 360 slim and am unable to install battlefield 4. Can I use this HDD and install it?", "response": "Should work fine I have the 4GB slim and I added this drive. So far I haven't needed to install any games cause most of mine are older. But I have been installing the free xbox live gold games with no issues. So a game with install should not have a problem with this drive."}
{"product_id": "B004EJ0L8E", "context": "What do you put the headset into USB or audio jack?", "response": "Audio jack but you can buy an external sound card that makes it USB if that's what your worried about."}
{"product_id": "B006NU6F28", "context": "does it work on windows 8 at all?", "response": "Yes, I bought it for my Windows 7 PC but it does work for Windows 8. My sister has a Windows 8 PC and she downloaded it onto her computer with the same disk that I had used and it worked smoothly.  I hope this answered your question!"}
{"product_id": "B0009VXBAQ", "context": "does this play gamecube games?", "response": "Yes it can. Most of them. Some don't play."}
{"product_id": "B00GQTZ8TM", "context": "if 2ds is broke do u lose preloaded game forever", "response": "I didn't lose my preloaded data when I sent mine in for repairs."}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "There is a mirco-usb charging port in the front of the mouse."}
{"product_id": "B006W41X1S", "context": "can you sound whore with these?", "response": "Not sure what that means"}
{"product_id": "B0072A4JVW", "context": "Does it come with l2/r2 buttons because I am trying to play ff8", "response": "No it only had L1/R1 you have had to tap the back of the Vita for L2/R2"}
{"product_id": "B0096DMDXY", "context": "Is this compatible with my HP notebook pc with Windows 7?", "response": "I have a HP Pavilion desktop with windows 7 and it works great.  In fact the Extreme 3D Pro Joystick Usb Pc is by far the best joystick I have owned!  I think it will work fine."}
{"product_id": "B008TP1OKI", "context": "Does it work with Destiny?", "response": "Yes ...u must have this to play destiny....if u check the game on the box it will say ..requires hard drive storage but if u have this u will b able to play every gave there is"}
{"product_id": "B00ATF5YZM", "context": "does this work on windows 8", "response": "Yes it works i am playing it on windows 8"}
{"product_id": "B00EV4O7B4", "context": "Does this come with X & Y games as well as the 3DS?", "response": "No. It is only the faceplates with the arts. We bought the game separately."}
{"product_id": "B001AWBYRA", "context": "Does this work with Windows 7?", "response": "Yes. I have run it on both Windows XP and Windows 7, and it works perfectly on both."}
{"product_id": "B001B5U80K", "context": "Is Torchlight made for any other game console, or just PC?", "response": "there is a version for Xbox 360 on the Xbox LIVE marketplace; however, I've only seen the PC version available on Amazon"}
{"product_id": "B00FNKMVUO", "context": "the thumb buttons, are they mechanical or membrane?", "response": "The thumb buttons are mechanical keys. They also have a curvature for quick button finding. There is #1-#12 keys."}
{"product_id": "B008CP6MA2", "context": "I'm from Italy. Can i use every game without a US PSN account? (don't answer with just 'no' in case please)", "response": "I'm from Sweden and God of war 1, 2 and 3 work just fine, however, the next two games you are supposed to download and you can't download  those games unless you have an account from USA or Canada"}
{"product_id": "B0053B66KE", "context": "does it play on a new 2ds?", "response": "Yes. Any 3DS game is playable on the 2DS. You simply don't get the 3D option during some of gameplay."}
{"product_id": "B000J18SR2", "context": "Do any of the Age of Empires III have the Alamo battle?  Thank you.", "response": "sorry not that I know of"}
{"product_id": "B00ANHBJBY", "context": "Hey guys I'm having trouble with this controller in Wii Mode. Able to sync but the battery is always 0% in Wii Mode after charging. Can anyone help?", "response": "You might have a bad control, mine works fine on the Wii u charges fine holds a charge fine."}
{"product_id": "B009D3HSTG", "context": "i pluged it into the computer it says the usb device is not recognized ive put in the cd and installed the hardware it still doesnt work why?", "response": "Many reasons. If you're using an emulator you need to program your buttons. Are you using an emulator? Go to the controller plugin option. Under the menus and try to program."}
{"product_id": "B00GD962OA", "context": "How many GB capacity has this?", "response": "It has three ...."}
{"product_id": "B00F4GSAYI", "context": "How long is campaign", "response": "I agree, 15-20 hours for the main campaign, but it's also fun to replay with a different strategy: first run, go full stealth and low chaos, then replay with high chaos violence. The second run through is shorter, since you already know the main flow, but it's entertaining."}
{"product_id": "B00AYBKQRW", "context": "will this work on a sharp confort touch window a/c", "response": "No, only on LG brand"}
{"product_id": "B00EZAWV6W", "context": "Could I buy this in the US (with my US billing address) to give as a present to my nephew so that he can play it in Argentina?", "response": "Yes as long as your credit card matches the US Address.If not,Then no"}
{"product_id": "B006IOAHPK", "context": "this version is censored?? thanks", "response": "No, it's not censored. At least, being half way through I have not seen a censored screen. All the probing is there. I think only EU, AU, and Africa are censored."}
{"product_id": "B00FB5R3XQ", "context": "Does this also work for ps2 games played on the ps3, the old ps3 with the actual games not digital downloaded ones?", "response": "Totally works, play Guilty Gear all the time with it."}
{"product_id": "B001DPZE84", "context": "work with windows 8.1?", "response": "I'm using 8.1 myself and I have not encounter any issues."}
{"product_id": "B004RMK4P8", "context": "hello, the code they send me to my mail? live outside the US, but my account is USA", "response": "It's not a problem you can use this code  in another contry"}
{"product_id": "B0049B2FP4", "context": "What mods don't require the mod installer?", "response": "I use Hoppah's Los Angeles Mod. That self installs and it really changes the game in my opinion. I can't play vanilla anymore."}
{"product_id": "B00FLZ4FS2", "context": "Can I use this code on my Xbox one and on our xbox 360 in the home or is it an either or code?", "response": "Yes, you can install it on both Xbox and Xbox One console.  You'll get another code after you install the first one."}
{"product_id": "B007MM9E42", "context": "Is there any continuation from the original \"Epic Mickey\"? Can you start playing this one even if you have not had / played the previous one?", "response": "My daughter had never played the first one and she went right into this one. So I don't believe you have to play the first one in order to play the second one."}
{"product_id": "B009NQPGOW", "context": "Hello, yes I would like to ask is this a PSP 1000? THANKS !!", "response": "Hello,it is PSP-3000.Thank you."}
{"product_id": "B00CBQO930", "context": "Does the scroll wheel click to intervals, or is it completely smooth?", "response": "I just bought this mouse for my husband. We are avid gamers and he is a video game designer. The mouse does click when scrolling. Its a great mouse either way."}
{"product_id": "B002RRLQIO", "context": "Does the variable volume control work with Windows media player?", "response": "As far as I know, it controls just the master volume. I've never really had to really adjust for media player since I never had to. I tried your request though, and confirmed it just the master volume."}
{"product_id": "B00002SANH", "context": "I have Windows 8 on my computer. will this work?", "response": "I do not know on Windows 8 but I know it works on 7 sorry maybe to see if on YouTube"}
{"product_id": "B00F27JGVA", "context": "Is this PS Vita card in sealed original packaging?", "response": "Mine was....so I can only assume this one would be too."}
{"product_id": "B005YR1VP2", "context": "Does it come with all the av cables and have an easy setup?", "response": "Yes it does comes with everything to set up"}
{"product_id": "B000LQ4HTS", "context": "Is the base heavy enough to play with it resting on a desk, or does it need to be bolted down?", "response": "You won't need to bolt it at all. I set it on my lap."}
{"product_id": "B00CXI0BPG", "context": "Can you remap the DPI buttons to something else?  I don't have a need for DPI switching.", "response": "I don't think so."}
{"product_id": "B0029M6VKA", "context": "What is this thing? Is it a new type of monitor, is it something you wear or is it something like the Kinect for the PC? I don't really understand it.", "response": "its a head tracker, you place it on top of your monitor, you ware a special hat clamp that reflects the red light that the trackIr puts out, so in supported games if you move your head left,right,up,down,in,out,roll left,roll right you will do it in the game."}
{"product_id": "B00D96BJSO", "context": "Is the xbox one stereo headset adapter included?", "response": "Think they have it still lol (yes)"}
{"product_id": "B004QRKWKQ", "context": "This product comes with the Wireless Gaming Receiver Xbox? este producto viene con el Receptor de juegos inalámbrico Xbox 360?", "response": "It has a USB receiver in it yes, also allows up to four wireless controllers on one computer."}
{"product_id": "B00AJZNUUI", "context": "WIll I need to purchase any additional remotes so that more than one person can play at a time?", "response": "Mine only came with one remote set."}
{"product_id": "B007R9PWLY", "context": "hello,in technical details it says that the harddisk is 1TB7200rpm,but in the product disccription it says 750gb 7200rpm+256GB SSD? so which one is it", "response": "includes both; a 256 ssd and a 750 hdd"}
{"product_id": "B00001IVRD", "context": "Can this game be installed on more than one computer? I would like to install it in my laptop and my tablet.", "response": "Yes as long as you have the codes you should be able too my brother gave us his copy to use while it was on his desktop and he was in georgia but you need the disk in order for the game to run"}
{"product_id": "B00CRL9TU2", "context": "can it be played in offline single player mode??", "response": "No. This game is the worst. I can't do anything with it."}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "I dont think it will work with old Wii."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "Have had my unit for three months and all LED's still shining bright."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "I've been using it pretty heavily for 6 months and the LEDs work perfectly. The only thing that has degraded are the wasd keys from being used too often, and that's just a little paint coming off the top."}
{"product_id": "B00BQZ5EWW", "context": "if i buy Total War: Rome 2 will the Imperator Augustus be add or do i have to buy Total War: Rome II - Emperor's Edition to get it ?", "response": "After big patch on it , whole player who has this one or edition one can play Augustus dlc and some of free dlc (i guess bactria one)So u just buy this and u can play"}
{"product_id": "B00I4C2EKA", "context": "Where do I download it from once I get the code?", "response": "Steam. But yo need to download Steam first"}
{"product_id": "B00FB45YFQ", "context": "why wont the LED lights work? and/or the software show a setting for it?", "response": "You have to have it plugged into the sound card that comes with the headset."}
{"product_id": "B00I4BGNVM", "context": "explorers pack still come with this?", "response": "No, it doesn't. You have to buy the code online or find an edition that still has it included."}
{"product_id": "B001IYR53W", "context": "Will it run on windows 8?", "response": "Hoyle card game works great 8 or 8.1"}
{"product_id": "B00A378L4C", "context": "How does the '00' key work in numpad mode? Is it a distinct key code, or does it just send '0' twice?", "response": "I don't know if there is such a thing as a single key code for a double-zero."}
{"product_id": "B0011E4J7O", "context": "Will it work without the battery pack?", "response": "No, it won't work without the battery pack. But they're relatively cheap."}
{"product_id": "B00HWMP0OU", "context": "will this work on a Australian 3ds console?", "response": "I am pretty sure it won't work on an Australian 3ds console  :("}
{"product_id": "B00D7UHT0E", "context": "is this good for a five year old", "response": "Yes, My 3 yr old daughter loves it! If they love music and love to dance they will enjoy this. It also has music for their age which is a plus."}
{"product_id": "B000096L71", "context": "Does the instrument panel have Garmin G1000?", "response": "You're welcome.  Simulator is great for me.  Lost medical due to poor health and at least this way I can still fly using a little imagination.  Enjoy it while you can."}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "As mentioned it is all keys but there are some cool 3rd party plug ins out there that allow you to color cycle or turn the keyboard lights into a spectrum analyzer for your music"}
{"product_id": "B00DRKJBC8", "context": "can you use a controller (xbox360) or do you have to use the computer keyboard?", "response": "Yes, you can use a USB game controller. I use a Logitech F310, set to \"D\" (Direct Input). Some of my friends on Steam use Xbox 360 controllers and have no complaints."}
{"product_id": "B007MJSZDQ", "context": ". 1.Does this work for any Batter pack or is it just the 2 given to you?", "response": "i got a rechargeable from my friend a couple years ago and it seems to be working just fine so i have 3 batteries in circulation"}
{"product_id": "B005QUQP80", "context": "I just got the K60, I plug it in but no lights come on and no plug and play happens? whats the matter", "response": "The K60 has no \"special\" plug-and-play features nor lights. Test to see if the numlock, capslock and scrolllock come on, and you're good to go!"}
{"product_id": "B00G0OYHCW", "context": "Does it come with a hard copy of the games or download codes? I was looking to get the used version but do not want to risk getting a used code", "response": "New Super Mario Bros U, and Luigi come on the same disc."}
{"product_id": "B00F4GSAYI", "context": "does this game come with a seperate cover like the elders scrolls v: skyrim legendery edition?", "response": "The game comes with a sleeve of the covers box art."}
{"product_id": "B005EOOT90", "context": "Can you watch netflix with these", "response": "Yes, anything going through your console can be heard through these."}
{"product_id": "B00C71034I", "context": "is the whole game a prequel?", "response": "Batman Arkham Origins takes place before Arkham City and Asylum, in Origins Batman does not know who Joker is unlike the other Arkham games."}
{"product_id": "B001444IN6", "context": "does it work for windows 7 and 8", "response": "Yes. My daughter has windows 7 and it works fine."}
{"product_id": "B00CTKHXFO", "context": "Does it include MGS: Twin Snakes?", "response": "It does include MGS 1 which is what twin snakes is a remake of, but not the actual twin snakes game.  So to answer your question,  no."}
{"product_id": "B008GEH9HO", "context": "Does This Come With A Charger?", "response": "Yes, as I understand from checking other reviews-however I didn't see it in product description and was about to call a local retailer to be certain-this should be added to description!"}
{"product_id": "B00HPU96FI", "context": "I have one question.  I get video from this cable, but no audio at all.  Is there any way to get sound from this cable when it's plugged in?", "response": "Your T.V. probably doesn't blend the VGA with your audio input. What you need is a 3.5 audio jack to a female RCA jack. This should 100% fix your problem."}
{"product_id": "B000LQ4HTS", "context": "Can the buttons be reprogrammed like the X55?", "response": "The buttons can be programmed although I am not sure about X 55 since I never use that but the buttons can be programmed."}
{"product_id": "B006QRMR4S", "context": "Is this a US 3DS? I bought US 3DS games, but can't play them on my Australian 3DS because the DS is region locked, so i'm looking for a US 3DS.", "response": "Yes this is a US version of the 3DS"}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "No not at all. It's possible that you have the mono setting set louder then the left. If it's not that then it's possibly a defect"}
{"product_id": "B00GU4F4OM", "context": "Will this mouse work with Windows 8.1? I have been seeing some reviews of some that have issues with 8.1 for some reason...", "response": "I have no problems"}
{"product_id": "B002672Z80", "context": "is it user friendly?", "response": "This remote Controller is very easy to use. Little finger and big finger can use it with no problem. We have four for my daughters and for their friends or cousins when they visit."}
{"product_id": "B0087ZMATE", "context": "is this a good headset if i need to hear people calling my name?", "response": "Yes. These do not block the noise around you very much."}
{"product_id": "B00656HLGO", "context": "Just to confirm, will this work with the Xbox 360 Arcade console?", "response": "Yes. I have an Arcade console, it worked perfectly."}
{"product_id": "B0011DCA6W", "context": "Will this program be compatible with XP or windows 8", "response": "Im not sure I run windows 7."}
{"product_id": "B007SO6USW", "context": "does it come with a battery pack for the controller?", "response": "It doesn't come with a battery pack. It hooks up to usb"}
{"product_id": "B001E93IWI", "context": "Will this headset break easily like some turtle beaches do", "response": "From what I've experienced so far, I'd have to say no."}
{"product_id": "B005CELN8W", "context": "Do you need an internet connection to play this game?", "response": "No you can play the games without connection from your computer"}
{"product_id": "B001DU25UO", "context": "Does this work on Windows 8?", "response": "Their site says it does, but I haven't tried it. I've since moved on to Xbox controllers."}
{"product_id": "B00AJXEYOG", "context": "Can I use this with windows 8", "response": "Anita G. I really could not tell you, I have windows 7 ??? Sorry I can not help you!"}
{"product_id": "B00AJZNUUI", "context": "will this wii work with my older games?", "response": "If they are wii games yes."}
{"product_id": "B0000512IE", "context": "does anyone use them for Star Citizen, and if so how would you rate their preference?", "response": "I use them for both Star Citizen and Elite:Dangerous.  I really like them.  Sturdy, responsive and a good firm center detent that you can feel easily.  They do work well with shoes on, but to me are more comfortable with sock on."}
{"product_id": "B009AFLXZM", "context": "I know that the box says \"no,\" but will this mic work with the wii (as in not the wii u)?", "response": "Depends on the game.  Most games do not have support for the Wii U microphone.  I know of one specific game (Japanese WiiWare edition of Karaoke Joysound) that has gone and added the Wii U microphone support, but I'm guessing if they don't explicitly add support for it, it won't work."}
{"product_id": "B0065NP6NC", "context": "Can I play a previous save from the original Fallout New Vegas or will I have to start over from the beginning?", "response": "You can most definitely use your old saves, the only difference between this game and the original release is that the DLC is included. The rest is the same. Hope this helps! :)"}
{"product_id": "B00D3TRMD8", "context": "Does this come with the Reign of Giants DLC?", "response": "No it doesn't. But you can buy it as an add on."}
{"product_id": "B004RMK4BC", "context": "can i use this code to pay for ps plus without registering a credit card", "response": "I believe so, yes. Once you have added your \"funds\", then simply confirm purchase inside the PS Store and your set."}
{"product_id": "B00HHUSNPU", "context": "Where do you ship from?", "response": "Hi friend, we ship from China"}
{"product_id": "B004TTNTYW", "context": "Does this actually work for Nintendo 3DS? Because I brought this for a replacement charger because I lost my previous one.", "response": "It is intended to work for Nintendo 3DS, but the one we received has faulty wiring and sometimes it charges but most times it doesn't because we can't find the exact positioning of the cord to make it work.  Ours might be that one bad one."}
{"product_id": "B000OYMYZQ", "context": "Will this work with PC?", "response": "It will charge through PC. In order to use the actual controller through the PC, you need the Microsoft adapter.  I bought this item and the adapter; works great. Still cheaper than buying a wired usb controller, although those are good too."}
{"product_id": "B00B1MXGDO", "context": "can i use this for pc gaming?", "response": "Yes you can provided you have the correct drivers, however for my controller one of the bumper buttons broke after only a few months, if you're going to be using it heavily I wouldn't recommend this controller."}
{"product_id": "B00DLRLDBO", "context": "does it work perfectly with xbox 360 controller do I have to do anything special and can I use it for a PS3 IPhone and PC??", "response": "I dnt recommend this at all only worked for 2 weeks couldn't really hear clear and now there oficially broke not worth at all what I paid"}
{"product_id": "B00JM3R6M6", "context": "will this work on 2ds?", "response": "No!  The 3DS game cartridge is totally different than the 2DS.  A 3DS game will NOT fit into a 2DS system.  You can play a 2DS game on a 3DS, but not the reverse."}
{"product_id": "B0033WFJFS", "context": "how do I get the instructions to use this control", "response": "Well... I guess you can set it in your \"control panel\". I only used it for my NBA 2K13 game, so when I plug it in, then I can set the keys in the options in the game. Hope this helps!"}
{"product_id": "B00FEOR4MY", "context": "It looks as if you can play on it without taking it out of the case?  Has anyone been able to do that?", "response": "You probably could but my son has never attempted to"}
{"product_id": "B00EH5V1IO", "context": "Do the headphones have to plug into a usb port? or can the also plug into an iPhone? ps i don't know why we are called disappointed on here!", "response": "They work on iPhone, fairly well I might add."}
{"product_id": "B00D6NPFDK", "context": "will other skylanders work with it(as in normal skylanders and skylanders giants)?", "response": "Not from what I was told , each game has its own characters and base."}
{"product_id": "B00BCEK2LA", "context": "Hi, is this mouse blue or grey?   Thanks.", "response": "Its a dark blueish hue unlike the mx518."}
{"product_id": "B00C2B355W", "context": "Does this headset work Wirelessly with the xbox one is my question.", "response": "Yes. The transmitter plugs into the optical port for sound and the usb for power and chat. The headset itself only has to be plugged up to charge."}
{"product_id": "B005M0KSIM", "context": "Does the game download from the disk to my PC, or do I have to use Steam? I wont use Steam on my computer.", "response": "Installs from disc  *edit* that is, if you choose disc version.  If you are choosing PC Download I believe it is accomplished through Steam"}
{"product_id": "B0050SVNP8", "context": "This is the U.S. version of pokèmon right? Does it matter?", "response": "Yes it does us version it's only fur usa region"}
{"product_id": "B00A8HIGSS", "context": "Are the menus put in english too, or just subtitles?", "response": "Everything's in english. When characters talk there are subtitles because when they talk they sound like their talking in a whole new language ( its not Japanese) its kind of a mumbling sound."}
{"product_id": "B00ATHFLZS", "context": "What color are the light on top? It looks different in every picture.", "response": "They aren't any one color, it changes through several colors while it's on. Green, blue, red, purple, yellow... :)"}
{"product_id": "B000IBELZG", "context": "Does this camera work with the PS Vita?", "response": "No.  The mini sub is not a match for the socket on the Vita."}
{"product_id": "B00BY0G0YU", "context": "Any ideas on what the special edition of the game contains?", "response": "From my understanding, it has a different cover and some artwork. That is all that I am aware of."}
{"product_id": "B00GJSUUC0", "context": "Is Phantom Pain included? What does unlock bonus MGS V Phantom Pain with Ground Zeroes means?", "response": "I know its late but the unlocks are metal gear solid 1 solid snake skin, Ground zeros sneaking suit, Gold bionic arm, and MGS1 Gray Fox cyborg ninja skin. Also some staff will transfer depending on who you extracted like Hideo Kojima."}
{"product_id": "B00HWMP0TU", "context": "Does it work with Windows 8?", "response": "Yes very well actually"}
