{"product_id": "B0050SYX8W", "context": "All right i'll admit it, i'm a bit challenged when it comes to some of these things. My question is-if i buy this halo 4 x box game will my grandson be able to play this on his i pod?", "response": "No, sir. That would prove impossible. Halo is available only for Microsoft XBOX 360. I would vote to have it on my iPad, though I'd guess Microsoft would have a fit if their competitor were to posses their precious game. Hope this helps!"}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "Yes, it comes with the adapter."}
{"product_id": "B003EUPCZG", "context": "is it good for left handers", "response": "If you get the left-handed edition, it's great!"}
{"product_id": "B00BXE4W4C", "context": "I have made it to the cellar.  Used the hammer to get in but now it is not in my inventory so I can't break the wall with the map.  Any ideas how to get the hammer back?", "response": "Sorry.. you're doing better than me... I never got the game to even download and I have played dozens of them.... :("}
{"product_id": "B009S4JZKK", "context": "does this program work on windows 8 .1", "response": "Yes it can run on Windows 8.1 However it will need to run on the Steam program which is free unless you desire to buy more engines and more tracks."}
{"product_id": "B00DCBDNW6", "context": "Do you have to buy a subscription to play this game?", "response": "Hi. First 30 days are free than you need to pay a subscription fee of about $15 a month."}
{"product_id": "B006JKARP8", "context": "why does it say that maintains the charge for up yo 1 year?  it wont work after 1 year?", "response": "each battery has efficiency in both storing and output. in a year. its safe to say that the battery lost bout 25% of the charged volume."}
{"product_id": "B00FE8WKPQ", "context": "I own the Wii U and no Wii Remote controllers. Will I have to purchase one for use with the Wii Balance Board?", "response": "Yes you do and I would suggest you also get the nunchuck controller"}
{"product_id": "B00HWMP0TU", "context": "Does the complete edition have all expansion packs included?", "response": "I have bought Civ 5 complete on disc ad I dont have expansions. Why ?"}
{"product_id": "B0086V5UF0", "context": "can you use the just dance 4 or just dance 2014 with the dance dace revolution dance mat?", "response": "I'm not sure if DDR & Just Dance are compatible. So I can't say for sure."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay for online multiplayer or is it free?", "response": "It's free for PC"}
{"product_id": "B000O5DY0E", "context": "Did you have any problems with the downloads?My old CD would stop downloading and will tell me to retry again because a specific file will this happen", "response": "I never downloaded anything, but I guess you could retry it. If that doesn't work, re-install the game, or call customer support."}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "It is inexpensive, however there are drawbacks. It does not sync directly with the playstation. you have to use the USB plug-in for it to work. That is why there can be a slight lag. I have not used this controller once since I bought it."}
{"product_id": "B00BM7NXMW", "context": "The scroll wheel won't scroll back, is there any way to fix that?", "response": "There doesn't seem to be any options in the software that inhibit the wheel from moving like that. I would guess its a hardware issue, maybe something is stuck or broken. Perhaps opening it up could help you find out (if it doesnt void the warrantythat is, if it does then contact customer service)"}
{"product_id": "B00FZ12F34", "context": "in the amazon infinite bundle, do you get elsa, anna, Rapunzel, and jasmine????", "response": "Elsa ans anna- yes,  rapunzel and jasmine-no"}
{"product_id": "B00AQ2BLI2", "context": "Does the disc version still require steam to play?", "response": "Yes it does, when u installed it will ask for steam and them they goin to update the game and now I played with steam offline."}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "I'm currently using windows 7 but according to the logitech website the g105 is window 8 compatable"}
{"product_id": "B002672Z80", "context": "Will these work with the Wii U?", "response": "Yes. Any Wii controller will work with the Wii u. But it won't work with Wii motion plus games."}
{"product_id": "B006IR6NH8", "context": "Will that work well for flying games?", "response": "no it won't. I'm sorry"}
{"product_id": "B003O6CBIG", "context": "Does this game have the bonus map?", "response": "Yes, Free Fall is included"}
{"product_id": "B00E1L786S", "context": "Anyone know if there's any issues using this with a PS4? I'm guessing probably not. It's just audio inputs, etc.", "response": "No; absolutely none at all. I have optical running from my PS4 to the N1, works like an absolute charm."}
{"product_id": "B00D9EPI38", "context": "if all I want is to play games, is 4GB good enough, I dont need or want all the bells and whistles, just gameplay", "response": "I know I'm late but, if you don't have a lot of games 4 gb is fine, but if you have a lot then you will need to upgrade or delete some of your saves."}
{"product_id": "B008CXTW5G", "context": "How is the key cap quality? How is the surface? is it touching silky or roughly? How is the letter painting on the caps?", "response": "Key cap quality is very good. Have had no problems over the year. The best part of the board is the removable keypad. If you switch between your mouse and 10 key, it seems mor natural to have the 10 key to the right of your mouse."}
{"product_id": "B00919RM1Q", "context": "Does it include the face maker ?", "response": "Yep. Facemaker included. :) Should be able to use your old faces as well from other versions."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "Almost any kind of controller can work with windows xp/7/8 if you download the right drivers for it.  Windows 7 and 8 should download the drivers for you."}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "Buy it used at gamestop play for 1 week and return for refund"}
{"product_id": "B0098EVZZ8", "context": "will these work with the Wii game", "response": "Yes, I use them with my Wii version of Skylanders Giants."}
{"product_id": "B00DB9JYFY", "context": "It states rated for M -- my son is 10 and loves that his friends play this game online with classmates -- how concerned should I be about the content?", "response": "It just a lot of shooting and giant robots not too bad"}
{"product_id": "B003O6EDSM", "context": "If I buy the Mass Effect trilogy from the Playstation Network, which DLCs would I have to buy in order to gain all of the possible trophies?", "response": "You can earn all possible trophies without DLCs. Buying a dlc(any one)will download new trophies to be earned"}
{"product_id": "B004C34D2M", "context": "does this Wii controller come with motion plus ?", "response": "No it didn't you will have to pay for that extra"}
{"product_id": "B00HVBPRUO", "context": "is there a separate volume button for chat sound and game sound?", "response": "Yes . Very conveniently"}
{"product_id": "B006QRMR4S", "context": "Is this a US based product?   Last DS I bought from Amazon came from China and I had lots of problems with it", "response": "Well, technically it is manufactured in Japan for America."}
{"product_id": "B003JETPHS", "context": "Does this work with ps3?", "response": "I recommend checking to see if the console has a USB slot"}
{"product_id": "B00DBRM3G8", "context": "Can you play the single player offline or do you have to be online to play? Thanks for any info! Have a great day!", "response": "5 V. 5, yes. MyGM, no. MyCareer, yes but it takes longer to level up your player without VC."}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "No men, only is possible un One Xbox."}
{"product_id": "B009AP23NI", "context": "Is this an official Nintendo product?", "response": "Yes it is. It's the Japanese version of it too which I thought was cool. What arrived was exactly like the picture there."}
{"product_id": "B0050SVMYA", "context": "Does this one come with AR Cards included?", "response": "When I purchased it about a year ago it did. I suppose it depends on the seller but they should be included."}
{"product_id": "B00DC7O77A", "context": "Is this game easier or harder than the wii's Donkey Kong?", "response": "Harder. But pure fun."}
{"product_id": "B00576U8CC", "context": "Does this game force you into PvP scenarios, or are you mainly fighting WITH or AROUND other players, but AGAINST AI enemies?", "response": "You are more often fighting alongside other players in a competitive nature. But you only encounter PvP if you specifically choose to join a PvP event"}
{"product_id": "B001DPZE84", "context": "will this program work on Windows 8.1?", "response": "I don't know. I gave it as a gift. Sorry."}
{"product_id": "B00BU7WVG8", "context": "is this a 2 players", "response": "I think it is"}
{"product_id": "B00166N6SA", "context": "Will this game work with Windows 8 or 8.1?", "response": "Yes it works with Windows 8, we have had no problems with it"}
{"product_id": "B00IPTUJ8G", "context": "Is there a disc version available? Huge bl fan and i have this version via psn download  but would like disc as backup.", "response": "Only have the download code with the DLCs. The code was from a Borderlands PS Vita bundle. Sorry I don't have what you're looking for."}
{"product_id": "B00IYWV5HS", "context": "Does this version come with the new pre-order rewards?", "response": "I did bought Wildstar Standard on Amazon. But it seems I have need and tried to download amazon games to play any games. But it didn't work. Idk where its at on my laptop and do I need more stuff"}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "This game is for the Wii U, so it won't work on an older system. You can play Wii games on the Wii U however."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "No.its a pain in the ass. You have to install it on the 360 then you can share it on to your xboxone. If you have both it's fine, and I did but otherwise don't do it"}
{"product_id": "B00AKIPBNS", "context": "does a poster come with the game i see it in the images lol", "response": "When I got it, there was no poster. There was only the game box with instructions and the game itself."}
{"product_id": "B00D96BMV8", "context": "Can you hear your voice in the headphones during chat, so you do not begin to shout?", "response": "Havent noticed hearing my own voice but iv also not felt the need to shout or had anyone complain that I was shouting. I can still hear myself talking unless the audio is just turned up rediculously loud"}
{"product_id": "B00ATHFLZS", "context": "can different keystrokes be assigned to the programmable buttons for different programs? How many?", "response": "It says they are, but I have not tried them. Also, it does not give you a manual when you purchase the item."}
{"product_id": "B009RXUNZI", "context": "When you \"stash\" the mic, does it mute? I would like this to act like PTT during games.", "response": "No, it doesn't mute your voice when you tuck the mic in, but I'm sure there's a way to manually mute yourself through your device."}
{"product_id": "B007XVTR12", "context": "does it work with windows 8.1 ?", "response": "Without a hitch. :) I had this game on 360 and loved it now it's all I ever play on my Windows 8.1 build."}
{"product_id": "B006W41W3M", "context": "does it work on xbox one and pc", "response": "Not sure, my son uses it on Xbox 360 and he loves it"}
{"product_id": "B006SVUQNQ", "context": "is this compatible with an xbox 360 S console?", "response": "Only with the slim console."}
{"product_id": "B002BS47JE", "context": "I enjoy the original WII Fit but dislike that it goes to a rating and time screen after each activity. Does the Plus program do this also?", "response": "Yes it does but there are so many  more of a variety of exercises to do that thee is no way you could get bored exercising."}
{"product_id": "B008RA5AWS", "context": "Once i purchase the Quickbooks Pro 2013 with Enhanced Payroll, will i still need to purchase a year subscription ??", "response": "I think I am paying by the month for three employees or less. If you go over three employees the monthly fee increases. I haven't been using it very long so I'm still learning my self. Good luck to you, Bob."}
{"product_id": "B004QRKWLA", "context": "Has anyone used this with old-school console emulators, and if so, does it feel okay playing older games?", "response": "I use is for all my games from the original nintendo to playstation 2 and I think it is great"}
{"product_id": "B0057S9SYY", "context": "do these headsets drop the sound every few seconds like the turtle beach x32's??", "response": "They don't drop the sound, but when the battery dies (without warning) good luck with the roulette wheel that is it reconnecting after switching batteries.  It's always a crap shoot, at which point, you have to quit playing, unplug the base for a couple minutes and hope that it reconnects upon power up."}
{"product_id": "B00001IVRD", "context": "Does this work on Windows 8 x64?", "response": "It seems so: http://www.eightforums.com/gaming/4295-starcraft-1-windows-8-beautiful.html"}
{"product_id": "B002SCQSKE", "context": "was the game fun", "response": "I haven't tried it yet. I just got it...by the end of the day I can let you know :)"}
{"product_id": "B00DBKSN8M", "context": "hello friend, how many gb? which are all games that brings?", "response": "The counsel comes with 500gb and it comes with (gta v) and a 30 day ps+ membership"}
{"product_id": "B00HGAWFJG", "context": "Can you turn the light off? Or, does it turn off while in stand-by mode?", "response": "Yes by pulling out the USB cord you can turn it off during stand by mode."}
{"product_id": "B00009OY9U", "context": "how long is usb cable?", "response": "Itis 80 inches long. This is the cable that is attached to the joystick as manufactured by Logitech.JR"}
{"product_id": "B003O6EDSM", "context": "For how many players is this game?", "response": "Mass Effect and Mass Effect 2 are strictly single player, but Mass Effect 3 offers a cooperative multiplayer experience which allows up to four players."}
{"product_id": "B00JM3R6M6", "context": "If I buy used, will I able to create a new game or I am stuck with the previous saved game?", "response": "all games are able to restart and be able to create new games. So yes you will be able to make a new game."}
{"product_id": "B004QRKWLA", "context": "Do I need to calibrate or download programs and are the programs included?", "response": "Negative.  Its plug and play.  After I used it for weeks without issues, I saw there was a Windows update for it.  So I installed that with rest of my Windows 7 updates.  I use it for sport and racing games no installation or disc needed. Good luck"}
{"product_id": "B001EYU1WS", "context": "Is this compatible with a Macbook Pro?", "response": "I just checked their website and I didn't find anything concerning Mac.  I would advise you to go to www.saitek.com and submit an email to their support team to find out for sure.  They are usually good about responding in a timely manner.  Good luck."}
{"product_id": "B008CP6Q6M", "context": "How many CDs are in the Pack?", "response": "Two one for the first game and one for second. Also includes code for dlc content"}
{"product_id": "B002I0HJG8", "context": "Does this one give me Founder Status with the 8 Character slots, 4 bank slots and all, or do I need the Collector's edition instead for those benefit?", "response": "Yes it does give you founder status will all perks, but remember if you have characters made already it will not add additional slots on top of those. It is 8 slots total regardless if you bought extra slots already."}
{"product_id": "B002I0K3PM", "context": "Is this game free roam like other Lego games?", "response": "It is the ultimate free roam. Better than any other Lego game. It is the ultimate a d aweso.email 1 player adveture! My most desired sequel, and I never even liked Lego games before this. Buy it and enjoy!"}
{"product_id": "B0016897GS", "context": "Can I use this to connect my smart tv to my computer modem? Is this the correct cable? Thanks", "response": "Yes, sorry, thought you were talking bout your smart phone"}
{"product_id": "B00D9FQAM0", "context": "is there a headset included with the new xbox", "response": "If you buy it brand new yes or you could just buy the headset seperately."}
{"product_id": "B002I0HJG8", "context": "few records come from? to buy the game is installed with your disks and then I guess updates and patches are downloaded ?", "response": "You can download the game and it will update. The only thing you get with a hard copy is the sheet with the code that gives you bonus items which is worth it. Plus put the code in backwards for more."}
{"product_id": "B0083H4NG4", "context": "I don't have a disk drive in my computer (iMac) would windows 7 find the drivers automatically? I already bought, it's in the mail.", "response": "Yes, it should work fine. You can also download the software from the manufacturers website."}
{"product_id": "B004W1IX1G", "context": "What is the difference between the edition of  \"software only\"  and \"with wii motion plus\" ?", "response": "The wii motion plus has the adapter.  If you have newer or 3rd party controllers that already have it,  then you don't need the +. If you don't, then get some after market controllers that do,  since the + adapter sticks out of the controller."}
{"product_id": "B0017Q4DGI", "context": "Can this be played on the original wii console?", "response": "YesThat's what I'm doing"}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "The same charging cable should work for both devices."}
{"product_id": "B00GD962OA", "context": "How much space does does regular and super nintendo games use and how many could I download on the 2 gigs ?", "response": "Some need only about 30MB, and others need well over a gig.  But, you can add a cheap 32GB SD card for more storage.  Also, keep in mind that for any WIIU games (non-legacy) you are only allowed to download them to an external HD, NOT the internal memory and NOT to the an SD card."}
{"product_id": "B008BT2FWI", "context": "are these games 3 hiden objects system", "response": "no it is not"}
{"product_id": "B004N7IIQ4", "context": "Is the Mixamp the 2011 ed. (pictured) or 2013 w the eq presets (as described in item) ?", "response": "It is the 2013 mixamp"}
{"product_id": "B00965WK8K", "context": "Can any serious gamer here comment on how flawless the sensor in this mouse is? Any (even slight) positive/negative acceleration, angle snapping, etc?", "response": "Its perfect, no flaws except, the click sometimes doesn't work (very rarely) but that is probably from bad treatment of the mouse. I have had this mouse for a while and seriously enjoy it and recommend it."}
{"product_id": "B00CHGYUE2", "context": "Okay what is the difference between the map pack version and the regular black ops two?", "response": "The map pack brings 5 awesome maps. Every map dlc brings a peacekeeper which is a gun I like. Plus 1 new zombie map called die rise which is a comic place and has some jumps to do. The zombies map is okay. But the multiplayer is really good."}
{"product_id": "B00IYWV852", "context": "Is the extra 20 buck for the deluxe edition of the game worth it?", "response": "For a free house and costume I would say it's cheaper and a better value than what other games will offer you for their deluxe editions. Unfortunately you missed out on the beta access, but you do get 3 guest passes for friends still."}
{"product_id": "B00ECOBFA4", "context": "What is the age range on this? Would it be appropriate for a 6 yr old?", "response": "The game is basically the movie.  If your child can handle watching the movie, they can definitely handle playing the game.  My 5 & 7 year old love free play and just playing around in the different worlds."}
{"product_id": "B008M4BNQG", "context": "do you have to be online to hear the game 0r cani hear it off line by my self playing my game", "response": "I'm sorry the model must have change there was only one card when I purchased Christmas 2013 for my son."}
{"product_id": "B0032MO77U", "context": "Does it try load other junk onto your computer as does another Jewel Quest 2 disc that I purchased and had to toss out?", "response": "it always asks if I want to purchase upgrade or something like that and it offers a \"yes\" or \"no\" box and I always choose no. other than that I love it."}
{"product_id": "B00E88G054", "context": "How loud does the mouse click? Reviews say that they got wireless mouses instead, I will most definitely receive a wired mouse, correct?", "response": "Well the mosue doesn't make the loudest noise but neither is it quiet but not very noticeable when play fps games. I have to admit that the blue light gets a little annoying if you leave your desktop on all nite. This mouse is great for me so far."}
{"product_id": "B007VTVRFA", "context": "I am looking to gift this for a friend. Will I get a CD Key when I purchase this or will it just give me a download?", "response": "You will get a key."}
{"product_id": "B00B0QONB0", "context": "Are you able to play original Xbox games on this hard drive?", "response": "I haven't tried it"}
{"product_id": "B00EOPT5ZS", "context": "Can this be used on several computers? Is the configuration stored in the peripheral?", "response": "Yes,  you can use it on several computers. The configuration is stored in the peripheral. Steph"}
{"product_id": "B004C4U1VI", "context": "Have the Xbox 360. Do not see how the cable hooks up to the gaming console.  None of the slots fit any of the cable.", "response": "It is the proprietary port that is a trapezoidal shape right next to the hdmi port on mine."}
{"product_id": "B00I5LMSBK", "context": "my copy of the game did not come with a playing manual, is this normal ?", "response": "Yes, mine also does not have one. I believe that the instructions are in the game itself."}
{"product_id": "B0086UK7I6", "context": "Are the buttons fully programmable for things besides games? ie copy/paste ctrl+w etc", "response": "The buttons can be programmed to do alot. Some basic dos commands work as well."}
{"product_id": "B002J9GDXI", "context": "How long is the cable? Is it braided?", "response": "Yes, though it wears out quickly where it connects to the mouse. I've had 2 of these and both lose their connection often after only only a couple month's usage."}
{"product_id": "B00A1AQJAO", "context": "Will this work with the New Nintendo 3DSXL?", "response": "Yes it will work, but the updates will only support DS - DSIXL.  My son is still waiting for the updates from Action Replay."}
{"product_id": "B00FRESQYG", "context": "is this a good one to start with? i know nothing about this game except it looks like something i can play with my son.", "response": "This game contains ESRB blood and gore crude humor mild languaje suggestive themes use of alcohol violence for teen"}
{"product_id": "B00CBQO930", "context": "How do you pick a color when you order it?", "response": "The mouse is able to make all of those colors. It changes colors with LED lights."}
{"product_id": "B002BXKJA0", "context": "Does it work on Windows 8.1?", "response": "I didn't really work for me initially. It would crash each time I tried to play. I fixed the problem after watching this video though; https://www.youtube.com/watch?v=uhJL7UVHXNQI installed the game via steam. That might help too. Now I don't have a problem playing the game. It took me a while to fix it though."}
{"product_id": "B002I0H79C", "context": "iS iT 3 pLAYER", "response": "If i remember right its 2 player offline and 4 online"}
{"product_id": "B001O3066U", "context": "Replies indicate this edition will play on Windows 7 Home Premium.Reviews in other places indicate there are problems. What do you think?", "response": "I have Windows 7 and have no problems at all, I'm not sure if its Home Premium or not."}
{"product_id": "B003ZJ1VD8", "context": "What colour is the back light?", "response": "There is no back light for the keys.  The logo is lighted up at the bottom though."}
{"product_id": "B00CJD4HD2", "context": "Does this mouse have the same clicking issue as the G500. i.e Sometimes it doesn't register a click, sometimes it double or triple clicks.", "response": "The base G500 had problems that the G500s has, in my experience, corrected. Especially regarding the mouse-wheel/middle-mouse button problem. Still not as good as the G5, but it's worked well for me so far."}
{"product_id": "B004RMK4BC", "context": "Do i have to have a real  US address to purchase this item ?  Thank you ..", "response": "Hmmm I think you do, but also I think that they don't verify that in this kind of purchases (digital ones)"}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "Blue LED and its not switchable to red"}
{"product_id": "B00CPKUV98", "context": "Is there any difference between the PS3 version and any other platform?", "response": "not that im aware of its the same game for each of the consoles it is on and there is no online multiplayer"}
{"product_id": "B007A7K60A", "context": "will this work with windows 8 on a PC", "response": "I only have windows 7 and it works so it should work with 8."}
{"product_id": "B0000CNUUP", "context": "Do you have to buy the game discs (currently $6.93) and the game code (currently $19.99) both separately? Is that how it works?", "response": "I didn't buy this game off of Amazon, but you should be able to just buy the discs and install it directly from those. No Steam or online activation is required if you do it that way, plus it's cheaper. Unless you specifically want to pay more for a digital copy..."}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "Same product just branded differently for different regions."}
{"product_id": "B0050SYK44", "context": "Does it support local co-op like the first one? My girlfriend and I really enjoyed playing it together.", "response": "The max for local is 2 per Xbox"}
{"product_id": "B00004VUFG", "context": "does this steering wheel work with farming simulator2013", "response": "I have no clue."}
{"product_id": "B00ECOAX34", "context": "Do any of the Lego Games have a Sandbox mode? I would love to find a Lego game with a Sandbox just to play around making things..", "response": "Lego Indiana jones 2"}
{"product_id": "B00ENFVS5Y", "context": "I recently purchased and returned the TX 458, Just wondering if I should give it another chance?", "response": "Dont know why you returned,but if you want a wheel for xbox one its your only choice.I love mine.I hate to drive with a controler."}
{"product_id": "B008KH7NZA", "context": "Is this headset PC compatible? Why doesn't it specify?", "response": "Yea it is, I used it to play league of legends on my pc a few times."}
{"product_id": "B005J37I4Y", "context": "I HAVE XP400 IS THIS COMPATIBLE", "response": "Yes, I've used it with the XP400 and it does work.  It seems to be a simple bluetooth connector and not model-specific."}
{"product_id": "B003V4AK8E", "context": "I just bought this but it wont cut on does this need batteries?", "response": "If this on is like ours, and I believe it is, it uses batteries."}
{"product_id": "B0096L2SJ0", "context": "where are the games stored", "response": "The unit is used in conjunction with your smart phone, in my case a Galaxy 3. The games are stored in the phone memory"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "I have windowa 7---just finished the game. no problems.--Just turn off the anti virus programs when playing these games."}
{"product_id": "B0051UMYLW", "context": "Does this work with Win 7 x64 I love these games and still have the originals, but they do not work on Windows 7 64-bit. Does anyone know if this version is compatible with Windows 7 64-bit.", "response": "use dosbox.  I use it to play dos base games on my windows 7 64-bit system"}
{"product_id": "B00AR1LX9O", "context": "are these headsets good for FPS games like Call of Duty and Battlefield", "response": "I really like mine for those types of games as they allow you to hear things that at times your speakers do not. They are very clear. Be aware that this headset does not work with xbox one console as it comes in the box."}
{"product_id": "B00CD90R72", "context": "Is playing the game with the move controller as enjoyable as playing it with the dualshock?", "response": "Hola solo con el DualShock"}
{"product_id": "B003VAM392", "context": "Will this work on a PS3 and Mac version 10.8.5?", "response": "It does work with PS3. I have used it before in DirectInput mode, and it responds just like a DS3. I'm not sure about Mac, but a Roommate has used my controllers with emulators, maybe it depends on the software and drivers installed."}
{"product_id": "B000TK99PS", "context": "does this version have Zilch?", "response": "I can' t tell you as Hoyle is no longer on my computer as it took up too much space."}
{"product_id": "B008XHCLFO", "context": "does this fit the new 3ds xl?", "response": "Yes And look greatMy grandson love it"}
{"product_id": "B002DUCF8A", "context": "Is there a waranty on this item? Mine has failed after 4 months and I was wondering where I can get it fixed. The CRS-HDG-IAS-VS-ALT switch is frozen", "response": "Yes, just go to Saitek's web site and contact them."}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "Mouse and keyboard is always the best way to go. I don't think it has controller support"}
{"product_id": "B00F27JDUY", "context": "can i change the full internal language to english?", "response": "Yes. Please, you can change setting menu."}
{"product_id": "B00B1MXGDO", "context": "i have a wireless adapter for my pc. would this controller sync to it so i can play wirelessly on my pc??", "response": "No, the controller doesn't have wireless feature in it"}
{"product_id": "B0015PHMFU", "context": "Hello, do I need to buy a universal adapter as well... for this univeral controller to work with my PS3? Thank you!!! :)", "response": "You don't. It has USB input"}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac os Yosemite?", "response": "Yes! I play with yosemite all the time"}
{"product_id": "B005LUUWL6", "context": "does this work for 3ds xl for cheat code?", "response": "Yes, it does but you have to plug it in to computer to upgrade firmware.  It has a lot of old games but lack of new games such as Pokemon X, Y,.... etc.  I suggest you buy game save better than action cheat."}
{"product_id": "B000I10PY2", "context": "Does this feature a gba compatable link cable port?", "response": "I don't think so, I believe you have to buy an adapter for it."}
{"product_id": "B0086V5UF0", "context": "I want to use this with a group of girls.  Do I need a remote controller for each of them or can they just follow the choreographer on the screen?", "response": "I think in order to get rated, you have to move with the controller. My daughter does it with 2 people - we only have 2 wii remotes and they take turns."}
{"product_id": "B004HYK8Y8", "context": "Does this game come patched out of the box? Im hoping to exploit a few glitches.", "response": "yes but if your connected online u have to download the patches"}
{"product_id": "B000HZFCT2", "context": "how many controllers work at a time", "response": "i only connected 4 i didnt try to connect any more than that idk i it would work but it works with 4 controllers perfectly fine"}
{"product_id": "B004L5SJ4Y", "context": "compatable with windows 7? 8.1? 10", "response": "Its only compatible with 8.1 if you download the 5 \"mods\" available on \"TheAirTacticalAssaultGroup.com\"; web page.  I had no luck what so ever until I downloaded these mods, now the game seems to be running smoother with little or now problems.  There's also a \"New Pilots\" forum that gives you lots of good advice.  Good Luck"}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "No it's simply . A game that works with or without internet by choice"}
{"product_id": "B00CX8VY4S", "context": "the game is digital download?", "response": "The game can be digitally downloaded yes, or you can buy a physical copy as well."}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yes, there is plenty of room for both the 3DS XL and the AC adapter! There's also two slots for games too."}
{"product_id": "B00AJZNUUI", "context": "does this work with skylanders?", "response": "Any Wii game works on the mini, but it must be a Wii game - not Wii U."}
{"product_id": "B00KAI3KW2", "context": "how many gig on the hard drive", "response": "MS is doing a patch in June so you can use a 3.0 USB External HDD.  You could add another 2 or 3 TB External HDD to the Xbox1 which should give you plenty of HDD space and last you a good while."}
{"product_id": "B001CXYMFS", "context": "Can you detach the throttle but still use it?  Say if I wanted to mount the throttle on the left arm of my chair, and the flight stick on the right?", "response": "There's a cable connecting the two separable halves. When separated, you get about 18-20 inches of clearance, which should be enough for most keyboards."}
{"product_id": "B008M4BNQ6", "context": "can these be used on my pc to watch videos", "response": "No.  I tried and had to buy separate headphones for the computer."}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "It comes with the box and everything included."}
{"product_id": "B000B78F72", "context": "I want a cd that I can download to my pc and not have to interact with other sites and don't have ads - just a icon my husband can click on & play?", "response": "This is a good CD with many, many different solitaire games on it.  No ads or anything, just games.  I have enjoyed it and learned a couple of different solitaire games."}
{"product_id": "B007XVTR3K", "context": "can you play this on xbox one? or do you have to play it on xbox 360 only?", "response": "Only in the Xbox 360 dude"}
{"product_id": "B0053B5RGI", "context": "does this play on the dsi xl 2d?", "response": "Well my other daughter has a DS XL and she can NOT play this as it is for the 3DS only but u can play it in 2D format on the 3ds..weird."}
{"product_id": "B00D78Q4UM", "context": "Is the palm rest removeable?", "response": "Yes, it is detachable."}
{"product_id": "B008BT2FWI", "context": "are these games 3 hiden objects system", "response": "No, they are only match three games."}
{"product_id": "B00E4MQODC", "context": "i have M.S.and my fingers are weak, The 2 buttons on top left,are they easy to push,like the left click button,and do they push from side or top.", "response": "Yes they are very easy to push down and all buttons can be pushed pushed from just about any angle this also includes the thumb buttons. Up down left right but thumbs requires more push as it would interfere with pressing them if it were any easier you would get miss press's."}
{"product_id": "B004GINKNQ", "context": "How do I install the 60gb hard disk drive for Xbox 360?:", "response": "On The right side of the Xbox there is one cover. Open it. Place the Hard drive in the space provided, aligning properly and push it. Close the cover."}
{"product_id": "B0029M6VKA", "context": "please tell me what is in this 149.99 item,only trackir 5? or with clip pro in it?thank you .", "response": "The 149.99 is for the tracker 5 only. The clip pro is not included. I have the clip pro but do not use it."}
{"product_id": "B001MGNWDI", "context": "This doubles as a generic usb gamepad for action games? Or it's intended exclusively for flight control?", "response": "It can be used for most computer games there are ways to key map each button."}
{"product_id": "B00CX8VYM0", "context": "Is this game as good on Xbox one as it was on the 360?", "response": "Better! Assassin's Creed 4 Black Flag is an amazing open world game, especially on the Xbox one."}
{"product_id": "B00DCBDNW6", "context": "I now own a PS4 after owning a PS3 for years. Can I use my FF XIV PS3 paid subscription on my PS4 system, or do I need two subscriptions?", "response": "I have the same situation and I only pay for one subscription which includes both my PS3 and PS4."}
{"product_id": "B00DVEJA7G", "context": "does it come with a charger", "response": "It comes with a micro-USB connector that you can connect to your computer for charging."}
{"product_id": "B004RMK57U", "context": "i have redeem the code in my ps3 system,can i use it again in my ps4 system?", "response": "If you use the same used on both, yeah"}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "The Wii U version will not work on the Wii. There is a Donkey Kong Country game for the Wii that is much, much better than this game for the Wii U. You can play the Wii game on the Wii U by opening the Wii menu from the Wii U menu. Hope that makes sense."}
{"product_id": "B007VPZR5U", "context": "can you program the buttons to be used as any key? or just numbers?", "response": "Any key even commands(crtl+s). But yeah any key!"}
{"product_id": "B001AATQ0Y", "context": "Does this item work with 64bit system like Win7-64bit or Win8-64bit?", "response": "It works on my Windows 7 Ultimate 64 Bit system.   It works great with PS2 wired controllers.  However it does not work with PS2 wireless controllers."}
{"product_id": "B002I0H79C", "context": "Does this work in Colombia?", "response": "I'm American but as long as you can log into XBOX Live it should reach the regional servers in your area if not log onto XBOX Live and ask for a solution."}
{"product_id": "B00FJWNSU8", "context": "Is this actually how the casing looks with the white sides instead of blue?", "response": "No, the casing is blue all around."}
{"product_id": "B00BZOBE78", "context": "Will this work with Civ 5: Gods and Kings?", "response": "Yes, I have both and it works fine"}
{"product_id": "B000B9RI00", "context": "So if you have an Xbox One AND an Xbox 360, you need two seperate cards?", "response": "No it's ur Xbox live membership so u can use it on both kinda like netflix"}
{"product_id": "B00DLDEKOK", "context": "Can you hear the game sounds rather than using tv volume? I am new to this and hope gran kids can play quietly", "response": "No it is only to hear the people you are playing with."}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "I don't really know.  I have never tried it on my PC."}
{"product_id": "B002JVX5V4", "context": "will this scrabble work on windows 8.1?", "response": "Yes....  I have it on my computer"}
{"product_id": "B00HWMP0TU", "context": "Can you download the game via Steam and then play it offline, or does it require you to be connected via steam to even play?", "response": "you can download the game from steam, but for me I was unable to actually play it - whenever I tried to play the game, Steam crashed and the program closed."}
{"product_id": "B004AM5RAM", "context": "Does it come in the Razer box and does it have all the pieces and paperwork included that it would have if it came from the website?", "response": "Comes with everything the same as you would get brand new in box from a physical store like BestBuy/Wal-Mart. Authentic box and all paperwork as well as the CD included. CD contains some stuff like remapping tools, firmware etc."}
{"product_id": "B007XVTR3K", "context": "Is the Season Pass good for 3 months or 1 year?  If a year, 365 days or throughout the calendar year.", "response": "I believe the pass lasts for a year (365 days) after purchase. It can even be bought from xbox live for 4000 microshaft I mean Microsoft points."}
{"product_id": "B0053B5RGI", "context": "Can it be played on the dsi xl 2d?", "response": "There's no such monster.  It can be played on either a 3DS, 3DS XL or 2DS.  There is no DSi XL 2D"}
{"product_id": "B00IPTUJ8G", "context": "never played this is this a shooter? or rpg?", "response": "B. Roger has it right. It also has a quest system; it is very similar to games in the Fallout series."}
{"product_id": "B00ERDGMT4", "context": "What is included with the game disc? Does it come with a map of Pandora?", "response": "There is the game disc and expansion pack disc, but no map sorry."}
{"product_id": "B000FP0K0U", "context": "Will this work with Windows 7?", "response": "I have Windows 7 and it works great with it."}
{"product_id": "B00H1FCUBY", "context": "is t for ps3??", "response": "My son uses them to listen to music.  I'm not sure if you can use them for ps3."}
{"product_id": "B006W41W3M", "context": "does it work on xbox one and pc", "response": "Not the one I purchased but was offered an upgrade if needed. As far as a PC don't know because I never tried? Hope this helps."}
{"product_id": "B00GD962OA", "context": "Do you need to buy a controller in addition to this bundle in order to play games?", "response": "It came with the wiiU game pad, but if you want to do multiple players, then extra controllers/ wiimotes recommended."}
{"product_id": "B0088MVQIM", "context": "Does it work fine with Bass or is focused only in guitar with some Add-on for Bass, I'm a bass player but I want it to practice and have fun.", "response": "Works great with both bass is what I play"}
{"product_id": "B0088MVODO", "context": "if I buy the anthology on ps3 does it work on ps4?", "response": "Nop, the ps3 doesnt playback PS3 games, so if you plan on buying it keep your ps3 :)"}
{"product_id": "B002I0GF72", "context": "How does it differ from the original  (game cube) game?", "response": "Can you play this on just a \"regular\" Wii without internet?"}
{"product_id": "B00FOGFP0A", "context": "I have heard that PS3 games are not region locked? This game only came out in the UK and i have a US PS3, will it work?", "response": "Yes. You just cannot purchase and use any dlc. It requires a UK psn id."}
{"product_id": "B00D96BO7K", "context": "can this be used wirelessly to watch movies from my xbox 360? thanks", "response": "Unfortunately no. Need to run the cord at all times. But this is a great headset has alot of uses"}
{"product_id": "B000IBELZG", "context": "Can this camera work on skype for my psp 3000?", "response": "Sorry that I took so long to get back to you.  (It took a while to find where the camera was \"hiding\".)  My PSP is a 2000 series and doesn't do video when Skypeing."}
{"product_id": "B003O6CB6S", "context": "I personally loved this game on Xbone, but now I want it on PC. Is there anyone else still online? Spare the negitivity, I've already read the reviews", "response": "I just think it's awesome to play in pc! But make sure ur pc is good enough to run it!"}
{"product_id": "B00BMFIXKQ", "context": "I played the first assassins creed and stopped because it was so repetitious. Are the later assassins creed games the same way?", "response": "Similar, yes, but still fun."}
{"product_id": "B00AJXEYOG", "context": "Can I use this with windows 8", "response": "I have Windows 7 so not sure if you can.Maybe try Google and someone can help you.Sorry."}
{"product_id": "B000P46NMA", "context": "This game has subtitles in Spanish?", "response": "Assassins Creed 1 does not have subtitles."}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "My husband says its in English. He really liked it."}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "It works with all but there is a little lag, save yourself some money and get a trackir"}
{"product_id": "B004RMK4P8", "context": "my play station can not redem the code you sent me. i am currently in greece. what should i do now?", "response": "I'm not sure if the codes are region locked. I would contact amazon support."}
{"product_id": "B00INUME3K", "context": "Can this game be played on a Australian PS3 console?", "response": "I ordered mine from UK, it should work,all PS3's are the same(i think)"}
{"product_id": "B00JFCA6V2", "context": "Which memory card should I get for this if I want to download one or two games, but still have a bunch of save files?", "response": "16 gb is what i have and I have four large games on my Vita, and I still have plenty of room. Some games are 2gb in size, so 8gb might be enough, but possibly cutting it close. I'd say 8gb or 16gb."}
