{"product_id": "B00GJ2HZ7E", "context": "Will Sonic & All Stars Racing Transformed key work on a Mac or do I need to buy a Mac version of the game?", "response": "They redeem on steam, which does not carry mac versions of the sonic games. You can see the list here, listing only windows as supported. http://store.steampowered.com/sub/26498/"}
{"product_id": "B0041G5SD8", "context": "Does this game require STEAM in order to play it, like simple campaign mode?", "response": "Yes unfortunately, but I believe you can unplug internet and start it up that way. Haven't tried but I did read about it on line."}
{"product_id": "B008TXMPJE", "context": "I have the base game & dlc on disk with Origin. Will amazon dlc work with it? Steam ones do not, so I worry", "response": "yes, I brought the base game on Origin also."}
{"product_id": "B00CX9L30W", "context": "i have it for pc but would like to play on ps4. will on characters be on both or will i have to start new ones", "response": "Based off my experience transitioning from ps3 to PC, I'll say yes"}
{"product_id": "B00166N6SA", "context": "How large is the case itself that it comes in?", "response": "Its like a regular dvd case"}
{"product_id": "B00BGAA0SU", "context": "Is this game 3rd person only?", "response": "Guys whats a 3rd person game? do you mean like you don't see the character itself and you only see through it's eyes ?"}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "No way to tell yet. It can hold 2 3dxl's so unless they make the new ones super huge it should be fine."}
{"product_id": "B00HN9LS48", "context": "Can this be used to mount the Kinect to the bottom of the TV?", "response": "No it just rest on top of the the t.v."}
{"product_id": "B002CZ7P04", "context": "Do you get a real workout from this game, can you loose weight?", "response": "Yes you can.  You can choose your paste to walk"}
{"product_id": "B0099OZR9W", "context": "Stupid question but i need to know if there are directions for the install?  I'm not tech savvy at all  lol", "response": "No tech knowledge required.  Just pull pull the plastic panel off the the bottom   of other Xbox and slide the drive in.  There is only one way it will fit.  Do a search on YouTube and you can see a quick video.  It is super easy."}
{"product_id": "B00IAVDPSA", "context": "Does the remote stay \"on\", or will it shut itself off like the controller?", "response": "It is an Infrared remote that has motion sense backlights. It is then \"off\" till you press a button, or move it to get the lights to come on. Battery life has been good so far. I got mine on release date and it is still on the first set of batteries with no noticeable signal strength loss."}
{"product_id": "B00B3PDH5G", "context": "If connected to PS4 with a cable, can you control chat volume and Mute by button which on the headset?", "response": "Sorry my response was for PS3 and PS3 doesn't need a cable (Xbox does), for ps4 you need the talk back cable (similar to the cable you need for Xbox one)."}
{"product_id": "B00BQWTGIS", "context": "My husband really likes this game.  Can someone please suggest a couple of other games that are similar?  I'm Christmas shopping.", "response": "Shadows of Mordor would also be a good option."}
{"product_id": "B0050SWBAE", "context": "Should I have played other Pikmin games before playing Pikmin 3?", "response": "Honestly it does not make a difference. There are a few references to one and 2 that you might not 'get', but I don't think you'll miss anything major. Many mechanics are new or changed and everything you'll need to know is explained in game (or left as a puzzle for you to solve, obviously)."}
{"product_id": "B002AQNT96", "context": "If I want to use my joystick - Logitech's WingMan Extreme Digital 3D (USB) - will I need an emulator, and do you know if this model will work? Thanks.", "response": "well an emulator is to mimick a console.  I know controllers work.  so I would assume it would work.  but if not you can get it to work with a 3rd party software like joy2pad or something."}
{"product_id": "B007R9PWLY", "context": "hello,in technical details it says that the harddisk is 1TB7200rpm,but in the product disccription it says 750gb 7200rpm+256GB SSD? so which one is it", "response": "Bought in 2012, came with just a 750gb HD and an empty slot, I purchased a 500gb SSD about 1 year later;  Love it"}
{"product_id": "B00BM7NXMW", "context": "Can the DPI buttons (+/-) be remappped, such as making them +/- zeroing for a scope?", "response": "Yes, Just download the software for the mouse and you can change the \"+/-\" into whatever action you would like.I've done the same on Battlefield and it works great."}
{"product_id": "B00I9GARIM", "context": "Does this headset work with consoles and does the mic work in game with consoles like, ps3/4, xbox ?", "response": "Hi , No it is only for PC, works in all the functions only with computers"}
{"product_id": "B008BT80O0", "context": "Is this the English (U.S.) version of the game or an import?", "response": "I have the English version with all international drivers and teams, great game I've enjoyed every laps played on PS3."}
{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel have left,right and middle click on the scroll wheel ? I really like this feature", "response": "It has only  middle click there is no side click"}
{"product_id": "B00BFOEY3Y", "context": "Does this G700s work on glass? I have the Logitech MX performance, and want more macro keys.", "response": "You need a Logitech mouse with a Darkfield Sensor or another mouse with Blue Track to work on glass but Darkfield is proven to be more responsive than Blue Track."}
{"product_id": "B003EUPCZG", "context": "is this mouse also good for maya 3d graphic designer ?", "response": "might a bit too heavy for graphic design. I find that playing with this kind of mouse for hours tires my hands a bit."}
{"product_id": "B00DC7FWRE", "context": "Is this just the game or does this come with the stand, and a remote?", "response": "It is a game and a remote. no stand"}
{"product_id": "B00BU3ZLJQ", "context": "can this game and others be played without signing up for xbox live?", "response": "You can play without signing into Xbox live, but several of the features of the game are disabled, including the survival mode entirely."}
{"product_id": "B00ATHFLZS", "context": "Just ararived and does not work at all. tried several computers, not a problem on my end, the mouse is dead. unless there is some secret magic dance..", "response": "Mine worked on arrival but didn't last long maybe 3-4 months. The cable got some sort of a short in it. When you would wiggle the cable it would work."}
{"product_id": "B009GSX0A4", "context": "Does it have english", "response": "Nope, this game since it is imported it is completely in Japanese. There a rumors of the game being transalted for other regions soon and to be available on PSN."}
{"product_id": "B00CMQTUY2", "context": "Does this work on the PC?", "response": "can you use this one for windows 8 without cable????? who send me the link for download the driver??? Thanks."}
{"product_id": "B007A7UJ4S", "context": "how many Gigabytes are required to install this game on the ps3? In save data tool (i think) you can see it", "response": "After installation it totals at 3,847 MB or 3.8 GB. I don't believe there is any updates for it though."}
{"product_id": "B000BIZR72", "context": "does this play on a DS Lite?", "response": "yes that is what I have"}
{"product_id": "B008RA5DIY", "context": "If we purchase the actual disc, are we able to download also?", "response": "I am sorry but I don't know the answer to this question.  We bought the disc and have no need to download anything."}
{"product_id": "B005J37I4Y", "context": "Is this battery powered? Does it have a replaceable or rechargeable battery if it dies? Or is it powered by the xbox 360 controller?", "response": "It's powered by the 360 controller."}
{"product_id": "B00CMC6HCY", "context": "Will there be a Game of the Year edition released with all DLC included on the disc?", "response": "I'm not sure, I haven't heard anything about it"}
{"product_id": "B005CELN8W", "context": "Does this play on my ipad", "response": "ipads run on iOS operating system (like iphones).  The system requirement printed on the box is Windows (XP, Vista, 7, or higher"}
{"product_id": "B00EZAWV6W", "context": "is it better on pc or xbox?", "response": "Neither. I wasted money purchasing it online but could never download it. The company and amazon were no help solving this issue."}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "yes it can be, just install the driver for it on your computer"}
{"product_id": "B00D7UHT0E", "context": "will this play on a Wii mini?", "response": "Don't know.  Check with wii."}
{"product_id": "B00009W5WB", "context": "Is  this the cable for older style S controller?", "response": "That's what I thought. But sadly, no."}
{"product_id": "B00FE8WKPQ", "context": "What is the weight limit for the board?", "response": "I believe it's 330lbs but I'm not positive. I am 270 and I've had no issues with the board."}
{"product_id": "B003O6EDSM", "context": "Is the online pass for Mass Effect 3 included, or do I have to pay extra, and is it worthwhile in 2014?", "response": "I believe it is included and if you are wondering if the multiplayer is still worthwhile in 2014 I don't know because I don't play it. The single player campaign is worth it though. The Mass Effect series is great!"}
{"product_id": "B0094H8H7I", "context": "can you save your game", "response": "Unfortunatly not. It's the only drawback besides the wireless controllers. Get some wired genesis controllers."}
{"product_id": "B002I0H2AG", "context": "Does this game have a private\" warzone\" setting where you can fight 3 on 3, 5 on 5, etc like the prior versions? Thanks.", "response": "I will say yes but I am honestly guessing.  I haven't played  it for a while."}
{"product_id": "B0038PBF1W", "context": "will it download on window vista", "response": "It works with 7. Interestingly, although it is on a disc, the program loads onto your computer, so you don't need the disc everytime you want to play it."}
{"product_id": "B00FBV6V56", "context": "Is this the 2013 version with MixAmp Pro as pictured?", "response": "Yes it's the same model as the one pictured."}
{"product_id": "B0058GMO0A", "context": "Is it compatible with macs", "response": "Sorry not sure. I don't play it much now"}
{"product_id": "B000A2R54M", "context": "Does it work well on 2DS?", "response": "I Haven't tried it on 2DS, but I have tried it on 3DS. It works perfectly fine."}
{"product_id": "B00D84DRNC", "context": "Is this real leather?", "response": "It is not real leather.  That said, the material is plenty durable, has a good feel to it, and doesn't require the regular maintenance that actual leather needs.  I've had no complaints thus far."}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "Im not to sure, I bought myself a new one. If the previous owner hasn't deleted the memory then it should be there."}
{"product_id": "B00FC1UH82", "context": "Is it wireless? or you have to plug it via usb?", "response": "Wired. It has a pretty long cable (3m if i'm not mistaken) and also has a place with a \"door\" thing where you can store the cable when you're not using it."}
{"product_id": "B00CJ7IUI6", "context": "Is there a difference between the game if I buy it new or i can just buy a used?", "response": "No difference at all. Make sure if you want all the downloadable content that you buy the LEGENDARY EDITION."}
{"product_id": "B005UI8V6C", "context": "Do you need internet to download this game?", "response": "No, but make sure you have no higher than a Windows 7. Windows 8 or 8.1 will not install the game. Have a great day!"}
{"product_id": "B008SBZF4Y", "context": "can this figure be played with other skylander games or just the skylander giants game only?", "response": "It's a universal figure"}
{"product_id": "B00B67ZTUW", "context": "Is there an English strategy guide available? I am only seeing the Japanese guides in searches.", "response": "I do not believe there are any physical English strategy guides, but there are many sources online that are just as good."}
{"product_id": "B000R0SRNU", "context": "Is this a 4 player offline game?", "response": "No its only 2 player offline."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "No, you must redeem it first on Xbox 360, then it will allow you to download the Xbox One version immediately after it has been redeemed."}
{"product_id": "B008MI7MWQ", "context": "Can you list all the games in this pack? Thank you in advance.", "response": "no I don't have this game. When I could not use it on my system I got rid of it. Sorry"}
{"product_id": "B00I14395A", "context": "Is there any noticeable latency when using the keyboard?", "response": "No issues at this time, however, I have disabled the keyboard lighting. The mouse does not last that long though, perhaps 5-6 days before it requires a charge. The keyboard battery is long lasting. I like this combo, just wish the mouse lasted a tad bit longer. Hope this helpes"}
{"product_id": "B0065NP6NC", "context": "Can you transfer your progress on the original fallout new vegas game to this new game?", "response": "Yes, but you don't have to download the DLC, it comes on the disc."}
{"product_id": "B002DUCF8A", "context": "I have a Cessna trim wheel for pitch control -- will the trim wheel on this panel conflict with its operation?  And if so, what's the recommended workaround? Thanks!", "response": "I don't have an answer for this one.  The only trim wheel I have is on the Multi panel so I have no conflict."}
{"product_id": "B00ENFVS5Y", "context": "How is this wheel mounted? Example I have the  Microsoft 360 Wheel & it has a clamp to attach it to a desk.", "response": "Same style of attachment except better if that helps. I've had both."}
{"product_id": "B00EHBKUTE", "context": "will my pc still need a reg keyboard for basic typing outside of video games? would a wired keyboard/mouse be better than wireless?", "response": "Yes this is a gaming pad not a keyboard.  In extreme gaming the response rate of wired keyboard/mouse is better, but I game with wireless and can't really tell the difference; but I am not an elite gamer either."}
{"product_id": "B0000CNUUP", "context": "If I don't want to install through the dvd, can I just redeem the code on steam?", "response": "The one I got from this seller gave me a steam key"}
{"product_id": "B00HWMP0TU", "context": "Does the PC DVD version require any downloading or is it all on the DVDs?", "response": "Yes Down loading! ;("}
{"product_id": "B0018YXM3Y", "context": "Does this game run on windows 7 ?", "response": "Yes.  Total War is played daily on our Windows 7 system and we have had no problems."}
{"product_id": "B009D3HSTG", "context": "When I connect the controller to my PC it installs the driver but it wont recognize it in the game controller menu. Please help.", "response": "What emulator are you using? Did you put the mini DVD in your computer."}
{"product_id": "B00B77OKNI", "context": "Since this is Bluetooth, will it work on a pc or laptop with bluetooth?", "response": "Unfortunately I havent been able to get to work."}
{"product_id": "B00CJD4HD2", "context": "Does this mouse have the same clicking issue as the G500. i.e Sometimes it doesn't register a click, sometimes it double or triple clicks.", "response": "Have not had a problem at all.  I use this mouse for shooter games, I would have noticed that problem immediately and would have returned it."}
{"product_id": "B0072A4JVW", "context": "Does this allow for access to a portable charger?", "response": "Of course and you can easily remove or insert your PS vita from the case AT THE SAME TIME as your charging and have earphones plugged in. This case gives you access to all ports except the Sim card port on the 3g model."}
{"product_id": "B00F27JNGS", "context": "What is the difference between PSvitaTV and regular PlayStationTV?", "response": "As far as I know, the only difference is the colour and regional settings during set up. The Vita TV also uses the normal Japanese button layout (O for confirm and X for return). Other than that, there's nothing I've noticed that was different."}
{"product_id": "B0045FEEAS", "context": "Can this particular model play GameCube games?", "response": "No it only allows for wii games"}
{"product_id": "B00IA2NYT4", "context": "can Ps2 games be palyede in this Ps3", "response": "No.  Only the very first PS3s sold had that feature.  All systems now can only play PS3 disks however the Sony online store allows you to purchase and download many PS1 and PS2 games to your PS3 and okay them that way.  But you may be purchasing games you already own disk versions of (unfortunately)."}
{"product_id": "B000LQ4HTS", "context": "Can I twist the stick to control yaw in a helicopter  or use it as rudder in a plane?", "response": "Yes, it will pivot about the rotor center.  You can also program the slider to control blade pitch as this makes hovering a lot easier."}
{"product_id": "B00BQWTGIS", "context": "will it work on windows vista?", "response": "The system requirements states that it supports 64-Bit OS; Window Vista (SP2) X64.  I use Windows 7 so I can only tell you what the game box says as I don't have 1st hand knowledge."}
{"product_id": "B0029LJIFG", "context": "Do I need a Gold starter kit too?  My son had a xbox live account but it expired I want to reactivate so I bought this yesterday, is this all I need?", "response": "I don't think so"}
{"product_id": "B00CQ9L1Z6", "context": "will it work for samurai warriors chronicles?", "response": "it works in all the games if not update xD"}
{"product_id": "B001444IN6", "context": "can you have kids in this", "response": "Yes..  I have a family i made and i made the mom n dad woohoo or try for a baby and u will here a baby noise or somethin..  Then as u play she throws up n stuff n belly get big and then have the baby"}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "I haven't had any problems so far using this keyboard with Win. 7 or 8. Logitech has great software."}
{"product_id": "B00D84DRNC", "context": "Which section of the case is best suited to carry the 3DS XL, the large middle pouch or the more snug fitting inner pouch?", "response": "I personally put it in the inner pouch and then put any extra games in the middle part since there are only two spots to put your 3ds games."}
{"product_id": "B002I0H79C", "context": "are people still playing this game as of june 2014?", "response": "I believe the multiplayer servers are still open."}
{"product_id": "B008M4BNQG", "context": "ok so im really confused, can i just plug the USB and start playing, will it work if i dont plug in the other wires??", "response": "The other wires are for sound to go throw had phones, they work fine on my comp with out them but you need to plug them in while on ps from what I could tell"}
{"product_id": "B00BT71S4K", "context": "the galaxy note 3 fit on the controler?", "response": "Sadly no, while it is adjustable, the note 3 probably won't fit to any of these type controllers. It should still.work if you have a stand or prop the phone up though."}
{"product_id": "B00111SFEU", "context": "Does it work with andriod phones as well?", "response": "Yes it does. I just use it in PS3,  but after your question I tried  in my Galaxy S5  and it worked well"}
{"product_id": "B0071NH8B8", "context": "can i use it with a different provider besides AT&T?", "response": "No, the 3G for Vita is only offered through AT&T.;"}
{"product_id": "B00HLT0YT0", "context": "It sucks having to wait until the 8th, but it releases tomorrow, and i paid for 1 day shipping.  So I shouldn't have to wait until Thursday.  Right???", "response": "I chose Amazon Prime two day shipping and I received mine this morning. Estimate says it should arrive on Friday and when it shipped, it says it should arrive on Thursday. UPS delivered it early and it arrives today."}
{"product_id": "B00EIM3BV6", "context": "I like to use Skype on my computer while using a headset to hear the TV if I am gaming on a console. Is there a way to hear both anyone is aware of?", "response": "Cant speak from experience but I believe all chat is through bluetooth. So I believe you could link that to the computer while the game audio is from the console. Not 100% though"}
{"product_id": "B00FXOP1JI", "context": "Does bundled 3DS come with dc charger, or does the dsi car charger fit the 3ds? thanks", "response": "A DS or DS Lite charger will not work, but a DSi one will work."}
{"product_id": "B000BAVN14", "context": "Will this still work with Windows 7?", "response": "Yes, This game is on my Alienware 14 the newest version which has Windows 8 on it I believe so it should have no problem on Windows 7. The game is super cool by the way!"}
{"product_id": "B00BMFIXOW", "context": "Can I play the PS4 version using my PS3 save games?  Just upgraded to PS4 and don't want to start game over.", "response": "Can't.  Have to start all over."}
{"product_id": "B009S4JZKK", "context": "Does this work in Windows 8?", "response": "Windows 7 is basically the same except the layout on the desk top. You need to have a Steam Account in order to operate the program. It takes several hours to download. Good Luck"}
{"product_id": "B002BSA20M", "context": "Is this halo reach game work on pc's? (laptops)", "response": "No. It's an Xbox 360 game disc. Your PC (laptop) will only recognize it as a video DVD. If you don't have the game console, you won't be able to play this game."}
{"product_id": "B000TK99PS", "context": "does this version have Zilch?", "response": "Not that I know of.  I returned it because it wasn't compatible with Windows 7."}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "It's one in and one out."}
{"product_id": "B00B98HBTA", "context": "Has anyone had problems with this game locking up? Mine seems to do it about once every mission.", "response": "Yes, we've have had the same issue... has to be a glitch in the digital download... they really need to patch this."}
{"product_id": "B00009VRG5", "context": "In I Spy Fantasy, where is the scroll in the wizards room?", "response": "I'm sorry you are correct I just glanced at the screen shot I found and thought the drawing of the dragon on the wall above the desk was a window. Anyway, here is the screenshot so you can see the scroll on the desk. HAPPY GAMING!http://www.mobygames.com/game/windows/i-spy-fantasy/screenshots/gameShotId,230452/"}
{"product_id": "B001Q24UAM", "context": "What operating systems will it work on?", "response": "Some work on Windows 7 but most don't, others XP or earlier, the best one didn't work"}
{"product_id": "B00HPU96FI", "context": "I got the cable this week and when I turn on my Dreamcast the screen flickers everyone so often. Is the cable I got defective?", "response": "Sounds like it, but do make sure you have a good, secure connection with the dreamcast and your TV/Monitor.  And if you have a different TV/monitor you can try it with, that will help rule out a faulty input."}
{"product_id": "B002BRZ79E", "context": "Registration info? I tried to play this game I bought but it's impossible without a valid registration.. Can someone help?", "response": "The code is in the case on a piece of paper. I will double check when I get home. Make sure you enter it right (third time was the charm for me)"}
{"product_id": "B00519C7CE", "context": "Call of duty black ops LTO Edition x box is it  black ops 1", "response": "yes its call of duty black ops 1 and you also get the first strike map packs with it their is a code in the case you redeem it on your xbox"}
{"product_id": "B00AJZNUUI", "context": "do the regular wii controllers work with the mini?", "response": "Yes you may use regular controllers for the wii mini"}
{"product_id": "B00BMFIXZG", "context": "Why is game in slooow motion and video is like watching old kung fu movies?", "response": "That is not normal. Does your PC meet the minimum requirements? If your graphics card and cpu aren't that great, you might wanna lower the graphics settings before playing."}
{"product_id": "B00EV4O7B4", "context": "What region is the 3DS for? Europe, America etc..", "response": "The one I purchased is North American region, so I'll take it they are all North American."}
{"product_id": "B00FXOP1JI", "context": "Hello and place the order for my product, I wanted to ask, please wish my product is in its original box, I do not want another box for my other packa", "response": "I ordered mine via Amazon Prime and it looked just like the picture. I have no doubt that if yours will as well."}
{"product_id": "B00FXOP1MU", "context": "Does this come with charger (meaning that I don't need to buy things other than this)?", "response": "Yes, it comes with its charger!"}
{"product_id": "B000IZAQD8", "context": "Does it come with Dvd remote?", "response": "The game controller is also used as Dvd / Blu-ray remote, it does not come with any other remote."}
{"product_id": "B00EPC3PY2", "context": "What language are the dialogues, subtitles, and the game menu?", "response": "All text is in english, including trophies."}
{"product_id": "B0053BCML6", "context": "can you play this game on the old Nintendo DSi", "response": "You cannot as this is a 3DS title and not a DS title."}
{"product_id": "B0011E4J7O", "context": "can you use it on a black xbox 360", "response": "My xbox 360 is black,just not my controller,it's white. So yes."}
{"product_id": "B00B77OKNI", "context": "Will it work with kindle fire HDX", "response": "The green throttle arena controller should have no problems working with the Kindle Fire HDX. The HDX has bluetooth and you should be able to install the Green Throttle Arena software from Amazon`s App Store."}
{"product_id": "B00006B84X", "context": "Does it have independent centering for the pitch and roll axes? Can you feel that the roll axis is centered while moving the pitch axis?", "response": "Yes, both axes are independent of each other."}
{"product_id": "B0050SYDEQ", "context": "Will the forza horizon 2 play  in a 4 GB xbox360 ?", "response": "from what i'm told forza horizon 2 won't play on the 360 at all it's supposed to be for the one only"}
{"product_id": "B0050SZ0SY", "context": "Will it run on Windows 8.1?", "response": "Yup, I had no problem playing it via EA Origin on my Windows 8.1 machine."}
{"product_id": "B0048XAVC2", "context": "Does RCT3 run on OS Mavrick?", "response": "It should run on maverick, the lowest os it'll run on is 10.5 leopard."}
{"product_id": "B005VA5D24", "context": "Is this hard drive compatible with the Xbox 360 Original Console?", "response": "Nah dude sorrry its only compatible with 360 slim sucks I know"}
{"product_id": "B004AM5RAW", "context": "Is the size/shape of this one the same as the Naga MMO?  I have that one and like it a lot.", "response": "The shape is perfect, and it is an amazing mouse, customizable to what you want.  Wort the money for sure."}
{"product_id": "B0011E4J7O", "context": "Can I use this with a wireless controller for PC with a AA battery pack?", "response": "A PC can charge a rechargeable battery pack, but this cable DOES NOT transmit data. To actually use the controller a PC wireless Xbox 360 USB receiver is required."}
{"product_id": "B00BCEK2LK", "context": "Does this work on glass?", "response": "It does not work on glass"}
{"product_id": "B005QUQP94", "context": "Can you adjust the light intensity and the color? or is it just blue?", "response": "The intensity has four different settings: off, dim, medium, and bright. However, the color cannot be adjusted."}
{"product_id": "B008YA9BVC", "context": "does the headset work on the Wii? or does it work on just the Wii u?", "response": "Seeing as there is no headphone jack on the Wii remotes the answer is no. This works on the Wii U and 3DS only."}
{"product_id": "B003JETPHS", "context": "Can you use the microphone and the drums at the same time?  I ask because I don't know that there are enough USB ports.", "response": "You can get a usb hub to expand your slots - my neighbor has one that works great - just search for usb hub.  Even so, you should have at least two usb ports on your wii console."}
{"product_id": "B00E1L786S", "context": "how do you change the modes?", "response": "On the remote control there are 4 buttons for the sound pre-sets. This can also control the sound inputs."}
{"product_id": "B00IA2NYT4", "context": "250 gb o 500gb?", "response": "es de 250GB o  500 GB"}
{"product_id": "B000O5DY0E", "context": "Does this game work on Macs?", "response": "Yes, I believe so."}
{"product_id": "B009DZTXR4", "context": "Could someone list all the dlc that comes with the game?", "response": "Shark Attack Pack, Z Style Pack, The Trouble With Clones, Genkibowl VII, Gangstas in Space, Penthouse Pack, Invincible Pack, Genki Girl Pack, Funtime! Pack, Explosive Combat Pack, Special Ops Vehicle Pack, Moneyshot Pack, Steelport Gangs Pack, Witches and Wieners, Warrior Pack, Nyte Blayde Pack, Horror Pack,  CheapyD, Online Pass."}
{"product_id": "B00DH1KRQQ", "context": "does it comes with its own gamepad software?", "response": "Yes, and I was wrong about the functionality. All I had to do was press the analog button in the center. I came upon it, though. There are no instructions or any resources of any kind to be found"}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "Yes.  You need to download the current firmware and driver from corsair."}
{"product_id": "B00D96BPL0", "context": "Will these work with the ps4? If so, how do I set it up?", "response": "Yes, they work very well with the ps4.*For full PS4™ compatibility you will need to PS4™ System Software Update 1.50 and have stereo output connection from TV or audio receiver for game audio."}
{"product_id": "B00H4BBVZQ", "context": "Is this game the same as the definitive edition, content wise?", "response": "I believe it is, I don't know anything about the definitive edition  I think the definitive edition is Xbone exclusive, while the GotY ediotion is for 360."}
{"product_id": "B00EEMLPR2", "context": "i wonder if the season pass got expired and other DLC ?", "response": "No, it doesn't. It is valid for all maps and DLC on 2014."}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "I do not believe that internet or phone registration is required. The registration key is included in the package AND STILL WORKING WITHOUT PROBLEMS."}
{"product_id": "B00GG4BBUM", "context": "Can I play with to 2 players?", "response": "Yes you can play with 1,2,3 or 4 players."}
{"product_id": "B008M4BNQG", "context": "does this head set also work with a PC", "response": "Yes, it works with both PC and Mac. I had a pair of cheap headphones break on me and I started using these with my Mac. Only thing is you may have to change your audio output settings so the sound goes to the headset but that takes two seconds."}
{"product_id": "B00EV4O8VS", "context": "Does this bundle come with a wii u Remote and nunchuck?", "response": "No it does not bundle includes one Wii U Game pad the console and a downloadable digital code for the game. Wii remotes and nunchucks are sold separately."}
{"product_id": "B007JM8ULS", "context": "does it has to be a xbox slim or does it work with xbox360 e?", "response": "No it has to be a slim. And font bother buying any accessories for your xbox it might break you have better luck in Gamestop."}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "Yes it shoud! i got mine from amazon and it works fine! Obviously the game is in English subtitles but it is tons of fun! highly recommended!!"}
{"product_id": "B00IAVDQCK", "context": "Can you hear your own voice when you speak ? (Like on Turtle Beaches, you can hear yourself through your own headset to allow voice moderation)", "response": "No you can't.  You do miss that feature when you are used to it."}
{"product_id": "B00B77OKNI", "context": "Since this is Bluetooth, will it work on a pc or laptop with bluetooth?", "response": "Yes. Just pair it and it will work fine. Its a good controller, though im still waiting for more arena game development. It only works on arena games."}
{"product_id": "B003O6E986", "context": "Is this a full game?", "response": "Yes it is a full game"}
{"product_id": "B003ZSN600", "context": "Does this work on a xbox 360", "response": "Duh, it's an xbox 360 controller."}
{"product_id": "B00E369SDM", "context": "What comes with the PS3? Cords? Controllers? Or just console only?", "response": "The PS3 should come with the cords(non-HDMI), a controller (usb charger) and the console. No hard drive though. Tip: Read the description always."}
{"product_id": "B007TMFD7C", "context": "Does this work on mac'c OS Yosemite ? And is additional h/w required such as a joystick ?", "response": "The short answer is yes, it does work with Yosemite.  However, the USB key ($29.99 from X-Plane) does not work."}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "No, it will not fit the slim....."}
{"product_id": "B00D9FQAM0", "context": "Would I be better off buying the 250g Elite (the older, black model) or this newer version? I use my Xbox solely for FPS/Netflix", "response": "I like the newer version. But if all you use it for is net flux either one will work just fine."}
{"product_id": "B00HEX8TA4", "context": "How is the mouse wheel? Can you feel it when you scroll with the mouse or is it more like 'slippery'?", "response": "There is a texture to it. It has a rubber tread on it. It rolls and you can also press it down as a click function."}
{"product_id": "B0007U2CX6", "context": "What PSP's will this work on? I think mine is either 3000 or 3001. Thanks", "response": "it works on all versions"}
{"product_id": "B000BTBMWA", "context": "will this work with the black xbox 360 the 2 gig hard drive  im also useing a non hd tv", "response": "Should work with any XBox model that has that proprietary A/V port, and will work with any TV or monitor with component video in."}
{"product_id": "B00EZKNT18", "context": "Will this work on a Windows PC or not?", "response": "Yes it works on a PC"}
{"product_id": "B0029M6VKA", "context": "please tell me what is in this 149.99 item,only trackir 5? or with clip pro in it?thank you .", "response": "the track Ir 5 is a tracker that work with microsoft flight simulator system it let you move your head to look left and right in your flight system with out moveing thi mouse the tracker is a very good tool to have.also work very well on most game"}
{"product_id": "B000R0SRNU", "context": "can you play with 2 people without xbox live?", "response": "You can play with two players when using the same xbox.  I am not sure about playing with people on xbox live though."}
{"product_id": "B005M2KSLC", "context": "Is the white or black version glossy? I'd don't like the glossy mice because they tend to build up grime very easily.", "response": "The black version is not glossy.  It does seem to have a sort of glossy feeling on the sides but even that is not much.  So to sum up, it is mostly not glossy."}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "They have a standard headphone plug (male) so they will work with phones, tablets, laptops, or anything with a standard headphone jack (female)."}
{"product_id": "B007JDMPOK", "context": "If I already have Tera on my laptop, can I use the code to get the goodies, and use the disk to install on another PC?", "response": "Yes you can. remember the KEY only work for ONE account."}
{"product_id": "B0050SYILE", "context": "Is it safe to order a used one or better to buy a new one?", "response": "I've always bought new games but if I did buy a preowned game I would make sure they had a great review from them positive feed hope this helps"}
{"product_id": "B00BY0G0YU", "context": "Any ideas on what the special edition of the game contains?", "response": "The special edition contains a different cover and case. Inside the case is the art book."}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "I was able to run Silent Hunter Pacific wolves on my lab top which runs 7. Good hunting!"}
{"product_id": "B0050SWBAE", "context": "Does this work with the pro controller?", "response": "Yes. I recommend using the Nyko Pro Commander or Power A Mini (if you have smaller hands)."}
{"product_id": "B00D6PTMSW", "context": "Does the game help you tune your guitar?", "response": "Only when you're playing it. Once it's in tune, based on the quality of your guitar, it should stay tuned. To that key anyway. When I change key in the game it automatically prompts me to tune it and the tuning feature is actually quite  helpful. Usually takes less than a minute with my guitar. Hope that helped."}
{"product_id": "B00A1Y2STQ", "context": "Does this keyboard have stands in the back that will arch it up? I can't really type with the keyboard flat. :c", "response": "Yup, the keys feel real nice too when their pressed."}
{"product_id": "B00AWEMODK", "context": "Just wondering, does this collection has separate registration codes for the different expansions or just one for the whole package?", "response": "Just one for the whole package"}
{"product_id": "B00G6CLZPA", "context": "Is this any different from the psp demon fleeting game? or the same?", "response": "It has a bonus High School Mode."}
{"product_id": "B000096L71", "context": "will it run properly on window 7", "response": "It doesn't run on my PC with windows 7. So l put it on an xp machine and it works fine."}
{"product_id": "B00AAQRNQ8", "context": "How does this feel in the hand? Cheap? Sturdy?", "response": "Sturdy and very comfortable"}
{"product_id": "B00DC7FWRE", "context": "Can this game be used with the original wii if you don't care or want the u game pad", "response": "you still need a second remote because in some games you are pitted against each other. also i dont think it can be played on the original wii because it requires the little game pad that is with the wii u"}
{"product_id": "B004XGN8W4", "context": "Does this work with a PS4?", "response": "Dont think so. I know the Xbox one definitely doesn't fit."}
{"product_id": "B000IBELZG", "context": "Can this camera work on skype for my psp 3000?", "response": "in a word, Yes."}
{"product_id": "B00001LDCK", "context": "does it work on Windows 7?", "response": "yes when in compatibility mode"}
{"product_id": "B00B15EXJC", "context": "how does it connect in the bluetooth setting or do i just plug it in with the usb wire and it automatically syncs?", "response": "Wired USB is used for charging... comes with a USB for charging or u can use the one that came with the ps3... for wireless use plug in the included wireless USB and it immediately is ready to use, no sync required! I've had mine for months and I've only had to charge it twice! great buy!!!"}
{"product_id": "B00HWMP0TU", "context": "does this version require me to load it via a cd drive or will it allow me to just download it on steam?", "response": "I opted for the DVD.  The online download was available."}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "Well, there really isn't much mature content in the game at all. Very minor coarse language, no smoking/drinking, no sexual themes. There's violence, sure, but no excessive gore or blood."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "Its a generic version of the first xbox controller"}
{"product_id": "B00FEOR4MY", "context": "Will the 2DS in a neoprene cover fit inside this case?", "response": "My son has a 2DS and it fits in this case. So yes it should fit."}
{"product_id": "B00DPQ6GPO", "context": "Can all those mods work for online if it does i will buy it then just want my question answer", "response": "Some work some dont!"}
{"product_id": "B001CXYMFS", "context": "Does this have yaw control? As in, can you twist the stick clockwise/counterclockwise?", "response": "rudder controls are on the front of the throttle lever, its a rocker you control with your fingers."}
{"product_id": "B002BRZ9G0", "context": "Does this use the classic controller?", "response": "No, I purchased the controllers for a different game I had bought from the Wii store."}
{"product_id": "B0071NH8B8", "context": "what exactly is included within this bundle besides a Vita?", "response": "The vita, a 4 gb Sim card, USB cable, ac adapter, ac power cord, printed materials."}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "No its under you gamertag. After you install it on the 360, you'll have it available for download on xbox 1. You could put a profile on his xbox and download it that way..."}
{"product_id": "B000OPOCFU", "context": "is this compatible with windows 7 64 bit", "response": "Yes. I play the game with windows 7 64 bit It works very good"}
{"product_id": "B00576U8CC", "context": "I realize that its an MMO, but do you need a Gold membership on Xbox live even if you just want to play single player? Is there even single player?", "response": "Once a year Gold Live is on sale. It seems you may need Gold to play on Xbox. Enjoy..."}
{"product_id": "B00GHJ6X8G", "context": "I have a sealed copy of MLB 13 sitting next to me. Is it worth upgrading to MLB 14? I can't afford a PS4 now, so the PS3 version is my only option.", "response": "I myself could not afford ps4 but bought mlb 14 for ps3.  So far online play was extremely bad.  Very choppy online play. Issues with responsiveness and graphics issues.   If I knew that I would have just kept playing mlb13 and then upgrade to ps4 next year after the bugs are out."}
{"product_id": "B00F27JDUY", "context": "So i can game online and there will no prob considering it from japan?", "response": "Yes, as long as you create a north american psn account. The only difference is the circle and x buttons in vita menu: circle is enter and x is cancel. I'm not sure about return policies or warranties though, in case your vita has problems. My vita has been good so far."}
{"product_id": "B007JM8ULS", "context": "Will I be able to play my original xbox games on my 360 slim with kinect with this hard drive plugged in?", "response": "Yes, but there is a list of certain games that can be played on the 360. The list can be found here: http://support.xbox.com/en-US/xbox-on-other-devices/original-console/play-original-games"}
{"product_id": "B009RXUNZI", "context": "How's the overhead band size, and the size of the ear cups? Looking for headset that I can wear for hours and for gaming.", "response": "The headset is incredibly comfortable, and fits snug over the ears(not on top of them). I'm a pretty avid gamer, and I don't have any complaints about how they feel or how they sound. Longest amount of time I've clocked with these on at once would probably be around 6-7 hours."}
{"product_id": "B009AP23NI", "context": "Is this an official Nintendo product?", "response": "Yes, I believe it is official but is an imported Japanese controller. Up until now I haven't had an issue with the controller and everything work right out of the box."}
{"product_id": "B00BV72X1U", "context": "will this work for xbox live?", "response": "Well it's ment for a PC not an Xbox."}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "Yes it does, that is what I'm using."}
{"product_id": "B005BLAJRC", "context": "Do we need a \"joystick\" type device or will the games work with just a mouse?", "response": "A mouse is sufficient. Some of the words games respond to keyboard keys. I love the games ... I have two programs, one is for only Hoyle card games, and the other is this one mostly puzzles and games that don't need special equipment."}
{"product_id": "B008UQWX0Q", "context": "Does DSi 3.25 play DS games?", "response": "Yes it works smoothly. So far I've had no problems with the system."}
{"product_id": "B00FQPQO4A", "context": "How do i install the addon after i install the base game?", "response": "It should be in \"exe\" file so just press avto install."}
{"product_id": "B004NRN5DU", "context": "What happens if your batteries die, or perhaps you remove the battery pack (by mistake of course).  Will this trick work to render a pause?", "response": "No, this is a real time game so there is no pause besides quitting to the main menu"}
{"product_id": "B0041RY3W4", "context": "Can this be used to charge a single Sixaxis controller?", "response": "Yes, it does not matter how many slos are plugged. A single filled/plugged slot still gets charged as normal."}
{"product_id": "B002I0HJG8", "context": "Does this one give me Founder Status with the 8 Character slots, 4 bank slots and all, or do I need the Collector's edition instead for those benefit?", "response": "I purchased this one and I have founder's status.  All you'll have to do is log onto your enmass account on their website, go to account settings, and there should be a way to input the cdkey."}
