{"product_id": "B0071NH8B8", "context": "So, what is the upside to the regular Vita wifi?", "response": "It's got a better screen then the newer model."}
{"product_id": "B002B9XB0E", "context": "Does it come with a CD to configure controls or does it have plug and play compatibility?", "response": "It does not come with a CD. I used the gamepad successfully on a Raspberry Pi computer, after I configured it with software that knew to look for the gamepad. You should check to make sure the gaming software you plan on using supports gamepads."}
{"product_id": "B00FYIXMHQ", "context": "Does the game used $ 83 brings beanie of Delsin?", "response": "The Collectors Edition includes Delsin's beanie, a DUP patch and Delsin's buttons from his vest.But this edition is $79 new... Buy it new."}
{"product_id": "B00DYAQHTQ", "context": "Is this a non-stop violence game?  I find most games to have too much story and that's boring.  I like just pure violence.", "response": "No man, this gamejust fails in story AND in gameplay (violence). If you are looking for pure violence why dont you try GTA V?"}
{"product_id": "B00CXCCB64", "context": "I played before on 360, now getting the One, am I still able to play live with my friends that are playing on 360?", "response": "No, sorry its a network thing."}
{"product_id": "B00E1L78N6", "context": "I use the Xbox One to watch TV, when I use the TV app does it play through the headsets?", "response": "Yes it will play through the headset as long as tje controller is on and the headset is plugged in."}
{"product_id": "B000VRCNLG", "context": "will this be able to run on windows 8 someday? I loved this game when I had XP.", "response": "Good morning I have it running on WIN7 Pro 64 and on the 32bit OS. If you use windows 8 to act as a virtual XP or win7 it will work but you have to play around with the settings.enjoy."}
{"product_id": "B00DLRLDBO", "context": "how many cords to i have to deal with?", "response": "Few cords but headset breaks easy; broke after 30 days"}
{"product_id": "B002I0JJ2U", "context": "does this game still work and can you play it on windows", "response": "Yes it is a NEW game designed for modern computers and works fine on XP, and later versions of windows. This is NOT one of the older Final Fantasy titles. It is an online MMO that uses modern technology."}
{"product_id": "B0045ZB66I", "context": "Does this version (the physical PC version) require Origin or Steam?", "response": "No, this is a stand alone PC version; Naturally you'll have to download into ur computer via the enclosed disk, but once downloaded you play the game like all PC games.  You do have the capability of logging into the website where ur profile is saved but that is entirely optional."}
{"product_id": "B00B98HBTA", "context": "What is the diffeence between the game for $19.99 and the one for $39.99? Is it becuase the rating is pending on the $19.99 one?", "response": "I can't see what you are seeing.  I would check if they are for different game systems OR if one is used or new?"}
{"product_id": "B00EZAWV6W", "context": "Could I buy this in the US (with my US billing address) to give as a present to my nephew so that he can play it in Argentina?", "response": "Yes u can buy it with ur US billing address and give him the code, so he can download it from outside of US."}
{"product_id": "B000ND3XXA", "context": "I know this is meant for a computer, but would it also work with the Wii U possibly?", "response": "No it wouldn't. You would have to get an official Gamecube to Wii U adapter"}
{"product_id": "B003ZSHN0O", "context": "will this work on windows 8.1", "response": "I really don't know. You might have to call the makers of the program to find out. Sorry I couldn't help you."}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "There is a wire going from the headset to a audio module that fits into the controller. The module is included with the headset."}
{"product_id": "B00GOOSORM", "context": "do u need it if u buy the ps3game", "response": "You do if you don't want to put your credit/debit card on file, this is a easy way to by pass that whole process"}
{"product_id": "B000LQ4HTS", "context": "Is this available for windows 7 ???", "response": "It works just fine with Windows 7"}
{"product_id": "B001KMRN0M", "context": "does this plug into ps3 console?", "response": "If you mean remote play no.  That is the ps vita."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "I don't think it's mechanical, but it works well with fast key games like Crysis 3, tomb raider, and bioshock."}
{"product_id": "B0006PJAZU", "context": "How many computers can this be loaded on?  Interested in the number; like only one computer or up to three computers  .", "response": "It's only $22.95and it's as good as any other word-processing program. Buy as many copies as you need. It's still a bargain."}
{"product_id": "B000SOYG8U", "context": "is it about the clone wars pleace answere", "response": "This game is not about the clone wars...."}
{"product_id": "B0097CUREG", "context": "do you have to leave the cd in while playing", "response": "Yes you do. :("}
{"product_id": "B00ECOBFA4", "context": "Hi there dose this come in a case with the dic or is it emailed to you to download on the xbox 360 thanks", "response": "This is a case & a disc. Not sure if there's a digital version available!"}
{"product_id": "B00CD1FCAC", "context": "Does this include a 2 year Limited Warranty offered by Corsair if I buy from amazon?", "response": "sure. As description on the box surface."}
{"product_id": "B0076DO5A0", "context": "can this work on my IMAC", "response": "If your machine is less then three years old and you have a Windows install to boot, you can."}
{"product_id": "B002ZS6Y64", "context": "will these headphones work on my  hp envy  pc running windows 8.1  ..will i need any more cables or adapters", "response": "Mine didn't unless something has changed in the 720+"}
{"product_id": "B004RMK5QG", "context": "How Many Years can you stack up of PS+", "response": "I redeemed 2 cards for 2 years without any issues."}
{"product_id": "B00B98HF1O", "context": "Is this the Avengers?", "response": "Yes. The characters are made out of Lego toys just like the ones you can buy in the store.  It's a real real amazing game!"}
{"product_id": "B001DPZE84", "context": "How realistic is this game? Would hours of playtime = the ability to(in an emergency situation) fly a plane crapily and live to tell the tale?", "response": "hope you have your will made out"}
{"product_id": "B00I5LMSE2", "context": "Do you have to have a 3DS to play this game? Can it be played on the regular DS device?", "response": "This game will not work on the regular DS. It will only play on the 3DS or 2DS. (The 2 DS is the flat version that does not have a hinge.)"}
{"product_id": "B00HPU96FI", "context": "Does the Dreamcast main menu look yellowish?  I just unhooked from a CRT screen (S-video) and hooked my DC up to my HDTV w/ this cable.  Looks yellow?", "response": "No, it doesn't look yellowish in my HDTV using this VGA cable. I would double check the color settings on your HDTV first to make sure your cabel is not defective."}
{"product_id": "B001ELWMHI", "context": "Does it still work today after its been out for 13 years with it was 2001. I'm thinking about getting but, I'm not 100% sure if I should get on.", "response": "It still works but there is no longer support for online gaming."}
{"product_id": "B00EIM3BV6", "context": "For use with Xbox One, how do you connect the 2.5mm chat cable from the new xbox headset adapter? Do you need to run the 2.5mm cable to the mix amp?", "response": "Im sorry but i 'dont have xbox one"}
{"product_id": "B00GZ1H07Y", "context": "Does this have the Star Wars and 3D tables?", "response": "No. Download Zen Pinball. There they are available."}
{"product_id": "B005HN5LKY", "context": "does it come with all the cords?", "response": "It comes with everything that is in the picture"}
{"product_id": "B001COU9I6", "context": "what it is the model ps3 cech-xxxx?", "response": "Hello, The model is CECHE01.  This thing only lasted 3 months after I got it.  Thanks"}
{"product_id": "B00HWMP0OU", "context": "Could a child who cannot read yet play this game? Or would it just be frustrating?", "response": "I would recommend that you wait until the child has a good grip on reading. There is a lot of text."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "I have not heard any of high pitch whine as of yet. I just bought this mouse and I'm loving it so far. Hope I answered your question."}
{"product_id": "B0081Q58AW", "context": "Is this the physical version or the cd-key version? I would like to purchase the box version if possible.", "response": "Yes, this is the physical CD-rom version"}
{"product_id": "B005J37I4Y", "context": "This doesnt work on xbox one right?", "response": "No it does not. And the Xbox One does not support Bluetooth. The only headset on the market that provides 100 percent wireless game AND chat audio is the Stealth 500X, which launched within the last month. Microsoft changed the way console handles audio pretty significantly in the Xbox One."}
{"product_id": "B0098W4ZD4", "context": "does this work with mac", "response": "Yes it does. It is really cool and if you want to customize the settings, you can download the R.A.T. software from their site. Hope it helps you."}
{"product_id": "B00EV7AYAO", "context": "How loud is this keyboard when you press the keys? My keyboard is a very OBNOXIOUSLY loud razer that's key presses can be heard through closed doors.", "response": "It's pretty quiet. The quietest keyboard I have ever owned. Had mine for almost 6 months and I use it very heavily. Outstanding product for the price"}
{"product_id": "B00001IVRD", "context": "Does this works on Mac (Mavericks)?", "response": "On the bottom of the box it says you need Mac OS X 10.3.9 or higher, so it sounds like it might run on some computers.  As with some other computer games, it might not run on newer machines and I have no experience with a Mac."}
{"product_id": "B003RS1A7Y", "context": "any way to plug it into an amp?", "response": "The only way is using a MIDI module."}
{"product_id": "B00IPTUJ8G", "context": "Any news on how much space is needed for the RETAIL copy? I'm hoping I can /just make it/ with my 4GB card!", "response": "Is this a physical copy with the small chip in it, or a Code to Download a Digital Copy?"}
{"product_id": "B0099OZR9W", "context": "When I transfer content, does it mess up my game saves and data?", "response": "yes I was forced to redownload grand theft auto five multiple times and I tried to transfer games and saves and missing pieces were transferred and little bits stayed so don't buy it. It's off market and doesn't work like it should."}
{"product_id": "B0018YXM3Y", "context": "Is it a disk you put in your computer, and if so, does it install with steam? or no.", "response": "Yes you put a Disc in and it will install on steam and you just need to find the code which is in the case the very front of the case"}
{"product_id": "B006NU6F28", "context": "does it work with logitech driving force pro?", "response": "it does on my computer"}
{"product_id": "B002AQNT96", "context": "it is on steam?", "response": "Not that I can see."}
{"product_id": "B00EFFW0HC", "context": "Can I use a memory unit", "response": "If you are referring to the harddrive on the Xbox or the an extra external drive you may purchased than yes. Thats how you save your game progress"}
{"product_id": "B0088MVQIM", "context": "includes version for bass or should I download?", "response": "it comes with it don't DL it"}
{"product_id": "B00IP0H4GA", "context": "Will this versions menu screen be able to format to English lettering or is it all Japanese?", "response": "It's all in Japanese."}
{"product_id": "B003ZSP0WW", "context": "the controllers come with the battery and charging cable? and come in black color?", "response": "If you go to descriptions it will tell you if it does. This one I wanna say does not. They are how ever on amazon for cheep the cord is 3$ something I wanna say and there's a rechargeable two pack for 12$ something."}
{"product_id": "B000CBWQUY", "context": "will this work with the wii? will the nintendo wi-fi usb connector work with the nintendo wii?", "response": "I just got the Nintendo Wi-Fi USB connector, and it works perfectly with both my DS and Wii."}
{"product_id": "B00001IVRD", "context": "Does this game work on Windows 8?", "response": "Don't know, I use it on Windows 7. There is a problem with it saving games, other than that is just like when it came out."}
{"product_id": "B00B67ZTUW", "context": "I've never played a Tales game before but i tend to adapt to games at a good pace so will i be ok starting with this one?", "response": "If you've never played a tales game before this game is a good starting point. As far as pace goes the game has a nice learning curve, allowing you to learn the mechanics early on without being destroyed early in battle lol. You should really enjoy this game."}
{"product_id": "B001NT9TK4", "context": "has anybody tried this in ps4/? does it work", "response": "Yup i can confirm and, im pissed that it doesnt.. has forced me to buy a lot more pc games instead of PS4... highly doubt they will fix it considering the G29 is almost out and cost another $300 so have fun with that..."}
{"product_id": "B0096L2SJ0", "context": "Can the controller be charged?", "response": "No it can't. The pocket version needs AAA bateries, but the PRO version is rechargable and comes with a micro usbe to usb cable (no AC adapter) but you can use your own micro usb cable to charge it"}
{"product_id": "B008YRITPO", "context": "How long is the wire on this keyboard?", "response": "It is pretty long not long enough to have ur comp and keyboard not near each other I would guess 2 and a half feet long."}
{"product_id": "B00FM5IY38", "context": "Is there any sexual content or obsene language in this game.", "response": "no  all positive language"}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "It will start charging right away, it's great!"}
{"product_id": "B003VH5Z2C", "context": "does it work with a flat screen", "response": "It has worked with my 51\" Samsung Plasma TV."}
{"product_id": "B009K7QB8O", "context": "Is it compatible with Mac? or Windows 8?", "response": "It is compatible with windows 8 for sure.I am not sure about mac..."}
{"product_id": "B00BCEK2LU", "context": "Is this keyboard mechanical?", "response": "No it is not mechanical."}
{"product_id": "B00IAVDPSA", "context": "Can you use the remote to change the source input on your receiver?", "response": "No. This remote controls you Xbox One, and all of its apps and TV"}
{"product_id": "B006IR6NH8", "context": "Does it work on the iMac? I want something to use with F1 2013   My PC flight yoke works for steering, but I also need analog gas/brake.", "response": "My son uses it for the i racing game on the internet but the speed is not fast enough on the mac and uses my windows based computer.  Not real sure if i can answer your question totally,but for some reason he does not use the i mac."}
{"product_id": "B00FAN4LRA", "context": "What's the material of ear cushions? Does it like faux leather? will it become messy, sand-like small pieces and take off from ear pad?", "response": "It's genuine leather and the stitching on the ear cups is superb. Also, the leather is soft to the touch."}
{"product_id": "B00DT55P94", "context": "are they all on one disc? or seperated?", "response": "there are on separated disks, except maga man 10 thats a psn code"}
{"product_id": "B000H67DDY", "context": "Do the Rudder pedals control nose wheel steering?", "response": "Yes they do control steering while on the ground.  Very responsive rudder pedals.  Much better than the CH pair I had before.  If you get them I suggest you go to FAQ section at Saitek's website and click on the FSX tab for set up instructions in the FSX settings,"}
{"product_id": "B008D7F47Q", "context": "Does it Work with Windows 8.1? Trabaja bien con W8.1?", "response": "No it cannot work with windows 8.1 definately not."}
{"product_id": "B008NMPSEU", "context": "Can you list all the games in this software, please. Thank you so much in advance.", "response": "I can't list them because I bought this as a gift for my father. So sorry. He has the software."}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "If it has green and pink 3.5mm audio inputs, yes. If it doesnt, you will have to buy a usb to 3.5 audio/mic adapter which you can find on amazon for cheap. =)"}
{"product_id": "B0041RR0TW", "context": "How does this compare in physical size to the PS3 controller? I'm looking for a controller smaller than the 360 one, hopefully PS3 size.", "response": "Yes，it's smaller，but it's heavier."}
{"product_id": "B00D78Q4UM", "context": "Does anyone suffer LED backlighting outage issues, like owners of the K70 do? It's an issue with the K70, so is it an issue with the K50?", "response": "Up until now I have had no problems with setting up or transitioning with the less.  They stay as bright as you set them constantly."}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "They are very similar. The differences is in the gameplay. TombRaider has slightly better graphics, more intuitive gameplay, and you get to explore your environment more. In Uncharted you are kind of told where to go but in TombRaider you have more freedom similar to Metal Gear Solid Snakeater. Uncharted is great but TombRaider I believe is superior."}
{"product_id": "B0002GTXDM", "context": "Does the other gameboy need a wireless adapter, too? Also does this work with a GBA SP to a GB Pocket?", "response": "Both game boys need one. And only works with game boy advance and up."}
{"product_id": "B0087OZ5FG", "context": "Pulse elite or gold?", "response": "Pulse for sound quality and features. Gold for build quality."}
{"product_id": "B00GY4OAM0", "context": "Can you play this game on a regular wii?", "response": "I do not believe Wii U games can be played on a Wii. The Wii U can play both but not the Wii."}
{"product_id": "B00C2B355W", "context": "does this headset have a 3.5 mm jack for mobile? are they comparable to the a50? better? worse?", "response": "Yes it has a 3.5 mm to use with mobile. Idk about comparing them to A50 I don't have them but they are also in different price range so could make a fair comparison."}
{"product_id": "B00C71034I", "context": "i sit two player", "response": "According to my son, it is not two player, just single player.  However, you can play others via the internet. Hope this helps..."}
{"product_id": "B00D6NPFDK", "context": "How many people can play", "response": "Two can play at one time as long as each has a wii remote."}
{"product_id": "B0085P7U0U", "context": "what games are included?", "response": "Lots, including Spades, Bridge, Hearts, Spite, GoFish, and about 20 types of Solotaire, plus many others"}
{"product_id": "B00BCEK2LU", "context": "Is this wireless? It comes up under a search for wireless, but the pictures seem to show a wire coming out of the top.", "response": "Hi james, No it is not wireless.Thanks, PCrush"}
{"product_id": "B008UQWX0Q", "context": "Does DSi 3.25 play DS games?", "response": "Yes, i play ds games in R4 card"}
{"product_id": "B001PO2BJI", "context": "will these work for wii u?", "response": "if the remotes are the same as the wii, it will fit. not sure"}
{"product_id": "B00EEMLRTS", "context": "Is the actual game included in this pack?", "response": "Yes it is with season pass"}
{"product_id": "B00012YI14", "context": "does it work for the pressure-sensitive gamecube shoulder buttons? like for pressing part-way down as well as all the way down?", "response": "Unfortunately the buttons on the playstation 1+2  controllers are digital so they will be limited"}
{"product_id": "B002VBWIP6", "context": "Why is the game card cheaper than the online code? You would think when factoring in the cost of delivery and the materials it would be about the same", "response": "If I were to guess, it's because the card is the same pull-tab card I got and the codes are old, some too old to use."}
{"product_id": "B00DC9SWWE", "context": "I love campaign modes on other first-person shooters and play offline quite a bit.  This a problem with this game? Description troubles me.", "response": "You need an Internet connection to play the game. There is a campaign of sorts, but it's more of a way to teach you how to play multiplayer, and it involves playing with other players. The game is a lot of fun, but if you're looking for a Halo-like campaign experience, this isn't it."}
{"product_id": "B001PO2BJI", "context": "We have the \"Wii Remote Plus: Princess - Peach\" - will these work with that model of remote, please?", "response": "I'm pretty sure it will. I think the wii remotes are all the same size."}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "The save file yes. It could be transferred back and forth. Not the game itself. Check the Psn for the ps3 version and it will tell you."}
{"product_id": "B00166N6SA", "context": "Will this game work with Windows 8 or 8.1?", "response": "Yes it will. I have windows 8.1 and the game runs fine."}
{"product_id": "B00178630A", "context": "I have 1.5 meg dsl connection,,,I was wondering if the game will stream without buffering??", "response": "It should be fine unless you are in a big game with a lot of other players    It says broadband required if you aren't sure I would go to Battle.net and get some feedback from Blizzard.   It's a great game if you love Diablo2"}
{"product_id": "B004RMK4BC", "context": "when you put in the credit card is it taking off your credit card or your amazon credit", "response": "You can use your payment of choice to purchase this Gift Card. If you are unsure what your payment mode is I suggest checking your 1-Click Order settings to verify.All of my purchases of this where using my credit card, and never had a problem."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "Its the flaming hot cheetos you have to worry about."}
{"product_id": "B00009OY9U", "context": "Will this work to fly helicopters in BF4?", "response": "Yes it will work on Battlefield 4"}
{"product_id": "B008SBZD9G", "context": "Is it a Steam version or can I directly punch in activation code in FF14 client? I would prefer a direct activation code that can be used in 14 client", "response": "I bought and used it through the ff website since I had an account from the free trial. So the answer is steam free."}
{"product_id": "B000266786", "context": "Does this software require an always on internet connection?", "response": "No mention of that during set up"}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "I think so, but i am not all that confindent. It works perfect with windows 7. I couldnt be more happy with the way it performs!"}
{"product_id": "B00G42KO0Y", "context": "I have a pretty massive phone, will a Galaxy S5 or like that size fit the holder?", "response": "I have a Galaxy Note 4 and it fits just fine."}
{"product_id": "B00BXONG7G", "context": "can I use this game in Windows 7", "response": "No problems what so ever. Great game. I operate with windows 8.1. Great graphics. I am extremely satisfied with this game."}
{"product_id": "B007TYC8MI", "context": "Is this a digital version? or a hard copy?", "response": "It's hard copy discuss!"}
{"product_id": "B00CPKUV7K", "context": "What is the area code for the game? Is there a PAL region code?", "response": "all Xbox game has region codes. this one is North America version. and yes the German version is extremely censored. to be clear this is the NTSC-U/C. NTSC-J is the Japanese code, PAL is Europe,New Zealand, and Australia, and NTSC-C is China."}
{"product_id": "B00503EAG2", "context": "Can you play this game offline?", "response": "If yo like to play single player I highly recommend ASSASSINS Creed 4. The largest map I've ever played and very enjoyable."}
{"product_id": "B00J128FPA", "context": "So I have a square enix account on my Ps3. If I get the ps4 Version can I still use my ps3 account and characters? Or do have to start over?", "response": "You don't start over. you log on with your same account both ps3 and ps4"}
{"product_id": "B006RJ373K", "context": "system requirements for mac and pc?", "response": "no aid to me, thanks"}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "i buy the psn card but no code wtf?"}
{"product_id": "B00F27JE1C", "context": "Is this package with Japanese?", "response": "Yes, the package and all of the inserts are in Japanese. There weren't any translated materials with it."}
{"product_id": "B00IRHE892", "context": "Can you change the color of the lights?", "response": "No, the light cannot be changed. They can be turned off though."}
{"product_id": "B009SJR28W", "context": "Is this a true Chiclet keyboard with scissor or higher grade switches, or just the style with a membrane layer underneath?", "response": "100% membrane. I just took mine apart to see because I was seeing the + heads under the keys and got super excited!  Can't say I am disappointed though, still love it."}
{"product_id": "B00GY4OAM0", "context": "Does the game cover material from the third movie?  If so, how extensive?", "response": "It only covers the first two movies.  The third is supposed to be released as downloadable content."}
{"product_id": "B00F27JN8Q", "context": "Can I plug a Skylanders portal into the USB slot to remote play from PS4?", "response": "Is there a Skylanders for Vita? You might as well just play straight from the PS4. Pretty sure if there is a game, it will work. Make sure you update though."}
{"product_id": "B0071NH8B8", "context": "How many hour's of gameplay will it last before the battery needs to be re-charged?", "response": "About 3 and a half hours with wifi running  and without wifi on 4 hours"}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "Yes, the moment you buy it, they give it to you right away and they also send you an email with the code. Takes two minutes for the whole process and works perfectly for the US PSN store"}
{"product_id": "B004N7IIQ4", "context": "is the mix amp compatible with xbox one", "response": "Yes it works just fine with mine."}
{"product_id": "B001MGNWDI", "context": "Can this stick be used left-handed?", "response": "It's perfectly semetrical in every aspect, it could be used with either hand."}
{"product_id": "B007VH2WPQ", "context": "Do the screws from my original case fit or do I have to buy new screws?", "response": "Mine came with screws that worked fine. The original screws  (mine were Phillips head from 2005) worked as well."}
{"product_id": "B00886XQO0", "context": "This or turtle beach xp510 ? Is there differences between these two headsets?", "response": "Hardware wise they are the same. Looks and Audio presets are slightly different."}
{"product_id": "B0002XJBGE", "context": "Does this work on MacBook Pro?", "response": "This should work with all Intel processor macs. You just plug it in and it works no need to install any drivers. However the game you're playing must support joystick input."}
{"product_id": "B00EEMLRTS", "context": "does the camera come with batteries", "response": "It has  a rechargeable battery built in all you need to charge it is the cord that comes with it"}
{"product_id": "B003NVMEVQ", "context": "What is the difference between the mirror and the normal abyss?", "response": "The mirror assumes you have bionic hands thatcan generate a hundred newtons of force. The normal abyssus is a delicate flower made for humans."}
{"product_id": "B00FQFFQ2Q", "context": "can you make you own cars in this game?", "response": "Yes you can make ur own cars"}
{"product_id": "B0042J7I3C", "context": "Does it hook into the controller or the Xbox?", "response": "we cant get these to work. We plugged them into the controller adjusted volume still no luck......"}
{"product_id": "B009AFLXJS", "context": "Does it works in wii games at the Wii u's wii mode?", "response": "It works only with Wii U games, if you want to use one classic control, you will need the previous classic control."}
{"product_id": "B00CJ7IUI6", "context": "Is the DLC in the disc or is it a download code?", "response": "It comes with two disc, you download the DLC straight from the disc."}
{"product_id": "B00IYWV852", "context": "I was thinking about buying a couple of this game as gifts, it won't be an issue will it? The recipients won't have any problem using the game codes?", "response": "As long as you don't apply the codes you receive to your NCSoft account, they should be able to use them just fine!"}
{"product_id": "B0091A3AHA", "context": "Can you plug Xbox into TV when in the uNsc vanguard case", "response": "That depends on what you mean. If the case is open, you can easily plug everything in, with no need to remove the console. However, if the case is to be closed, everything will have to be unplugged and placed in the cloth bags that come with the case."}
{"product_id": "B001AH8YSW", "context": "Will it run on Windows 7 ?? I keep getting minimum requirements not met.", "response": "https://www.youtube.com/watch?v=s6xgUzYjTbY go here to fix the issue"}
{"product_id": "B003O6N64Y", "context": "is it work with PC ? with surround sound and evrything like PS4 or xbox 360", "response": "Yes, works great with the PC.  If you want the mic to work though you're going to have to get a blue tooth dongle and pair it with your computer.  I couldn't get that to work so I ordered the PC Chat Adapter Cable Kit for Turtle Beach ® & Similar Gaming Headsets.  Mic works GREAT!"}
{"product_id": "B00FB4BUMW", "context": "is the keyboard rgb?", "response": "No, it has blue LED lights. No multicolor."}
{"product_id": "B0050SVNP8", "context": "I wasn't able to play the first Pokemon B&W due to Nintendo cutting the wifi access, will this game spoil the experience of the first game?", "response": "In some aspects yes but it doesn't spoil the plot or ending. It does however explain how team plasma separated and what happen with some old characters in the first game. Other than that it acts like its on stand alone game and completly acts like the main character in the first game didn't exist."}
{"product_id": "B000B6MLPU", "context": "i plug it all in but there's no signal when on hdtv?", "response": "Also, leave the yellow composite video cable disconnected."}
{"product_id": "B00IP0H4GA", "context": "Exuse does this game works in any ps3 , even if my ps3 its from america", "response": "Yea, my ps3 is american. It works fine. As long as you know the game is japanese therefore theres no english"}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "Normal Modern keyboard 102 keyboard that has the Alt, Windows, plus Control key in addition to the M1,M2,M3 to select toggle keys to use the G1 thru G6 keys"}
{"product_id": "B000BTBMWA", "context": "does this have the hdmi link to the xbox and component for the tv?", "response": "No hdmi at all. The larger plug shown in the picture connects to the xbox. The individual component cables are for video into the tv. There is a optical audio outlet if you don't need the analog audio out's.Quality is very good. I never noticed a difference after changing to hdmi"}
{"product_id": "B00DBRM3G8", "context": "Can you play the single player offline or do you have to be online to play? Thanks for any info! Have a great day!", "response": "Ibope. Yo sony hace ti be online to play single."}
{"product_id": "B007YLUCME", "context": "I am confused of plug and play. If the controller cannot turn on without having it plugged in, what's the point of having a rechargeable battery?", "response": "Let the battery charge well, once the lights stopped flashing and you can use it."}
{"product_id": "B00DBCAT3W", "context": "Is Fable Anniversary like the original Fable or is it more like Fable: The Lost Chapters?", "response": "It includes Fable and The Lost Chapters DLC, remastered for the 10th Anniversary (mainly aesthetic changes)."}
{"product_id": "B00DBDPOZ4", "context": "does it work for pc ?", "response": "It's USB and there are official drivers for Windows, so yes it works. Ignore the first comment saying it does not work."}
{"product_id": "B000OYMYZQ", "context": "Will this let me use a wireless controller through USB on a PC or laptop, without using the Microsoft gaming receiver?", "response": "Nope you can't. I tried doing this but the receiver had to be connected."}
{"product_id": "B0050SXKU4", "context": "Is this game at all appropriate for a 13 yo boy? My son is begging me for this, and it doesnt seem appropriate IMO.", "response": "In no way shape or form. There are full frontal nude men and women as well as very impressionable content not meant for a child in adolescence. Not to mention the rude people in the online multiplayer. 16, maybe, 13, not at all."}
{"product_id": "B008TP1OKI", "context": "Battlefield 4 requires a 2gb hard drive space to install the game, but it needs a Microsoft offical hard drive. Will this HDD emulate microsoft HDD?", "response": "It functions perfectly fine for all other applications/games. I honestly can't see why it wouldn't work."}
{"product_id": "B00ECOBFA4", "context": "What is the age range on this? Would it be appropriate for a 6 yr old?", "response": "The game is much like the movie and like most of the Lego games.  You walk around in the animated world finding treasure by blowing things up with special spells, skills, etc.  I don't think there is anything really too scary or violent in the game."}
{"product_id": "B00AR1LX9O", "context": "Will this work on mobile phone?", "response": "No.  You need to have the relay transceiver plugged into the phone, it is not Bluetooth."}
{"product_id": "B00FZ12F34", "context": "this Exclusive Amazon DISNEY INFINITY Infinite Bundle, with Sorcerer's Apprentice Mickey Figure is for PS3?", "response": "Bought bundle for young grandchildren with a Wii system. Nothing written on back in figures or on sets to exclude any gaming system. My understanding is that with PS3 or XBOX360 that there are more levels and you can play online with multi players where with the Wii you can only play in the toy box."}
{"product_id": "B00I5LMSBK", "context": "For the North America pre-order of the game, was amazon supposed to give both the Shigechi & Kira DLC? I only received an email for Shigechi", "response": "you only got the one for shigechi.  Kira is only available threw a different preorder company but idk who actually had it."}
{"product_id": "B00DLRLDBO", "context": "how many cords to i have to deal with?", "response": "One for the USB one for the head phones and then one that plugs into the controller"}
{"product_id": "B000AOJ7FK", "context": "Does this actually work with Windows 7?  It says on the back of the disk case \"O.S. - Windows 98/2000/ME/XP.", "response": "I've got Windows 7 and it works for me."}
{"product_id": "B000BD1AFA", "context": "is it works on windows 8?", "response": "Yes. I have GTA: SA on my computer which is running Windows 8 Pro...it runs perfectly, and without any incompatibility issues. The game doesn't have any lagging on my computer either."}
{"product_id": "B008NMPSEU", "context": "After installation, would I need the disc to play?", "response": "I have found that it works best with the CD inserted.  We just keep it in the cd drive unless we have to use it for something else.  But the games are worth it.  I have lots of slot cds and this is our favorite."}
{"product_id": "B0094H8H7I", "context": "can you save your game", "response": "No you can't. It's the only drawback besides the wireless controllers"}
{"product_id": "B0009VXBAQ", "context": "Is this just the regular Wii?  I had one but my daughter took it when she left and now I can't watch Netflix or use the Wii fit.  I have the disks.", "response": "Yes it's the original wii"}
{"product_id": "B0029LJIFG", "context": "Sorry what's this for is it for playing live? I just want this so i can download games for my son. Can I download 2 games per month. Any games?", "response": "You hsve access to free games and discounts on other titles.  You have yhe ability to play other players from around yhe world live."}
{"product_id": "B0038PBF1W", "context": "How do I order more add on aircraft for this sim?", "response": "Unfortunaly You cant order any aircraft anymore....instead You can download war of the thunder is a free game basically is the same game And You can purchase moré aircraft"}
{"product_id": "B00CX8VYM0", "context": "Can you turn off the strong language? Other words, censor it to play in front of younger kids.", "response": "No, but you can use subtitles, a different language, or just play with the volume off."}
{"product_id": "B00BXONG7G", "context": "Can you activate this via: Steam?", "response": "no, and DONT GET THIS GAME ON PC! PLEASE. Worst waste of $15 ive ever spent. It was fun on xbox so I thought i would get it on PC but i was mistaken."}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "No sound card required at all, actually."}
{"product_id": "B00GU4F4OM", "context": "How big is this thing?  I have large hands and FPS gaming can be a pain because my thumb and pinky usually drag on the mouse pad causing my shots to..", "response": "it has a thing sticky out where your thumb is so i dont think you would have that problem"}
{"product_id": "B00HGLLRV2", "context": "Are there super attacks like in infamous", "response": "Yes, each power set (Smoke, Neon, Video) comes equipped with its own special that can be used after you kill enough people in a short amount of time."}
{"product_id": "B004FS8LYK", "context": "Hi, is this compatible with ps4 console?", "response": "I believe it has to say ps4 on the cover, so no."}
{"product_id": "B004QRKWLA", "context": "does it work with steam games?", "response": "Yes, it does. As long as Steam says it has controller support, it will work with the game. Sometimes you may have to map the buttons yourself, though. Don't listen to the guy who said it doesn't."}
{"product_id": "B00CD90R72", "context": "Is there a 2-player mode where my wife and I play on the same screen?", "response": "Yeah, I play with my friend everyday.even four people can play, 2 on each team."}
{"product_id": "B00DNGQTFI", "context": "Can this CD work in Playstation 4", "response": "I wanna say no because I believe they made a version for the PlayStation 4."}
{"product_id": "B00AR1LX9O", "context": "Will this work on mobile phone?", "response": "Yes it will work. But it depends on the size of the port on your mobile device. The cord that is included with the headset is a 2.5 mm plug in. Most cell phones have a 3.5 mm plug in. I bought a small adapter for it for $5."}
{"product_id": "B003G6ISRC", "context": "Does the game install completely on the hard drive or does it need the cd to be in the computer to play the game?", "response": "It installs completely, then you can put the CD away and not use it while you play."}
{"product_id": "B0057SDCLY", "context": "Can I hook up the Tritton Trigger Headset to my PC?", "response": "Yes if you stop being an fget"}
{"product_id": "B0098W4ZD4", "context": "does this work with mac", "response": "Yes, but for mac's I'd advise getting the magic mouse or touch pad.... Bc you get more functionality"}
{"product_id": "B00ENFVS5Y", "context": "Does this have the most recent update? And did they fix all of the earlier batch problems?", "response": "As Thomas said, you'll still have to plug the wheel into a PC to update the firmware, but all the problems have been fixed and works amazingly on the XB1 or PC :)"}
{"product_id": "B006W41W3M", "context": "Is this just the headset or does it include the transmitter, cables, etc.?", "response": "i am not sure , but I purchased for my son back in the states and he told me that he needs a part to make the sound work,  Is he wrong anyone help with that may be he just set them up wrong and does not need another part to make work.."}
{"product_id": "B006PP404Q", "context": "Would this fit a Vita slim?", "response": "Really can't say since the vita slim is not out for sale in the north America yet. Im sure they will be making one soon for it. But I wouldn't take my chance on it."}
{"product_id": "B0079V29EI", "context": "I have read lots of complaints about people receiving the wrong model for their vita. I have the original vita, will this grip work for that model?", "response": "There is currently only the one model of Vita in the US. The slim has not released yet as far as I know. The charging attachment actually slides up into the Vita and then you move a switch to lock it into place holding the Vita firmly."}
{"product_id": "B00DE2W33I", "context": "Hard Disk  500", "response": "If I understand your question, the PS4 comes with a standard 500 GB hard drive.  It can be upgraded to one with higher capacity.  I believe that most available drives are compatible, however I recommend you check with Sony for a list of compatible hard drives."}
{"product_id": "B00DC7G2W8", "context": "Does this game will come with a game code for one of four other games (New Super Mario Bros. U, The Wind Waker HD, Pikmin 3)? I read that elsewhere", "response": "Yes. You register your copy of Mario Kart 8 with Club Nintendo before July 31 to get the download. The registration code is inside the game case."}
{"product_id": "B008CP6MA2", "context": "I like 20 day came my game but when you enter the Captcha code tells me this expired or was used that happened there", "response": "Maybe try again and check your spelling... All of mine worked"}
{"product_id": "B00FB4BUMW", "context": "Will the computer see this keyboard preboot so the bios can be accessed with the F2 or ESC key?", "response": "Yes works fine on my X79 board pre-boot."}
{"product_id": "B009DYCTY4", "context": "can I use my ps2 games in it", "response": "Unfortunately you can't use PS2 games on the PS3. It would be a huge selling point if you could though!"}
{"product_id": "B00EPZ8POY", "context": "does this game works with any ps3 console(usa)?", "response": "Yes it does  you will love this game :)"}
{"product_id": "B0086V5UF0", "context": "Where can the \"just dance 4\" be played? Because I can't play it on DVD/CD player.", "response": "it wont play on my wii either"}
{"product_id": "B0042J7I3C", "context": "Does it hook into the controller or the Xbox?", "response": "it plugs into the hand held controller   Good luck"}
{"product_id": "B0094H8H78", "context": "Does this have internet access such as facebook page?", "response": "Regarding the guy who said \"No there was no facebook back in 1990 when the Genesis came out \", no, but there is internet now. How is that statement relevant? Also Genesis came out in 1988, not 1990"}
{"product_id": "B00DC7G0GG", "context": "We just ordered the Wii U... what extra controllers will we need for multiplayer use?", "response": "You can use the game pad, wii remote, wii remote + nunchuck, or wii u pro controller. personally i think the pro controller is the most respnosive and easiest to play with, even more so than the game pad itself."}
{"product_id": "B003G6ISRC", "context": "what do you play this game on? Is this delivered on a disk? thanks", "response": "It comes as a cd. You download the game on your computer (PC or mac) and play! Plus you can put it on mulitple computers."}
{"product_id": "B00DFB99UI", "context": "Does this wheel have force feedback?", "response": "Yes it does. Bought it for my son. He loves it."}
{"product_id": "B00576U8CC", "context": "How often do \"special missions\" or \"events\" happen, and what type of mission are they usually?", "response": "Pretty often like once an hour or so. And they vary. Sometimes its an elimination or its a search and rescue. You never know."}
{"product_id": "B00BT71S4K", "context": "I have a samsung tab 4, 7 inch tablet, I know it won't fit, but will it work for that?", "response": "I don't see why not. As long as your tablet has blue tooth it should work."}
{"product_id": "B0050SX9I2", "context": "Does this work with the PS4? If not, is there a PS4 remote available?", "response": "There's a 3rd-party remote coming mid-October that actually looks really promising. It's officially licensed by Sony, too. You can check it out here and even pre-order it if you want: PlayStation 4 Universal Media Remote"}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "Dorito dust and mountain dew will make you the best cod player ever. FaZe will recruit you but Optic will be jealous then kid nap you"}
{"product_id": "B00G42KO0Y", "context": "I have a pretty massive phone, will a Galaxy S5 or like that size fit the holder?", "response": "I googled S5 showing the S5 is with 4.8\" screen. It fits the holder, which can support 8.2cm maximum."}
{"product_id": "B004RMK5QG", "context": "I have a Canadian PSN, this card will work on it?", "response": "Only for psn acount registrate in usa"}
