{"product_id": "B0050SYK44", "context": "Is this game enjoyable to play as a single player game?", "response": "It's alright as a single player. I didn't enjoy it as much as I did the first one though. I got bored about a third of the way through and quit playing. I think if I had co-oped it I would have stuck with it longer."}
{"product_id": "B0087ZMAUS", "context": "How good is the mic quality compared to the PC 360's?", "response": "I own both headsets and they both use the same technology for the Microphone. I use it to record audio and if I had to choose between the two I would pick the 360 by very close margin. hope this helps. But honestly, you cant go wrong with either headset."}
{"product_id": "B0027AP5S8", "context": "Oh. So no special tools needed. But I have one more question, will the custom fan (Tailsmoon Wisper Fan) be a problem with the casing?", "response": "Not at all. I put one in it myself. The whisper fans are the same size and shape as the stock fan."}
{"product_id": "B00JM3R6M6", "context": "Can you play the Tomodachi Life on a regular Nintendo DS?", "response": "GameCube VS Wii right here. Tomodachi Life is a 3DS game, which is not compatible with the Nintendo DS. Sorry, you'll have to upgrade to the current system if you want to play it. There's also a Japanese only version called Tomodachi Collection for the original DS, just make sure yours isn't region locked or it won't run either."}
{"product_id": "B00AKIPBNS", "context": "Which 3DS region lock does this game have? Does it depend on where it's ordered from?", "response": "Possibly.  I live in the USA and it works on my system which I got in the USA."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "Once you complete your purchase you can view the code in your browser immediately."}
{"product_id": "B000IBQLOU", "context": "How does this stand up to jumping? I tend to be a jumper when I'm playing, and i was wondering if this is going to slip?", "response": "Because this is one of the thicker pads, it stands up to jumping quite well. The bottom is not slick. It's like a foam-ish material that offers some resistance to slipping. I prefer these thicker foam pads to the flimsy thin ones."}
{"product_id": "B003O6N64Y", "context": "Will they Play 7.1 through Smart TV?", "response": "Use the optic cable and it will play what it says on the website! I just looked at my headsets to see if 7.1 was the max. Couldn't see it so research at www.turtlebeach.com/px5 I still use mine and it has been years!"}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes, the ps3 does not have a region lock like the ps2"}
{"product_id": "B00D9FQ9CQ", "context": "do I need internet to play games at home? or I can buy a cd game and play and home without any problem", "response": "You do not need the internet to play off line by yourself"}
{"product_id": "B00EADTVL2", "context": "Is the AC Adapter compatible with wall outlets in North America?", "response": "Yes. I live in North America and the charger works fine."}
{"product_id": "B00F27JDUY", "context": "can i change the full internal language to english?", "response": "Yes. It has the exact same start up procedure that asks you to pick language, date and time. It's 100% the same as a North American ps vita slim"}
{"product_id": "B005UI8V6C", "context": "Do you need internet to download this game?", "response": "No, I'm sure internet isn't required for download or play."}
{"product_id": "B0000512IE", "context": "Could this be adapted to be used in racing games also?", "response": "Yes I would think so."}
{"product_id": "B000YQ639M", "context": "does this contain  both the basic game and the add on advanced game", "response": "Yes. The Base game needed to play the expansion is with it. Its a complete pack."}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "All parts in a Sony box :)"}
{"product_id": "B00CJ7IUGS", "context": "If i buy a used version will i still get all the DLC?", "response": "Yea u still do i bought a used version and i still got the dlc u just use a seperate disc"}
{"product_id": "B00B0QONB0", "context": "This hardrive can be used on the xbox 360 slim console in black.", "response": "It sure can! It should work great!"}
{"product_id": "B002BRZ79E", "context": "Registration info? I tried to play this game I bought but it's impossible without a valid registration.. Can someone help?", "response": "You have to buy the game new once it is opened and the code is used the disc is useless"}
{"product_id": "B00ANHBJBY", "context": "Does anyone know how well this holds up in games like Super Smash bros? The responsiveness and durability for example.", "response": "I have smash Bros and this controller and i don't recommend it. It's not very responsive for Smash Bros. Pay the extra cash and get the official Wii U pro controller, that one works alot better for me."}
{"product_id": "B002BSA298", "context": "will this work with the old console and will I need another cable to connect it?", "response": "I had to get the AC adapter extension. I bought it on Amazon for I believe around $2 or so."}
{"product_id": "B00166N6SA", "context": "Is this the one you need to buy to install in computer before you can play any other Sims3 games?", "response": "Yes it is! This is the original Sims 3 game with no expansions. You then buy expansions for this game."}
{"product_id": "B00DJYTGYU", "context": "Does it work with GTAV?", "response": "This controller will work with any game that doesnt require motion function(like the original six axis ps3 controller is capable of) so games like Killzone 2 are going to be unplayable in sections(arming bombs and whatnot)GTAV is good to go, have fun"}
{"product_id": "B0050SYDEQ", "context": "does this game have free roam?", "response": "Yeah, but its called playground. Highly recommend this game, I'm 5th in the world"}
{"product_id": "B00B3PDH5G", "context": "What exactly do you need to make this compatible w/ Xbox One (of note--you are talking to a video-game ignorant mom here)?  Thanks!", "response": "Everything you need comes in the box."}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "I don't have windows 8 ,but it does work on Win7. Hope this helps."}
{"product_id": "B00D96BJSO", "context": "Will the headset work? Im using a monitor (HDMI-DVI) instead of a TV and I'm getting sound from pc speakers through S/PDIF rather than from a TV.", "response": "The headset only plugs into the controller so it should work fine."}
{"product_id": "B001AI7CF2", "context": "$ 7.99 is the price for each extension? or for the package of four extensions? Please clarify", "response": "It is the cost for the four pack.  Got them and they work great."}
{"product_id": "B00ATF5YYI", "context": "Is this the complete version (just like the one on Steam) that has all DLC? I'm pretty sure the DLC isn't even sold separately anymore for downloads.", "response": "as far ias i can tell it has everything in it there tons of servers up too"}
{"product_id": "B0002DQUH2", "context": "just like to know if there is a volume control button ?", "response": "No, there is no volume control.  That's the only complaint I had about this board.  I got it as a replacement for the original board of my computer that did have it and I missed the convenience."}
{"product_id": "B001EYU1WS", "context": "Is it as complex as the picture?", "response": "The only thing complex about it is getting it to actually work. Works fine with Windows 7. I finally gave up with Windows 8. If time is money I've spent thousands of dollars trying to find a solution."}
{"product_id": "B007SO6USW", "context": "does it come with a battery pack for the controller?", "response": "Unfortunately not, listed below are items included:1. USB for power (no wall charger included)2. The stand which fits both controllers for charging ( led light indicators blue wen fully charged red when charging)3. An intstruction bookletHope this helped"}
{"product_id": "B005761IOY", "context": "i bought one of these controllers and like it doesn't turn on without being plugged in to the charger is there a way to fix that", "response": "Nope. Sadly this seems to be Power-A's most quality piece. You can get one with fans on the grips but you have to keep that plugged in too, and the casing seems like it came from the dollar store. I would return this and get a first party controller."}
{"product_id": "B00FAN4LRA", "context": "What is the type of connector called? The one that kinda looks like a micro usb......", "response": "It is a proprietary connector."}
{"product_id": "B004C4U1VI", "context": "Will this fit SCPH-70012 PS2 Slim models? Asking because I see various people saying it fits their PS2 Slim and some that say theirs do not.", "response": "It did NOT work for my silver PS2 Slim model, but it worked for my Nintendo Wii."}
{"product_id": "B00DH1KRQQ", "context": "Does it work for windows 8?", "response": "I talk to etekcity directly and they said it does work for windows 8 but not windows 8.1 or higher. If you like my response please follow TwistedSaiyan on twitter and like us on facebook and subscribe to us on YouTube because we are apart of a special beta test program with Etekcity."}
{"product_id": "B000NJBD90", "context": "I know it says PS2 to PS3, but it's a USB, do you think it'll work if i plugged it into my Xbox 360?", "response": "No. but here is YouTube video for more information http://youtu.be/lQ1WXIBACXU"}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "Mine always blinks 3 times the first time I turn it on. ..have you synced it to YOUR PS3 yet ?"}
{"product_id": "B0000695GX", "context": "Is this game playable on Windows 7?", "response": "Windows 7, Yes it is playable."}
{"product_id": "B00EZKNT18", "context": "does it come in offical packaging?", "response": "Yes it comes in a Sealed Afterglow official box"}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "No. The Xbox one sends audio via wireless to the controller, then to the headset. Xbox 360 does not provide audio to the controller except voice chat."}
{"product_id": "B00BGA9X9W", "context": "Are the sticks confortable to play with? Meaning it won't slide my thumbs by mistake like with the DS3?", "response": "The sticks are very comfortable to play with. The rubber on the stick seems to wear out quickly. I suggest Grip Its or some other type of joystick cover."}
{"product_id": "B004GZ2RCY", "context": "unlike the legendary WoW mouse that I just bought and had to return because it some how not compatible with win 8.1, so I guess my question is this?", "response": "My first question would be, what game were you using the mouse on? I have found that some games just can't see all the buttons on the mouse, even with the software installed."}
{"product_id": "B0016897GS", "context": "do you need clips", "response": "Clips? Do you mean to help tack the cord up? If so the yes my husband was just saying we need to get some duct tape and I thought ohhh now that will look horrible! Haha it did not come with any that I noticed..."}
{"product_id": "B00A750QIE", "context": "Does this game offer stereoscopic 3D like The Show 11' and 12' do?", "response": "Thank you very much for taking the time to answer my question, I appreciate it."}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "PS3 came with 1.."}
{"product_id": "B002J9GDXI", "context": "How long is the cable? Is it braided?", "response": "yes it is braided. it 6foot long"}
{"product_id": "B004G5TUJM", "context": "does this work on all racing games even nedd for speed games", "response": "We bought this for grand tourismo 6. Our system is ps3. It doesn't say it is limited to certain games on th box it comes in from what I recall."}
{"product_id": "B00DUARBTA", "context": "Does this game have multiplayer mode?", "response": "Only 2 players can play at the same time"}
{"product_id": "B00005NIMB", "context": "Will this work on windows XP?", "response": "Yes. When I had that joystick, I was using a machine running XP"}
{"product_id": "B00D9EPI38", "context": "So, DOES it have hdmi output? (The Xbod itself is not a monitor so I can't \"watch movies right on it.\" I still have to connect to a screen)", "response": "Yes  it must be connected to a tv"}
{"product_id": "B0079V29EI", "context": "Do these still fail to hold the additional power after a month of use?", "response": "Mine is still working fine and have not noticed a change in the additional energy it holds."}
{"product_id": "B009AFLXQQ", "context": "does the controller have rumble?", "response": "Yes it does. I've had the controller since March and I have yet to charge it again. I don't play very often but, battery life is excellent."}
{"product_id": "B006SVUQNQ", "context": "My current hard drive keeps saving corrupt data and slowing the xbox down, for some reason my xbox wont read any game that has the corrupt data on it. Will this happen with this hard drive?", "response": "No it should be fine backing up cloud saves, and new saves as well as copy over the saves from your 4gig internal flash drive.. Downside, unless you have your saved games in the cloud or are not corrupt, they are gone forever unfortunately."}
{"product_id": "B004C34D2M", "context": "The product description says, and I quote, \"It contains the same motion-sensing technology as the remote\" is this a false description? If so? Report?", "response": "It says that, but when I tried to connect it to the WII it would act like it registered, then when I selected two player in a game, a screen popped up and told me to reconnect the remote. I repeated this 5 times and it never connected."}
{"product_id": "B0016897GS", "context": "the router to connect 30 ft. away .http://www.amazon.com/gp/product/B00NR2VMNC/ref=ox_sc_act_title_1?ie=UTF8&psc=1&smid=ATVPDKIKX0DER", "response": "Yes, same here.  50 ft is plenty."}
{"product_id": "B00IAVDPSA", "context": "Can you use the remote to change the source input on your receiver?", "response": "No you can't unfourtanately unless it can be used as a universal remote but there were no instructions to do that. Sorry"}
{"product_id": "B001CXYMFS", "context": "how does this stick work playing elite dangerous? any suggestions if this one isnt very good for the game?", "response": "I use this with Elite and the Oculus Rift.  Works great.  Sometimes I wish for an extra hat switch, but I just have the hat switch work the power in free flight and translations/thrusters when docking.  Not as good as some other sticks, but MUCH cheaper."}
{"product_id": "B00IA2NYT4", "context": "250 gb o 500gb?", "response": "I ordered the 500 GB but I received the 250 GB, didn't matter much though because I use my 750 GB WD Blue."}
{"product_id": "B004FS8LYK", "context": "This game is Spanish or subtitled in Spanish?", "response": "I have this game in english with no spanish subtitle ."}
{"product_id": "B00CMSCWGS", "context": "does this work for windows 8?", "response": "Totally, i have installed w8 and works perfect"}
{"product_id": "B007A7K60A", "context": "will it work with HP touch screen?", "response": "I'm not sure as I don't have HP touch screen.  Sorry."}
{"product_id": "B00CMQTVUA", "context": "How large is the Hard drive  for xbox standard system?", "response": "Actually, you will only have 384gb available to you and it goes fast! When I had my Xbox One I filled it up in  matter of 3 Months, all that was left was 22.00gb, barley enough for one more game!"}
{"product_id": "B00EF1OGOG", "context": "what is the size of the unit? length and width?", "response": "Like 3 inches length 1 inch width..."}
{"product_id": "B00GY4OAIE", "context": "Why did this product come in a paper sleave instead of the protective plastic blue ray case?", "response": "Mine came in a paper demo sleeve too. I can't complain though. The game works & the price was good."}
{"product_id": "B00CPKUV9I", "context": "Does Wolfenstein:TNO have a single player mode?", "response": "it only has a single Player campaign."}
{"product_id": "B00GY4OAIE", "context": "How do you save your game when you're not done with a level? Are there check points or something? My 8 year old is having a terrible time.", "response": "The system saves automatically after you pass a level.  You can't save in the middle of a level."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay an additional  membership for playing the game or is  it enough with buying the game?", "response": "Honestly, I am not sure. But some period they gave us special offer for free seasonal passes and maps. I think you don't have to pay an additional membership for playing."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "The game doesn't  require wifi to install. And time varies (usually no longer than a half hour). However, should you connect to the internet and play the game, you will be prompted to install updates."}
{"product_id": "B004N7IIQ4", "context": "Is the headset over-the-ear or on-the-ear?", "response": "On top of your eae"}
{"product_id": "B0029LJIFG", "context": "if i buy this product today can i use it next year? in other words my xbox member ship has about 6 months left, so can i buy this now and use it later", "response": "Yes, you can, up to a 100 years later, if they are still in business..."}
{"product_id": "B000QJ1NS8", "context": "My GBA SP won't charge. Time to change the battery?", "response": "It's a smart choice.Worst case scenario,  you have to buy a new system- but then you have a new battery for that one."}
{"product_id": "B004N7IIQ4", "context": "Is the mixamp compatible with PC ?", "response": "Yes it is, but it will need to be plugged into both a USB port and your headphone and microphone jacks."}
{"product_id": "B003VH5Z2C", "context": "Why doesn't Faxanadu work?", "response": "Did u try it on another system to see if it worked? Or if the game is missing some of its insides? Because that might cause it not to work"}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "I am using my PS4, PS3 and Vita that I got from Amazon in Malaysia. Works with PS Plus too..."}
{"product_id": "B005L38QK2", "context": "Are there more buttons on the right-hand side of the mouse or just the two on the left that are next to where the thumb rests?", "response": "2 on each side(2 left-2 right) 7 all together"}
{"product_id": "B00IA2NYT4", "context": "which thing is included with this console?", "response": "The console has the power cable, AV Cable, Controller, black wireless charging cable, the Last of us Game and Online play code."}
{"product_id": "B000BT4CF4", "context": "Are these wired mouse controllers, genuine Microsoft controllers or knockoffs ?", "response": "i bought it in 2011 for 31$ and now works without any problem, i'm still using it. Its an original product"}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "Thank you for the answers. We are looking for Hoyle for windows 7 and 8. The old one works on my machine but my husband's machine will not take it."}
{"product_id": "B0087ZMAUS", "context": "Sorry not to ask again, but, I want to get a good idea before making a purchase. Do these feel sturdy or more flimsy?", "response": "They are well built not flimsy at all. Overall the quality is good. I have had mine for one month, I use them really frequently..."}
{"product_id": "B002BS47JE", "context": "can you work out without the balance board?", "response": "There are some of the strength and yoga work outs that don't need the balance board."}
{"product_id": "B0050SZBP6", "context": "does this come with the lvl 90 boost?", "response": "No, that's for the purchase of the new expansion that is coming in december."}
{"product_id": "B00I4C2EKA", "context": "Will this run on Windows 8.1? I have a Surface Pro 2", "response": "I'm using Win7, so I am not sure."}
{"product_id": "B00A378L10", "context": "Will this version of the CM Storm QuickFire TK ever be restocked?", "response": "The Brown switched Quickfire TK in the US comes out mid March...I ordered this exact item and they just sent me a blue switched quickfire TK...ugh the frustration."}
{"product_id": "B00B15EXJC", "context": "How big is the USB dongle?", "response": "Not too big, about as wide as the USB port, and sticks out just past the front of the console about 1/2\""}
{"product_id": "B0086UK7I6", "context": "Does it have any clicking issues that happen to it?", "response": "My left mouse button failed entirely after about 4 months. But I fully believe I just got a bad one. Logitech sent me a new mouse free of charge."}
{"product_id": "B009LGO88E", "context": "can i use the Circle Pad Pro as a grip for non supported games", "response": "Yes you can but the extra buttons will only work with certain games only."}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "Absolutely!  The simple design and approach of the levels makes it ideal for the younger kids."}
{"product_id": "B00726ARTE", "context": "is this 4 xbox 360 or ps", "response": "Neither, it's only compatible with phones and pc"}
{"product_id": "B000QJ1NS8", "context": "The picture says 850 mAh but the description says 600 mAh.  Which is true?", "response": "Mine says 850. Works great. Holds charge as well as the original. Hope that helps"}
{"product_id": "B002I0JZIS", "context": "does this have nuketown", "response": "No,  that's for the xbox360 n ps3, black Ops 1 & 2"}
{"product_id": "B00DC7O3K6", "context": "if i add a motion sensor to the back of my normal wii remote, does that work with this? or do i need a new remote all together?", "response": "You need the Wii remote plus and a nunchuk."}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "Unfortunately it only works with the wii u system."}
{"product_id": "B009K7OFSC", "context": "Will this work on a mac with all functions. Just need right,  left and center click and 4 way scroll", "response": "Well Jellicoe, I have no clue if this Mouse will work on Mac because I don't use Mac. The only Mac I use is Mac and Cheese. I appologize for not being able to answer your question. Good Day"}
{"product_id": "B00DWXUYN0", "context": "Is this made to hold the 3ds XL during gameplay or is it just a storage case? Thanks in advance!", "response": "Just for storage. Does not actually attach to the device itself."}
{"product_id": "B00DC7G0GG", "context": "If i use the Wii-motes to play, do I NEED the nunchuck thing, if so then would it be better to just get the pro controller?", "response": "No you do not need the nunchuck for this game."}
{"product_id": "B00E3667XQ", "context": "Is it worth it even IF I cannot use the streaming feature?", "response": "Yes. I do not use the streaming. It's more about gaming quality and speed. Try to think of the device as a console rather then just another android tablet."}
{"product_id": "B002I0K3CK", "context": "Why is this game $67.99?? This game is 2.5 years old and all new games are based at $60....", "response": "I have the same question. Did they stop printing it because a new one is coming out soon?"}
{"product_id": "B00EZKNT5O", "context": "does it come with a cord", "response": "Yes. The cord is permanently attached to the controller and there is a pull away split near the USB."}
{"product_id": "B000035Y6D", "context": "What all does your system come with, The wire hook up for the tv, controllers? anything?", "response": "Mine came with one controller, the console itself, the power cord, tv hook ups and a game. The sellers on there should tell you what all comes with it because each person is different. Some come ready to play and others are just selling the console by itself."}
{"product_id": "B005M2KSLC", "context": "does it have a DPI switch up AND down???", "response": "What is the DPI switch?"}
{"product_id": "B00GU4F4OM", "context": "can someone please link me driver download, my cd reader is broken.", "response": "http://redragonzone.com/en/download.aspxthen click on Mammoth Driver, hopefully it works. Or you can contact the company on the website and they might be able to send you something more specific.Hope this helps."}
{"product_id": "B00FB4BXGA", "context": "Anyone having the problem with key malfunctioning? I only use the arrow keys for driving & without touching a right or left car will suddenly turn.", "response": "I have had my keyboard since the day it was released on amazon. So probably over a year and have yet to have any malfunctioning with it? Maybe shoot their customer service an email and see what they say."}
{"product_id": "B003RS1A7Y", "context": "Is it compatible with PAL system?", "response": "If you have a PAL-compatible copy of the Rock Band 3 game, it should work just fine."}
{"product_id": "B00DBDPOZ4", "context": "The description claims 30 hours of battery life, but how much did you get out of it before having to charge it?", "response": "The battery life has been excellent, it usually lasts a few days and we're pretty hard core gamers."}
{"product_id": "B001MGNWDI", "context": "Does the joystick work with IL-2 Cliffs of Dover, War Thunder or Heroes and Generals?", "response": "I think, with a little finagling...and the use of Pinnacle game profiler...it will work with any game."}
{"product_id": "B00A9HA52W", "context": "Anyone else having trouble getting the customizer software to recognize the controller?", "response": "you can go to codejunkies,com and download the evo customizer software."}
{"product_id": "B00FC1UH82", "context": "Is the default gate for the stick square or octagonal?", "response": "The default is square. But I believe u can change it if u want"}
{"product_id": "B0029LJIFG", "context": "What is the difference between this gold card and the newer version - besides price - wouldn't this one still provide 12 months of xbox live?  thanks!", "response": "I am not sure there is a difference. My son has a 360 and we were paying monthly via my credit card. I bought this as a gift for him. It worked perfectly and there hasn't been a difference in access or content. The only difference is the awesome price."}
{"product_id": "B000H1V56U", "context": "Am i suppose to recieve a spliter for the fan? Because as of now, the male is 3 prong and the female is 4.", "response": "Mine plugged right in the 360 but the   thing stopped working in less than a month, so I tossed it out. Sorry I can not help you."}
{"product_id": "B00F68LBE0", "context": "can i plug the charger in and charge the controller while playing?", "response": "No, I've tried. Can only use it once it's fully charged."}
{"product_id": "B0087ZMATE", "context": "Does it have a mute button for the mic?", "response": "No. It wasn't that great. I had to return it and bought a Hyper X headset."}
{"product_id": "B00A378L4C", "context": "are the leds very bright?", "response": "There are 5 brightness settings, and the lowest one is moderately dim in a dark room"}
{"product_id": "B00A378L10", "context": "Are the Home, End, PageUp, PageDown  functions accessed by using the shift key or NumLock? Also, I see tat the default function of the \"2\" is up arrow", "response": "All the functions at the side can be toggled on and off by using the numlock. You can use the arrow keys when numlock is off, numlock on and you will get numbers."}
{"product_id": "B004GZ2RCY", "context": "What are the dimensions of the mouse itself?", "response": "sorry for the late answer but anyway when you ask I was old the mouse long time ago but believe me, its huge."}
{"product_id": "B0038MVFYC", "context": "Does this come with a Nintendo DS?", "response": "No it does not"}
{"product_id": "B00E447L8C", "context": "will this charge a iphone4?", "response": "Yes, anything that has a USB compatible charge cord can be charged"}
{"product_id": "B00CBQO930", "context": "Does the Scroll Wheel also act as a button when you click it?", "response": "If you mean to use it to scroll through pages and stuff, then yes. It acts as a middle mouse btn."}
{"product_id": "B001CXYMFS", "context": "how does this stick work playing elite dangerous? any suggestions if this one isnt very good for the game?", "response": "I got this stick to play elite. Works great."}
{"product_id": "B00006B84X", "context": "Does this have a twist access or not? On CH website, it says it has a three way axis, which makes me think it does, but some reviews say it doesn't.", "response": "no, on the base of the stick there is axis's tuning wheels and then on the left side top of the base is a z wheel."}
{"product_id": "B00D3TRMD8", "context": "Can you download it on Amazon tablet", "response": "I don't know.  I downloaded this game to my PC desktop and it worked fine.  By the way, it is a VERY fun game :)"}
{"product_id": "B00CJ7IUI6", "context": "Is there any nudity in this game ? (this is the only problem I have against getting the game) please reply-thank you", "response": "Because you are fine with murder but  the human form is too filthy."}
{"product_id": "B00CMQTUSS", "context": "Using this for PC, which will require the micro USB to always be connected.  Will I have any need for batteries at all?", "response": "it is wireless whit pc or need a wire usb"}
{"product_id": "B00GZ1GUSY", "context": "Is it normal to see this annoying white flash between screens a camp fire?  Not sure if mine is defective because it's irritating/annoying. TYIA.", "response": "Yeah, it's pretty odd. Normal thing in the game though."}
{"product_id": "B006NU6F28", "context": "Does it come with English for the Nordic Version", "response": "Hello Caleb I am sorry but I bought this game for the son of a friend and all he needed was that game in english."}
{"product_id": "B004RMK4BC", "context": "How do I get my code", "response": "by email, or right after amazon accepts your payment"}
{"product_id": "B009K7U6IK", "context": "I am seeing conflicting answers for this, si I want to know: Is this a mechnaical keyboard? Or are the \"Gaming Keys\" Mechanical? Would like to know.", "response": "They are not mechanical, none of the buttons are. The directional keys and WASD keys just have grip on them."}
{"product_id": "B00AQ2BLI2", "context": "Do I need to be connected to the Internet like in Empite or can I play offline?", "response": "You can play offline to with ou no problem, online online if you want to play multiplayer"}
{"product_id": "B0095D1CM8", "context": "Does this work with Linux?", "response": "Not plug and play for linux.  Go to the forums, i think there are some work arounds to get it working on linux"}
{"product_id": "B00BU3ZLJQ", "context": "will it work on a desk top personel computer?", "response": "There is a PC version but you have to buy directly from minecraft.net It's not as easy to play as the console version, so I would suggest downloading the demo and letting your kids try that first to see if it's a fit."}
{"product_id": "B005F1ZUU4", "context": "Will this controller work for windows 8?", "response": "Yes, it works great!"}
{"product_id": "B00HN9LS48", "context": "Regarding the critical comments, do you think attaching a simple velcro strip would solve the problem of is not staying attached?", "response": "I doubt it.  The back bracket wouldn't stay in place or support the weight.  I ordered a different one that cost a little more and am quite satisfied.  They were quite good about arranging the return and refund.  I bought a PDP Kinect TV Mount."}
{"product_id": "B00F2ENJY8", "context": "can you play any WII game on this or just what comes with it", "response": "You can play many Wii games on it but keep in mind that it's not WiFi capable."}
{"product_id": "B004MR3QY4", "context": "What is the difference with the black edition?", "response": "i think is colour and the light"}
{"product_id": "B004W1IX1G", "context": "Does this work with the Wii U?", "response": "I'm not sure.  If it doesn't state that it works with Wii U in the description, I wouldn't use it on Wii U.  Otherwise, it is great on the regular Wii system."}
{"product_id": "B004AM5RAM", "context": "Do you notice any latency between clicking and games responding? I have had terrible wireless gaming mouse experience.", "response": "However you can use this mouse either way wired or wireless"}
{"product_id": "B000RT2868", "context": "Will this work with the Street Fighter Anniversary Arcade Stick (Original Xbox) to Xbox 360?", "response": "No, it is not compatible."}
{"product_id": "B006NU6F28", "context": "Does this include Multiplayer gameplay?", "response": "No I don't think so. It so much fun by yourself. I enjoy play it by myself."}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "The keyboard comes with a hand rest attachment so you can choose which one you want to use. So effectively both :D"}
{"product_id": "B00EFFW0HC", "context": "Can you turn off the lights in a building so enemy's cant see anything?", "response": "That I know of no. What I do to not be seen is throw a smoke grenade to block there view and turn off my laser light. When the smoke is up you can pick off the people who's laser light is on and visible while I am invisible."}
{"product_id": "B00004VUFG", "context": "can I use this with my xbox 360?", "response": "I think Logitech makes this for all game consoles, mine is for PS2."}
{"product_id": "B00FZLE9JW", "context": "Will this hard drive work to play original games on my XBOX 360 Slim?", "response": "I got it for new battlefield as it needed hard drive (I have Xbox 360 with 4gigs). Worked good, it extends your memory so I don't see a reason why it wouldn't work with original games"}
{"product_id": "B002CZ7P04", "context": "I was addicted to the Island Cycling game on Wii Fit Plus.  Is this game as fun in your opinion?", "response": "Yes, very fun. The more you walk around your island and click on the things around you the more trees, potted plants, light poles and other things appear on your island. You are decorating your island. It gives you a great workout. If you get the game, you will not regret it. Have fun!"}
{"product_id": "B003EUPCZG", "context": "do the mouse wheel and logo light up?", "response": "Yes. The mouse wheel and logo do light up."}
{"product_id": "B002I0GF72", "context": "Does this game come with the gold foil cover or was that only upon release or preorder?", "response": "It must have been upon release and or preorder. Because the one I ordered recently did not have a gold foil cover on it."}
{"product_id": "B00EIM3BV6", "context": "Is there anything else I need to buy to go with these for them to work on the ps4?", "response": "No there is no other accessories you need.  When you get your new Astro's just plug them into your PC and download the lastest firmware for them and you are good to go.  The PS4 does accept this device and never had a issue."}
{"product_id": "B001UIG6M2", "context": "Does it have kingdom heart cheats?", "response": "Maybe it might not sure"}
{"product_id": "B00FATRKWM", "context": "I will be purchasing the US x-box, will it work in Europe?", "response": "Yes, it will work in Europe, but you will need a converter plug for the European electrical system."}
{"product_id": "B000FQ9R4E", "context": "After playing about 3 games, the game seizes up and won't let you play anymore and you must shut the whole Wii off. Anyone else have this problem?", "response": "This was a gift for my grandson, sorry I can't be of much help."}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "It has been a while since I used it...but as far as I do remember it will turn on.. only after the drivers are set up and the game brings the unit to life."}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "I've played Dead Space, Crysis, Call of Duty, Hitman and a bunch of others.....I didn't like Kill Zone, could be my deal, never got used to it and didn't finish...liked Sniper Elite 3 but not Kill Zone...I guess if you pick it up cheap enough or try the second one....?????"}
{"product_id": "B00DB9JYFY", "context": "It states rated for M -- my son is 10 and loves that his friends play this game online with classmates -- how concerned should I be about the content?", "response": "That's for you as a parent to judge yourself.  My biggest concern as a parent would be the attitude and language of some fellow players - not the game.  The game itself is the standard shooter no better - no worse for onscreen graphics and violence."}
{"product_id": "B003R783IY", "context": "Do you need xbox live to save?", "response": "To save your progress, no. It does that on its own."}
{"product_id": "B002LARYGA", "context": "Does it require my original tv remote or can I program it to my tv using codes?", "response": "You can use code for a large amount of different tv brands and models. Check there web site to make sure a code is available for your specific tv.  Fir the money, this is the best remote I ever owned.  And I owned a plethora of Logitech Harmony remotes costing way more."}
{"product_id": "B000ZKA0J6", "context": "Does it work on Windows 8.1?", "response": "Yes it does I have it on 8.1 and it runs just fine."}
{"product_id": "B000TK99PS", "context": "Will this 2008 version work on Windows 8? Thank you Cee Cee", "response": "Can't say for sure. I know the 2012 version does."}
{"product_id": "B00BI83EVU", "context": "If I buy a pre-owned version for PS4 do I need to also buy a pass to play? I'm attempting to avoid giving UPlaysoft any of my money.", "response": "there is no pass needed to play the game i think you may need a PS plus sub to play online but thats all (: season pass is optional for DLC"}
{"product_id": "B000SOYG8U", "context": "is it about the clone wars pleace answere", "response": "No it is not, it is ort of like the game risk, where you conquer other worlds and hold onto them."}
{"product_id": "B005Q1YA5O", "context": "Is this the one that includes the base game sims 3 and sims 3 pets? I saw a cover just like this but this doesn't say it includes both", "response": "No it does not include the base game, even I did not knew that and ended up buying the base separately. The download was very slow, not sure if it was because of my internet connection but it took whole night just to download. I would recommend buying a combo pack in which you get base and pets both."}
{"product_id": "B001E93IWI", "context": "Will this headset break easily like some turtle beaches do", "response": "No they dont break easily and they are a really good headset"}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "No, it is working well and felt many times and not broken."}
{"product_id": "B006JKARP8", "context": "Will this work with the new vita to be released on may 6th?", "response": "I don't see why it wouldn't work, it pretty much charges anything I can hook up to it (phone, camera, etc). Its not only a great vita accessory, but also one of the best battery chargers in general for many mobile electronics."}
{"product_id": "B00012YI14", "context": "does it work for the pressure-sensitive gamecube shoulder buttons? like for pressing part-way down as well as all the way down?", "response": "Unfortunately it doesn't, the shoulder buttons on the ps2 controller are very short."}
{"product_id": "B002TLTBN0", "context": "Do all wii games compatible whit this controller are also compatible whit the game cube controllers?", "response": "The Wii Classic Controller Pro is mostly for Virtual Console games, and the GameCube controllers are only for GameCube games being played on the Wii."}
{"product_id": "B00AWEMODK", "context": "When I install it on my bootcamp for windowns 7 It starts to install then nothing happens. I know my computer can run this game. Help Needed!!!", "response": "I had the same issue with mine as well. It honestly took me about 5 retrys to finally get it to work. Just keep trying man.. Their download is broken..sorry to say"}
{"product_id": "B00FXOP1MU", "context": "can you play regular ds games on this unit?", "response": "correct, yes you can"}
{"product_id": "B00CD1FC6G", "context": "What dose the BIOS switch do on the top of the keyboard?", "response": "Light does not turn on only the s key for the game wasd keys that are attached"}
{"product_id": "B00B3PDHBU", "context": "Is it possible to use one set of headphones with an XBox 360, PS3, PS4, and XBox 1?", "response": "Practically, no. however if you really wanted to make it work you could: 1) move all 5 systems close together2) then get an Optical Switch that supports up to 5 inputs and has one optical output (if it exist)3) finally connect the output to the transmitterif your not willing to do the above, then \"no\""}
{"product_id": "B007WPM9GO", "context": "I just want to confirm this works with the regular nintendo 3ds?", "response": "yes it does.  comes with 3 sets of plastic adapters to fit the 3ds or the old ds'."}
{"product_id": "B00FE8WKMO", "context": "does this include the balance board?", "response": "No it does not. You can get the wii u fit with board but not sure the meter comes with. I would shop around to see what yiu can find."}
{"product_id": "B00H8NS1K8", "context": "How well does the microphone pick up noise from the keyboard? I use a blue switch mechanical keyboard.", "response": "Microphone will pick up keystrokes loud enough to be picked up by a nice mic. Don't be a key-smashing barbarian. Great Headset if you don't like bass and you have a small head for it to grip."}
{"product_id": "B007XVTR12", "context": "Are there any other FPS out right now that you might recommend after having played this game? Also, does this work with the XBOX PC controller?", "response": "It depends if you are looking for a single player game or multiplayer. For single player, I would recommend Crysis 3"}
{"product_id": "B00DE2W5XG", "context": "If this is a launch day bundle, is the ps4 a first day ps4 which has problems?", "response": "i didn't have any 1st day problems - once you setup your internet connections, you can update the PS to the latest version and the games would have the autodownload of the latest patches too."}
{"product_id": "B00A378L10", "context": "Will this version of the CM Storm QuickFire TK ever be restocked?", "response": "I'm waiting as well..."}
{"product_id": "B004G5TUJM", "context": "Since this has a USB jack, does it work on PC? Do both wheel and pedals work for PC?", "response": "Yes it works on PC. The gas and brake aren't very accurate though."}
{"product_id": "B005CELN8W", "context": "What else is included on this DVD...possibly Money to Burn?  I can't find the complete list", "response": "There is no complete list on this DVD. Instead you have make enough money in one slot in order to purchase another slot so that's how you will see the other games"}
{"product_id": "B00GOOSORM", "context": "I'm currently stationed in Japan right now but I have an account registered in the NA region. Would I be able to use this to add days to my account?", "response": "Yes.  If you have an NA account this would work."}
{"product_id": "B004NRN5EO", "context": "Does this come with the DLC?", "response": "no, i don´t recommend, piece of junk; go ahead and buy \"the last of us\"... Amazing Game!"}
{"product_id": "B00I4A751U", "context": "can i play this on my ps3 in the usa", "response": "This item is region free and will have no issues being played on any Playstation 3 system."}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "The stand has one in and one out"}
{"product_id": "B00CMQTVK0", "context": "What games come with the Day One Edition?", "response": "Sadly, none. But there are new bundles out now that offering the xbox one with games."}
{"product_id": "B00GJXMRX0", "context": "can i download it again if i erase it", "response": "The game requires you to activate on Uplay, so no matter where you purchased it (Amazon, steam, etc) once it's activated on Uplay, you will always have access to the game to re-download it as needed."}
{"product_id": "B0041RR0TW", "context": "does it work with windows 8", "response": "it worked in win7 but stop working for win 8"}
{"product_id": "B00C2B355W", "context": "Does the PS4 allow 7.1 through PS4 dashboard audio out sound settings or does it limit the output to 5.1?", "response": "Yes I believe allows 7.1 and I have the same headphones and it works really well. I hope this helps"}
{"product_id": "B00CD1FC6G", "context": "Are the keys raised? I'm asking because it looks like it's very easy to clean if the keys aren't inside something.", "response": "They are raised. It also comes with a tool that you can clip onto the keys and remove them which makes cleaning easier."}
{"product_id": "B003VUO6LU", "context": "I wana play ps1 and 2 games can i", "response": "My son says yes, he is playing a PlayStation 2 game even as I type.  Hope this was helpful."}
{"product_id": "B006NU6HAS", "context": "can this be used on fs2004?", "response": "No, FSX only, sorry. It is an awesome plane though and would worth picking up FSX just to get the NGX."}
{"product_id": "B007C3E5WM", "context": "How many buttons/clickers does this one have? I need at least 3 for Elder Scrolls Online. Thanks in advance!", "response": "it has two side buttons for your thumb and the scroller when pushed down is a button."}
{"product_id": "B0001BR9Q6", "context": "Will it plqy on Window 7?", "response": "It should. After I Installed the cd, I had to download a file. It only took a few seconds to get it and install."}
