{"product_id": "B001AH8YSW", "context": "at launch game.    box pops saying I must be administrator to play first time. I am the administrator. Any help would be appreciated I am running windows 8", "response": "I agree with Donna. The ONLY way I could make this error go away was with the 1.5 patch. Just look for it in Google, download, and you'll be fine"}
{"product_id": "B002TLTBN0", "context": "is this controller wireless", "response": "Technically it is. But you must have a wiimote so you can attach it  into it , it's very useful if you got the wiiU and want to play wii games on it"}
{"product_id": "B003Y5AHPG", "context": "Will this model play Castevania 3?", "response": "Some guy on You Tube said that Castlevania 3 will not play on the Retron 3. Not quite sure, don't have a physicalcopy of it to find out."}
{"product_id": "B00HLT0YT0", "context": "It sucks having to wait until the 8th, but it releases tomorrow, and i paid for 1 day shipping.  So I shouldn't have to wait until Thursday.  Right???", "response": "I don't know what's up, but I'm going to Gamestop tomorrow, and if they have an extra, and this hasn't shipped yet, I'm canceling my order."}
{"product_id": "B000SOYG8U", "context": "is it about the clone wars pleace answere", "response": "No, it's about the fourth movie \" a new hope \""}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "The other plugs into the front center of the mouse directly center and below the scroll wheel.  The batteries are rechargeable in the mouse, just like the keyboard."}
{"product_id": "B0000CNUUP", "context": "If I don't want to install through the dvd, can I just redeem the code on steam?", "response": "No the boxed copy of Morrowind has no CD key to enter to redeem."}
{"product_id": "B004SJFJUA", "context": "Is the base necisary? Or does the battery pak, once installed, just charge when the 3DS is plugged into the 3DS charger?", "response": "You need the base AND your DS charging cord. The new battery attachment is installed onto your DS and that need to be placed on the base. Then you use your existing DS charger to plug into the base."}
{"product_id": "B004ASOLLM", "context": "Does it come with the charger?", "response": "No it does not     mine didnt"}
{"product_id": "B00C710AT6", "context": "Can you play it on windows 8 a gateway computer", "response": "Yes but if you're computer has the requirements needed"}
{"product_id": "B003Q9RGRW", "context": "can I use the pad with Netflix or Pandora or internet explorer? as if it was a pc keyboard?", "response": "It works with the search function on Netflix and as a keyboard for IE but I'm not sure about Pandora."}
{"product_id": "B00CX9L30W", "context": "Is the collectors edition worth the extra $20?  Does the helm exp bonus work whenever you want to create a new job or is it only good for a 1-time use?", "response": "Not really. Wait for a discount.  I get mine for 24 $. Its for every character you ever create."}
{"product_id": "B002Q4U5DK", "context": "is the mouse small?", "response": "Personally I like this mouse a lot! It's larger then I thought it would be but not too large at the same time."}
{"product_id": "B008SBZF2Q", "context": "Does this character work with WII U?", "response": "Sorry I don't know as we have Xbox, and my son usually only plays with them on the ipad version.  The info at the very top of the page for the item (under the name) states: Platform: PlayStation, Xbox"}
{"product_id": "B0047ERZ7Q", "context": "how many megapixels.. if any...??", "response": "megapixels are an over rated spec . Camera manual states 0.3 megapixels . The psp is a versatile media player and the camera is a nice upgrade ."}
{"product_id": "B00CWFUHT0", "context": "Does it come with a HDMI cable", "response": "No it does not."}
{"product_id": "B00F27JNGS", "context": "Will the Japan model have an update where it will work with NA accounts once the PS TV releases in the west?", "response": "I have no idea bro. I would think that it would considering all the ps vita's run the same firmware and that u need a eu, jp, us account to get those regions games.. I'll know in December when the ps TV comes out"}
{"product_id": "B009GTV5HS", "context": "is that work for mac (OSX system)?", "response": "No OSX software for the mouse. Still able use as plug and play. I would assume that the special hat button will not work without software."}
{"product_id": "B001AATQ0Y", "context": "does this work with ps2 DDR pad?", "response": "No It Doesn't. It does not work."}
{"product_id": "B00CHGYUE2", "context": "Does this game come as disk media or is it a game case with an online download code inside?", "response": "It's a game case with the online download code inside. Hope this helps!"}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "Of course, a game fit for all ages with challenges that will not only reel in the the oldies, but even the young generation will be able to have fun playing through the richly designed levels."}
{"product_id": "B00BBUCCKO", "context": "Clarification of previous question.   I am actually interested in programming macro keys at home, then bringing to work.  Are macros saved?", "response": "Yes. Macros are modified via the software (or use of the M1-3 and MR keys) and saved to the internal memory."}
{"product_id": "B009UCGVZC", "context": "Will the Skylanders giants work on the existing original power platform that came with our Skylanders game? Or do we have to purchase a larger one?", "response": "If you have a skylanders spyro game portal only series 1 characters work on it. If you have a skylanders giants portal all Giants characters, plus any new series2 plus all series 1characters will work on it."}
{"product_id": "B008IYCVK2", "context": "If this is just a game code for steam, does that mean it can be played cross-platform on PC and Mac?", "response": "no, no mac as far as I know but its a great game"}
{"product_id": "B00A878J5I", "context": "Will the game pad fit in the dock station if you have a silicone cover on it and does it charge ok with it on it.", "response": "Ya it fits and charges great. I got 1 thinking the same and gave it a shot and turned out great i love it"}
{"product_id": "B000I10PY2", "context": "Does this come with a charger?", "response": "Yes, but always ask the seller to confirm this."}
{"product_id": "B0007TJ7TE", "context": "will this keyboard work with windows 8 or only 7", "response": "i'm not sure about window 8 but i don't recommend getting this product it is poorly made"}
{"product_id": "B000BIZR72", "context": "does it work on 3ds?", "response": "I can confirm that it does work"}
{"product_id": "B00A1Y2STQ", "context": "Does the keyboard light turn off when the computer goes to sleep?", "response": "No it does not."}
{"product_id": "B0050SYR74", "context": "Can it work with pc?", "response": "Yes, it does, you can hook it up with the standard red & white typical cables or if your PC has optical connection it would be even better."}
{"product_id": "B0017TFLBQ", "context": "will this work for windows 8", "response": "Yes, at least my implementation runs fine in windows 8 x64 (and 7 x64) LAN connection games seem more reliable in windows 8."}
{"product_id": "B0076HD2W8", "context": "Where do I find the drivers for this adapter?", "response": "Look in the description of the seller. One of the buyers had the link. If you cannot find it, search YouTube for the drivers. I apologize for not being able to send you the link directly."}
{"product_id": "B0098EVZZ8", "context": "will these work with the Wii game", "response": "Will they work with the ipad"}
{"product_id": "B00B23MO9Y", "context": "If I buy this disc, will I code to add it to my account? Will I get it instant or have to wait?", "response": "You will have to register the code on the manual with your account online and it should be instant you just have to wait for how ever long it takes to install and update the game."}
{"product_id": "B002I0HJG8", "context": "few records come from? to buy the game is installed with your disks and then I guess updates and patches are downloaded ?", "response": "yes, you can acutally download the game from the website. but if you buy the actual game you get perks like mounts and stuff."}
{"product_id": "B0009VXBAQ", "context": "Will this version work with the wii fit?", "response": "Yes as long the title say wiiIf the title says wii U it won't work."}
{"product_id": "B00006B84X", "context": "where can I download an operating manual", "response": "Here are some instructions on downloading and troubleshooting: ftp://ftp.chproducts.com/pub/pdf/Fighterstick%20USB.pdf  The Control Manager download that lets you customize and set up your Flightstick is here:http://www.chproducts.com/Flightstick-Pro-v13-d-723.html      Don't think there was a written manual?"}
{"product_id": "B008EZ3PBY", "context": "Does the xbox reset if you switch your tv to cable or something else with these aftermarket adapters. Do you have that problem with this one?", "response": "I had issues and ended up buying the Microsoft one."}
{"product_id": "B00ATF5YZM", "context": "can i buy and download this if i live in Australia??", "response": "Yes buy the game and then activate the key in steam yo download"}
{"product_id": "B009DYOPK0", "context": "How big is this mouse? Full grip? I have big hands and don't like having to use claw grip when mice are too small.", "response": "This is a pretty much a full grip mouse, you can claw it if you like but don't have to and can still hit all the buttons on it. Deferentially bigger than any stock mouse that comes with a PC or Laptop."}
{"product_id": "B008TP1OKI", "context": "Can i download my Xbox deals and Games with Gold Deals from the marketplace in this hardrive?", "response": "Yes you can download any games that are made for the xbox 360. You can't download any games that are for the 1st original xbox. They will not play on the xbox 360 with this hard drive."}
{"product_id": "B00HHUSNPU", "context": "Will I be able to keep this case on while using this charging kit?", "response": "You sure will not need to remove the cases to charge the controllers. Enjoy :)"}
{"product_id": "B009Q8M816", "context": "CAN YOU CHANGE MODS", "response": "There are 17 modes you can change."}
{"product_id": "B00B15EXJC", "context": "Dead zones? Does it have dead zone areas for the joysticks?", "response": "There is a reset button below the select and start buttons. If you push that in that should reset the joysticks, I had that happen to me once and that's how I got it fixed."}
{"product_id": "B00F27JE1C", "context": "What does this come with?", "response": "It comes Ac Adapter and that's it."}
{"product_id": "B00CMQTVK0", "context": "Are these Day One Edition just manufactured or are they from Nov. ?", "response": "You know what I've been thinking the same thing, either it's from the release or maybey the owner of the xbox one had a problem, sent it to microsoft and they got it fixed but I'm not sure and I don't care cause like I said it really works great for me $)"}
{"product_id": "B00G0OYHCW", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "To be honest I don't know I don't play that long. I bought the nyko pro controller and I could always use that if the game pad ran out. It's a great controller and 20 bucks"}
{"product_id": "B00H8NS1K8", "context": "How well does the microphone pick up noise from the keyboard? I use a blue switch mechanical keyboard.", "response": "I got no complaints about my keyboard clicks. I have a mechenical keyboard from razor it's a black widow"}
{"product_id": "B008VQ68C4", "context": "Is it possible to use with phones", "response": "No, it only has a USB plug."}
{"product_id": "B005CELN8W", "context": "Do you make this for Mac, or only PC?", "response": "This game is make for both computers"}
{"product_id": "B00FFL0T46", "context": "I wanted to purchase this game but I do have a Steam account will this game will be able to be played through Steam?", "response": "No, it sadly can't be played through Steam as the DRM says it is for TellTale Games Account. However, Steam is now having a 50% sale of that game. Go get it right now! It's only $12.49! ;)"}
{"product_id": "B00HWMP0OU", "context": "Will this work on 2DS?", "response": "all 3DS games run on the 2DS as do DS games"}
{"product_id": "B00EPZ8POY", "context": "will this work on ntsc ps3", "response": "Yes, it's a fret game"}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "Yes it will run on XP but only with service pack 3."}
{"product_id": "B0002FGFHU", "context": "is this game compatible to 8.1 window pc", "response": "Yes, it is compatible with the newest Windows 8."}
{"product_id": "B00519C7JC", "context": "How busy are the servers today?", "response": "Sorry I'm out of town."}
{"product_id": "B00GOOSORM", "context": "If I use a 60 Day Time Card, does it countdown based on my time played or just 60 consecutive calendar days?", "response": "I really don't know.... I gave this card as a gift to my niece."}
{"product_id": "B00F9RGFEY", "context": "I have two game systems. PS3 and PS4. This team works for both?", "response": "it comes with the cables to connect to both but you will have to switch them between systems. the headband is also VERY brittle (cracked on me in only a couple weeks of gentle use)"}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "Yes! It comes with pc cables xbox cable and I believe ps3 cables idk how those work but for xbox and pc it comes with all the cables for ingame talk and sound"}
{"product_id": "B00008J7NZ", "context": "Do these copies contain version 1.0 or the updated ones that deleted all of the glitches.", "response": "Sorry, I am not sure, but my son hasn't come across any glitches since he's played it."}
{"product_id": "B007TMFD7C", "context": "Obviously for adults but what age would you recommend in youth?", "response": "10 and up. Like another user said. It really depends on how much they like real life simulations."}
{"product_id": "B0011E4J7O", "context": "How long is the cord?", "response": "My son says it is about 48\" long."}
{"product_id": "B007CM0K86", "context": "Can you play the girl as the main character? or do you have to play the man?", "response": "Joel is the main character that you have to play but there comes a point in the storyline where you play as Ellie. You grow to love both of them though."}
{"product_id": "B00B5QLS4A", "context": "Is this mouse comfortable with large hands, i currently have a g600 and it just isn't comfortable for my meaty hands anymore....", "response": "yeah, this mouse is perfect for big hands."}
{"product_id": "B00002SANH", "context": "I cannot get the game to work on my lap top operates windows 7 64 bit pc", "response": "Do a quick search on youtube.   Search \"oregon trail 2 64 bit\".  I had the exact same problem. It references windows 7 which you have but I got it to work on windows 8."}
{"product_id": "B000IBQLOU", "context": "How does this stand up to jumping? I tend to be a jumper when I'm playing, and i was wondering if this is going to slip?", "response": "If you have tile or hardwood floors it doesn't slip! It kind of has a non slip grip at the bottom to help."}
{"product_id": "B00BZOBE78", "context": "When I look at the system requirements, it asks for 8 gb of hard drive space, is that for both the platform and expansion or just for the expansion?", "response": "I have all the expansions and it works fine with 8gb of memory.   I hope that answers your question, I am a little unsure what you were asking."}
{"product_id": "B009Q8PP16", "context": "Does the controller work with the rechargable battery packs ? i have a charging station with battery pack and i put my controller on it to charge it", "response": "Yes it does, it drains a little more rapidly but its like an hour difference to normal batterys. But it does work."}
{"product_id": "B00CBQO930", "context": "Weight and Size. Is it light and cheap or does it have a nice weight? Is the size big enough to be comfortable for people with large hands?", "response": "It's heavier than the standard mice that come with most computers, but I wouldn't necessarily call it 'heavy.'  It IS large and ideal for people with large hands."}
{"product_id": "B009DZTXR4", "context": "if i have regular version then buy this version will it still work", "response": "Yes.  If you played the 'Games With Gold' version, this game is good to have because you get the whole regular game on disc so you never have to download it again if something happened to your console, plus all of the DLC, basically for the price of the DLC alone."}
{"product_id": "B00ERDGMSA", "context": "Does this come with all the DLC if you buy the Game of the Year Edition of Borderlands for Xbox 360 or PC?", "response": "On PC it came with the 11 extra levels, the 2 additional characters and 3 or 4 of the extra mission sets. It does not come with all the skin DLC or some of the newer mission sets, like Son of Crawmerax."}
{"product_id": "B00BXONG7G", "context": "can i use this game in windows 8.1", "response": "yes - and today, 12/19/14 - its on sale at Gamestop for $4.99 download."}
{"product_id": "B00BGAA29M", "context": "What type of game is this?  Is there strategy involved?", "response": "I'd consider it a platformer, like Rayman or Ratchet and Clank. It feels retro and yes there's strategy involved. You may have to think."}
{"product_id": "B00A9HA52W", "context": "Anyone else having trouble getting the customizer software to recognize the controller?", "response": "Thought I'd give an update it is now day 3 of the response wait I have sent more messages, but I have received no answers. I will attempt to speak to a live person over the telephone on the morrow."}
{"product_id": "B00EOUL7T0", "context": "can i control game volume?", "response": "nope, only a mute button and a chat volume button"}
{"product_id": "B00HWMP0OU", "context": "Does this work on the Nintendo DS XL?", "response": "yes it will work on the DS XL"}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "yes I have it on mine"}
{"product_id": "B003ZSP0WW", "context": "I just got 2. I turned them on and their power buttons just blink - they don't connect. I tried hitting the console power button, too. What do I do??", "response": "You have to link them by pushing the sync button by the connector port on the controller and also maybe pushing a button on the xbox, I'm not positive but you only do it once."}
{"product_id": "B00DNHLFQA", "context": "Will this download work on Windows XP?", "response": "no because the soundtrack does not work on anything through origin poor support still has not solved my problem, and teh alpha dont exist."}
{"product_id": "B00D6PTMB4", "context": "When I am playing with my friend (on the same console but with 2 cables) can I play left handed while they play right?", "response": "Yes you can just change your settings before playing on multiplayer as long as you have it on the same console and 2 cables you should be good to go"}
{"product_id": "B00005LBHM", "context": "Can you play this on the Gameboy Advance sp?", "response": "yes you can, I play it on mine all the time."}
{"product_id": "B0029M6VKA", "context": "Does it work with Windows 7 and Windows 8?", "response": "Windows 7 : Yes, perfectly.8 : I dont know."}
{"product_id": "B002JVX5V4", "context": "Can you play on line with friends", "response": "No, I cannot find a way to do this on Scrabble Plus.  However, it has 4 different Scrabble games, some which provide dual boards to use with an opponent in the same room."}
{"product_id": "B000ZKA0J6", "context": "does this version work on a mac? it seems like you can only shop for this version of the game.  I have mavericks, will this work on my macbook pro", "response": "Yes sir, it sure does.  As long as your system setting are beyond that of the requirements you can play this on your Mac.  Check out the details here if you're interested:  https://us.battle.net/support/en/article/starcraft-ii-system-requirements"}
{"product_id": "B003V4AK8E", "context": "Where can I buy a replacement usb receiver for the power A pro elite controller?", "response": "GameStop or a game store"}
{"product_id": "B00G0OYHCW", "context": "Does it come with a hard copy of the games or download codes? I was looking to get the used version but do not want to risk getting a used code", "response": "I had received a new nintendo no copies of the codes. Honestly I wish I could help you out more"}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Yes. Xp, vista, 7. Runs on my laptop with win 8."}
{"product_id": "B00JM3R6M6", "context": "Can you play the Tomodachi Life on a regular Nintendo DS?", "response": "Nope, its for Nintendo 3DS and 2DS. It won't work on the older Nintendo DS or DS Lite."}
{"product_id": "B00BMFIXZG", "context": "do you have to have internet", "response": "No you do not."}
{"product_id": "B00GZ1H07Y", "context": "Does this have the Star Wars and 3D tables?", "response": "No, it doesn't. Those are on the Zen Pinball 2 game."}
{"product_id": "B006LVZEN0", "context": "Is it good for Large and Wide hands?", "response": "The palm grip can be adjusted a few millimeters at a time so that the mouse is about 11 cm long to a maximum of 12.5 cm.  The width, however, isn't something you can customize.  If your hands are longer, then you may enjoy this mouse, but otherwise you may want to look elsewhere."}
{"product_id": "B009DYCTY4", "context": "Does it come with controllers?", "response": "Yes, it comes with one controller"}
{"product_id": "B00DBDPOZ4", "context": "Can it charge when Xbox One is turned off?", "response": "Yes it will charge due to your xbox one never turning fully off (sleep mode). Now if you are one of the ppl like me that unplug the power cable after use then NO it won't, i don't like my system connected in sleep mode all the time."}
{"product_id": "B008YA9BVC", "context": "does the headset work on the Wii? or does it work on just the Wii u?", "response": "Just the Wii U. It uses a standard 1/8\" stereo plug with mic that plugs into the headphone jack on the Wii U GamePad. There is nowhere on the original Wii to plug it in."}
{"product_id": "B009Q8PP16", "context": "is it compatible with black ops 2 and how would you program it to the game if it is possible", "response": "Yeah its pretty much compatible with anygame you just have to play with it, it comes with an instruction sheet on how to use it so that should help"}
{"product_id": "B00G6YJ60E", "context": "Does the PC version of the game support manual saves or is it checkpoint only?", "response": "Well it saves automatically ALL THE TIME so you always load right where you left off but yes it does also have manual saves I believe."}
{"product_id": "B00CPS59CE", "context": "Does this come with the bluetooth wireless chat adapter as shown in the photo?", "response": "If you are referring to the part that attaches to the xbox controller, then yes. Enjoy."}
{"product_id": "B004L6C6BK", "context": "Is this the 2013 version because the review pictures show it as a 2011 version?", "response": "It is indeed the 2013 version."}
{"product_id": "B00DGZDFO4", "context": "not opening and im trying to get help but NOBODY is helping me..I have windows 8????", "response": "Also if you don't have a 64 bit OS you may be in trouble, not 100% sure but I think this was one of the few games to require 64 bit"}
{"product_id": "B000ND3XXA", "context": "does it work with mac?", "response": "Yes. I bought it to use with a Mac and a GameCube controller and it worked as soon as I plugged it in. I was using it to play Dusy: An Elusian Tail, which is designed for an Xbox controller so the button mapping was off but I think that's a consequence of the game."}
{"product_id": "B00I4C2EKA", "context": "What is steam client?", "response": "Steam is a game client. It basically downloads your games and allows you to play them. Look it up on Google. Its very userfriendly."}
{"product_id": "B005F1ZUU4", "context": "is the one that can work with the Xbox One as well??", "response": "no, sadly it will not. the xbox one uses a whole new wireless just for its controllers and microsoft has yet to release a working receiver for those. believe me I myself am waiting and hoping they will. currently the only way to use xbox one controllers on a PC is wired"}
{"product_id": "B000BD1AFA", "context": "is this a downloadable thing or a disc??", "response": "This is a disc but there is downloadable out there some where"}
{"product_id": "B00HLT0YT0", "context": "Can these play Japanese games? Is it region locked at all?", "response": "No the ps vita is not region locked. Japanese games should work fine"}
{"product_id": "B00FB45YFQ", "context": "why wont the LED lights work? and/or the software show a setting for it?", "response": "The software have a setting for the leds."}
{"product_id": "B00GJ2HZ7E", "context": "Is there gamepad support?", "response": "Yes, but it has plenty of bugs on Generations. I had to buy the Xbox controller for PC. When using a generic controller, Sonic strifes to the left uncontrollably."}
{"product_id": "B00BGHUS58", "context": "Is the game worth it to buy it new, or is used a better deal? Also, does it have any istallation issues?", "response": "YES, IT IS A FANTASIC GAME ."}
{"product_id": "B00B1OK3TC", "context": "does it work on xbox", "response": "Yes it dose butt at times dose work right on computer"}
{"product_id": "B0029LJIFG", "context": "if I make a purchase today, could you email code to me?", "response": "This one doesn't send you a code, it mails it within a week."}
{"product_id": "B009AFLXZM", "context": "I was thinking of using this microphone for something else. What type or size of plug in does it have?", "response": "I am not sure. I bought these for my grandsons to use with their Wii system. I am sorry, can't answer your question."}
{"product_id": "B004C34D2M", "context": "does this Wii controller come with motion plus ?", "response": "No, It is just a standard remote."}
{"product_id": "B000VLNXRU", "context": "Will the GPS display on the pro flight instrument panel? I dont see it as part of the 12 instruments.", "response": "Pro flight instrument is used to show aviation instrument info.. if you want to show a map with gps location you can export out and show on a monitor"}
{"product_id": "B007A7UJ4S", "context": "Do this game have English Voices?", "response": "Yes. It is set to English by default. If you like you can change it to Japanese at any time."}
{"product_id": "B00B70WKUK", "context": "can i redeem this on steam", "response": "That is the only way you can play this game"}
{"product_id": "B00DLRLDBO", "context": "Does the headset acutally connect to an Xbox 360 controller? For chat?", "response": "yes but it didn't not last long my be a month"}
{"product_id": "B009CEM332", "context": "Is this playable with just a keyboard?", "response": "It is possible to play on the keyboard, but the control scheme isn't all that great so I would advice the use of a controller."}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "I have had the play and charge for Xbox 360 and up graded to the nyko power kit when I got my xbox one.  The nyko kit is way better.  Controllers are always charged and ready to go.  Really like the charging kit from nyko"}
{"product_id": "B00DJYK8XS", "context": "Dance Dance Rev games will \"boo\" and stop the game if you do badly. Does Zumba travel through the whole song regardless of how Awful you are doing?", "response": "The better you do, the more background dancers come out to join the party in Zumba! If you aren't doing so well or can't keep up on some of the moves, the entire song will keep playing but the background dancers go away."}
{"product_id": "B007C3E5WM", "context": "Is the light bright and should I buy this product?", "response": "The light is bright but I do not find it distracting. I think this is one of the most responsive and comfortable mice I've owned. I like it better than a couple of $100+ mice I've owned. Terrific bang for buck and my favorite mouse so far."}
{"product_id": "B009LGO88E", "context": "I have the Newest 3DS XL with the new tiny right joystick that seems useless at its size. Will this device work as a supplement for that?", "response": "No it will not as it won't fit properly on the new hardware. That \"c stick\" nub and the extra shoulder buttons takes the place of the Circle Pad Pro attachment and alleviate the need for it."}
{"product_id": "B00005B8G3", "context": "Are there games that are preloaded on this unit, or do you have to buy them seperately?", "response": "The games must be bought separately & there is also a lighting problem with most of these models where you can barely see the screen."}
{"product_id": "B00DC7G2W8", "context": "I assume that we're going to get the Club Nintendo download code for one free copy of either SMB U, Pikmin, Zelda Wind Waker or Wii Party U, correct?", "response": "Yes, you must register Mario Kart 8 between 5/30/14 (12:00a.m. ET) and 7/31/14 (11:59 p.m. PT) on Club Nintendo and you'll receive a free download code for the digital version of one of four free games."}
{"product_id": "B002I0K3CK", "context": "Can I use this game with the GamePad or i need another controller?", "response": "For 1 player, game pad. For 1 or more, ALL players need a wii controller."}
{"product_id": "B00CXCCH1I", "context": "Can you play tag team? or do you have to fight against your local player 2?", "response": "There is no tag team, its only a 1v1 scenario but there is online as well"}
{"product_id": "B0053BCO00", "context": "will this work in the 3dsxl", "response": "Yes, any 3ds game currently in production will work with the 3dsxl."}
{"product_id": "B00004XRBB", "context": "Can u fly the Junkers JU 87-B STUKA", "response": "No, you can only fly the fighter planes and jet."}
{"product_id": "B0057S9SYY", "context": "do these headsets drop the sound every few seconds like the turtle beach x32's??", "response": "No they worked really great for me but friends said I would cut out every once in a while for then but other then that I've had no issues"}
{"product_id": "B007SO6USW", "context": "Does it work with the ps3 slim?", "response": "Nope its hard to get the controllers to hook up to the charging stand. The charging stand keeps pushing the controllers out and won't let it charge so I don't even use it but the charge stand does hook up to the slim and lights up"}
{"product_id": "B003Q55Y5C", "context": "Does the online still work in 2014?", "response": "In short - no.  There are still a few private servers scattered about here and there but it's officially dead in the water."}
{"product_id": "B002Q4U5DK", "context": "which version is this", "response": "This is not the latest version of this mouse but it is fantastic. I would recommend it as a gaming mouse without hesitation."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "Yes. I have Windows 7 and the game works great, and is a great game too."}
{"product_id": "B00HWMP0OU", "context": "Could a child who cannot read yet play this game? Or would it just be frustrating?", "response": "it makes it easier if the child can read but my 3 year old grand daughter plays the game and loves it. Some of the characters talk, some do not, but she enjoys the wardrobe changes and the easier quests. I hope this helps :)"}
{"product_id": "B000HZFCT2", "context": "Is this compatable with windows 7 ?", "response": "Yes, it will also run on windows 8 and 8.1 if you ever upgrade."}
{"product_id": "B001DNGCN2", "context": "does this work with the ps3 fat boyalso does actually works there are so many mix reviews about this product", "response": "yes its made and works on my fat 80gb ps3"}
{"product_id": "B00A378L4C", "context": "are the leds very bright?", "response": "Very bright, they can be dimmed however."}
{"product_id": "B00BGA9X9W", "context": "Does it work for pc?", "response": "Very comfortable ps4 controller. I am glad to get it. I like it too much."}
{"product_id": "B00CERXJNW", "context": "Is the wrist rest removable?", "response": "Absolutely! It is removable:)"}
{"product_id": "B000GCJ6MK", "context": "Is this an expansion kit, or is the full FSX installation? This price on this way cheaper than the Gold and Standark packages I see for sale here on A", "response": "Full installation; but, this version is for use on XP machines ---> doesn't work on modern Windoze boxes --- need version specific to -7 or -8 and/or -64 bit, if using those machines.  Install this version on newer machines and computer will respond with, \"Are you talking to me?\""}
{"product_id": "B00005NIMA", "context": "Is this a USB stick?", "response": "Yes it is.. got it for my son he loves it and it works great.. I did some looking around best price I could find was on amazon.."}
{"product_id": "B0029M6VKA", "context": "Does it work with WOWP?", "response": "I am not familiar with WOWP but, I can tell you that it works independent of any software that you may be using."}
{"product_id": "B0087ZMAUS", "context": "How good is the mic quality compared to the PC 360's?", "response": "Extremely high quality all together.  Highly recommended"}
{"product_id": "B00004VUFG", "context": "I have a formula force set I bought this for my autistic grandson Im not very familar with tech it doesn't have the software how do I get it", "response": "Often, when you load a new game it will automatically link to the controller or ask what controller you have in the settings. If you need the specific drivers they should be at Logitech's web site. Hope this helps."}
{"product_id": "B004N7IIQ4", "context": "Does it work with the PlayStation 4", "response": "As far as I know it should. Check the astro website though."}
{"product_id": "B008GEH9HO", "context": "Can you turn the connectivity off, similar to putting a phone in \"airplane mode\"?", "response": "You can turn off the WiFi connectivity if that's what you mean. There's a button on the side."}
{"product_id": "B00IAVDPSA", "context": "Does this controller connect to a Windows PC (like the Xbox 360 media remote)?", "response": "No, this works using IR and only communicates with Xbox One right now"}
{"product_id": "B0050SZ0SY", "context": "Does it work with windows 8?", "response": "Do not know running on Win 7"}
{"product_id": "B00CWFUHT0", "context": "does it come with its original box?", "response": "Mine did, I don't know if this was a retailer or private owner."}
{"product_id": "B00JFPO7JG", "context": "Is it online only", "response": "You can buy the CD-ROM from Amazon."}
{"product_id": "B00EZKNT18", "context": "I see that it works for PC but will it work for a Mac computer?", "response": "I assme it should work for Mac computers. I'm sure the controller's drivers will automatically install once you plug it into the USB port on your Mac."}
{"product_id": "B009ZDPYKO", "context": "Are the giant figures compatable with the origional adventure packs?", "response": "the giants will not work in Spryro's Advanture.  If that's what you are asking."}
{"product_id": "B00E447L8C", "context": "I ordered this item and does not fit my iphone 5? Am I missing something?If not I would like to return.", "response": "You plug your lightning to usb cable just like you would with a wall charger. It should work just fine. To charge the moon stone's battery you use the provided micro-usb to USB charger to plug into your wall"}
{"product_id": "B00GJXMRX0", "context": "has anyone else had there pc completely shut down while playing assissins creed 4? mine does after about 25min. it has happened 5 times so far.", "response": "nope, but I play from a boot camped imac through a thunderbolt drive. I even enabled the whole 60fps hack, it works fine but the system does get hot. Even by itself windows runs hotter on a boot camp set up than normal OS does."}
{"product_id": "B00ATHFLZS", "context": "does it work for minecraft", "response": "you can hot-key the 2 thumb buttons easily, but the \"double-click\" button next to the LMB is detected as the LMB in all of the games I have used it with (Planetside 2, Crysis 3, etc.)"}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "Yes, the deluxe version includes 5 free federal e-files.  It also includes one state program download, but there is a state e-file charge of $19.95 per return.  All this info is shown on the back of the box."}
{"product_id": "B00EZPCWWA", "context": "Do you need wifi to operate the ds", "response": "To do online functions, yes, otherwise you can play w/o wifi"}
{"product_id": "B003ZSN600", "context": "Is this original one?", "response": "Yes it is. It works perfectly on Xbox 360 and on PC"}
{"product_id": "B00C2B2Y9A", "context": "How long does the battery last?", "response": "Sonething like 10 hours after fully recharged"}
{"product_id": "B00GANWVJE", "context": "what is the age cut off? My son is 5 & really wants a Zelda game. I jus want to make sure he is able to play the game on his own & not having to watch dad play it to enjoy it.", "response": "I think that it's fine for him, besides, even I sometimes get stuck on something in the game but I will still have a lot of fun, the characters are well animated and colorfull as we'll."}
{"product_id": "B002I0J4VQ", "context": "can you play with newer version", "response": "If I'm understanding the question correctly I think your asking about which games are playable in this system? If so, this system only plays Playstation 3 games. It will not play Playstation 1, Playstation 2 or Playstation 4 games. It will however play all Playstation 3 games"}
{"product_id": "B00D5WDI3G", "context": "Can I install the software in several computers ?", "response": "I am not sure because I only have one PC but I do know where you can find the answer.  You can email Chess King support.  The email address:  support@chess-king.comI hope that helps!Mike :-)"}
{"product_id": "B000WCCURW", "context": "Does this game play on windows 8?", "response": "Yes. Currently I am playing it on Windows 8 in XP service pack 3 mode (right click on program launch file and go to 'Compatibility' tab)."}
{"product_id": "B00ANHBJBY", "context": "Controller only works when plugged in. Is there a color that indicates when the thing is fully charged? Or did I just receive a bad unit?", "response": "A red light appears when it's charging.when it's done it goes away.Your controller should be able to work wireless if it doesn't then it's defective."}
{"product_id": "B00GU4F4OM", "context": "Does this mouse remember your profile settings or more importantly remember your current dpi settings when starting up the computer after a shutdown?", "response": "yes, the profiles are saved on the hard drive."}
{"product_id": "B00EZKNT18", "context": "Will this work on a Windows PC or not?", "response": "My understanding is yes but of course you have ti have an PlayStation or Xbox hooked up of course.  I will ask my Grandson if I get better info than that if it will help,"}
{"product_id": "B00GJ2HZ7E", "context": "Is there gamepad support?", "response": "Yes I am able to play with the 360 gamepad."}
{"product_id": "B009Q8M816", "context": "does it work for call of duty ghosts", "response": "Absolutely.  That's what I used it on for months.  (I have Xbox one now)"}
{"product_id": "B002P35JMO", "context": "Does this adapter plug into the controller or the actual Xbox 360? The port in the photo looks different then the port on our wireless controller?", "response": "It does work by putting it directly into the xbox360, if u use the HDMI port from the Xbox to the TV set"}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "Works fine on Windows 7"}
{"product_id": "B005T3GSBS", "context": "does this game have English subtitles or is it only in Japanese", "response": "It is in English subtitles :)"}
{"product_id": "B006POYBUA", "context": "Does it works with the white Xbox 360 (non slim)?", "response": "No it did not work on mines I had to buy something different."}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "Yes, the code will be send directly to your email"}
{"product_id": "B0002XJBGE", "context": "does the controller sqaure sticks affect gameplay", "response": "Only used it a couple times. It's not compatible with all my games. And that was over 4 years ago"}
{"product_id": "B008D7F47Q", "context": "can you play it without wifi?", "response": "Yes, you can play the game without a connection to the internet."}
{"product_id": "B00CHYOP80", "context": "are these a usb headset", "response": "Nope, standard 3mm headphone jack."}
{"product_id": "B00AEX81SG", "context": "does this slim design still have wireless internet and bluetooth", "response": "yes it dure does"}
{"product_id": "B002I0H79C", "context": "are people still playing this game as of june 2014?", "response": "Yes there was about 900 people on this morning. It will probably be supported until Gears of War 4 comes out for the XBOX 1 which is unconfirmed but sometimes in 2015. Otherwise you got atleast 2 more years of this game online. Horde is spectacular."}
{"product_id": "B009UCGVZC", "context": "Will the Skylanders giants work on the existing original power platform that came with our Skylanders game? Or do we have to purchase a larger one?", "response": "We never owned the original platform."}
{"product_id": "B00KAI3KW2", "context": "If I get this without the Kinect, can I buy a Kinect and add it on later or am I stuck with the Kinectless version?", "response": "You can buy a Kinect later.  Microsoft will start selling them individually at retail at some point, or you can get one on eBay."}
{"product_id": "B00519C7JC", "context": "What does the \"Standard LTO\" edition come with and what does \"Standard LTO\" mean?", "response": "It's just mean limited time offer. For the extra map package, that includes zombie map Ascension."}
{"product_id": "B007XVTR12", "context": "Can I use this with Macbooks?", "response": "Not sure..but my Grandson plays Call of Duty on WiiU..he says tp check out this website..should answer your question...www.canyourunit.com jope this works..kj"}
{"product_id": "B00DH1KRQQ", "context": "does it comes with its own gamepad software?", "response": "I believe so but buy at your own risk."}
{"product_id": "B00BGD6LMG", "context": "Does this game come with two disc?", "response": "Yes it does come with 2 discs"}
{"product_id": "B004EJ0L8E", "context": "how long is the cord?", "response": "I don't have an exact measurement for you but its long enough for me to be able to walk and get something in my room without taking my headset off. To be fair though, i have a small-ish room"}
{"product_id": "B0018YXM3Y", "context": "Does this game work on windows 7 ?", "response": "Yes, I use it on Windows 7..."}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "Yes, you can play any game with or without the 3D effect, and all the older DS games, and since this is the XL version of the 3DS the DS games are larger too!"}
{"product_id": "B0050SYK44", "context": "Is this game enjoyable to play as a single player game?", "response": "I love playing this game it's fun either way you just upgrade faster in multiplayer"}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Yes.   32 bit only though."}
{"product_id": "B000YQ639M", "context": "does this contain  both the basic game and the add on advanced game", "response": "Yes, it contains Medival 2 total war, and the 4 dlc packs."}
{"product_id": "B007VTVRFA", "context": "i am little confused by all these negetive reviews, can any one confirm if i can play this game offline as on today?", "response": "Yes, you can play offline now. Still plenty of bugs that will likely never be fixed but the game is playable and fun."}
{"product_id": "B000P46NMA", "context": "This game has subtitles in Spanish?", "response": "I don't think so."}
