{"product_id": "B00BGGIWZM", "context": "is the pc/mac version be used for mac and pc, is that what this means? or only the mac version be only for mac", "response": "It can be used for both."}
{"product_id": "B008IYCVK2", "context": "I am playing this, is there any way to save the game state?  I haven't figured it out or, for that matter how to exit gracefully.", "response": "What? Just hit escape and save the game? Then hit exit? I haven't played in a while, so I can't quite remember, but this seems most logical to me."}
{"product_id": "B00C710AQO", "context": "Can this game be played by more than one player, offline. I mean, can my two sons play against each other or as a team offline with two controls?", "response": "if you have two controlers"}
{"product_id": "B003Y5AHPG", "context": "Where are the L & R buttons on the controller?", "response": "I used an snes controller so I don't know where they are on the ones provided are"}
{"product_id": "B007R9PWLY", "context": "I am buying a laptop with a 1 tb hard drive and 8gb solid state. In this configuration is the OS put on the HDD or SSD?", "response": "as far as I remember the OS on the SSD"}
{"product_id": "B00IA2NYT4", "context": "can Ps2 games be palyede in this Ps3", "response": "No, this is the slim version and does not run PS2 games.  The first model of the PS3 will run PS2 games."}
{"product_id": "B00BGAA29M", "context": "Hello. How many players can play?", "response": "1 - 2 players"}
{"product_id": "B0002DKTY2", "context": "is it for windows 8?", "response": "I'm using it with Windows 8."}
{"product_id": "B00CJ7IUI6", "context": "i have regular skyrim i want to know if you buy it will you get to keep your save?", "response": "Absolutely. Your character and progress stay as they are and you can continue through both expansion packs."}
{"product_id": "B00IJQJYHC", "context": "So, this keyboard doesn't have those stands in the back? So is it just FLAT on your desk? Isn't that uncomfortable?", "response": "yes, the keyboard has not stand, that´s correct. It is not uncomfortable because the key already is already slightly beveled.A to high angle is not very good for you wrist.We also use the keyboards :)"}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "I have had no problems with either of my controllers"}
{"product_id": "B00027CXEM", "context": "Free roam? Do you have to be jedi/sith?", "response": "I don't think it's free roam but it is relatively open and the openness is not affected by alignment."}
{"product_id": "B00FATRKWM", "context": "Does the xbox have hdmi on it?", "response": "It does and you can you it with your HDMI TV or computer. I use it to stream movies on my TV. I love my X-Box!"}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "Yes, it does work. I did have some trouble running the analyses and would get an error message, but that may be due to my computer malfunctioning since I was having similar problems with Fritz as well."}
{"product_id": "B005S0KH7I", "context": "What's the difference between this one and the standard G105 that goes for ~$55? Just a logo and green lighting?", "response": "yeah, use a knife to remove the mw3"}
{"product_id": "B0041RR0TW", "context": "Do I have to set the buttons to play games like assassin creed 3 will this controller have already default setting just like consoles style", "response": "The buttons mirror the XBox 360's.  Only the layout resembles Playstation.As such, XInput is recommended for PC games.  I recommend DirectInput mode for emulators."}
{"product_id": "B007XVTR3K", "context": "So do you need an online pass to play it if you buy it used?", "response": "No its not like battle field"}
{"product_id": "B0088MVODO", "context": "is this game region locked? if so to which region?", "response": "It should not be region locked (languages can be changed, etc), but if I were purchasing it, I would only purchase brand new from a vendor on my same continent."}
{"product_id": "B00HGLLRV2", "context": "looking into getting  a ps4 for Christmas I played the first game and really liked it is this game on par or better then the first infamous?", "response": "I think it's just as good, it is pretty cool how you have more options for powers and the storyline isn't bad. It kept me playing non stop just like the original game"}
{"product_id": "B00GV0LR64", "context": "So I'm guessing if the game is designed for higher accuracy WHEN aiming, this isn't going to help much. Is that right?", "response": "It helps with both hip shot and aiming. The red dot helps you acquire target faster which equals higher accuracy"}
{"product_id": "B00005B8G1", "context": "Does this include a charger?", "response": "no this does not come with a charger."}
{"product_id": "B00CPKUV7K", "context": "Why is it rated M?", "response": "There's a reason why it's rated M for mature. It should say on the back on the bix. It's rated M for blood and gore, intense violence, strong language, strong sexual content, and use of drugs. It's has content that's not meant to be seen by little kids, it's a grown-ups game. That's why it's rated M for mature."}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "How is it possible that 2 out of 5 people say it does support 220v is beyond me...If someone could quote the label on the power adapter it would save all of us foreigners a heck of a lot of trouble."}
{"product_id": "B00FLLFJ68", "context": "Does it extend the battery life of the controller?", "response": "I believe it does somewhat"}
{"product_id": "B005FMLZQQ", "context": "Using for Netflix and Hulu, can thus be used to navigate from the dashboard to the apps and control the apps as well?", "response": "Could you please help me?I'd like to use it as a replacement for my controller but can't  get it to work. I got it to control my TV volume only. ..help please!"}
{"product_id": "B00004XRBB", "context": "does it work on Windows 7?", "response": "Yes it does, works on mine. Have fun !!"}
{"product_id": "B001AI7CF2", "context": "Can you combine two (2) extension cables?", "response": "I'm not sure, but I don't see why not.  They are pretty long regardless."}
{"product_id": "B00FEDP968", "context": "Can you use the headset and 5.1  speaker ports at the same time?", "response": "No,  There is a button on the base that will either select Speakers or Headset."}
{"product_id": "B000B6MLTG", "context": "does this cable fit the black slim xbox 360... need help ??", "response": "If the back of your Xbox 360 has a port that looks like the trapezoidal one in this picture (http://www.spainsellers.com/images/Xbox-360-Slim.jpg), then it SHOULD work, but no guarantees. I would suggest an HDMI cable instead of this, if the monitor/screen you're trying to connect to has an HDMI port."}
{"product_id": "B00IRHE892", "context": "Do you think g502 is better than Deathadder Chroma? (I'm playing BF4)", "response": "g502 is better in every way unless you prefer the deathadder shape or slightly lighter weight.  g502 has better sensor (native at every step), build quality, software (if wanted) more buttons, features, and better customer support."}
{"product_id": "B002NILRUY", "context": "I wonder if the black one is just like the pink one ?", "response": "The blue one looks identical"}
{"product_id": "B006NU6HAS", "context": "Does it come with any liveries other than the default shown on the package?", "response": "Yes, it comes with some other like Egyptair and DeltaAorlines"}
{"product_id": "B00EM5UFF4", "context": "Can I play the Xbox 360 version on the Xbox One?", "response": "Sorry....No.  Unfortuneately Xbox One and Xbox 360 game disks are not compatible."}
{"product_id": "B001TOQ8X4", "context": "I'm confused - what' GW1, GW2 and the deluxe versions. Can I play with GW2 or do I need other things to play?", "response": "You only need GW2 to play GW2. GW1 is another and very different game."}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "You will receive codes via eMail and you will be able to redeem those codes in PlayStation store on your PS3. DLCs are digital and all you have to do is to download them them once you redeem the codes."}
{"product_id": "B007C3E5WM", "context": "Is the light bright and should I buy this product?", "response": "the light is very bright and if you are looking for a mouse that can handle ton's of play or work time this is the one to get"}
{"product_id": "B00006B84X", "context": "Does it have independent centering for the pitch and roll axes? Can you feel that the roll axis is centered while moving the pitch axis?", "response": "Hello Steven, this is an Axis based stick. With the CH when moving it in a diagonal motion you hit a sort of 'bump' when the axis cross over each other. Hope that answers your question."}
{"product_id": "B002QHDKE8", "context": "Should I play skate 1&2 before Skate 3? I usually like to play games in order but I only have $40 to spend and my friend was telling me about how awes", "response": "There is no story line to follow.  Skate 3 has better graphics and more detail.  My advice--spend your $40 on Skate 3."}
{"product_id": "B00F27JNGS", "context": "What is the difference between PSvitaTV and regular PlayStationTV?", "response": "There isn't really a difference just that this comes from Japan and the Playstation tv is from america"}
{"product_id": "B00CMQTUY2", "context": "how is the D-pad of xbox one controller  as compared to ps3 controller better or equivalent  or much better for fighting games like mortal khombat ?", "response": "I do not have much experience with the PS3 Controller, but I know the design and feel of the Xbox One controller's D-Pad vs the Xbox 360 controller is MUCH BETTER. It is much more \"clicky\" and responsive."}
{"product_id": "B009DYOPK0", "context": "Does this mouse have an accurate scroller? Meaning that its not that sensitive and scrolls very easily", "response": "It's kindof tough, but as any mouse requires a little breaking in."}
{"product_id": "B00GQTZ8TM", "context": "I bought one a while ago for my brother and it didn't come with a charger. I'm assuming that this one does, correct?", "response": "Yes it does. If the handheld didn't come with a charger I would contact the buyer."}
{"product_id": "B002CZ7P04", "context": "is is appropriate for children?", "response": "Absolutely appropriate for children!  G-rated and fun for kids and adults.  Great program."}
{"product_id": "B0017KIBAI", "context": "How long is the cord?", "response": "Dont know the exact length, but really long. Longer then the original cables.http://youtu.be/PYimWrAldwY?t=2m30sCheck out this video, the compare the white controller cable length"}
{"product_id": "B00H4BBVZQ", "context": "Amazon states that the DLC is \"included\".  Is all of the content on a disc, or is it one of those vouchers?", "response": "It is long codes for each DLC"}
{"product_id": "B008BGXYBM", "context": "size? how is this mouse for profile i like my mice simple High DPI low and flat", "response": "I personally like a high profile mouse, so was kinda bummed.  It's a great mouse but it is low profile...about 1.5inches high.  Inch in the back..less than an inch where the fingers are.  Hope that helps."}
{"product_id": "B005EOOT90", "context": "if u buy the headset do u need to get an adapter or something im not sure", "response": "If you have HDMI hook up then yes."}
{"product_id": "B00DE2W33I", "context": "was everything in the packaging", "response": "The game came outside the PS4 box."}
{"product_id": "B00HWMP0TU", "context": "Does it work with Windows 8?", "response": "Yes it works great with windows 8.   My wife and I both play.  She is on windows 8 and I on windows 7.  No problem with either setup.   Both are optimized for direct x 11."}
{"product_id": "B00BGAA29M", "context": "I'm 36 almost 37.  Will I enjoy this game?", "response": "I am forty and I enjoyed it."}
{"product_id": "B004RMK4P8", "context": "MAN IT DOESN WORK THE CODE", "response": "When i bought it, it worked out perfectly in my PS4 acc"}
{"product_id": "B00ECOBFA4", "context": "Hi there dose this come in a case with the dic or is it emailed to you to download on the xbox 360 thanks", "response": "Not emailed.  Its a video game that you load into the xbox 360"}
{"product_id": "B006LVZEN0", "context": "Does the scroll wheel retain its inertia or click into place (i.e. behave like a flywheel or like the wheel from Wheel of Fortune)?", "response": "It clicks.   Not does it have an option for a flywheel mode.   My new mouse does, and I've found it come in handy quite often."}
{"product_id": "B00C2B355W", "context": "does the mic work wirelessly with ps4 or does it need to be connected to the controller?", "response": "the headset (both mic and speakers) communicates wirelessly with a base station on the 2.4 GHZ spectrum. The base station connects USB to the device of your choice."}
{"product_id": "B00I14395A", "context": "Do the rechargeable batteries 'really' only last 48-hours? (if so, then it's not 'really' wireless)", "response": "They last several weeks and can be recharged while you are using the mouse or keyboard.  Nice feature."}
{"product_id": "B005QUQP80", "context": "Is this keyboard compatible with Windows 8?The Corsair Website says \"yes\" while the spec information here says \"no.\"", "response": "It works with Windows 8 flawlessly. There is custom software/drivers that provide firmware updates that may not be compatible with windows 8 however."}
{"product_id": "B000OYMYZQ", "context": "Will this arrive in an original Microsoft Xbox package or wrapped up in bubble wrap? Also what is the mAh rating on the battery?", "response": "Mine arrived in a ziplock bag with a product sticker taped onto it."}
{"product_id": "B000PD0HQE", "context": "Are you able to watch Netflix, Hulu, etc. on this console?", "response": "You can as long as you have an Xbox Live account."}
{"product_id": "B0050SVHZO", "context": "the old wii remote works with wii U?", "response": "Yes, my Wii Remote and nun-chuck works great on the Wii U and is one of the main alternative controlling options for most Wii U games."}
{"product_id": "B00F27JDY0", "context": "What games might be affected by the change with X and O buttons?", "response": "All my games have stayed the same except for soul sacrifice?"}
{"product_id": "B00B98HBTA", "context": "I want to know what language is this game .....", "response": "Can someone check if game has polish subtitles ?"}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "Usually you get pre-order games the day they are released.  Except for Nintendo games, I'm on Amazon Prime and every Nintendo game in the last 2 years or so that I have pre-ordered have been shipped out the day or day after their release date (some were released on Sunday so they were shipped out on Monday)."}
{"product_id": "B00DBDPOZ4", "context": "Can the cable connect to -and the battery be charged by- a usb wall charging unit instead of connecting it to the box?", "response": "No it cannot, it will only charge when connected to the XBOX One.  I have had no success with other wall chargers.  I have tried a generic charger, and all the high end Samsung chargers I have.  Vice versa, if you connect your phone to the XBOX One, it will not charge either."}
{"product_id": "B000K9Q5NW", "context": "What is with the fluctuating price? This seat was $299 last week.  I've seen the price move up and down around that number over the past several months.  Why the volatile price?", "response": "I was just about to buy a white one and the price jumped to $414! The strange thing is, if you go to the manufacturer's website, is sells for 350 euros. I hope amazon buys a new lot and sells them for a good price."}
{"product_id": "B003VANOFY", "context": "Can this headset be used while charging?", "response": "yes i actually use it most of the time plugged in"}
{"product_id": "B00HFZ5KCG", "context": "Does the product come with charger and usb cable? Along with the games in a separate package?", "response": "The charger and usb cable are in the same white PlayStation box as the Vita.  The box looks like it was removed from a retail bundle box."}
{"product_id": "B00GPH7Y8S", "context": "Do each of these games have single player options? I ask because IE 5 is required to play each of them?", "response": "Yes, it has single player option....but I have a problem of the game locking up all the time. I'm running windows 8.1. This game was supposed to be 8.1 compatible. I'm disappointed. I'm running the old series on an XP system...good luck"}
{"product_id": "B0007TJ7TE", "context": "will this keyboard work with windows 8 or only 7", "response": "yes, I hooked it up to my 8.1 laptop and it worked just fine"}
{"product_id": "B00EM5UFEK", "context": "does xbox one require a gold membership  or does ps3or 4 requiree any membership or play on split screen?", "response": "PS3 does not require any membership. That's why I returned Xbox & purchased PS3."}
{"product_id": "B0094H8H78", "context": "Would this be something an 8 year old girl would enjoy?", "response": "There are lots of great games for ALL ages. I have 1000+ games on mine. Feel ree to contact me if you need any help. Best of luck to you!"}
{"product_id": "B00DGZDFO4", "context": "Can you gift the PC download version? If so how?", "response": "Give the code to the person. Or if you have already added it to the steam account you can gift from there."}
{"product_id": "B006NU6HAS", "context": "Are you able to get the update to the steam edition with the box version of the PMDG?", "response": "Yes you most certainly can. You just use the serial number in the box set to download the update. Make sure you buy the box set new not used"}
{"product_id": "B00ENFVJJO", "context": "Does anyone feel it charges to fast causing the controller to NOT hold a charge as long as it may have before using this charger?", "response": "No. Like all USB charged devices, it operates on 5volts and low current. Besides, it's made by Sony. Its up to spec and won't damage your equipment."}
{"product_id": "B00FQFFPZO", "context": "do you need the steering wheel and foot controls to operate this game?", "response": "no but it would be more of an experience"}
{"product_id": "B00FZLE9JW", "context": "Will this hard drive work to play original games on my XBOX 360 Slim?", "response": "No it won't. Only hard drives made by Microsoft will play original Xbox games. But otherwise, this hard drive works well!"}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "Yes it is i had a hard time finding a genuine and  heap actual microsoft branded 360 controller"}
{"product_id": "B00KGGJPYA", "context": "What are the dimensions of this product?", "response": "I returned it. Because it was big and heavy. As long as an iPhone and a little less wide. Felt like a brick"}
{"product_id": "B002Z7BE24", "context": "I want to know whether it has a slipcover", "response": "Nope, it does not."}
{"product_id": "B008HPAXZ2", "context": "It's only one screed protector filter?", "response": "One screen protector per screen; one for the top and one for the bottom."}
{"product_id": "B00GLG2D4I", "context": "Is this compatible with a the PS3?", "response": "If the PS3 has bluetooth function, it can.Just check the PS3 manual or bluetooth icon/logo on the device."}
{"product_id": "B000B6MLPU", "context": "I purchased one of the older models of the XBOX 360 (120 GB with no wireless).  Is this the same cable that came packaged with that version?", "response": "Yes, I too have the old Elite Xbox 360. It works perfectly."}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "You can use a xbox 360 wired controller. Or if you have a ps3 controller you can download motionjoy and make the ps3 controller emulate a 360 controller. That is if the ps3 controller is not recognized."}
{"product_id": "B00A1AQJAO", "context": "Will this work with the New Nintendo 3DSXL?", "response": "No it will not! Even tho it says it does. It ejects it because it's to small to be held in place. I would suggest the power saves pro it's easier to use!"}
{"product_id": "B00IRHE892", "context": "why does it say \"Batteries 2 AA batteries required.\"? never seen a wired mouse that needs batteries, could that be a mistake?", "response": "I tried putting 2 AA batteries in mine and it broke the damn thing"}
{"product_id": "B00HN9LS48", "context": "Would the Xbox 360 Kinect clip work for the Xbox One Kinect?", "response": "I do not believe it would work for the Xbox 360"}
{"product_id": "B00AJXEYOG", "context": "Can I use this with windows 8", "response": "not sure.  i use it with windows 7"}
{"product_id": "B0002FGFHU", "context": "Hi, I am from Germany. Is this the US Version? I have the German an UK version, but theres no Honda Civic. Is here on this the Honda?", "response": "Yes there is a honda civic in this game."}
{"product_id": "B004QRKWLA", "context": "Although this controller is meant for the pc, can it still be used for the console as well?", "response": "We actually bought it to use with the console. It works perfectly!"}
{"product_id": "B00JC9SWSC", "context": "Is the hobbit game that comes with this bundle the retail case version of the game or does it come in just a cardboard sleeve?", "response": "It comes in a cardboard sleeve."}
{"product_id": "B00BDS415I", "context": "How durable is this headset? I want one that can last me a few years.", "response": "Well, the x12 and the px22 are near identical when it comes to build quality. That being said, my x12 work perfectly except that the mic stopped working after 6 months."}
{"product_id": "B00E1L78N6", "context": "Is Polk Audio 4Shot Headphone - Black - Xbox One wireless?", "response": "yes, it comes with an adapter that plugs into the controller."}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "No way it's foam molded on the inside to fit just the vita. It does have storage for a couple of games though."}
{"product_id": "B0098W4ZD4", "context": "I have retarded hands that gush out sweat when I play games. And gush is not an exaggeration. Will this be a problem for RAT? its got alot of crevices", "response": "no, i don't think it will be a problem because i sweat when i play games too and it works perfect!"}
{"product_id": "B000IZAQD8", "context": "can it play ps1 games", "response": "yes, PlayStation 2 consoles can play playstation 1 games."}
{"product_id": "B007VPZR5U", "context": "Can this be used on a laptop and a stationary PC", "response": "It is a usb mouse, works fine on both!"}
{"product_id": "B00FNNQREC", "context": "can you milk cows in this game?", "response": "Nope - no milking the cows (my boys said)"}
{"product_id": "B00GGUMV46", "context": "What is a Season Pass?", "response": "excuse me, I've been away, the season pass is a complete authorization to download all the DCL such as weapons, maps, costumes, games extensions leaving the game."}
{"product_id": "B0087ZMATE", "context": "is this a good headset if i need to hear people calling my name?", "response": "Yes, as long as the volume level isn't high, then you'll easily be able to hear someone calling your name."}
{"product_id": "B00BQWTGIS", "context": "will the game be installed on steam or at least will you be allowed you to play without the disc ?", "response": "You could always add the software to your steam cloud with the add game button on the bottom left of the steam home page"}
{"product_id": "B006JKARN0", "context": "In the disc of PS3    says BLUS OR BCUs?  have this option for spanish language?", "response": "Game is BCUS (which is for region 1) and there is no option for Spanish menus, sorry."}
{"product_id": "B0085VIILY", "context": "does this flight stick work with all other flying games on xbox 360?", "response": "I am not sure."}
{"product_id": "B005QUQP80", "context": "Does this keyboard response with Windows 8.1?", "response": "Yes. I'm running Win 8.1 with the K60."}
{"product_id": "B00FATRKOK", "context": "Does it come with game codes or disks?", "response": "Both. Tomb Raider was a digital download/code while Halo 4 was a full disk."}
{"product_id": "B00DJYTGYU", "context": "Would this controller work on a PS4?", "response": "Not sure if you can use for ps4 its not wireless"}
{"product_id": "B00A1Y2STQ", "context": "does this keyboard work with windows xp", "response": "Yes, I have used it ok XP and 7 and both OS's work with the keyboard"}
{"product_id": "B003N3HEU0", "context": "We have the older Wii.  Will this game work on it?", "response": "Yes, that's what I have as well  :-)"}
{"product_id": "B00FLLFGO8", "context": "Can be used for sony Z2 tablet?", "response": "No I have a Tab Tablet and it will not even fit anything above 7 inches by strecthing it."}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "It's the same mouse but call of duty mw3 comes with logo printed on the grips and with different colored led lights AND it comes with free mouse pad that's actually pretty good. compare the prices and cod mw3 version of the g9x is definitely the better deal"}
{"product_id": "B00BZOBE78", "context": "Can I use this without redeeming it on steam? Will it still unlock on my local computer?", "response": "You must activate the game via STEAM.  Once that is done, you will be able to play the game with or without internet or STEAM.  why this is so;  my guess is that you are prevented from selling the game to someone else without giving up your STEAM account."}
{"product_id": "B0083H4NG4", "context": "im quiting razer products they just broke after a few months after use, is this mouse better?", "response": "My Salmosa held up for years surprisingly. Unfortunately I'm not able to attest to such longevity in the MX, but I've been very happy with the build quality abd functionality in the months I've had it."}
{"product_id": "B00CD1FC6G", "context": "Does this keyboard have the ability to toggle the Windows Key on and off?", "response": "Yes, you can lock the windows key, so that you won't mess up while gaming."}
{"product_id": "B006PP4136", "context": "Would a ps vita slim fit in this case?", "response": "Yes, it fits in perfectly."}
{"product_id": "B00FLLFJ68", "context": "Is is possible to power this with a USB cord running from the PS4?", "response": "I am sorry no. Thank you for asking."}
{"product_id": "B00IAVDQCK", "context": "Can I use this headset for voice chat only?  (Game Sounds still coming out of the tv.)", "response": "Yes you hear the game through the TV and the headsets."}
{"product_id": "B00DC7O77A", "context": "Does this game support the use of the wii u pro controller instead of the gamepad?", "response": "Yes u can. I prefer to play with the pro controller"}
{"product_id": "B005Q1YA5O", "context": "In your opinion which expansion pack is better, the Pets or Supernatural. Not looking to buy both so would be helpful to get some opinions", "response": "It depends on you. Do you like playing witches, werewolves, etc. Or do you like working with pets? I personally would prefer supernatural. As I enjoy playing with supernatural characters. My personal recommendation is to purchase both, as they both compliment one another"}
{"product_id": "B00B98HDNO", "context": "after i insert the disk and the game starts installing, it asks for a product code. Where can I find it?", "response": "You can find it in your Amazon purchases. Go to Your Orders and then, under the product, it should give you the product code."}
{"product_id": "B001DPZE84", "context": "How realistic is this game? Would hours of playtime = the ability to(in an emergency situation) fly a plane crapily and live to tell the tale?", "response": "Very realistic. Play all the time hours on end."}
{"product_id": "B006LVZEN0", "context": "Does the scroll wheel retain its inertia or click into place (i.e. behave like a flywheel or like the wheel from Wheel of Fortune)?", "response": "Owner since Jan. 2011, the scroll wheel works beautifully, I have/ had no problem with the mouse yet. The wheel also has rubber padding around it, feels great, and even after all the gaming usage. Hope it helps."}
{"product_id": "B00J6DLPLK", "context": "Japanese voice & English subtitles  Support?", "response": "The Japanese voices DLC is available in the Playstation Network Store, be aware that it's about 20 GB of data so it might take a while to download and you might need to free some space for it."}
{"product_id": "B00919RM1Q", "context": "Does it include the face maker ?", "response": "yes, it does!  I had an older version & when I installed the new one my old face was included.  Saved a lot of time for me!!"}
{"product_id": "B00EZKNSTQ", "context": "How long is the wired cord?", "response": "its long  it reaches a chair from the tv"}
{"product_id": "B00B3PDHBU", "context": "Was the packaging already opened upon arrival?", "response": "No, why would it be?"}
{"product_id": "B00BGGIWZM", "context": "When you 1st get into town do they show how to play it, or you have to know it from the other games?", "response": "They have a beginning tutorial. And they is a button you can click and it tells you more details(you can check it anytime in the game)"}
{"product_id": "B007Y7OP8K", "context": "Does this game come with a manual or insert?", "response": "no it does not"}
{"product_id": "B00HKCKA0G", "context": "can you use this as a pc headset?", "response": "I put this into my microphone jack on my laptop and tested the quality of it, and I got nothing. It barely came out with any sound for that matter. It works well on PS4 but not for PC."}
{"product_id": "B0000512IE", "context": "Is there any adjustment in sensitivity of the toe and heel positions.  I have a model PPU995 which has no null position.", "response": "I don't think so.  My son and husband use this for flight simulator and they seem pleased with it."}
{"product_id": "B00292OW1U", "context": "The keypad to the left, can we use it to move the character about similar to the arrow keys?", "response": "Yes, standard they are movement keys; but can be changed to anything you want."}
{"product_id": "B00EVWZHLK", "context": "Are the discs stacked on top of one another or do they have separate disk trays?  I'm a collector and stacked discs tend to get scratched.", "response": "They have separate trays. Also these games were amazing you won't regret buying this collection."}
{"product_id": "B0002DQUH2", "context": "what type of plug????", "response": "Another reviewer said it is not a USB but a pin plug.  I agree."}
{"product_id": "B00EIM3BV6", "context": "I have plugged in the cord from the headset to the controller, and while the mic icon is on the mic is not working. Any hints?", "response": "I had problems with my mic on Windows 7. Works fine on Windows 8. There could be a ton of reasons though. You need it set as default in your sound setting and typically selected in the program you are using too. Also, if the mic boom is straight up, it turns the mic off."}
{"product_id": "B00562O78S", "context": "Resistance 3???? Does it still come with Resistance 3???", "response": "You don't get it until getting the display.  Probably to avoid the situation of dealing with canceled preorders after already having given out R3.  I know this because I have this preordered via Gamestop."}
{"product_id": "B00DHUUTEM", "context": "How do I control the keyboards LED's?", "response": "The FN button next to the right alt key, push and hold that and then press the escape key while holding the FN key."}
{"product_id": "B004GZ2RCY", "context": "Which mouse is it? There are 2 different pictures of the mouse.", "response": "The first picture is not the correct one."}
{"product_id": "B005VA5D24", "context": "Do you need a cable to plug it in to the Xbox, or does it plug in directly?", "response": "Nope . Goes in the back"}
{"product_id": "B008SBZD9G", "context": "may purchase soon, is it online only or can i play single player story mode. don't care for mmorpg games.", "response": "It's an MMO, it's only online. Please consult other explanations of what an MMORPG is."}
{"product_id": "B00D96BJSO", "context": "Can you hear yourself chat through the headset?", "response": "Turtle Beach is releasing a new adapter this month that will allow you to hear yourself. I know this is a little late for the original poster, but for future reference.http://www.turtlebeach.com/product-detail/xbox-one-adapters-accessories/ear-force-headset-audio-controller-plus/645"}
{"product_id": "B009RXUOD4", "context": "do you recomend something else", "response": "Got mine in April and one side stopped working this week -- I've only had them for 4 months.  Customer service has yet to respond.  I'm not impressed."}
{"product_id": "B009GWLSFY", "context": "Would this be over kill for games such as this? Qanba Q4 Q4RAF Ice Blue PS3 & Xbox 360 & PC Joystick (Fightstick)", "response": "yes too much going on there, just get the ps3 version and call it a day"}
{"product_id": "B00G21VQ2M", "context": "Is there an english version?", "response": "No unfortunately not, and there will probably never be an english version of this game."}
{"product_id": "B00ARD5410", "context": "Does the scroll wheel scroll left & right?", "response": "No it does not."}
{"product_id": "B001444IN6", "context": "How will I be sure that this game will come with the codes necessary to install it?", "response": "As long as the manual is included, then you will have the proper serial# for install. Be sure to check each seller's listing to verify what is included."}
{"product_id": "B001O3066U", "context": "Does anyone know if this version will work with Windows 8?", "response": "I only know 1 person who has Win 8 but I will ask.  I feel that if you need to run it as \"Administrator\" in Ultimate 7 you could do the same in 8.  For the price it's worth a try."}
{"product_id": "B000FQ2D5E", "context": "Can this be run on the PC?", "response": "No it cannot, there is no pc version of metal gear solid 4."}
{"product_id": "B007A7UJ4S", "context": "Does anyone who has previously bought this game thru amazon,does it come with the box or just the downloadable disk?", "response": "I received it in a box"}
{"product_id": "B00E1A1SP6", "context": "Can you get netflix etc on the 3DS xL", "response": "Not sure about Netflix but my sons watch YouTube videos on it. Don't know if that helps or not."}
{"product_id": "B00H1FCUBY", "context": "Are these headphones compatible with Bluetooth 4.0 devices?", "response": "I've used them with the lg g2 which I believe is bluetooth 4.0"}
{"product_id": "B00006HYLN", "context": "does it work for windows 8", "response": "According to Logitech's site, this device will work with Windows 8, and the software is compatible, for full functionality. You can check other Logitech products at the link below.http://www.logitech.com/en-us/support/320?crid=411&osid;=14&bit;=32"}
{"product_id": "B002ZS6Y64", "context": "This works with any PC right ?", "response": "It will not work on my PC it has a loud buzzing sound that is constant no matter what USB cable I use, But it works like a champ on my PS3."}
{"product_id": "B00B5QLS4A", "context": "is it compatible with windows 8.1", "response": "I believe so. If it is not already 8.1 ready then I imagine that all you would have to do is download the latest drivers and then you should be fine. However you need to make sure that you use it through a USB 2.0 port and not a 3.0."}
{"product_id": "B0017Q4DGI", "context": "can this game be played on the wiiu", "response": "Yes, I don't own a wii U myself, but I do know that all wii games CAN be played on the wii U."}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "I downloaded on my laptop when I went to play it the game it told me to put the disc in? Do not understand as it was already downloaded . I have another one down loaded manuf by IGT and it does not make me do that?"}
{"product_id": "B002BRZ79E", "context": "game did not come with registration code", "response": "You need to contact amazon and/or square about that. Mine was on the back of the book in the case."}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "Mine was all separately packaged"}
{"product_id": "B009LGO88E", "context": "is it a real 3ds", "response": "No, this is not a 3DS (and it isn't marketed that way). It's a Nintendo peripheral that adds functionality (extra circle pad and two extra buttons; ZL and ZR) to a 3DS XL."}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "Yes it does. Theres one included in box,which I was shocked too see.Its a awesome system."}
{"product_id": "B00CH923NE", "context": "Is this game better than Mario and Luigi 'Bowser's Inside Story'?", "response": "It's not better than Bowser's Inside Story (in my personal opinion), but it's still worth playing."}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "YES THEY ARE!!!!!!!!!!!!!!! as long as you have an adaptor from lets say titanfall edition xo4 or skull candy! THE WORK WITH XBOX 360!!!!!!!!!!!!! I HAVE A PAIR!"}
{"product_id": "B002I0J4VQ", "context": "can you play with newer version", "response": "Do you mean you can play online with people with later PS3 models, or PS4 users?"}
{"product_id": "B004SJFJUA", "context": "Does it come with just the base or the Base+Battery? , Battery by itself  is 20$ here Nyko Power Pak+ for 3DS", "response": "It comes with the base and battery."}
{"product_id": "B00BI9MDSO", "context": "It's been about 2 years since it was released. Can it now fit the PS Vita Slim comfortably or do you still have to push on it hard?", "response": "I've never had any issues closing this case."}
{"product_id": "B00EV4O8VS", "context": "How many GBs is this console?", "response": "It's the \"Deluxe Edition\" so it's a 32 GB flash storage. You can always plug in an external drive up to two terabytes in size. make sure the drive is empty though."}
{"product_id": "B001B5U80K", "context": "is this compatable with the xbox 360?", "response": "if you got a 360 you could probably see if they got a version through through xbox live and download it."}
{"product_id": "B00BGD6LMG", "context": "As a mom I am asking... My son is 11. He has a couple of the call of duty games.  What do you think?  Can he avoid the sex stuff in \"free roam\"?", "response": "My kids (10 and 12) report that there is some nudity in one of the Watchdog missions, but it is easy to avoid that mission. So I guess the nudity is quite limited.  Hope that helps!  Who knew?"}
{"product_id": "B00EZPCWWA", "context": "Can photos taken with the 2DS be downloaded to a computer?", "response": "yes you can ... SD card would be the simplest way to do this"}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "Yes, goes up to 8"}
{"product_id": "B008MI7MWQ", "context": "can I play this game on o/s windows 8?", "response": "I couldn't play it on any of three systems I tried...save your money - this game is a bust."}
{"product_id": "B002BSA298", "context": "does it work with an xbox 360 console arcade?", "response": "i believe it does"}
{"product_id": "B004HYIAPM", "context": "To activate you need a steam account, why/", "response": "No big deal.  Do it and forget about it.  No consequences whatsoever.  In fact, I don't even remember having to do it."}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "Yes it's PS4 compatible"}
{"product_id": "B00BFOEY3Y", "context": "Dose this mouse have a \"middle click\", usually the action of pressing the mouse wheel down? The wheel has left/right, but dose it click down?", "response": "Yes it does have a down click!"}
{"product_id": "B00AXI9WFS", "context": "Will the figures and the stories work with 2.0 since this is 1.0 stuff?", "response": "you can use the 1.0 items on the 2.0 set....but, you can not use the 2.0 items on the 1.0 set. -iwd"}
{"product_id": "B00B15EXJC", "context": "Does this controller work well with call of duty games", "response": "Hi! Sorry it took so long to reply, I asked my boyfriend and he said yes, he loves this controller.  He said its a hybrid  between an xbox and ps3 controller but he said it's easier to control it just takes some getting used to at first. Hope that helps!"}
{"product_id": "B00B76QR44", "context": "Can this be played offline once downloaded?", "response": "Yes, I play it offline all the time."}
{"product_id": "B00IU3MSF4", "context": "can this play original xbox games", "response": "Certain original Xbox games will play on the 360, but most will not. However, the graphics are so much better on the 360 and it has by far outlasted our original Xbox."}
{"product_id": "B005UI8V6C", "context": "could it be used on multiple computers?", "response": "well of course and you can save and continue on different levels.enjoy"}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "It does have Bridge and the box says it will work on Windows 7.  It does work on Vista but I have not actually run it on Windows 7."}
{"product_id": "B00F8W9SWQ", "context": "Can you see the keys clearly with the back light off?", "response": "Yes, it's great with and without the backlight"}
{"product_id": "B005LUUWL6", "context": "Does this work for 3DS games, or is it just a ARDS that works on the 3DS?", "response": "My son has the original 3ds and the XL 3ds. The original 3ds it wouldn't stay down in the slot, but it worked just fine for the xl 3ds"}
{"product_id": "B00F9RGFEY", "context": "Are these on-ear or over-ear headsets?", "response": "Over the ear. Thickly padded."}
{"product_id": "B00IU3MSF4", "context": "Is the Borderlands 2 Games on Demand download card transferable?  I'm not interested in this game.  Can I give it away to a friend?", "response": "yes  2 games"}
{"product_id": "B0017KIBAI", "context": "Does this controller have more of a glossy feel like the original gamecube controllers, or is it more matte like the Smash Bros edition controllers?", "response": "Whoever is telling you this is Matte is an idiot. Like Tom says, its a glossy feel. This IS the original GC controller."}
{"product_id": "B00F27JDY0", "context": "What is the difference between the JAPAN version and the ASIA version?", "response": "Only difference is color and O is select and X is back if color matters to you get the import of not get the borderlands 2 bundle with black vita slim I think it's only 199 hope that helps"}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "Yes it will. I have Win 7 and it works perfectly. I liked the puzzles, too."}
{"product_id": "B00EF1OGOG", "context": "what is the size of the unit? length and width?", "response": "93 x 46 x 25mm / 3.7 x 1.8 x 1.0in"}
{"product_id": "B00FEOR4MY", "context": "Does this help with falling impact? I tend to drop my case from time to time.", "response": "Yes it does, I have dropped it twice and its fine"}
{"product_id": "B005EQE0YM", "context": "would I need to by an audio adapter for this headset or just plug in and its ready to go out of the box?", "response": "Ready to go outta the box."}
{"product_id": "B002BRZ79E", "context": "Looks like a good game, just not into monthly subscriptions. Is that the only way to play this?", "response": "There no other way, but those cost subscription are good deal, like we order pizza almost similar that cost. Subscription that you can play everyday 30 days vs time time order pizza ? What the difference it make ?"}
{"product_id": "B003VUO6H4", "context": "Is this a ps3 fat or a slim", "response": "Es lo que dice en la caja"}
{"product_id": "B00D9FQAM0", "context": "is there a headset included", "response": "If bought new, yes a headset is included. If bought used, you will need to check that sellers particulsr listing to see if the headset is included.  If it is not specifically stated that it is, it is likely not included in a used sale."}
