{"product_id": "B000YMQGWU", "context": "Will this work with emulated games on a pc?  Not that I would ever download something without paying for it..", "response": "It sure will. I use it just for that purpose all the time. WARNING: do not pirate games illegally. Homebrew, freeware ROMs are legal to play on an emulator."}
{"product_id": "B00562O8U0", "context": "I have a Sony BRAVIA XBRHX929 TV and wondering if I need a 3d Synch xmitter along w/ these glasses or will it synch/work directly with the TV ?", "response": "You do not. The TV has an emitter built in."}
{"product_id": "B00GD962OA", "context": "Our Wii just died on us & we have a lot of games for it.  Are the Wii games compatible with the Wii U console?", "response": "Yes, it's backwards compatible."}
{"product_id": "B00EZAWV6W", "context": "I have an old Vista will this game work on my computer???? My son wants to play it.", "response": "That's what I have and it doesn't work. Though I'm not sure if that's the reason."}
{"product_id": "B00GU4F4OM", "context": "What does it mean by \"selective DPI?\" For instance, are you able to have 2500 DPI? Or just 1,000, 2,000, 4,000 etc..", "response": "yeah it go 1000/2000/4000/8200/16400dpi i like the mouse for my desktop but for my laptop it  moves around a little when im playing this one game.but i think its the laptop not the mouse"}
{"product_id": "B004RMK4P8", "context": "What do I do if I'm buying the playstation card for someone do you give me a code to give them..I'm older and don't know anything about this.", "response": "The code will be sent to your email address. The recipient has to go to the Playstation Store app on their console (PSVita, PS3, or PS4) and redeem that code. The value of the gift card is stored on the console, then they can purchase downloadable items directly from the Playstation Store app."}
{"product_id": "B00FFL0T46", "context": "Can I download this game in a DELL Laptop if so how do I do it?", "response": "Call Amazon customer support and they will walk you through it."}
{"product_id": "B001E27DLM", "context": "Does this port have all 15 alternate endings from SNES?", "response": "I believe so. I haven't finished it, so I haven't attempted to pursue the alternate endings. But the online walkthrough I'm consulting provides points where I can jump to the ending."}
{"product_id": "B00HWMP0TU", "context": "I understand that I need an internet connection to download the game. Can I play the game offline once downloaded on my computer?", "response": "Yes it will work fine in offline mode after you download it, I've played on long car rides and it works fine."}
{"product_id": "B00CXCCB64", "context": "I played before on 360, now getting the One, am I still able to play live with my friends that are playing on 360?", "response": "No. It is not cross compatible."}
{"product_id": "B00A1Y2STQ", "context": "does this keyboard work with windows xp", "response": "Yes.  Xp and Windows 7 handle it just fine."}
{"product_id": "B00B1N07QM", "context": "[Solved] Does the Orbweaver store the active profile on the device like the n52te does? Does it have only the dpad for the thumb buttons?", "response": "The Orbweaver *does not* store the profile on the device, you *must* have the Synapse software installed and running to have the Orbweaver use non-default keys.Your thumb can use the thumbstick, the flat piece that extends out underneath the thumbstick (the \"flipper\" button), and the button above the thumbstick. So technically 10 if you count all 8 thumbstick directions."}
{"product_id": "B00FE8WKPQ", "context": "Can I play this on my regular Wii?", "response": "No, Wii Fit U is only for the WiiU console. There is however a Wii Fit Plus and that's for Wii."}
{"product_id": "B00BFOEY3Y", "context": "Does this G700s work on glass? I have the Logitech MX performance, and want more macro keys.", "response": "It does \"work\" on glass, but I don't suggest using ANY mouse on glass. That and you will not get full dpi performance from glass surfaces"}
{"product_id": "B000GCJ6MK", "context": "How can i run it on a mac?, thank you in advanced!", "response": "Thank you Very much!!"}
{"product_id": "B00BMFIXKQ", "context": "The game is in English or multi language? has any subtitles at least? Which?El juego esta en inglés o tiene múltiples idiomas o subtitulos ? Cuales?", "response": "It  has subtitles and in the settings you can switch the laguage"}
{"product_id": "B008JHH5RC", "context": "Not really a question but... NOTE: This skin will NOT fit the NEW Nintendo 3DS XL.  Skinomi, please create a skin that fits the New 3DS XL.... ?", "response": "There is a version on Amazon made for n3DSXL by  skinomi."}
{"product_id": "B0042J7I3C", "context": "How durable for 9 dollar headset is it?", "response": "It's durable however it doesn't work for the system."}
{"product_id": "B009AGXH64", "context": "Is the game pad the only controller compatible?", "response": "No, it is also compatible with the new Wii U Pro controllers that are similar to XBox controllers. The old Wii controllers also work."}
{"product_id": "B00E8RVP0U", "context": "can we watch this on a DVD player?", "response": "No, you need to play it on Nintendo Wii with controller.  The game checks to see how much the controller movement matches up with the movement on the screen to award points."}
{"product_id": "B00DGZDFO4", "context": "not opening and im trying to get help but NOBODY is helping me..I have windows 8????", "response": "do you have any error? i am running the game on w7 but maybe i can help you"}
{"product_id": "B009GZX49Y", "context": "good morning I wanted to know if this trilogy are video games or play 3 games .... if they would make the purchase ... excuse my English I am from Ven", "response": "They are three separate game all around EZIO as the main character.  All the games are on the disc but need to be downloaded as all the data could not fit on the disc.  As long as you have space on your PS3 hard drive you will be fine."}
{"product_id": "B00FOHP8XI", "context": "Does the controller which come with the console have a bluetooth technology? or do I have to connect it using the USB cable? is the USB cable included", "response": "it is totally Bluetooth... you just need the cable to charge it..and it should be included unless otherwise stated.."}
{"product_id": "B00ATHFLZS", "context": "What color are the light on top? It looks different in every picture.", "response": "It's not a solid color. It cycles through multiple colors"}
{"product_id": "B00C71034I", "context": "Does this game allow split screen mode?", "response": "my fiancé says it does not"}
{"product_id": "B009AP23NI", "context": "Is this compatible with Wii games played on WiiU?", "response": "Nope, Wii games played on the Wii U must be played with Wii controllers. You can pick up the Wii Classic Pro Controller and a Wii mote, but as for the Wii U Pro controller, that can only be used with compatible Wii U games."}
{"product_id": "B00DBRM3G8", "context": "what difficulty mode is best to play on?", "response": "I'd recommend rookie to get a feel for the controls, especially for newcomers. Pro for a laid back, but pay attention game (fun if you like 4th quarter comebacks). AllStar for a challenge, and Superstar/Hall of Fame if you are into testing your skills at basketball and fighting A.I. Script. Hope that helps."}
{"product_id": "B00CD1FCAC", "context": "Does this include a 2 year Limited Warranty offered by Corsair if I buy from amazon?", "response": "Yes it will always come with a 2 year limited factory warranty anywhere you buy it."}
{"product_id": "B00EOPT5ZS", "context": "How quick is the reaction time?", "response": "Just like a keyboard. Thing is great"}
{"product_id": "B00006C2HA", "context": "It won't install! (Macbook Pro) After dragging the .dmg to the HDD and double clicking it, the icon just bounces and then hangs. Help!", "response": "I don't think doom 3 is compatible with macbook pro"}
{"product_id": "B00FB4BUMW", "context": "will this work for usb 1.0?", "response": "If you are plugging this keyboard into a computer that has usb 1.0 ports, no. If you are plugging a usb 1.0 into one of the usb 2.0 ports on the keyboard, yes."}
{"product_id": "B00FAN4LRA", "context": "How sturdy are these headsets?", "response": "They are very comfortable and sturdy. We had no problem with them. We love it, and we just purchased a second pair."}
{"product_id": "B009DL2TBA", "context": "Does it comes with Netflix?", "response": "I'm not sure. I gave this to my son for Christmas,  but you can always download the app for free from play station network as well as the YouTube app."}
{"product_id": "B001Q24UAM", "context": "Does Play! have the actual games or just one-hr. trial versions with the opportunity to buy the real games?", "response": "the games on the disc are limited to one hour play and then you have to pay more if you want to play more"}
{"product_id": "B0088MVQIM", "context": "Could one plug in an electric cello or violin and learn them or is it just strictly for the bass and guitar?", "response": "The game reads like tablature, not musical notes and therefore is unfortunately guitar and bass specific."}
{"product_id": "B00EI4V3X2", "context": "Is this headset surround sound for both PS3 and PS4? I would like a headset that has equal surround sound for both systems?", "response": "Yes but I'd go for the dpx21. Bettter sound quality"}
{"product_id": "B00EZKNSTQ", "context": "does it come with a cord", "response": "No, but there are instructions on the box that will teach you how to wire/wrap your own cord. Just kidding, of course it comes with a cord."}
{"product_id": "B003OZOAKY", "context": "do i need the original total rome before i buy the gold edition?", "response": "No. It is a complete game and a good one."}
{"product_id": "B00005QEFD", "context": "Does it come with a memory card?", "response": "It does not come with a memory card but they aren't very expensive to buy seperatly."}
{"product_id": "B004C34D2M", "context": "The product description says, and I quote, \"It contains the same motion-sensing technology as the remote\" is this a false description? If so? Report?", "response": "I've had no problems with mine, make sure you read the instructions correctly, install new batteries, etc."}
{"product_id": "B00AU80ZSY", "context": "Once Ticket to Ride has been downloaded, will I be able to play without an internet connection?", "response": "Yes. You can play the game with the computer. Obviously, you'd need to have internet in order to play with other (real) people around the world, though.EDIT: The other reviewers are correct in that you can also play a turn-based game off the same computer with friends."}
{"product_id": "B009D3HSTG", "context": "I ordered two of these and they work great BUT the joysticks keeps coming off on BOTH. Any quick and easy solutions?", "response": "I use and abuse mine and that's  never happened.  Maybe ask for a refund?"}
{"product_id": "B003O6C0V4", "context": "Does that work on the wii mini ?", "response": "I wouldn't think so. Then again I'm not familiar with the Wii Mini. It has a USB thumbdrive looking thing that plugs into the back of the Wii and uses the motion sensor to read movements provided by two bands that you wear while working out. I hope my answer was helpful."}
{"product_id": "B00B98HDNO", "context": "Does this work with windows 7", "response": "Yes, it does. I played it on two computers with Windows 7 and both worked fine."}
{"product_id": "B00CXCCB64", "context": "If I had a PS3, and I get this for Xbox one, can I transfer my stats from online?", "response": "no you have to buy an x box one game no transfers from different systems"}
{"product_id": "B00HLT0YT0", "context": "borderlands 2 doesn't officially release until may 13th.  Does that mean bundle buyers will have early access?", "response": "No you wont because the seller wont ship it until December this year."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "I have not had any issues with this keyboard and I've had it for about 6 months. My computer usually stays off until I use it, though."}
{"product_id": "B00FE8WKPQ", "context": "will the Wii U FIT  game and meter work on the Wii?  Do not have the Wii U", "response": "No, you must have a Wii U for the new game to work and to use the meter. Go ahead and get a Wii U as you can still play your old Wii games on it. You won't regret it."}
{"product_id": "B00AJXEYOG", "context": "Can I use this with windows 8", "response": "I don't have windows 8 so I can't answer that.  Hopefully if you contact the seller or the developer they should [hopefully] be able to answer your question."}
{"product_id": "B00FYMTUQY", "context": "Will this mount work fo rthe LG 42LB5800 TV?  It looks like there isnt much of a bevel on the TV for the stand to connect too.", "response": "Yes. It has a stand that you have to be very gentle pulling it out.  Once you pull it out put on your TV and adjust it."}
{"product_id": "B0088MVPFQ", "context": "Is it 3D games ???", "response": "Yes. It is 3D. But this is a classic side-scroller, so the 3D doesn't make much of an impact. Still plenty of fun though. One of my kid's favorites."}
{"product_id": "B001IYR53W", "context": "Will it work on Windows 7?", "response": "Mine  is on my lap top and it has Windows 7 and works great."}
{"product_id": "B001O3066U", "context": "can i download this edition", "response": "NO.  It comes on a CD that has to be in the CD-player every time you play it."}
{"product_id": "B002I0JZIS", "context": "does this have nuketown", "response": "It is not Black ops 2, so no,  it doesn't have it"}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "It is a different region but it will work with a us playstation. (I bought it for myself) Playstation is not region locked. That is why some people import Japanese games from Asia.com or playasia.com. Enjoy the game, it is great.edit: Jamesphoney is correct. Don't forget about that part. lol"}
{"product_id": "B00DC7O3K6", "context": "will this game work with a normal wii, or only wii u?", "response": "I had to send it back because it does not work with wii."}
{"product_id": "B00CPKUV98", "context": "the doom beta code that comes with the game, do you need the game to play the doom beta?", "response": "No, it is not necesary having the disc to play it."}
{"product_id": "B00CMQTUSS", "context": "Using this for PC, which will require the micro USB to always be connected.  Will I have any need for batteries at all?", "response": "does it rumble when using with PC?"}
{"product_id": "B00C7103DO", "context": "i want to buy this game but i want to know if i buy this specific product does it come with the deathstroke dlc?", "response": "Haroon, I'm in Brazil and, in my region, the code doesn't work. If you're in America, I guess it does."}
{"product_id": "B004N7IIQ4", "context": "Compatible with Playstation 4??", "response": "Yes, when you connect through with the usb cable, it works in chat."}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "Training dogs is an amazing experience.  Goldie my lab can't wait to play this game."}
{"product_id": "B00BDX1M00", "context": "What is the product warranty on recertified headsets?   Are they backed by the manufacturer or by your company?", "response": "Don't get them at all they worked for one day then wouldn't sync again. I got them to deploy and can't send them back. Save your money."}
{"product_id": "B000PD0HQE", "context": "what games will this xbox 360 come with?", "response": "Forza horizon crisis 2 the walking dead shadow of mordor battlefield 3 assassins creed rogue saints row 4 brink call of duty ghost call of duty modern warfare assassins creed brotherhood batman Arkham origins halo 4 ghost recon advanced soldier darksiders 2"}
{"product_id": "B00BT71S4K", "context": "I have a samsung tab 4, 7 inch tablet, I know it won't fit, but will it work for that?", "response": "I am not 100% sure but I think it would if it has Bluetooth and runs apps compatible with it."}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "Yes. It comes with the adapter"}
{"product_id": "B00BT71S4K", "context": "Will it fit a small tablet like a Nexus 7?", "response": "I dont feel like answering questions right now.. This controller is trash,, aint work with the game i wanted to play"}
{"product_id": "B004W1IX1G", "context": "Does this deal come with the \"Wii Motion Plus Adapter?\"", "response": "No, it doesn't  You have to buy it. there is a good options for just 9 o 10 dollars"}
{"product_id": "B0053B66KE", "context": "Will this work on a DS? I ordered it before I realized my son does not have a 3DS", "response": "you should cancel your order, this only works with a 3DS. But if you buy a 3DS, your son can play either DS and 3DS games, hope this helps you."}
{"product_id": "B005M2KSLC", "context": "Is the white or black version glossy? I'd don't like the glossy mice because they tend to build up grime very easily.", "response": "Its true.  I have the white."}
{"product_id": "B00B5QLS4A", "context": "Does this mouse have a middle-click function on the scroll wheel separate from the button below it?", "response": "Yes, the wheel is also utilized as a button."}
{"product_id": "B0085VIILY", "context": "Can the joystick be used with other games like HAWX or Ace Combat?", "response": "Yes but it's clumsy and slow."}
{"product_id": "B00GP0HQ3S", "context": "Does this come as shown in the picture without packaging or is it factory sealed?", "response": "Item in the picture comes factory sealed."}
{"product_id": "B00DPJBTM6", "context": "i know you should buy this with the mix amp for best quality but I don't do Game Battles anymore. So is this headset great for just using stereo sound", "response": "I would spend my money on some good headphones after a while I'm almost sick of the muddy sound. The mix amp doesn't do much beside make them louder. Spend 100 more and get sennheisers or some audiotechnicas."}
{"product_id": "B00BQMGW4Y", "context": "how long is the cord?", "response": "Way to short it's about 3 ft long. You have be sitting right in front of the tv. Works great but the shortness of the cable makes it hard to enjoy playing"}
{"product_id": "B002I0J4VQ", "context": "Does it come with all the cords needed?", "response": "It comes with an AV and Power cable but not controller"}
{"product_id": "B0065NP6NC", "context": "The game comes in multilanguage? I want it in Spanish?", "response": "Yeah, try setting your console to Spanish."}
{"product_id": "B004H7P0B6", "context": "If your joystick is worn out (i.e. stick is wobbly or loose) will this replacement piece fix that?", "response": "Temporarily. The rubber on the caps of the sticks is cheap and rips off with aggressive use. It took about two weeks of SSBM play to rip them for me."}
{"product_id": "B002Q4U5DK", "context": "Can this mouse be used as an ambidextrous mouse? I use my left hand to surf the internet and control my computer and use my right hand for gaming.", "response": "It can be. The shape is pretty symmetrical, but you'll lose ease of use on the side buttons when surfing."}
{"product_id": "B005L38QK2", "context": "My mouse stopped working. How can I return this product and replace it with another ?", "response": "I would contact Amazon and ask them what to do."}
{"product_id": "B003Q9RGRW", "context": "Does it come with the headset", "response": "No, it was just the chatpad."}
{"product_id": "B002I0J4VQ", "context": "Does it come with all the cords needed?", "response": "Yes it come with the power cord and HDMI cable. It does not come with the controller."}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "Klondike is the classic solitaire;  however, all the other options are absolutely fantastic!"}
{"product_id": "B00FB5R3XQ", "context": "Now, I've had many people say that PS3 sticks don't work as well as Xbox 360 sticks for PC, can anyone confirm or deny this?", "response": "All my ps3 sticks and fighter pads by hori work perfect with no drivers.  Plug and play baby!"}
{"product_id": "B00GS1TYIO", "context": "Is this Windows XP compatible?  I didnt see it on the description.", "response": "I have W8.1, have no way of knowing how it does on antiquated systems. Suggest you contact the game maker for that info."}
{"product_id": "B00CPKUV7K", "context": "Why is it rated M?", "response": "That info is in the item description section. Language, adult situations and violence"}
{"product_id": "B004RMK57U", "context": "i want to buy playstation plus digital code but am in nigeria can it work", "response": "if you are using us psn, then yes."}
{"product_id": "B00FATRKOK", "context": "what features make it a holiday bundle package as opposed to a standard package?", "response": "I suppose including two games with it makes it \"special.\" In my case, though, the games were in Spanish, so not so special. However, the seller did give me a refund for the games, so all is well. The system itself works perfectly."}
{"product_id": "B0095P5K8I", "context": "does we need to have a mouse pad or we can us it with out the pad?", "response": "You do not need a pad for sure. This mouse is very accurate as you expect."}
{"product_id": "B001KMRN0M", "context": "Does this item have a Headphone Jack?....and if so, what size is the Jack? Also does this item have built in speakers?", "response": "Yes, regular sized headphone jack(which means you could plug your apple headphones into it) and it does have built in speakers but those speakers aren't that good if you're listening to music or watching a video. If you're playing a game then the speakers are good."}
{"product_id": "B00576U8CC", "context": "I realize that its an MMO, but do you need a Gold membership on Xbox live even if you just want to play single player? Is there even single player?", "response": "You need gold.It's only made for online"}
{"product_id": "B00FZ12F34", "context": "I could probably do the math myself, but I'm lazy and I don't quite follow exactly what's in this bundle.", "response": "It comes with Elsa and Anna toy box set, Jessie and buzz toy story play set, woody, McQueen and holly cars play set, mater, Francesco, jack skellington, sorcerer apprentice mickey, mrs. Incredible, dash, violet, syndrome, mike, randy, Barbosa, and Davy jones."}
{"product_id": "B00AKIPBNS", "context": "Once you beat the game/story, can you replay the game at a higher difficulty with your progressed and high level characters?", "response": "No. You can keep playing and do side quests and stuff you didn't finish like Downloadable-Content but you can't replay the story unless you start fresh"}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "Most keys do not work"}
{"product_id": "B00FKV8AK6", "context": "is the dlc in the disc or u have to put the code into the xbox to get the dlc", "response": "There is a card in the case with a code for the DLC. You need to download it."}
{"product_id": "B002BS47JE", "context": "what is a pal version?", "response": "Isn't that the European system???"}
{"product_id": "B0029M6VKA", "context": "Does it work with Windows 7 and Windows 8?", "response": "Works perfectly with Win7.  The change log for the drivers on the TrackIR site indicates they added Win8 support in October of 2012.  I've never personally tried to run it on Win8, but it's a very simple USB device, so I can't imagine it wouldn't work."}
{"product_id": "B004MR3QY4", "context": "I am looking for a long lasting gaming mice, with high precision, control and speed for FPS, which one should I get?", "response": "You have to get the a deathadder. If you have the money get the chroma edition."}
{"product_id": "B00DLDEKOK", "context": "Can you hear the game sounds rather than using tv volume? I am new to this and hope gran kids can play quietly", "response": "You can hear the game sounds in tv still. They can hear taking In the headset and then couldn't hear the game sounds."}
{"product_id": "B00DH1KRQQ", "context": "does it have the rumble feature?", "response": "It has but personally i haven't been able to use it maybe, because most pc games are programmed to work with a Xbox 360 controller, i had to use the CE360 in order to be able to play with this controller however as i said i can't seem to activate the rumble feature..."}
{"product_id": "B002I0J51U", "context": "Does this require a eye camera?", "response": "totally, it is completelly useless without it"}
{"product_id": "B00F2ENJY8", "context": "HD Possible?  Or at least widescreen?  or does it lock you into 480i?", "response": "The Wii Mini is capable of widescreen (16:9) or standard (4:3), but ONLY in 480i with the supplied composite cable.  480p, which is possible on a regular Wii, isn't supported on the Mini.  Even component cables from other Wiis will not work on the Mini, meaning you are stuck with 480i and the composite cable only."}
{"product_id": "B002AQNT96", "context": "is this redeemable on steam or do i just get the game and thats it i boot it from the disk", "response": "NOP sadly in can only be booted from disc and the original servers from activision for blur doesn't work anymore, the onyl way to play online is with tunnglehttp://www.youtube.com/watch?v=3DP-ygfhSQA"}
{"product_id": "B00HVBPRUO", "context": "Can you watch movies on gold wireless headset on the ps 4 if I put blue-ray movies in the ps4", "response": "Yes, the surround sound isn't as good as it is with the games - but it is still far better than just regular speakers on a tv or a simple sound bar."}
{"product_id": "B000VRCNLG", "context": "will this be able to run on windows 8 someday? I loved this game when I had XP.", "response": "It doesn't work on windows. 8"}
{"product_id": "B001O3066U", "context": "will it work in windows 8?", "response": "What I have is NOT compatible, as far as I know.  You have to go by the specifications as stated."}
{"product_id": "B009GWLSFY", "context": "There is no list of the games in the product details. Can you list them please?", "response": "Go to ps3 trophies website and look at the trophy list for a list of all the games. Fairly easy platinum, too!"}
{"product_id": "B00F27JDY0", "context": "What games might be affected by the change with X and O buttons?", "response": "the Japanese game with O, the Engliash with X, it looking for you chose which one are you buy~~"}
{"product_id": "B00FNKMVUO", "context": "I'm sure this is dumb question but, does the mouse change colors?", "response": "Yes and no each profile on the software has its own color for the s but you can always change the color on the side"}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "I used original ps vita. PSTV works. Idk about ps slim vita."}
{"product_id": "B00AKIPBNS", "context": "If I've never played a Fire Emblem game, will I still understand/enjoy this game?", "response": "Yes, absolutely. Play it on the easiest difficulty your first time through as you learn the mechanics (normal, classic) and dont be afraid to look up any questions online. I had never played an FE game before and I loved it."}
{"product_id": "B004774724", "context": "does this work on kindle fire", "response": "No that is computer game"}
{"product_id": "B00BS520SG", "context": "How many controllers can plug into the adapter", "response": "only 1.  But dont buy this if you dont own a Wii remote control.  It will not connect directly to a Wii U, which is why I had to return mine.  False advertisement, and waste of time."}
{"product_id": "B00CMQTVK0", "context": "Hello is this item works with 220 v Electrion or 110 v help pla", "response": "The US version is 110v. You will need to get a different power supply if you need 220v from either microsoft or Amazon."}
{"product_id": "B004RMK4P8", "context": "MAN IT DOESN WORK THE CODE", "response": "it works just perfectly"}
{"product_id": "B00A378L10", "context": "Can the LED lights be turned off?", "response": "Yes, the keyboard's lights can be bright, dim, or completely off. However, the WASD and directional arrow keys will stay lit."}
{"product_id": "B0050SVNP8", "context": "can this game work on 3DS XL US version ?", "response": "Yes it's works for 3DS, 3DS XL and 2DS. I bought this game for 3DS, but I know that it works for 3DS XL and 2DS."}
{"product_id": "B00009ECGK", "context": "Does the previous versions have to be bough and installed? or Can I buy this game right away, install on my PC and play?", "response": "This game includes the original game plus all of the expansions. The CD key is included."}
{"product_id": "B0053BCO00", "context": "Works in the 2ds?", "response": "No it only works in the 3DS. Regular DS games work in both consoles"}
{"product_id": "B004JKZUJI", "context": "does this work well for zelda virtual console games", "response": "I have never had any problems with mine.  Some Wii games won't let you use a controller, but on the ones that do it works as good as my Nintendo one."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "When I'm playing on the ps4, I am in the same world as pc players interacting with them. I'm assuming the same would be for ps3."}
{"product_id": "B000PD0HQE", "context": "Does this come with a xbox live 1 month code and a standard xbox 360 headset?", "response": "Hi Tanya!It will come with the standard Xbox 360 headset, but does not come with an Xbox live code."}
{"product_id": "B003RS1A7Y", "context": "What other midi devices does this work with? Can I use on my computer?", "response": "Yes but you will need an adapter for it"}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "It is wired into the controller.  It does not require battery's and will run off the controllers rechargeable battery's"}
{"product_id": "B00JC9SWSC", "context": "Does this come with an HDMI cable?", "response": "No HDMI... Only a component cable"}
{"product_id": "B00A7VK16A", "context": "work with xbox 360 e console?", "response": "If it uses an HDMI cable the answer is \"yes\""}
{"product_id": "B00FB4BXGA", "context": "Can i bind the t keys(the keys under space bar) to any button like t1 is shift t2 ctrl t3 is alt?", "response": "Yes, u can do that.. Not just with the t keys, but with almost all other keys.. You can do that in the driver software, not the powergrid.. If the software crash, run as adminstrator..."}
{"product_id": "B00F9RGFEY", "context": "This does come with the USB light up device just like the regular prismatic headphones? Or does the tower replace that?", "response": "The tower replace it"}
{"product_id": "B002I096AA", "context": "does it have pictochat", "response": "It has an application available for download called swapnote.It is similiat but I'm not sure if it will communicate with older devices."}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "Yes, and it plays nicely there too."}
{"product_id": "B00DC9SWWE", "context": "My dad and I plan on playing this together, and it says 'XBLive Gold Required'. Do we need one or two for both of us?", "response": "In order to play multiplayer with your dad you'd need 2 copies of Titanfall, 2 consoles, and 2 accounts with Gold membership. Multiplayer is online only."}
{"product_id": "B007MM9E42", "context": "Can you play the Wii version on the Wii U?", "response": "No, you need to have a wii u system"}
{"product_id": "B00E6OLJ88", "context": "Can i have a list of all the mods in the order of when you press the button on the back", "response": "Burst mode 1Burst mode 2Burst mode 3Rf 5/spsrf 8/spsrf 10 spsRf 15 spsrf 20 spsrf 40 spsrf 80 spsSmg/lmbaim kneelcaffeine freak jitterquick aim rapid firecrackhead Bobdrop shot rf 10/spsjumbo shotdual/ akimbo rf 7/spsdual/ akimbo rf 11/spsquickscope rtzombie auto aim rf 12/spsjuuju hop rf 10/spsjuuju voodoo Lthalo ultimate RFhalo autoRF anti recoilultimate quickscope LT"}
{"product_id": "B00ARD5410", "context": "is this mouse for right or left hand??", "response": "It is for the right hand."}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "Yes it still plays noraml ds games, with no differences in gameplay other than the lack of formentioned 3d effect"}
{"product_id": "B0045ZB66I", "context": "do you have to pay a monthly fee to play?", "response": "There's no monthly fee. It's not an MMO either"}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "If you mean ps3 then no the USB is different the ps4 controller uses micro USB the same you use to charge a cell phone (not iPhone BTW)"}
{"product_id": "B00G0OYHCW", "context": "What does this deluxe set come with besides the games? Does it include the charging station?", "response": "It comes with all the items as EGARCIA stated. I ordered mine this past Monday and everything is included except for the game. I'm not a huge Mario or Luigi fan, got mine for a great price.You have to e-mail the sellers, ask them what's included, etc. Also ask for exact pictures of the Wii U!"}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "The.one I ordered. Didnot work"}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "What I understood was that the red button activates the programs you enabled the buttons to do. Think if it as the turbo button on those controllers from long ago"}
{"product_id": "B008YA9BVC", "context": "Can you actually hear audio? From videos and even the game? or we can only use this to chat?", "response": "Yes needs to be hook through game pad and volume has to be turned up on the game pad. Some games will Ask you if you want to use the headphones on the game pad click yes."}
{"product_id": "B00CMSCTA2", "context": "Is there a suggested resolution at which to play the game?", "response": "have you downloaded STEAM to play it http://store.steampowered.com/"}
{"product_id": "B00GD962OA", "context": "How many GB capacity has this?", "response": "8GB.I bought a 64GB microSD + very small usb card reader (which practically just as big as a usb connector itself) and it is just elegantly awesome."}
{"product_id": "B009XZ1CTQ", "context": "Okay so I've downloaded I think 4 mods for fs 2013 but can't find them during game play how do I find them?", "response": "Hi,  This was a Christmas gift for grandson, I have never played game.  He was only 11 at time, to young for many one to email to ask a question.  Plus my son and wife would not approve.  Good luck."}
{"product_id": "B00CPS59CE", "context": "I have a feeling its a really dumb question to ask, but does it come in the original box of the headset or another box? Im just kinda curious", "response": "Mine did.  Have had zero problems."}
{"product_id": "B000VBFWAG", "context": "what computer did you use for this game, brand and version.", "response": "My laptop is a HP; windows 7.  Hope this info is helpful.  Have a Great Day!"}
{"product_id": "B00IVHQ0KI", "context": "will this clamp to a desk?", "response": "Yes it has a pretty strong clamp.  It's solid once attached."}
{"product_id": "B00HGLLRV2", "context": "which is the best standard edition or limited edition?", "response": "Doesn't matter because the code in the box expired like 2 months ago. So which ever one is cheaper."}
{"product_id": "B004774724", "context": "If I bought the download, would I be able to install it on my PC and my laptop? Or would I have to buy two copies?", "response": "Nope! You download direct from amazon! Convenient, yeah?"}
{"product_id": "B002P35JMO", "context": "Someone please tell me where the fat end of this thing plugs in!  PLEASE HELP!", "response": "Thank you!  I don't have a slim so that would explain that. Ugh"}
{"product_id": "B00DBRM3G8", "context": "Can I play this game with my cousin on the same screen on the same system? 2 players?", "response": "Yes you can. I think 4 players, if not more, can play on the same system."}
{"product_id": "B002RRLQIO", "context": "Is the Palm rest removable?", "response": "Yes indeedy. I like/use it, but you can remove it if you need the space."}
{"product_id": "B005LN5UOC", "context": "as much as the totally loaded battery lasts", "response": "4-5 hrs of game play"}
{"product_id": "B001COU9I6", "context": "Does it play PS2 games?", "response": "Unfortunately, the console will not play PS2 games."}
{"product_id": "B002YVD3KM", "context": "what are NES games?", "response": "very rude and stupid reply!!! I probably know other things he doesn't know...big deal!"}
{"product_id": "B004W1IX1G", "context": "does it work for the wii u", "response": "Yes it does, you can play all regular wii games on the wii up game system but you can NOT play the wii u games on the regular wii system"}
{"product_id": "B008SBZD9G", "context": "Can I use a Xbox 360 game controller for the PC version?", "response": "Yes, as long as your pc is bluetooth compatible."}
{"product_id": "B00BMFIXZG", "context": "Does this work at all with windows 8?", "response": "I have Windows 8 and AC4 runs just fine."}
{"product_id": "B00ERDGMSA", "context": "If I buy the physical copy of the game do I get a code to redeem on steam so I can  play with steam friends?", "response": "I looked on the official forums for this game and it looks like yes, it is compatible with Steam. Steam is the platform for the multiplayer network and purchasing a physical copy give you access to it."}
{"product_id": "B00KGGJPYA", "context": "How do I charge this charger?", "response": "if you have an Android phone you can plug the phone into the receptacle and plug into the electrical outlet to charge."}
{"product_id": "B000ZBZK7C", "context": "Will the Winpoker work with Microsoft 8.1?", "response": "it has not worked for me on 8.1."}
{"product_id": "B004RMK4BC", "context": "does it work for Mexican accounts?", "response": "No, tenes que crear una cuenta en estados unidos para poder usar la gift card ! Saludos desde Guatemala !"}
{"product_id": "B0090WBXSM", "context": "If I purchase this controller. Will it work for amazon fire tv games?", "response": "Could not get it to work with the fire stick"}
{"product_id": "B0002L88HE", "context": "Do I need to purchase the game twice to do multiplayer with a second member of the family?", "response": "Yes, the game comes with one CD-Key, so every installation in a different pc needs a different key in order to play on lan or multiplayer"}
{"product_id": "B008XHCLFO", "context": "Does this game help alleviate hand cramps playing Mario Kart 7?  I am getting lots of cramps in my index fingers keeping them on the shoulder buttons.", "response": "Yes it's soft,  spongy and much easier to play.  My granddaughter loves it.  Worth every cent of it...."}
{"product_id": "B00GZ9ESEE", "context": "is this unit comes with head set?", "response": "Yes. It is cheap but functional."}
{"product_id": "B000R9A9JG", "context": "Is this the replacement for the Nyko Charge Station Rechargable Battery Pack Item # 87000-A50-0107?", "response": "The packaging on the items I received did not look like the one pictured. The packaging was listed as Wii U and Nyko is the manufacturer.  My guess is that is will work with the Nyko Charge station but I have the old school Wii charging station so it did not work."}
{"product_id": "B00FWWY1V0", "context": "do they stick without the regular cover", "response": "Yes they do and help with movement during first person shooters"}
{"product_id": "B001CXYMFS", "context": "how does this stick work playing elite dangerous? any suggestions if this one isnt very good for the game?", "response": "It works fine, but you'll use you're keyboard for the menus on you ship a lot to travel."}
{"product_id": "B0097CUREG", "context": "Is a mouse required to play ?", "response": "No, I play on my laptop and I don't have a mouse"}
{"product_id": "B00AAS88K6", "context": "How do I setup the Orochi with an external bluetooth adapter like the CSL USB Nano Bluetooth-Adapter V4.0 ?", "response": "Well I'm not sure, I use mine with a MacBook Pro so I have built in Bluetooth. But I would imagine you would open the Bluetooth settings or where ever you can see what is paired and hold down the four edge buttons and wait for it to show up."}
{"product_id": "B0032MM2P4", "context": "Can I use this on Windows 8?", "response": "Would not recommend this product the disks are loaded with Malware and will infect your computer!"}
{"product_id": "B004NRN5EO", "context": "this game comes with case, manual and artwork?", "response": "Mine did, but that depends on who you order from. There should be a brief description in the condition column of what that game comes with, make sure you look here because some games just come as a disk."}
{"product_id": "B00CMQTVUA", "context": "How large is the Hard drive  for xbox standard system?", "response": "The hard drive is 500gb though you will have less space than that to store your items for the system uses some of the memory for its' default items. You will have more than 400gb of space, closer to 425."}
{"product_id": "B00F27JDUY", "context": "does the ac adapter that comes with japanese model work in USA?", "response": "Yes, the included ac adapter works in the USA."}
{"product_id": "B00CERXJNW", "context": "is it compatible with window 8.1", "response": "Yes, I upgraded 2 of my machines and MS Windows 8.1 had no issues with my K95 and M95 devices.  I did download and install the latest drivers from Corsair in order to have the full set of utilities installed."}
{"product_id": "B00178630A", "context": "I have 1.5 meg dsl connection,,,I was wondering if the game will stream without buffering??", "response": "that's more than enough. at most the game uses 30KB down/up."}
{"product_id": "B00BMFIXZG", "context": "I bought this game and I can not play , I get it already been registered before. I could say I go to play ?", "response": "Do you mean that you purchased a used copy of the game?  One that had already been registered under another user?"}
{"product_id": "B00009TW6R", "context": "Does this game require the use of the CD drive beyond installation?", "response": "Not if you install one of the updates Bungie provides on their website."}
{"product_id": "B00009TW6R", "context": "Does this game require the use of the CD drive beyond installation?", "response": "nope, at least not for me. i didn't have to install anything different or download anything else."}
{"product_id": "B00EADTVL2", "context": "Does this plug into the wall?", "response": "Yes to a regular outlet"}
{"product_id": "B000RA778G", "context": "I have windows 8, will it work.", "response": "In checking the window system  your version is not listed.  But you may want to speak with someone from Staples or Office Max for assistance"}
{"product_id": "B009GTV5HS", "context": "Is this a wired or wireless mouse? I have read online that this is a Hybrid with both features, but the pictures look like a wired mouse.", "response": "This one is wired, the hybrid one just comes in full black even the aluminum its painted in black... But any way its a really good gaming mouse, great quality build, heavy but not too much..."}
{"product_id": "B000QJ1NS8", "context": "My GBA SP won't charge. Time to change the battery?", "response": "That might be the case"}
{"product_id": "B00IYWV852", "context": "I was thinking about buying a couple of this game as gifts, it won't be an issue will it? The recipients won't have any problem using the game codes?", "response": "Ive purchased video games for people before through digital stores, but i've only done it through steam.  I am 99% sure it works the same way on Amazon but i would double check with customer support first.  Enjoy!"}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "Yes it does. A gas and a brake. No clutch."}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "Yes, you can play offline. Nice game but I had problems with Windows 8 compatibility, kept crashing making it unusable. Good luck."}
{"product_id": "B00DPQ6GPO", "context": "I did comment earlier but I would also like to ask: Is this controller good for quick scoping?", "response": "No, I found this controller to be inadequate  in all categories especially scoping, it is not a purchase I would recommend."}
{"product_id": "B000YMQGWU", "context": "Will this work with emulated games on a pc?  Not that I would ever download something without paying for it..", "response": "Yes it works with emulated games on a PC."}
