{"product_id": "B006W41X1S", "context": "Can you use more than one headset at a time?", "response": "No the WiFi receiver is programed to one headset at a time."}
{"product_id": "B00D96BJSO", "context": "How Do I go about being able to hear the game play and the chat at the same time?  it seems like I'm only hearing one or the other?", "response": "You can adjust the game audio and chat audio in the options.  They default to both being the same volume."}
{"product_id": "B00BZOBE78", "context": "Does the pc dvd work with a mac???", "response": "Only if it is the Mac version. Be sure to check out which version. If I remember correctly you can buy the Mac version on Steam."}
{"product_id": "B00CJ7IUGS", "context": "Why the m rating?", "response": "Blood and Gore, Intense Violence, Sexual Themes and Use of Alcohol."}
{"product_id": "B00J128FPA", "context": "Do you have to be logged into PSN and what about the game patches issued every two months or so?  Will you get those?", "response": "Yes, you have to have a playstation plus account in order to play online. All patches will be added as they are released."}
{"product_id": "B000PD0HQE", "context": "Does it come with all the games", "response": "This came used from a third party seller, so he included everything listed.I think you have to read each listing if used and see what they are including."}
{"product_id": "B00GJ2HZ7E", "context": "it doesn't say windows 8.1 compatible but if it's all steam based doesn't it only matter on what OS you can run steam on?", "response": "Steam can run on a wide variety of operating systems and computers but the individual games you can get through the service are not necessarily compatible. In this situation though I am running windows 8.1 and I have not had any compatibility issues with the games in the package."}
{"product_id": "B00FXOP1JI", "context": "does it include a download code for pokemon X or Y as the second picture shows?", "response": "No, There was a offer where if you had purchased 2 other games in the month of march you could get pokemon for free."}
{"product_id": "B00BI9MDSO", "context": "How many game cards can this case hold?", "response": "3 + Memory Card"}
{"product_id": "B004FS8LYK", "context": "How much gore and eschatology does it have? Can it be reduced/censored?", "response": "There's a fair amount of gore and strong language.  There's nothing about the end of time.  I don't know of a way to reduce/censor games."}
{"product_id": "B00FATRKWM", "context": "Which voltage does xbox 360 use? 220V or 110V or dual-voltage?", "response": "You just need buy dc adapter for 220v or give current to engineer, they can change from 110v to 220v.Told from my experinece"}
{"product_id": "B003NSLGW2", "context": "If the ps4 controller stock grips are completely torn off, will these fit snug and not slip off?", "response": "Yes they should. My Ds4's one stick is torn off and these fit well enough. Does the job. They are not full fit but doesn't matter much."}
{"product_id": "B00286BZ4Y", "context": "will this work on widows 7?", "response": "I think it will."}
{"product_id": "B00GZ1H07Y", "context": "To play in multiplayer mode can all players use one controller or does each player need a controller?", "response": "Ill have to check on that later, never tried multiplayer. I do know its only local though and not over the net unfortunately"}
{"product_id": "B00FNKMVUO", "context": "How easy is it to switch profiles?  (And how quickly?)  I sometimes have to switch strategies quickly, meaning a whole new set of macros.  Thanks!", "response": "Not nearly as easy as it should be. It requires opening up the mouse software and doing it that way. There should be a switch to autochange, sadly there is not."}
{"product_id": "B00DPJBTM6", "context": "Does it come with everything? mixamp and all?", "response": "No, no mixamp included."}
{"product_id": "B001E93IWI", "context": "do  you here game sound and not just other people's voices", "response": "No... you do not hear game sound. Hope this helps..."}
{"product_id": "B00562O8U0", "context": "what does sony ps3 games mean when they say 3d compatable", "response": "You can play the game in 3d on a 3d TV."}
{"product_id": "B00H72EMP8", "context": "could you remove the boom mic", "response": "Yes. It is removal. Yes I have removed it for when I use them just for movies."}
{"product_id": "B00GU8W5AE", "context": "How clickable are the 12 side buttons on a scale from 1-10", "response": "For me? A 1. For a younger gamer, it might be as high as 10. They are close together and at a bit of an awkward angle."}
{"product_id": "B000KMCF0G", "context": "Just to clarify, this IS  just a cd-rom game, right? You just pop it in the drive and play?", "response": "no I think you need the cd to play that I think it has been a long time lost one of my cd so when I got a new computer now I can not play it"}
{"product_id": "B00AQ2BLI2", "context": "Does it contain the original game? I accidentally buy the part 2 but it does not contain the original game.I can't play it now.", "response": "Yes it dose, along with shogun 2 rise of the samurai and fall of the samurai. You get 3 disks in there, download them all and I think you have to have a steam account, register the game then done."}
{"product_id": "B006IR6NH8", "context": "Does it work with any driving or racing game, even simulators?", "response": "I have had no problems with this working in any racing game or simulator. While most newer games will recognize it older ones may require you to customize your key bindings but should still work."}
{"product_id": "B003ZMF26W", "context": "What's the lowest dpi this mouse can be set at?", "response": "500 dpi is the lowest setting, and you can set it to anything between 500 and 4000, plus these dpi values can be bound to any number of switches and toggles."}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "I believe it will the game says its for 7 and I have 8.1"}
{"product_id": "B00GU4F4OM", "context": "How big is this thing?  I have large hands and FPS gaming can be a pain because my thumb and pinky usually drag on the mouse pad causing my shots to..", "response": "You should probably find another mouse. This one is for small to medium sized hands. If you want I can measure the dimensions."}
{"product_id": "B00CERXJNW", "context": "Is this the keyboard that has 16.8 million color schemes", "response": "No, that one is the K95 MX RGB. It's scheduled for release in August (subject to change without notice). This model is white LEDs."}
{"product_id": "B0041RR0TW", "context": "does it work with windows 8", "response": "I have 8.1 and had no trouble installing it.  Didn't even have to go online looking for drivers.  But I have heard of others having trouble getting it to work with 8.1."}
{"product_id": "B004X56PWK", "context": "Does this game have multiplayer mode", "response": "I believe there is online multiplayer where you can race against another person.  I wouldn't count on the community of Sonic Generations players to be that vast though."}
{"product_id": "B007VFHIHA", "context": "I have a desktop windows 7 thats been upgraded from XP will this game work on it?", "response": "yes it should work fine. I had to adjust my resolution etc for the game to work without any problems."}
{"product_id": "B005MQ3BSK", "context": "Does it work on Windows 64bit?", "response": "Sorry don't really know. So disgusted with how not user friendly it is, haven't really used it. Presently just an expensive icon on desk top."}
{"product_id": "B0094H8H78", "context": "Does this have internet access such as facebook page?", "response": "No there was no facebook back in 1990 when the Genesis came out"}
{"product_id": "B0047ERZ7Q", "context": "dose it work with the pspvita", "response": "No, this will not work with the Vita. This camera uses mini-usb which is  not a port that the Playstation Vita supports. With this in mind the PSVita already has a rear and front facing camera making this device not necessary. This camera will really only be used for the PSP-1000 through 3000 models."}
{"product_id": "B009WI7V9E", "context": "Is the game still worth getting?", "response": "I bought it as a Christmas present for a teenage boy. I, personally, don't like violent games but if that's what you like the kid thought it was great. He enjoyed it and thought it was cool that it was a double cd. I hope this helps."}
{"product_id": "B0017KIBAI", "context": "How long is the cord?", "response": "It's about 8 feet"}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "No. You can adjust the volume on the TV independent of the headset and vice versa. So if you wanted to have headset ONLY sounds you'd need to turn down your TV volume."}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "I believe the lights all flash when your computer is first powered on... A self test if you will... But then the lights stay out until flight sim is started."}
{"product_id": "B00CX8VYM0", "context": "Can I play this on the PS4?", "response": "this one is for Xbox one but you can get it for PlayStation 4."}
{"product_id": "B003O6N64Y", "context": "can I connect this headset to a tv,thankyou.", "response": "Yes, it has analog (Red and White Cables) and digital (Toslink) audio input so as long as your tv has an audio output it will work."}
{"product_id": "B0081Q58AW", "context": "Is there a,way to play offline", "response": "Nope, if you are looking for an offline Elder Scrolls experience grab Skyrim, which is about $20 on Amazon.  Great game!"}
{"product_id": "B009RXUNGM", "context": "What Adaptors would I use to connect this to the Xbox One??", "response": "They have many adaptor sand tutorials on you tube to use your headsets with your xbox one. As long as you have the RCA cables and the 2.5 mm chat cable just watch one of the you tube videos and they will tell you what adapters to use"}
{"product_id": "B00FATRKLI", "context": "Can I play games purchased in Colombia, South America?", "response": "I'm not sure. I assume all games made for xbox would be the same."}
{"product_id": "B0098F1Y3K", "context": "can I play this game using nintendo ds or do i need nintendo 3ds?", "response": "I bought this as a gift for a family member, but what I've heard about 3ds games, they must be played on the 3ds system. I wish I could be of more help."}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the -box 360?", "response": "No is for wii u"}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "I haven't tried it, but my daughter tells me it does, but not all of them"}
{"product_id": "B00CJ7IUI6", "context": "i have regular skyrim i want to know if you buy it will you get to keep your save?", "response": "You should be able to since that are dlcs."}
{"product_id": "B005HN5LKY", "context": "I ordered this product and only received the cord that plugs into the wall, should I be expecting the brick, or is that not part of this purchase?", "response": "It is part of the purchase tbh I'm not sure why you had only the brick because both piece came with mine"}
{"product_id": "B00F27JDUY", "context": "does the ac adapter that comes with japanese model work in USA?", "response": "Yes it does. This model has no issues working in the U.S...Aslo, I purchased games and I am playing them just fine. and once you power up the first time it lets you choose your regional settings including language."}
{"product_id": "B00BA9AWTO", "context": "What are the 18 games on this game?", "response": "Christmas carolChameleonAliceBig Money ShowBlast ZoneBurnin LoveClover Cash"}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "It is one optical in and one out."}
{"product_id": "B00D6PTMSW", "context": "Does anyone have both the original and 2014 versions know if the Lessons are better in the 2014 than the original?", "response": "I bought the 2014 version and was forced to buy the original as a download in order to buy songs meant for the original to use in the 2014... I opened and tried the original a few times... its slow, clunky, freezes, has inferior graphics and has much less content."}
{"product_id": "B003EUPCZG", "context": "Any advice out there? I am looking for a wireless left-handed laser mouse. I tried all the wireless ambidextrous mice.", "response": "Very late answer here. The Razer Orochi is truly ambidextrous - symmetrical, with the same number of buttons on each side, and can function as both a wired and wireless mouse. Only caveat is that it is somewhat smaller than average, being designed for portable laptop use."}
{"product_id": "B0032MO77U", "context": "will these work on windows 8?", "response": "I have windows 7 and its fine, I know absolutely nothing about computers so consulting a more computer savvy person is a good idea."}
{"product_id": "B000PD0HQE", "context": "will this xbox 360 include all listed items?", "response": "Yes it comes with a controller and over 20 games as well as all the cords required to use the consol."}
{"product_id": "B001Q24UAM", "context": "What operating systems will it work on?", "response": "Windows Vista / XP Only"}
{"product_id": "B000VTQ3LU", "context": "So it can be used as a regular webcam on a Windows 7 laptop with some free driver downloads,  Will work immediately as a webcam/cam on ps3?", "response": "Under settings. All the way to left and then down to accessories"}
{"product_id": "B00562O78S", "context": "Why is the Playstation 3DTV only have 5000 for contrast ratio? Shouldn't LED be in the \"millions\" contrast ratio?", "response": "Maybe ' the best in class' report was taken from a compt reporter. Or maybe, he speakee no engrish."}
{"product_id": "B0032MO77U", "context": "Does it try load other junk onto your computer as does another Jewel Quest 2 disc that I purchased and had to toss out?", "response": "Dear Zanity 777,My answer to your question regarding Jewel Quest 1 & 2----I did not have any junk problems with them......the only problem I get is when I download games from internet, which I now don't do that anymore as you can be unlucky and get viruses that are expensive to FIX........Regards......S.BaSTAS"}
{"product_id": "B00E369SDM", "context": "does the controller come with the usb charging cable?", "response": "The PS unit does, but to buy an individual controller at a store or online, no."}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "No sir unfortunatly this is for the original 1000 series only"}
{"product_id": "B008BGXYBM", "context": "Does this Razer Taipan have Dual Sensor (two holes, one optical, one laser in the bottom)?", "response": "only one optic lazer"}
{"product_id": "B00E3667XQ", "context": "Is it worth it even IF I cannot use the streaming feature?", "response": "Yes, its still worth it, its still I awesome piece of hardware. I personally dont really use the game streaming feature a lot, but I love the attention it gets me in public. People are always like wow what are you playing on."}
{"product_id": "B0015PHMFU", "context": "Does this work out of the box for PC or do I need to buy the \"Universal Adapter\"?", "response": "It has a USB so right out of the box..."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "Technically, it will fit, but it is very tight. You have to \"jam\" it in and it doesn't come out easily. It's a nice case, but I returned mine to GameStop because I didn't like the tight fit. The slim Vita is actually a little taller than the original."}
{"product_id": "B003N3HEU0", "context": "does wii version have zombie mode", "response": "only the first map."}
{"product_id": "B003O6JJKY", "context": "wait does this have 250gb on it", "response": "Haha yes just be sure you have the 250 gb option selected. I know they merge various versions under the same reviews so just be careful."}
{"product_id": "B00FWWY1V0", "context": "can it be used for ps3", "response": "I currently use this for the ps3 Dual shock controllers so yes it can be used on Ps3."}
{"product_id": "B00ENFVJJO", "context": "Does this charging stand require that you attach some type of receiver to the actual controller?", "response": "I agree with the previous answer.  You just place the controller in the stand, push it down to click in-place.The status light on the PS4 controller will pulse while charging."}
{"product_id": "B00GLZQR96", "context": "Is there a monthly fee?", "response": "I don't understand why this question needs asking. How do people not know this?"}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "works with windows 8"}
{"product_id": "B004N7HSGU", "context": "Does it come with a chat cable for Xbox 360", "response": "It gives/comes with instructions for how to use it with each system, including the 360. I don't believe that you need anything else for any system but the xbox1"}
{"product_id": "B000A2R54M", "context": "Does it work well on 2DS?", "response": "It works the same. My son has the 3DS and this game works perfect on it."}
{"product_id": "B00AJILG1K", "context": "Will this keyboard work on my iMac Late 2012 Model?", "response": "I'm not sure. You'll have to check the company's website for Mac driver compatibility. If they have drivers listed for it then yes but it's not a plug-and-play model like some standard keyboards. But last I checked there were no Mac drivers available."}
{"product_id": "B007SO6USW", "context": "Does it come with a USB cord because mine is broken", "response": "No ma'am, it did not. Plugs into an outlet and the connectors are in the clear plastic piece. We have a million USB cords so it wasn't needed. Try Belkin or Amazon Basics. Their great brands."}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "There is a USB Reciever that comes with the controller. I have a full case and the cord was long enough to reach around to the front."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "it is silent. But it is not a mechanical keyboard"}
{"product_id": "B00E0H5J8M", "context": "Does the scroll wheel click to intervals, or is it completely smooth?", "response": "It clicks as you scroll"}
{"product_id": "B00009WAUO", "context": "Is SMB 3 more difficult than SMB 2 in your opinion?", "response": "Which one Super Mario Bros. 2 USA or the original Japanese version A.K.A. The Lost Levels? If you are referring to the original Japanese version then Super Mario Bros. 3 would be easier than The Lost Levels."}
{"product_id": "B0032MO77U", "context": "will it work on 64 bit cpu systems with windows 7?", "response": "As far as I know. I have windows 7 on my pc and it works fine."}
{"product_id": "B00ESN8YGW", "context": "Region locked?? Is this game region locked or not? There seems to be conflicting info", "response": "Can someone please give a certain answer ? Is it region locked or not ?"}
{"product_id": "B002RYLG4Q", "context": "Does this hook up directly to a TV via coaxial cable, or does it require an RF converter box?", "response": "av jacks. no converter.  plug and play"}
{"product_id": "B00BGGIWZM", "context": "When you 1st get into town do they show how to play it, or you have to know it from the other games?", "response": "My daughter said you can use the tutorials to get familiar with the game."}
{"product_id": "B00EPZ8POY", "context": "I bought the odin seiya DLC but even though i have it installed on my ps3 I cannot use it? anyone else having this problem with DLC?", "response": "Yes because like me you bought the UK version right or Asian.  End you are trying to play it in the states. Which is a different format and the download content only works on the US version so they match up I bought all the downloads and can't use them either"}
{"product_id": "B004FS8LYK", "context": "Can you recommend games for 8 year olds?", "response": "Sonic hedge hawg, any puzzle type games"}
{"product_id": "B00CHYOP80", "context": "does it say ps4 on the box", "response": "Yes, it does. It's also compatible with Mac, PC, mobile, xb360, ps3, and wii u"}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "I've only used it with Android."}
{"product_id": "B00EEMLPR2", "context": "Can anyone tell me what features the 1080p HD Tactical Camera has. Is it worth it?", "response": "For 45 Dollars for a prestige set it's well worth the money the game kicks arse"}
{"product_id": "B009Q8M816", "context": "An instruction sheet did not come with the controller.  Is there a website or link that has full instructions?", "response": "I apologize, but ours did come with instructions.  Good luck"}
{"product_id": "B004S5TDUQ", "context": "I just installed it today and it seems to be fully working, but says it is the demo. Did I get robbed or is this a developer oversight? Anyone else's PC version say it's the demo?", "response": "Did you install Steam? To register Rocksmith program you will need to install steam. Installation of steam should have been included on Rocksmith."}
{"product_id": "B001L5TIR4", "context": "Is the Rise of Atlantis compatible with Windows 7?", "response": "Yes. I have a windows starter and it worked just fine. :)"}
{"product_id": "B000TT2D2A", "context": "is it compatible with band hero games", "response": "Yes, the games are compatible just check this site and you'll see that they are. Sorry for the delay was out of town. Hope this will be some help to you...        http://www.rockband.com/compatibility"}
{"product_id": "B001E93IWI", "context": "Can it be used on pc>", "response": "No it is made for the xbox. They plug directly into the xbox controllers"}
{"product_id": "B00FC1UH82", "context": "Is this a smaller version of the other Mad Catz arcade sticks? The dimensions state 9.1 inches in length. Most other sticks are 17 - 19 inches.", "response": "They're definitely not 9.1 inches. They're rather sizeable"}
{"product_id": "B00BU7WVG8", "context": "Does this game have cops in it that chase you?", "response": "Yes cops chase you"}
{"product_id": "B00D6PTMSW", "context": "Do you have to have kinect on your xbox to use this lesson game?", "response": "No, it would be completely useless. You plug it in to play."}
{"product_id": "B002BRZ852", "context": "Do you have to be hooked to the internet to play this game?", "response": "No you don't. Best game ever"}
{"product_id": "B007JDMPOK", "context": "Do I have to use the activation code to get the mounts? I was hoping they were seperate codes.", "response": "The activation codes include the mounts in the item cillectiom tab"}
{"product_id": "B00DCDZM2I", "context": "Does this include the actual disk to play the game, or just the characters?", "response": "Disk to play and some characters."}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "No it is not wireless."}
{"product_id": "B00GANWVJE", "context": "does thiws game work for the 3ds xl model?", "response": "Yes, all 3DS games work on all forms of the 3DS and 2DS. However they do not work on the DS, DS lite, and DSi"}
{"product_id": "B00BI9MDSO", "context": "How far back does the case open? Can it only open to the degrees shown in the picture or does it extends further?", "response": "180 degrees. You won't be able to play in the case either. But I've dropped mine a couple times on asphalt and it's done great."}
{"product_id": "B00GY4OAIE", "context": "Why did this product come in a paper sleave instead of the protective plastic blue ray case?", "response": "I'm assuming he got ahold of promo games some how"}
{"product_id": "B00HK74G2E", "context": "Can you play PS2 games w/ this PS3?", "response": "No, this PS3 model is not compatible with PS2 games. The last PS3 models that were compatible with PS2 games were manufactured in August 2007."}
{"product_id": "B009AFLXJS", "context": "How does the pro controller connect to the gamepad", "response": "It is a stand alone controller, It syncs directly with the Wii U"}
{"product_id": "B00CMSCTA2", "context": "Is there a suggested resolution at which to play the game?", "response": "Most computers will automatically set it for the best option.  But you can always go in and manually do it.  Mine usually sets it down one setting from the highest resolution setting."}
{"product_id": "B00BS520SG", "context": "Does this work with the Wireless Wavebird controller? I've seen some ppl say yes, others say no. If you have TRIED YOURSELF, let me know the answer.", "response": "I had an old pelican wireless controller that it worked with, so a wave bird should. But why do you want to use a wave bird with it? The wiimotes are already wireless"}
{"product_id": "B002I0J5CO", "context": "If I plug the green cable in to my iPod touch, will I get sound?", "response": "Just did it to mine.  Yes.  Beautiful sound."}
{"product_id": "B003YC4D9A", "context": "does it have a usb", "response": "unfortunately it don't have an usb port, but the salesman warned."}
{"product_id": "B009RXUOD4", "context": "do you recomend something else", "response": "No, this headset has not given me any problems, and when I show people, they usually ask me what kind it is. It's worth the 80"}
{"product_id": "B004RMK4BC", "context": "does it work for Mexican accounts?", "response": "Its for American Accounts"}
{"product_id": "B009Q8PP16", "context": "does this controller use sync to change mode or is there a separate button thanks", "response": "It uses the sync button to change mods, to go back you hold right trigger and press sync"}
{"product_id": "B00F47ZNP6", "context": "Can I remap the buttons?", "response": "I am sorry but I have no idea if you can. Please, ask that question to someone else who bought this product. They may know. Thank you."}
{"product_id": "B001Q24UAM", "context": "Will it work on windows 8?", "response": "Even though the cover says it is only for XP and Vista, it runs on both Windows 7 & 8."}
{"product_id": "B008RA5DIY", "context": "If we purchase Quickbooks from Amazon, does Intuit still provide support?  They tell me that you may not get their actual product.  Is this true?", "response": "Yes, Intuit will still provide support even though you don't purchase the product directly from them.  We have had no problem with calling them up and asking for assistance.  You get the actual QuickBooks Pro 2013 - 3 User product."}
{"product_id": "B00F2ENJY8", "context": "Does it come with everything you need to hook it up?", "response": "Yes, but only 1 controller"}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "Gear shifter is not attached to the wheel and can be moved separately"}
{"product_id": "B00H1FCUBY", "context": "How is the battery life on these headphones?", "response": "It almost 9 hours"}
{"product_id": "B007VH2WPQ", "context": "Will it work with an old wired controller?", "response": "I don't think so but I would look up wired controller shell then that would work, wired and wireless shells are different"}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "yes and is very good the fighting sistem, but if you are fan this is anbolutely a MUST HAVE!!!!"}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac os Yosemite?", "response": "Yes, works fine on Mac OS Yosemite."}
{"product_id": "B00D96BPL0", "context": "Anyone knows if it works on a wii u?", "response": "yes its the perfect headphone"}
{"product_id": "B000TT2D2A", "context": "Is this a wireless drum set?", "response": "I believe there is a USB cable that goes into the console."}
{"product_id": "B006NU6HAS", "context": "Does this include the 800/900 and the 600/700 or just the 800/900 ?", "response": "No, just the 800/900"}
{"product_id": "B0073QM45I", "context": "If i plugged this into my 360 controller and then the usb into my pc could it be used as a wired controller for pc gaming", "response": "No you need a reciever for your pc. Its called xbox 360 pc receiver"}
{"product_id": "B00E447L8C", "context": "will this charge a iphone4?", "response": "My iPhone 4s works fine with it, and I think it should work with an iPhone 4."}
{"product_id": "B0087N222Q", "context": "Can I use this just as a microphone paired with a Bluetooth speaker for lectures?", "response": "I would imagine that you could, but the sound quality is a bit off. When using, i do notice quite a few pops and crackles. It may be better to spend the extra $ to buy a wireless microphone."}
{"product_id": "B002CZ7P04", "context": "We just got the game and are enjoying it, but we can't get mini games to work. When we click on a game icon, nothing happens. Do they need unlocking?", "response": "I did not know \"Walk it Out\" was supposed to have mini games, so I look forward to hearing from someone who's played some."}
{"product_id": "B003ZMF26W", "context": "is comfortable this mouse with a claw grip?", "response": "Absolutely, had it for about two and a half years now and I'm a claw grip gamer, no complaints about comfort or button accessibility."}
{"product_id": "B00D3RBYM0", "context": "Does this game have multiplayer mode", "response": "It does - you can choose to play the game persistently online in the menu and other players will pop into the map. Get ready for even longer load times though and in the end it still eats your save game. There definitely is on offline single player mode because I went in and changed the settings."}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "I had the same question, so I poked around and looked for the actual dimensions of the case and of the New 3DS XL. If I'm reading the dimensions right, there's still plenty of room. The New 3DS is slightly bigger than the regular one, but there still should be room."}
{"product_id": "B00D5WDI3G", "context": "will this work with windows 7", "response": "Yes, it does.  I have it installed on my PC with Windows 7 and on my laptop with Windows Vista."}
{"product_id": "B00B3PDH5G", "context": "What's the digital out port on the transmitter used for?  Can I plug speakers into it so I can listen either through the headphones or speakers?", "response": "The digital out port on the transmitter allows it to act as a digital audio pass thru. So you can daisy chain headsets or other devices. So yes, you could pass the audio from the transmitter out to a stereo system or speakers as long as they had an optical input."}
{"product_id": "B0053B5RGI", "context": "If I were to only get one, Would you recommend X or Y?  I'm new to pokemon and have only played the Yellow Game on the Original Gameboy with Pikachu", "response": "X. Xerneas is beautiful and very powerful."}
{"product_id": "B00DH1KRQQ", "context": "where is the link to download the program that helps it run", "response": "sadly i don't think there is one. you need to use the cd that comes with the package"}
{"product_id": "B00DCBDNW6", "context": "Do you have to buy a subscription to play this game?", "response": "Yes.  When you buy the game, you get a month free.  After that it's $15 a month."}
{"product_id": "B00004XRBB", "context": "Anyone run this on windows 8.1", "response": "probably not work, I use windows 7"}
{"product_id": "B0080RAT42", "context": "will it work on a mac?", "response": "Yes, it works perfectly on a Mac.  I tried it with OpenEmu which allows you to map the buttons.  I only have the three button controller to test, though."}
{"product_id": "B004G5TUJM", "context": "How do you use the foot pedals.  I have it hooked up to the PS3 but can't seem to get them to work.  The steering wheel is working.....help please.", "response": "honestly i returned mine it wouldn't work for me at all unfortunately"}
{"product_id": "B002FY0CM0", "context": "Is this cable compatible with the Sega Master System?", "response": "It looks like the Master System has the same A/V OUT port that the Genesis has. Though I have not tried this cable in a Master System. Here's a link that can hopefully help you out with deciding what you need. http://www.gametrog.com/GAMETROG/HOW_to_connect_Hook_Up_SEGA_Master_System_Instructions.html"}
{"product_id": "B003OZOAKY", "context": "Serial key not working ,", "response": "If anyone is having problems with their product such as a defective key or a key is not included, please email us using this form: http://support.encore.com/ordersupport/order_support_frm.aspxOnce we review your request and have obtained proof of purchase we can provide you with a serial number to complete your installation."}
{"product_id": "B000266786", "context": "Does it run on Windows 7 or 8?", "response": "No... it's a great product, but it doesn't run on Windows 7 or 8.  You'll need an older Windows XP to run it.  I wish the publisher would revamp it for the newer OS."}
{"product_id": "B009XZ1CTQ", "context": "Does the game already have the pick up trucks in them or is that an added mod?", "response": "that is a mod."}
{"product_id": "B00001LDBZ", "context": "Does it play on a Windows 7 OS?", "response": "NO   I  needs a very OS like windows 98."}
{"product_id": "B001H4NMNA", "context": "Should I unplug this after my controllers are fully charged or just let the green light sit?I don't use my ps3 often so it kinda seems like a waist?", "response": "I take them off once charged. Probably  not good to have a constant charge going in."}
{"product_id": "B002BS47JE", "context": "i would like to know the differencesbetween wii fit and wii fit plus? to me the activities and everything seem the same.", "response": "yes the plus has a few more yoga poses and strenth training as well as a few other balance games too. Both are good"}
{"product_id": "B009D3HSTG", "context": "Can this be used in place of mouse for regular computer use like browsing the internet?", "response": "Sure, all joysticks can be used as mouse device on Windows platform, this can be made with third-party software such as JoyToKey of Joystick-To-Mouse. Enjoy!"}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "We had no issue installing this game on our Win7 Sony VAIO laptop. Windows saw it for what it is and auto-played as programmed. I made sure Windows was configured to do that.Game plays well on it. No issues whatsoever."}
{"product_id": "B004W1IX1G", "context": "WHAT IF I DOESN'T WORK", "response": "You can return it for a full refund."}
{"product_id": "B000U5W3IW", "context": "Do you ship to mexico?", "response": "Im sorry I do not"}
{"product_id": "B0094H8H78", "context": "Does this have internet access such as facebook page?", "response": "No, none at all"}
{"product_id": "B0087OZ5FG", "context": "does it have a cable just in case the battery dies?", "response": "Yes it comes with a cable (although its not very long) that you hook into the ps3. I usually play while the phones are charging and I have to sit right in front of the tv lol"}
{"product_id": "B005DKZSVS", "context": "Has anyone ever had an issue with the amBX control panel not adding software automatically?", "response": "I never have had that problembut it does come with a CD or you can download it from cyborgs website"}
{"product_id": "B00B98HF1O", "context": "how many players can play at a time?", "response": "Up to 4 players at a time."}
{"product_id": "B00DLRLDBO", "context": "Do you need any extra cords or items to use with xbox 360", "response": "No it comes with all you need"}
{"product_id": "B004HYIAPM", "context": "Is this game appropriate for a 12yr old? What are the \"sexual themes and alcohol\" content in here like the rating says?", "response": "If you sons, have watched a movie like gladiator or any med-evil movie, it's definitely no worse. Very mild gore, no sexual themes and minor alcohol references."}
{"product_id": "B0050SYILE", "context": "Why it is only 29$?", "response": "I bought this as a Christmas gift. It is perfect and was not a copy. Actually I thought it was a fair price and always trust Amazons vendors."}
{"product_id": "B008MI7MWQ", "context": "what games are on the disc?", "response": "Two of my favorite are on this disc that I have played at the casino, Coyote Moon, Siberian Tiger, Wild Wolf.  Other games are the following: Lucky Lines, Double Diamond, Double Diamond 3x 4x 5x, Bombay, Treasures Troy, Three Kings, Lotus Flower, Aztec Temple, and Kitty Glitter. Hope this helps."}
{"product_id": "B00CJ7IUI6", "context": "i have regular skyrim i want to know if you buy it will you get to keep your save?", "response": "Yes it comes as original but the disc has a seperate file for you to download all of hearthfire, dawngaurd and dragonborn."}
{"product_id": "B0098F1Y3K", "context": "can I play this game using nintendo ds or do i need nintendo 3ds?", "response": "Any game that has the \"3DS\" logo on the front of the package can only be played on the \"3DS\"."}
{"product_id": "B000LQ4HTS", "context": "How easy are the Profiles on the X52 Pro to program in the software?", "response": "Very easy, once you get it to work. If you simply get the latest drivers and profiler, it will not work properly. In Vista 64, running the profile completely disabled my controller.https://www.reddit.com/r/hotas/comments/38hfq0/having_issues_programming_saitek_x52_pro/"}
{"product_id": "B004FS8LYK", "context": "How much gore and eschatology does it have? Can it be reduced/censored?", "response": "It does have gore in it.  If I remember correctly there is not a lot of  cursing.  It is not for a younger child. There is no nudity or lewdness. But there is a lot of killing."}
{"product_id": "B00BKF5IXS", "context": "Does this bundle have everything needed to play regular ps 3 games. Not just move games. Or do I need another console?", "response": "i buyer ever, ps3 console. 250gb and 500gb. send me e-mail. angel.a.n@orusac.com"}
{"product_id": "B001E27DLM", "context": "Will this US version of the game work on a European version of the 3DS?", "response": "I believe it will work since the 3DS and 3DS games are region locked, but the DS games are not. Do a little research though to make sure because I could be wrong"}
{"product_id": "B000PD0HQE", "context": "does this come with the 120 gb harddrive?", "response": "Yes it should have it as it came with it originally"}
{"product_id": "B004J6KRD6", "context": "Will the T500RS work on the PlayStation 4?", "response": "A google search for this answer will be your friend."}
{"product_id": "B00D96BORK", "context": "can i connect to my iphone 5c", "response": "Yes you can. It works just like any type of headphones."}
{"product_id": "B003BKWEHS", "context": "does it work on window 7?", "response": "Yes, it does. That's the system I use."}
{"product_id": "B008SBZF2Q", "context": "Does this character work with WII U?", "response": "I think they are all interchangeable with any system but the best thing would be to call your local GameStop. They know every gaming answer!"}
{"product_id": "B00BCEK2LU", "context": "I have an old G15 keyboard and love it, but the keys are way too loud and \"clacky\". Are he G510's keys loud or quiet?", "response": "The G510 is like any normal keyboard, not especially \"clacky\" on the key strokes (not like mechanical switches)."}
{"product_id": "B00BGAA29M", "context": "I have two dualshock 4 controllers. But I dont see an option in the game to play two player co-op. can you help me please?", "response": "While playing, turn on second controller and join  in by pressing X or some other button with it."}
{"product_id": "B003VAHYQY", "context": "How long is the length of the cable?", "response": "According to Logitech it is 1.8 meters which is 5' 10\""}
{"product_id": "B000YQ639M", "context": "could this game run on a windows 7?", "response": "Yes.  Perfectly fine."}
{"product_id": "B00B1N07QM", "context": "Wife tried Nostromo and her small hand felt slightly strained to hold  in the WASD position. Is this better for smaller hands?", "response": "The Orbweaver has adjustable hand, thumb, and palm-rest modules. It will feel a lot more comfortable than the Nostromo."}
{"product_id": "B00EADTVL2", "context": "Is the version that lights up blue when charged the version you are selling?", "response": "It lights up blue when the control is fully charged. When the control is chargong you get an orange light. Both colors look cool in my opinion"}
{"product_id": "B00FC1UH82", "context": "Is this fightstick compatible with PC ?", "response": "Yes, although I have heard of people having compatibility problems depending on if they have a certain intel chipset.  Works great for me though, games like SF4 and KOF automatically recognize the stick"}
{"product_id": "B001UIG6M2", "context": "Does this Come with a memory card?", "response": "no it doesn't but you can use a  standard ps2 memory card that will work just fine!!"}
{"product_id": "B00B3PDHBU", "context": "Do they work with the ps4", "response": "Absolutely. For reference, Turtle Beach actually has a useful naming system. If the model has a \"P\" in the name, it is compatible with Playstation models. An \"X\" for Xbox 360. An \"O\" for Xbox One. And so on. Please just make sure to check for and apply any system updates."}
{"product_id": "B003V4AK8E", "context": "Where can I buy a replacement usb receiver for the power A pro elite controller?", "response": "You can buy one at a local gaming store or any gaming store. They sell them for a few bucks for the usb's."}
{"product_id": "B002B9XB0E", "context": "can this work on Windows 8 and is this only intended to be used for the SNES emulator or can I play other games I have on my pc via Steam?", "response": "This works fine for me in windows 8. Just plug and play. I used it to play a lot of games on stream like La-Mulana. Many games should support it."}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "The buttons feel real \"crisp\" and \"pop\" when you go to push them. Not in an annoying/bad manner. The joystick feels right, but at the bottom for the plastic disc part (at the base) they should have done a better job."}
{"product_id": "B007A7UJ4S", "context": "Do this game have English Voices?", "response": "Yes, all of the voices are in English."}
{"product_id": "B00AAQRNQ8", "context": "Does the mouse have a free scroll (logitech G500 calls it hyper scroll) mode on the scroll wheel, a mode where there is no clicking/resistance?", "response": "Nope..and thats why i dropped two stars a gaming mouse , especially in WoT, needs a hyper scroll, heck any first person shooter does.."}
{"product_id": "B001Q24UAM", "context": "What operating systems will it work on?", "response": "I used Windows Vista. But I think any Windows program might work."}
{"product_id": "B00EZAWV6W", "context": "So, is it possible to play against the computer only, or are you always playing against other people online? (I know nothing about shooter games)", "response": "Yes you can, you can play with 4 players against zombies ( zombies waves)."}
{"product_id": "B00GO4PTR0", "context": "this code works for ps4 to or onlyy for ps3 and how do you send the code?", "response": "I know the code works for PS4 because I got it for my son when get got the PS4 for Christmas. I personally did not put the code though, my son did when he set it all up, so I know that they give instructions that walk you through it. I hope this helps."}
{"product_id": "B00DC7G2W8", "context": "Anyone know if it will be compatible with the pro controller?", "response": "Yes, it will be compatible."}
{"product_id": "B008SBZD9G", "context": "Hi, Does this product includes the CD-Key needed to register and play?", "response": "You don't need the CD the installer is found online and you can purchase the CD key which is sufficient. Just registering online can be a hassle because of the complications on the website. Hope this helps"}
{"product_id": "B0045ZB66I", "context": "My sister would like to play it but she has a windows 8, could she?", "response": "As long as the computer meets the requirements, yes.  Windows 8 is really just windows 7 with a fancy touch screen mode."}
