{"product_id": "B00BGA9V2Q", "context": "does this version include the crusader class", "response": "No it does not"}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "Yes they come with headset"}
{"product_id": "B002I0GF72", "context": "Does this come with a booklet inside? I ask because I bought it used and there was nothing inside.", "response": "It comes with a club nintedo brochure and a paper that tells you how to access the electronic manual. The electronic manual can be accessed by pressing the home button while in-game and select the \"?\" symbol."}
{"product_id": "B00AAQRNQ8", "context": "I have very large hands, how will this mouse work out with that? I prefer palm grip, and most mice force me to use claw because they are too small.", "response": "From my palm to my index finger is about 6 1/2 inches. I can rest my hand on the mouse with the heel of my palm on the table and my index and middle finger rest comfortably on the 2 mouse buttons. This still allows my thumb to manipulate he three buttons at the thumb rest too."}
{"product_id": "B00BMFIXKQ", "context": "it is for One player or multiplayer?", "response": "You can play with other players online. But it's mostly for one player."}
{"product_id": "B00A8HIGSS", "context": "Are the menus put in english too, or just subtitles?", "response": "English. though you have the choice to change to japanese."}
{"product_id": "B00C2B355W", "context": "My son plays games on his MacBook Air.  Are they compatible with a MacBook?", "response": "It requires an optical out port, so if it has that it should be."}
{"product_id": "B00FNNQREC", "context": "How do you get the chicken eggs? I am trying to help my young son and I can't figure out how to get the eggs or how to pick up the hay to feed the cow", "response": "My son said , to pick up eggs just walk over them. Use a hay bailer and place in pasture or stalls to feed cows. Hope this helps"}
{"product_id": "B00B98HBTA", "context": "does this have hawkeye", "response": "Yes. He shows up pretty early in game, after 2nd level I believe."}
{"product_id": "B00A1Y2STQ", "context": "how many colors does it has?", "response": "I have the one with the blue lights. You can dim the backlights too. Very cool."}
{"product_id": "B00AWEMODK", "context": "Is this supported by windows 8.1?", "response": "Yes, it is. My laptop has windows 8 and it works great"}
{"product_id": "B00FNKMVUO", "context": "the thumb buttons, are they mechanical or membrane?", "response": "I can't say with certainty that the first two posts are incorrect, but they do not feel mechanical to me.  The tactile feedback on them is extremely poor, and there's virtually no auditory feedback to speak of.  The primary buttons (on the top) are definitely mechanical, but I really doubt the ones on the side are."}
{"product_id": "B00GU4F4OM", "context": "What does it mean by \"selective DPI?\" For instance, are you able to have 2500 DPI? Or just 1,000, 2,000, 4,000 etc..", "response": "It has the widest range I've ever seen in a mouse from 150 to 16400. You can set it to any number in that range, that the cursor can land on, usually 50 or 00. IE: You wont be able to get 1758 but you can get 1700 1750 or 1800 depending on where the setting lands"}
{"product_id": "B002I098JE", "context": "Is good for 9 year old", "response": "It is violent. A lot of shooting and killing people. Online can be very graphic and people are very profane. In my opinion, no, it's not acceptable for a 9 year old. If my son was 9, I wouldn't allow him to play it."}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "The one I got from astro did. Everything looks brand new."}
{"product_id": "B006PP4136", "context": "Is this starter kit made for the Original PS Vita or the PS Vita 2000/Slim? If not, which accessories that come with it fit the PS Vita 2000/Slim?", "response": "This kit is made for the original PS Vita. Ear buds sound great, pocket pouch fits perfect and snug."}
{"product_id": "B00EF1OGOG", "context": "I don't want to charge off a PC, can I charge the Anker off the AC wall charger & cable that came with the iPhone or do I need an extra cable?", "response": "Yes, you can use the charger and cable you already have for your phone. It's usually really slow when you charge using a computer vs the wall outlet."}
{"product_id": "B00002SANH", "context": "does it read to the player or does the player have to do reading on each page to understand what to do next? My child is not proficient enough to read", "response": "The \"people\" you encounter will speak, but the rest of the program will not read out loud.  However, the game IS worth the playing with you and your child together as it will help to improve your child's reading skills until they can play the game by themselves."}
{"product_id": "B002YVD3KM", "context": "Will it work using Windows 8?", "response": "I can confirm it works with both Windows 8 and 8.1."}
{"product_id": "B00AFYAUYW", "context": "Is this version backwards compatible with GameCube games?", "response": "No it is not."}
{"product_id": "B002I0H2AG", "context": "does this game really suck ballls", "response": "Uhhh yeah always do"}
{"product_id": "B00EV4O8VS", "context": "Does this bundle come with Nintendo Land?", "response": "No, only Wind Waker."}
{"product_id": "B00JFPO7JG", "context": "Why can't I start the application after installation? Mine is window 8.1", "response": "Go to the tropics website and download the hot fix to repair the box install"}
{"product_id": "B006JKARN0", "context": "In the disc of PS3    says BLUS OR BCUs?  have this option for spanish language?", "response": "Says BCUS and it does have the Spanish language option."}
{"product_id": "B000WCCURW", "context": "Does this game play on windows 8?", "response": "I went on the TitanQuestdotNet forum to look for this answer and it appears that it is possible but you may need to look around the internet for help if you run into a problem. It does pay to have a computer laying around that is a few years behind the times just for these situations : )"}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "I personally have never used it on a separate computer, though I don't believe it does. Still a great mouse though."}
{"product_id": "B00DHUUTEM", "context": "How do I control the keyboards LED's?", "response": "You nees to press and keep pressed the FN button, it is besides the right Alt, then press ESC."}
{"product_id": "B00D96BJSO", "context": "i can use it for listening for music in iphone 5 ?", "response": "What is the second cable provided ? From where I can get it ? If I will buy this headset this cable will be with it Sorry if my question is silly :D"}
{"product_id": "B007SO6USW", "context": "Does it come with a charger?", "response": "It does not. You need to use the mini USB charger that came with your controller"}
{"product_id": "B00IVHQ0KI", "context": "Can you change the gas and brake to the shifters behind the wheel in the controls options. I am in wheelchair and cant use pedals.", "response": "Dear Anthony, no, you cannot change the gas and brake to the shifters behind the wheel."}
{"product_id": "B00F27JDY0", "context": "Please, what contents are bundled with this ps vita?", "response": "The charger, the vita itself, and paperwork."}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "To keep it short, it does help you shoot quicker, but having a fast trigger finger is all depending on the player;however, the stops will help"}
{"product_id": "B008M4BNQG", "context": "Will these work with the ps4", "response": "Yes it will, it will work with all consoles and computers cause it uses a USB port for power."}
{"product_id": "B008CP6MA2", "context": "So what is this exactly? A disk per game? Everything has to be downloaded? I´d like to know if all of the games are included or not", "response": "there's 5 games included,2 are downloadable with an included voucher"}
{"product_id": "B00DBDPOZ4", "context": "Can the cable connect to -and the battery be charged by- a usb wall charging unit instead of connecting it to the box?", "response": "Scott is wrong you can charge this with a wall charger as long as the wall charger puts out enough amps, i.e. my iPad charger allows me to charge it but the smaller iPhone does not. hope this helps. I know you posted this a while ago and you probably already know the answer."}
{"product_id": "B003Q55Y5C", "context": "Will this run on Windows XP SP3?", "response": "According to the steam store page as a minimum yes it will. Recommended running requirements is vista or 7 though."}
{"product_id": "B00ANHBJBY", "context": "So does this controller register as a Pro Controller or Classic Controller? Is it wireless?", "response": "It is recognized as a Wii U Pro controller, not a Wii Classic Controller. Also, it can only be used on Wii U, not a Wii. And yes, it is wireless."}
{"product_id": "B006IOAHPK", "context": "Has multilanguage? Thank u!", "response": "I can't find any option to change the language."}
{"product_id": "B0096L2SJ0", "context": "Can you use this as a gamepad for your PC or Mac as well?", "response": "I believe you can I'm HID mode. I will check for you tonight."}
{"product_id": "B00D7UHT0E", "context": "is this good for a five year old", "response": "When I purchased this it was for an eleven year old.  I would try to get one that is made for younger children (like the Disney one).  From the dances that I have seen this could be difficult for a five year old."}
{"product_id": "B00BMFIXKQ", "context": "it is for One player or multiplayer?", "response": "It is for both multiplayer and single player. But I recommend to start single player first because by completeing missions and stuff in single you unlock more stuff for multi. But it's what ever do what you please it's your game anyways."}
{"product_id": "B0090WBXSM", "context": "Does this controller work with a Nexus 7?", "response": "It has worked on every android device that I have.  Including my nexus 7"}
{"product_id": "B00CD90R72", "context": "What is the difference between FIFA 14 and 2014 FIFA World Cup Brazil?", "response": "FIFA 14 is about clubs competition, the spanish league, the english league, the italian league, and so on.... and FIFA world cup Brazil is about national teams and competition. Brazil, Argentina, Spain, etc."}
{"product_id": "B00D4WTO1M", "context": "Hello , good afternoon , the game that sold you sell in physical or digital ?", "response": "I got a phisical copy(disc)"}
{"product_id": "B00CWFUHT0", "context": "Does it come with a HDMI cable", "response": "No it does not. It comes with one wire control, av cables, and the ps3."}
{"product_id": "B00CD1FC6G", "context": "Corsair Vengeance K70 or CM Storm QuickFire TK?", "response": "I can not speak to the CM Storm.  I will say I am pleased with my K70.  The construction is solid and rugged.  It is heavy and won't move in you.  The Cherry reds are great for gaming and decent enough for typing.  I'd make the purchase again."}
{"product_id": "B004NRN5DU", "context": "What happens if your batteries die, or perhaps you remove the battery pack (by mistake of course).  Will this trick work to render a pause?", "response": "this is a real time rpg. its what makes this game so great(some times not) . you can only be invaded when you are in human form- so stay hollow until your confident enough."}
{"product_id": "B0091WIOJ2", "context": "these headphones work with ps3", "response": "yes It's great  Headset work with ps3-4  and pc"}
{"product_id": "B003Q9RGRW", "context": "Does this come in the original box as shown in the picture??", "response": "Yes. Mine came in original box with Microsoft logos, exactly as pictured"}
{"product_id": "B002I0J5CO", "context": "Will this work for MacBook Pro (2014)?", "response": "Yes they work on Mac."}
{"product_id": "B0050SVHZO", "context": "Can the 8 GB version of the Wii U handle playing all games and the new Marvel Super Heroes?  Why would you need more than 8 GB?", "response": "The 8 GB are there for if you need to install updates or like to download games from the Nintendo eShop. However, usually the 8 GB aren't enough for some games. Thankfully, the Wii U is compatible with all USB flash drives, so that's an easy way to work around it."}
{"product_id": "B0087ZMAUS", "context": "Sorry not to ask again, but, I want to get a good idea before making a purchase. Do these feel sturdy or more flimsy?", "response": "I wouldn't give them to a 7 year old, but I've been using them for a couple of years now and they've held up well. I'd say they're more sturdy than flimsy."}
{"product_id": "B001TOQ8X4", "context": "does anyone know how the gameplay is in this game, my son played the first one to come out and he likes it so im wondering if this game is like it?", "response": "Yes, game play is the same with more freedom of movement."}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes it is. It's a little loud when typing... but I sure LOVE this keyboard. I hope that helps."}
{"product_id": "B0002GTXDM", "context": "Does the other gameboy need a wireless adapter, too? Also does this work with a GBA SP to a GB Pocket?", "response": "Sadly, no this does not work unless you have another wireless adapter. It only works with GBA to GBA (including the SP). hope this helped"}
{"product_id": "B005UI8V6C", "context": "How do you get all three games to download only the Traitor Soul will download?", "response": "When you just do the one download and start the game, it starts in an area where you can pick which of the three games/dungeons you want to enter into."}
{"product_id": "B003O6N64Y", "context": "Is it possible for this headset to work on the Xbox One ?", "response": "Just like nathan said. If you live in USA, you can order the adapter for 9.99"}
{"product_id": "B001Q24UAM", "context": "Will it play on windows 7?", "response": "Yes.  That is the operating system I currently have on my computer.  I've had no compatibility issues at all."}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "It brings a lithium battery and yes are rechargeable."}
{"product_id": "B00D7UHT0E", "context": "will this play on a Wii mini?", "response": "I wish I knew, but I'm not sure.  I bought it for the original Nintendo Wii, so I have a feeling it is not compatible."}
{"product_id": "B008GEH8LQ", "context": "Can you watch videos on this?", "response": "Yes. Both from Nintendo Video, and from youTube."}
{"product_id": "B00006B84X", "context": "Can the ch fighterstick USB be made to work with windows 8?", "response": "Yes it can. I really can't recommend the CH Products enough. I own the Fighterstick, Pro Throttle, and Pro Pedals. I know several people using this setup on Windows 8. Just head over to the CH Hanger for any assistance."}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "Keyboard and mouse. They did a great job with the mapping of the controls. Although, I suppose you could use a controller, but then it wouldn't be much like pc gaming, in my opinion."}
{"product_id": "B00B1VJZO4", "context": "Is this an expansion pack? do i have to buy sims 3 first before i get this?", "response": "Yes this is an expansion pack and you must have the Sims 3 game installed first."}
{"product_id": "B00GPH7Y8S", "context": "Do each of these games have single player options? I ask because IE 5 is required to play each of them?", "response": "Um..I only play the game 10 minutes over a month ago..I didn't like the graphics and play.. I I cant remember if the game has the option you are asking for.i wont lie and give you any answer. .hope I was any help..merry Xmas from new Zealand. .david"}
{"product_id": "B001AATQ0Y", "context": "Does it work for the PS2 Slim? My controller ports don't work, Would it work to plug in my controllers using this device instead of the standard port?", "response": "I tried it on my ps2 (fat)and it does not work so i doubt itll work for the slimon the other hand thank you i,you gave me a reason to whip that bad boy out"}
{"product_id": "B00E1L786S", "context": "does it come with or is it wall mountable?", "response": "It has legs that can be detached and it also has inserts on the back for wall mounting."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "I have Windows 7.  I don't know if Windows 7 programs work on 8.1 .  Sorry"}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "None. but, I've started enjoying Scorpion a lot. Although it takes a while to get the knack of it, it is actually fun!"}
{"product_id": "B00F68LBE0", "context": "How long is the included cable?", "response": "Three to four feet. But when I received my controller it did not work."}
{"product_id": "B00JFPO7JG", "context": "Is it online only", "response": "Single player.  You need to go online to register your CD key but that is all."}
{"product_id": "B004JQK2E0", "context": "do i have to be on the internet to install port royale 3 pc game", "response": "Michael,I do not recall having having to have the Internet connection, but I would not recommend that you spend your money on it.Bob"}
{"product_id": "B00E3667XQ", "context": "Is it true Android emulators have 1000 ms of audio lag?", "response": "1000ms is 1 second, so no, but there is noticeable lag. I was able to adjust the video settings for one of the more popular SNES emulators and I got it to a playable state, but you'll never beat a real system with a CRT."}
{"product_id": "B0088MVQIM", "context": "Does it come with a cable?????", "response": "Mine definitely didn't. Pretty disappointed."}
{"product_id": "B0017Q4DGI", "context": "What controllers do I need to have to play this game?", "response": "The Controls that come with the game console (Wii Remote Plus Controller.   At the bottom of the controller the words: \"Wii Motion Plus INSIDE.\""}
{"product_id": "B0098F1Y3K", "context": "can I play this game using nintendo ds or do i need nintendo 3ds?", "response": "You do need the 3ds.  Have fun!"}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes, versus mode, 1 player vs 2 player, and online just 1 player"}
{"product_id": "B0057WDBHA", "context": "Will this stick work with a Win8 PC?", "response": "I'm not sure. I only use it for PS3."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "Yes! It sure does, Just plug it in to a wii remote like you would a nunchuck!"}
{"product_id": "B0089OBLDO", "context": "I would like to use a Logitech G27 to play Forza 5 on an XBOX One and this \"might\" be the ticket. Anybody who has tried this please advise... Thanks.", "response": "Did not work properly right out of the box. Better try CronusMax. $49.99 and worked perfectly. Also it is plug and play. I wouldn't waste my money on this \"universal adapter\". Good luck."}
{"product_id": "B002CJ8Z04", "context": "Does it come with a Gameboy Advance Cartridge, and a DS Cartridge? Or just a Gameboy?", "response": "Just a Gameboy Advance Cartridge"}
{"product_id": "B000B6MLTG", "context": "I got an xbox 360 elite and my monitor is a samsung syncmaster s22b310. Will it work with it?", "response": "If your monitor has a VGA input, it should work."}
{"product_id": "B0045ZB66I", "context": "do you have to pay a monthly fee to play?", "response": "no, is not a multiplayer game."}
{"product_id": "B00000K4MC", "context": "Is there a digital download of this game?", "response": "You can buy rollercoaster tycoon Deluxe which includes RollerCoaster Tycoon and its two expansions: Corkscrew Follies and Loopy Landscapes for 6 bucks as a digital download off of Steam."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "No it's garbage, buy a real one"}
{"product_id": "B00FC1UH82", "context": "Is this wired or wireless?", "response": "wired, very rare to find a wireless stick"}
{"product_id": "B0051UMYLW", "context": "DRM-Free? Are the games in this compilation DRM-Free?", "response": "Thanks for the tip. I really like GOG.com, but this compilation is MUCH cheaper than obtaining all of the games separately there. Since I'm in no rush I'll check back on this later once the DRM (or lack there of) can be confirmed."}
{"product_id": "B008BT80O0", "context": "Is this the English (U.S.) version of the game or an import?", "response": "U.S / NTSC zone/ region yes... So unless you have a U.S playstation it's no good. BUT you can buy this as a digital download from the playstation store so no need to order physical version... It's not a Huge file size game."}
{"product_id": "B00008J7NZ", "context": "Can I play xbox live with this game? I mean online multiplayer. (interconnection)", "response": "LAN,yesXbox Live,I don't think so."}
{"product_id": "B003VUO6LU", "context": "which version of firware has", "response": "it came with 4.50 i believe"}
{"product_id": "B000IZAQD8", "context": "can it play ps1 games", "response": "Yes it can, just as normal ps2s can."}
{"product_id": "B002ST7AEU", "context": "Will they work with the Xbox 360 Quick Charge Kit (2 battery stand up charging base)?", "response": "I do not think they will. I believe the only base they will work with is Item # 86074-A50. This is what I use. It has 3 charging prongs as you can see in the pic of the product. The base I have has the exact same 3 prong system, and it works well. Hope this helps!"}
{"product_id": "B002RYLG4Q", "context": "Dose it play all Nes games are is it it wierd with them", "response": "Hello,You need the cartidges to play.  It does not come with preloaded games."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "Yes I have, about twenty four of mine failed after some time..."}
{"product_id": "B005EQE0YM", "context": "Are the cups on this headset circumaural (fit around the ears) or do they lay on the ears?", "response": "They Fit Around The Ears Jeff Powell &They Are Very Nice Headphones & Not Only Does My Fiancé Use Them But Me & My 4 Year Old Son Does Too!! I Hope My Answer Helped You!! (:"}
{"product_id": "B0065NP6NC", "context": "If you buy used can you still install the dlc from the second disc?", "response": "Most definitely! The install disc can be used on multiple consoles and as many times as you need it."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "I haven't opened it. So I don't know. But the keys are pretty quiet when I pound on 'em during pvp."}
{"product_id": "B0053B66KE", "context": "is it playable on ds or dsi", "response": "No, only on 3DS systems"}
{"product_id": "B00GBCLG0E", "context": "does it have a usb plug in for music,photo and video files", "response": "Yes it does in front of the system"}
{"product_id": "B000H67DDY", "context": "i want to know real weight (without case).Thank`s", "response": "Product Dimensions:  19.9 x 14.2 x 9.4 inches ; 5.8 pounds Per data supplied on the Amazon Site."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "Yes I have Windows 7 Home Premium. Worked without a problem."}
{"product_id": "B008TXMPJE", "context": "Is the online game code basically a download?", "response": "Yes a direct download"}
{"product_id": "B00BCEK2LK", "context": "Can I use the wheel to click?", "response": "yes the wheel just needs to be defined/assigned as a button within the controller software."}
{"product_id": "B00IJQJYHC", "context": "Does it have a good key response? I know it's not a mechanical one, but I like the mechanical, how does this compare?\"", "response": "This does not compare to mx cherry reds, totally different"}
{"product_id": "B001TOQ8X4", "context": "Physical copy? If so, can I download the game and play while the game is shipping?", "response": "Yes, You only need the client."}
{"product_id": "B00FQFFQ2Q", "context": "can you make you own cars in this game?", "response": "Yes. But if you try to make them outside of the career mode there are much fewer paint options. And in career mode you can't add your own sponsors."}
{"product_id": "B005FMLZQQ", "context": "Does it work with XBOX ONE aswell ?", "response": "No, I have both the 360 and the One, and it only works for the 360. There is a separate Xbox One Media remote."}
{"product_id": "B00B98HF1O", "context": "how many players can play at a time?", "response": "I do not know. Game did not work. I put on the trash can.  Buy it in a certified store or online, do not take the risk."}
{"product_id": "B00AKIPBNS", "context": "If I've never played a Fire Emblem game, will I still understand/enjoy this game?", "response": "Yes. Absolutely yes! This is the first Fire Emblem game that I've ever played, and I love it. It's probably my favorite 3DS game."}
{"product_id": "B00IVJ1M7M", "context": "Will this work with Pokemon Omega Ruby and Alpha Sapphire?", "response": "Yes it works with the new games"}
{"product_id": "B00B76QR44", "context": "will this game work with windows eight?", "response": "Yep but get 5 its  better and harder"}
{"product_id": "B00D6PTMHI", "context": "Does the cable plug into USB? My laptop does not have audio-in", "response": "The cable is 1/4\" male jack at one end and USB at the other end."}
{"product_id": "B00BQWTGIS", "context": "Is Uplay required or steam? i hope steam!", "response": "Uplay...whether you want to or not Belinda."}
{"product_id": "B002BRZ9G0", "context": "can a 5 year old play this game?", "response": "Yeah i believe so. I remember playing the original on SNES pretty young and loved it. And kids these days seem more tech savvy. There's no Gore or violence really so I think it'd be good for a 5 yo."}
{"product_id": "B00562O8U0", "context": "will these work with the viewsonic pjd5133? thanks!", "response": "Sorry! I don't know. When they do work it works great."}
{"product_id": "B001AH8YSW", "context": "Will it run on Windows 7 ?? I keep getting minimum requirements not met.", "response": "It ran just fine for me, but I got my copy from Steam."}
{"product_id": "B003O3EFY2", "context": "I know there are ports for all three types of controllers. I'm curious, could I play NES games with an SNES controller?", "response": "No, but you can use the 2 controllers that come with it."}
{"product_id": "B00HG0B8NA", "context": "can you make the cards VERY LARGE?", "response": "The only size adjustment I have found is by making the starting screen go to full screen.  I have not found a way to size the screen to a desired partial size or a way to control the size of the cards."}
{"product_id": "B00DBRM3G8", "context": "what difficulty mode is best to play on?", "response": "The hardest to get better"}
{"product_id": "B001AI7CF2", "context": "which wii has gamecube controller connections", "response": "Any regular Wii before the lastest Wii edition has Gamecube ports on the top of the device if you have it standing up."}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "No,  the unit has it's own sound card"}
{"product_id": "B00E88G054", "context": "Wired or Wireless? (one star reviews say they recieved wireless instead of the wired version)", "response": "I've had a mazer brand mouse ever since I FIRST got my pc. I bought the wireless one and I got it wireless! As so I decided to try the wired one and guess what? ITS WIRED!! So yeah, I got it wired because I wanted a wired mouse"}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "This wheel will work for both PS3 and PC."}
{"product_id": "B0017KIBAI", "context": "Is this an official Nintendo Product and does it work with US Wii consoles even though it says \"Use in Japan only\"?", "response": "It works on US wiis and gamecubes yes. They're not region locked."}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "This is from WMS Slots site. I hope that this helps:SYSTEM REQUIREMENTSMINIMUM PC REQUIREMENTSAMD/Intel Pentium IV 1GHz1GB RAMWindows XP/Vista/7DirectX 9.0c Compatible 3D Video Card (64MB or Higher)1GB Free Hard Disk SpaceDVD-ROM DriveInternet Connection"}
{"product_id": "B008O510Y8", "context": "People say this sounds \"tinny\" without an amp. What makes it sound tinny? Why don't other headphones sound tinny without an amp?", "response": "An equalizer will cover you- I am using onboard audio and these sound better than anything I've ever heard once you subdue the mids."}
{"product_id": "B00A1AQJAO", "context": "I bought a used 3DS which did not come with any AR cards and the first thing the section would ask for is a \"?\" card; would this be included?", "response": "First you have to download the software from powersave website. Plug in your powersave device into your com usb port. Insert your game card into the powersave device. Further more you will be instructed..."}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "The control, gameplay, artwork, and graphics are way better in Uncharted, but still not quick and deadly enough.  I don't like anything about Tomb Raider.  The best games for the PS3 are Crysis 2 and Red Dead Redemption."}
{"product_id": "B002672Z80", "context": "Do these have the wii motion built into the remotes?", "response": "Yes very much so."}
{"product_id": "B00D96BORK", "context": "how would i set it up for hdmi?", "response": "No idea, sorry. Have you checked YouTube?"}
{"product_id": "B00BCEK2LU", "context": "How does the backlighting compare to the venerable G11? Dimmer, brighter, same?", "response": "As I don't own a G11 per say, but got to handle a \"sample\" one in a store, I don't know the lighting aspects in all light. However, because of the wide color+alpha ranges the G510s is capable of, you can get dimmed colors and VERY bright colors. Even in sunlight many light settings come through."}
{"product_id": "B00FEOR4MY", "context": "Will the DS fit in this?", "response": "Yes the 2DS does fit perfectly in the case and has two elastic straps to hold it in place. (also both compartments zip closed)"}
{"product_id": "B001TOQ8X4", "context": "Once I install it, can I play it without having to insert the CD?", "response": "Yes,  I downloaded it and don't even have a cd."}
{"product_id": "B00EPZ8POY", "context": "does this game is in english version and the characters speak english too???", "response": "Menu in English but the speak Japanese / English subtitles"}
{"product_id": "B006POYBUA", "context": "My XBOX 360 Kinect won't connect to the USB port of my Mac. Will this solve my problem?", "response": "It did for me with a PC. You will need software and drivers to run the Kinect still. Enjoy your project!"}
{"product_id": "B00GV0LR64", "context": "(Any Ideas?)This will be my Review: I cant fix ist on any screens. I tried with LG 42\", LG 50\", Samsung 21\", LG 23\" and some other screens in a store.", "response": "Not sure what you are saying. The suction cup sticks to my 46\" lcd with no issues. What problem are you having?"}
{"product_id": "B004H7P0B6", "context": "Is this just one piece or is there a rubber attached to each piece that is removable?", "response": "It's just one piece."}
{"product_id": "B0072HYRNK", "context": "What is bulk packaging?", "response": "I'm guessing but I assume it means buying in bulk.  Large quantities of an item."}
{"product_id": "B000VRCNLG", "context": "will this game work on Windows 7 64bit?", "response": "Yes, it runs great on my Dell Windows 7 64 bit system."}
{"product_id": "B00EWEHI5K", "context": "How well does the Ouroboros perform on non-traditional surfaces, such as cloth?", "response": "It works very well Matt. As Miles have said,  performs quite well on non-traditional surfaces surprisingly, you almost dont notice the difference. To get better, the razer software comes with a calibrator surface, with shapes for the own razer mousepad, or you can calibrate according to your mousepad."}
{"product_id": "B002672Z80", "context": "Does this come with two remote controllers?", "response": "One remote control and one nunchuk controller. So yes, two in total. Not sure if that's what you mean, though."}
{"product_id": "B008NMPSEU", "context": "What games are on the disk?", "response": "I never could get mine to work and I don't know which games are on there. Sorry!"}
{"product_id": "B001MGNWDI", "context": "Does the joystick work with IL-2 Cliffs of Dover, War Thunder or Heroes and Generals?", "response": "I have never tried for that game but it works no problem for battlefield"}
{"product_id": "B008CXTW5G", "context": "does it have any warranty? I bought it several months ago, but my W is becoming more and more insensitive..so ..", "response": "mine does as well. This keyboard is terrible!"}
{"product_id": "B00INUME3K", "context": "Can this game be played on a Australian PS3 console?", "response": "It should be okay to play in your country. I live in the U.S. and I bought the game from the U.K.Worked fine. I don't think Playstation has zone restrictions like XBOX does."}
{"product_id": "B009XZ1CTQ", "context": "Okay so I've downloaded I think 4 mods for fs 2013 but can't find them during game play how do I find them?", "response": "Once they are entered into Farm Sim go into the shop with 'p' and the top it says sorted by machine type hit the left arrow until u reach mods by machine type then if they were vehicles or tools they will be there there r a few other options 2"}
{"product_id": "B00EW6QT76", "context": "Will US PS4 work on 220v? or need to buy a converter?? or it has an automatic voltage converter??", "response": "The PSU is rated for input voltage of 100-240V. It will work with power types other than 110-120V."}
{"product_id": "B00CJ7IUI6", "context": "What is the biggest difference between this legendary edition and the greatest hits version? if I just want to play the game, which version is best?", "response": "The Elder Scrolls V: Skyrim Legendary Edition is the best version to get because it comes with all DLC released for the game."}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "The best thing to use is an xbox 360 controller like i did. Just make you use a controller that support windows. (It must have a bluetooth reciver. It includes with the controller)"}
{"product_id": "B00BM7NXMW", "context": "Can the DPI buttons (+/-) be remappped, such as making them +/- zeroing for a scope?", "response": "Hm. I'm starting to wonder if you play DayZ.Anyway, yes. Any of the buttons on the mouse can be remapped to any function (such as a keystroke or macro) that you wish via the included configuration software. I'm kind of surprised I haven't done that yet, myself."}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "This headset is powered by the controller.  A wire goes from the headset to the bottom of the controller. It is always plugged into the controller to function."}
{"product_id": "B002I0HD9G", "context": "Does this work with a racing wheel", "response": "Im pretty sure that you could."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "I guess it depends on the design. The plug tip on the headphone has 3 black rings,and xbox 360 uses the 2 black ring version,so i would guess not compatible.If your talking about xbox one then that uses a usb style so again not compatible."}
{"product_id": "B00FNNQREC", "context": "whats so great about this game?", "response": "It is a good simulation of farming in a video game style"}
{"product_id": "B004RMK4P8", "context": "Hello, i Have trouble with the code... the code is USED! how can you help me with this...", "response": "You have to call Sony they will ask you to give them a picture of the code by email and they will check if it has been used recently or if its a error"}
{"product_id": "B0002L88HE", "context": "Is game compatible with Windows 8.1?", "response": "Yes, it runs on my Windows 8.1 system."}
{"product_id": "B008XHCLFO", "context": "Can the top part be taken off? I simply want the grips not the whole protection part (though that isn't bad, but i think it's ugly)", "response": "Since the DreamGEAR is in two pieces, yes, the top part can be left off the console. The material is soft & rubber-like, so it is flexible & very comfortable when holding the console."}
{"product_id": "B00D7UHT0E", "context": "are all the songs kid appropriate?", "response": "No, not really.  If you are concerned go with the Disney Version"}
{"product_id": "B008CP6MA2", "context": "It is in Spanish or English ?", "response": "English. New unseal package."}
{"product_id": "B002I0HD9G", "context": "Hi everyone, is this supported on PAL system in Britain?", "response": "Sorry, I can't answer because I bought this item to gift. I don't know anything about that."}
{"product_id": "B0080CE2WC", "context": "does this come with the rechargable batteris?", "response": "No it's just a charging dock. You would have to buy the rechargeable batteries separate. It's worth purchasing."}
{"product_id": "B0099OZR9W", "context": "does anyone know if this will work in the xbox 360 E", "response": "Yes, but the drive won't play older games"}
{"product_id": "B00005QEFD", "context": "Does the system come with the game where the bunny chases carrots?", "response": "No, there are no games with the bundle."}
{"product_id": "B00EZKNT18", "context": "Will this work on a Windows PC or not?", "response": "I bought this product several months ago and tried it on my computer. The software is somewhat compatible but ultimately this controller is not meant for Windows PC. Your best bet would be to buy a brand-name Xbox controller from microsoft"}
{"product_id": "B00E3667XQ", "context": "Is there a Micro SD card port to add content (music files, etc.); and could I download to the console from Google Play, etc?", "response": "I asked my teenage son who uses it and he said YES to both of your questions.  ;)"}
{"product_id": "B002I0J51U", "context": "Does this require a eye camera?", "response": "I'm shure it dose need one I bought both"}
{"product_id": "B0009WPZOA", "context": "Is it okay for an eight year old? I worry about language.", "response": "I have it and don't think I have ever heard any found language while playing this game."}
{"product_id": "B000B78F72", "context": "I want a cd that I can download to my pc and not have to interact with other sites and don't have ads - just a icon my husband can click on & play?", "response": "That's all he has to do is click the icon.  No ads to bother you."}
{"product_id": "B00EHBKUTE", "context": "I am purchasing equipment for an Oculus Rift that will be released next year. Does this work well for first person games? I know only WASD.", "response": "That depends, yes it will work with first person games but the limitation is how many keys you need, if the game requires more hotkeys than are available on the gaming pad than you will still need your keyboard to use all the functions."}
{"product_id": "B003ZSN600", "context": "Does this work with the Skyrim Legendary PC game?", "response": "Some games don't have controller support, but it should say. Go into setting/options on Skyrim main menu and see if there is controller support, if not then it's a keyboard only game."}
{"product_id": "B000H1V56U", "context": "Am i suppose to recieve a spliter for the fan? Because as of now, the male is 3 prong and the female is 4.", "response": "It's been over a year since I installed this on my elite. What little I remember is that everything matched up fine. Maybe different versions have different fan plugs? Hopefully someone here has opened up several original model 360s to verify this."}
{"product_id": "B0096DMDXY", "context": "Is this product for lefthanders?", "response": "I think it would be uncomfortable for a left hander'"}
{"product_id": "B00CPKUV9I", "context": "Does Wolfenstein:TNO have a single player mode?", "response": "Yes Chuck this a single player 1st person shooter game.Old school. There is no group play option."}
{"product_id": "B001H4NMNA", "context": "Is there a risk of over charging the batteries and shortening their lifespan?", "response": "No, this charger stops when the controls is completly chargeds"}
{"product_id": "B00FQPQO4A", "context": "Does this game work on the Surface 2", "response": "No, it requires a laptop or computer."}
{"product_id": "B00H4BBVZQ", "context": "Is this game the same as the definitive edition, content wise?", "response": "Pretty much the same. The only difference is the high-res, next-gen graphics on the Definitive Edition. If you just want to play the game and enjoy the story, then the 360 version is good enough!"}
{"product_id": "B00DRKJBC8", "context": "Is this the whole game or just a code for items?", "response": "Yes this is the entire game."}
{"product_id": "B00KAI3KW2", "context": "If I get this without the Kinect, can I buy a Kinect and add it on later or am I stuck with the Kinectless version?", "response": "You can add it later, when they release the kinect separately."}
{"product_id": "B002DUCF8A", "context": "Is the flap control a 3-way rotating lever, or an up/middle/down switch? I currently use one of the levers from a throttle quadrant as a flap control.", "response": "It is only a two way lever, up and down."}
{"product_id": "B00FOHP8XI", "context": "What exactly comes with the System(aside from a controller) Do I get all the cables needed?(aside from HDMI) Anything to I need to buy separately?", "response": "Yes, it comes with the basic cables needed in order to operate the system. The only extras you need are the ones you just want to have."}
{"product_id": "B0054JGGGY", "context": "how long is the battery life?", "response": "Not really sure, but I wouldn't really recommend this mouse considering price and compared to my ROCCAT XTD it reks this thing. Not trying to sway you just informing you that you should definitely decide whether you really really want this mouse or not because it doesn't seem very good from my experience with it"}
{"product_id": "B000R0SRNU", "context": "Is this a 4 player offline game?", "response": "I definitely played with one other person. However, I am not sure if you could play with up to 4 people offline. I am not sure how the game would handle 4 people playing in the same area going in 4 different directions."}
{"product_id": "B00BT71S4K", "context": "can the galaxy s5 fit in this gamepad?", "response": "I have the note 3 it fits snug so yes it should fit easily"}
{"product_id": "B000B6MLPU", "context": "This is to make the graphics better correct?", "response": "Yes and certain games like mine craft need it to use multi player"}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "It can extend, but big ears no"}
{"product_id": "B00FXOP1JI", "context": "Is it touch screen display?", "response": "The bottom screen is touch sensitive"}
{"product_id": "B00BRA9T5Y", "context": "How big is the USB dongle?", "response": "VERY small... laying flat down it is about 1 cm tall, 3/4\" long and half an inch in depth. Like a beefed of Frito. It basically just pokes out of the USB slot EVER so slightly, about 2 cm."}
{"product_id": "B002I0J5CO", "context": "is it good for hearing the steps in black ops? please be honest", "response": "My son uses it to play black ops and doesn't seem to have ant problems hearing it."}
