{"product_id": "B00CMSCTA2", "context": "Does this have campaign mode?", "response": "Yes this has the campaign mode"}
{"product_id": "B00CWFUHT0", "context": "what does cech-4012 stand for.can u use it with any smart t.v-europe or America?", "response": "Cech4012 stands for model number, and GB amount is attached to model number it can be used in Europe and America but if in Europe you will need the europeen ac adapter"}
{"product_id": "B00E3667XQ", "context": "Is it true Android emulators have 1000 ms of audio lag?", "response": "No lag on my shield with emulation of nes - Psx. Lag on remote play causes some sound to stutter or cut out buy that could be my PC or network."}
{"product_id": "B000OPOCFU", "context": "Where on the DVD is the product key.I tried entering and it still wont take it", "response": "Well The key is not on the dvd its self. It should be on the case that the dvd is in. Did you buy it used or new? Look in all the packaging."}
{"product_id": "B004S5TDUQ", "context": "Does the game work on windows 8?", "response": "Hello EthanI sent mine back to the supplier for a credit ( and lost 40% of its value ) I coulnt get it  to work on any system.Your better with Jamplay."}
{"product_id": "B00C710AT6", "context": "Does this game allow split screen mode?", "response": "You play multiplayer on the same screen, you see the whole court so no need for split screen."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "Probably. I don't have Windows 7 to test it on."}
{"product_id": "B000B9RI00", "context": "Is it a physical card that needs to be mailed, or is it a code I can have e-mailed to my account?", "response": "It's an actual card."}
{"product_id": "B00CJD4HD2", "context": "does the button on the side with the red dot do anything on this one? g500 it was just a dead button", "response": "It does nothing by default, but you can program it."}
{"product_id": "B005J37I4Y", "context": "Will this make my sons current Bluetooth earpiece for Xbox 360 work with Xbox one?", "response": "No it will not. Microsoft completely changed the way it implements audio on the Xbox One."}
{"product_id": "B00AIALGZK", "context": "Does this game support windows 8?", "response": "It works fine on windows 8."}
{"product_id": "B00D9EPI38", "context": "if all I want is to play games, is 4GB good enough, I dont need or want all the bells and whistles, just gameplay", "response": "that's all we wanted it for and so far it has been great!"}
{"product_id": "B00919RM1Q", "context": "Does this have jacks or better video poker?", "response": "Lowest payout is jacks or better, but no game called jacks or better! Lots of video poker games included. Hope this helps..........."}
{"product_id": "B00AXI9WFS", "context": "Will the figures and the stories work with 2.0 since this is 1.0 stuff?", "response": "The figures that are 1.0 will only work in the toy box mode for the 2.0"}
{"product_id": "B0072A4JVW", "context": "Does this get rid of having to use the rear touch pad?", "response": "No, no case will ever do that. The Rear Touch pad is a core functionality of the system and can't be replaced. This case gives you better grip and bigger triggers."}
{"product_id": "B002I0K6X6", "context": "Will this work with the PS4 ?", "response": "all Move products will work with both PS3 AND PS4"}
{"product_id": "B0088MVODO", "context": "i wana buy this game, but i want to know if ithe codes will be on line for dowloading the games, until what date will be the games onlie availables?", "response": "There are no codes.... they were already used"}
{"product_id": "B00DC7G3Q8", "context": "Is this for handheld Nintendo?", "response": "Yes, it is for a Nintendo 3DS handheld game."}
{"product_id": "B001H4NMNA", "context": "can a ps3 charging station charge dead controllers?", "response": "Of course the charging station can charge dead controllers.  It works exactly the same as the cord that came with the PS3."}
{"product_id": "B003O6CBIG", "context": "how many guns is their in mutiplayer", "response": "Although these are listed, it still depends what comes with your attachments, but I hope this helpsPrimary MW2 Weapons◾Assault Rifles ◾Sub Machine Guns ◾Light Machine Guns ◾Sniper Rifles ◾Riot Shield Secondary MW2 Weapons◾Machine Pistols ◾Shotguns ◾Handguns ◾Launchers"}
{"product_id": "B0086V5UF0", "context": "can you use the just dance 4 or just dance 2014 with the dance dace revolution dance mat?", "response": "No, this game works on real dance moves as opposed to jumping on the mat."}
{"product_id": "B00BQWTGIS", "context": "Is Uplay required or steam? i hope steam!", "response": "Hello Belinda, this game when you get it and install it forces you to use Uplay to install it again pretty much. If you want it on Steam you have to buy it in the Steam store, however it will still force you to install on Uplay. Hope this helped!"}
{"product_id": "B006YDPU48", "context": "Do I need to play the first one to understand whats going on?", "response": "No, but Dark Souls was very good game as well as Demon's Souls. Give them all a try, they're not only great games, but pretty cheap!"}
{"product_id": "B00AAQRNQ8", "context": "Can you program one of the buttons (side button preferably) to drop the DPI to a specified level only while being held then back to normal on release?", "response": "I will have to forward this question to my son as he is the principal user of the mouse"}
{"product_id": "B00AJXEYOG", "context": "what games are included?", "response": "Sorry, I don't remember. Mine is packed for a move.  But I do remember the whole disc was very boring. Not worth the money."}
{"product_id": "B000VBFWAG", "context": "Does it work with Window 8?", "response": "I do not know if it works with Window 8.  I have Window 7 on my pc.  Sorry.    Harold"}
{"product_id": "B00FC1UH82", "context": "does it have any headphone jack ? and if it does, where is it ?   a picture can be good for that.", "response": "no it does not"}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "yes it has a English version you can install. works great for me and i only speak/read English"}
{"product_id": "B00B1N07QM", "context": "Does the razer software allow you to assign the buttons as \"direct input buttons (directx)\" so I can configure them using another profiling software?", "response": "I tried to find out and the answer is I don't think so but I can't say for certain.  They do allow a bunch of separate profiles and macros.  I really like changing the capslock to cntrl on my keyboard"}
{"product_id": "B00F4GSAYI", "context": "i now know that there is a separate disc for the dlcs, but do i need xbox live to download and play them?", "response": "No the disc installs in ur hard drive it is saved there so no u don't need live just to play it"}
{"product_id": "B003O6JJKY", "context": "is it working good?", "response": "Good afternoon, so far it has worked very well. Colocale small fan nearby to keep it cold, so other very well. To your order"}
{"product_id": "B0073QM45I", "context": "This cable works without having a battery? I mean, It will charge my controller without a battery inside?", "response": "No, this cord is to recharge the battery packs that you can buy for the controllers that don't use AA batteries."}
{"product_id": "B0053B66KE", "context": "Can you use a DS or DSI?", "response": "Yes, d's or dsi"}
{"product_id": "B005L38QK2", "context": "Is anyone else having an issue where the cursor doesn't react appropriately. it's like going into a \"seizure\", or something.", "response": "No issues with mine."}
{"product_id": "B004YC4NN0", "context": "Does it work on a Macbook Pro?", "response": "I have not been able to get it to work on a PC or a MacBook.  really disappointed with the product."}
{"product_id": "B003O6N64Y", "context": "Is it possible for this headset to work on the Xbox One ?", "response": "Yes it can work on the Xbox one, in order for it to work you have to buy the and xbox one adapter for the headset"}
{"product_id": "B0000CNUUP", "context": "Please advertise that this runs through the steam client. I expedited the shipping and basically paid 4 times for something i didnt want.", "response": "I bought a boxed copy specifically because I dislike Steam and what's the first thing I see when I open the box? \"This is a Steam game.\" Automatically three stars off any review I might write for completely failing to disclose it requires unwanted 3rd party software."}
{"product_id": "B00FLLFJ68", "context": "Is is possible to power this with a USB cord running from the PS4?", "response": "No it's designed to be plugged into an outlet."}
{"product_id": "B003NVMEVQ", "context": "Do you offer international shipping? (More precisely for Macedonia)", "response": "Amazon does all my shipping, so I believe they do."}
{"product_id": "B00FQFFPZO", "context": "Can you list the track locations -- other than the Daytona, Sonoma, Talladega?", "response": "Bristol,  Darlington,  Atlanta"}
{"product_id": "B002P35JMO", "context": "Does this adapter plug into the controller or the actual Xbox 360? The port in the photo looks different then the port on our wireless controller?", "response": "The actual Xbox. This plug is for a sound bar if you use your HDMI port to a HD tv."}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "Nope, as long as you get the XTD version, it comes with an external sound card. I highly recommend this headset if you have the dough for it. It's super comfy and sounds insane."}
{"product_id": "B00GANWVJE", "context": "Is it different enough from ALTTP to where I won't feel deja vu?", "response": "It has the same landscape as Link to the Past, but has its differences."}
{"product_id": "B0038PBF1W", "context": "How do I order more add on aircraft for this sim?", "response": "yuplay has addition \"skins\" to the default aitcraft, which are free, and on the Wings of Prey forum, the community also has additional skins. I have the \"skins from Yuplay, but have not used the ones from the forum, due to difficult and lenghty download process for these, so have no opinion as to their use."}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "Yes it does. I believe it gives you 7 character slots? It may be 8."}
{"product_id": "B00009TW6R", "context": "Can you play using a game controller, or is it keyboard/mouse only?", "response": "Just the keyboard and mouse. The second one allows the player to choose between the 2"}
{"product_id": "B00BI4VVGY", "context": "Are the blue LED's brighter than the picture, or are they really that dull blue?", "response": "They're not blue at all... They are actually white.I wouldn't trust these controllers. I have 2 and both change from auto to manual controls at random."}
{"product_id": "B001Q55D5K", "context": "will it work with windows 7?", "response": "Windows 7 is not real \"game\" friendly. I will work so long as you set the game to work under Win XP. But you need to change the compatibility settings for the program, either manually or by using the Program Compatibility troubleshooter."}
{"product_id": "B002I0H2AG", "context": "I played Gears of War 3 and liked the campaign.  Should I give this game a try?  Is it a must play for 360 owners?  I am only interested in single player.", "response": "I always play single player and this game is great you should try it"}
{"product_id": "B004FS8LYK", "context": "why is it rated m for mature", "response": "Violence primarily, but there are a few instances of Adult Language."}
{"product_id": "B00B23MO9Y", "context": "Hello, I ordered this game and when i tried registering for my playonline account it said the Registration code was invalid/used.", "response": "Did you buy it used? I would contact customer support. Call their number and speak to a representative."}
{"product_id": "B00BGA9YZK", "context": "Is this just another graphical showcase like Ryse was for the X1 or is there an actual game hidden in here?", "response": "I couldn't get into it long enough to find out, it just wasn't interesting to me."}
{"product_id": "B000OLXX86", "context": "Does this game come with the DLC?", "response": "? Which dlc ? Don't remember"}
{"product_id": "B003VH5Z2C", "context": "I didnt realize my TV didnt have a Yellow in for video. Is there anythying I can buy that will convert the yellow and white plugs to HDMI?", "response": "Check with best buy they have connectors for that"}
{"product_id": "B009GTV5HS", "context": "Does the \"intelligent software\" work on Mac OS?", "response": "I think so, but you have to download the Mac version from their website rather than the CD that comes with it.Link:http://www.ttesports.com/productPage.aspx?p=68&g;=ftr#.UubC900o6ic"}
{"product_id": "B001TOQ8X4", "context": "Once I install it, can I play it without having to insert the CD?", "response": "Once the game is installed, you play from the internet. You'll get weekly updates that download when you log in. There is no need to have the CD in the computer. Just be connected to the internet."}
{"product_id": "B00BGA9YZK", "context": "can you play off line as a single game or is it just multiplay mode. do i need to buy playstation plus?", "response": "You can play offline in single player compaign. Multiplayer mode can only be played online."}
{"product_id": "B002CZ7P04", "context": "I was addicted to the Island Cycling game on Wii Fit Plus.  Is this game as fun in your opinion?", "response": "Unfortunately, I never played that game.  My grand kids LOVE this game.  Very much like watching their step count increase.  So much better than watching them sit on the couch."}
{"product_id": "B00C2B2Y9A", "context": "What's the durability? I am very careful with my electronics. How long do these last?", "response": "They seem firm. Haven't had them that long so I don't know if they will last. Though they seem good so far."}
{"product_id": "B00DB9JYFY", "context": "It states rated for M -- my son is 10 and loves that his friends play this game online with classmates -- how concerned should I be about the content?", "response": "The content is  pure war, and multiplayer only you will need membership gold.  If you boy play Call of Duty or Gears of War, well this game its the same the content as you wrote its for mature."}
{"product_id": "B00GY4OAM0", "context": "Does this game require the use of nunchucks?  Or can I use a classic controller and Wii U gamepad?  Nunchucks never work long for us...", "response": "Yes, you use the nunchucks.  Unfortunately we have the same problem.  It is the wires getting pulled and loose."}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "lol... I paid $5 something funny is going on."}
{"product_id": "B006PP404Q", "context": "Will this perfectly fit on PS Vita 2000 (slim)??", "response": "if it has a 5 inch oled screen then it should"}
{"product_id": "B004XGN8W4", "context": "will the white xbox 360 fit?", "response": "Yes it will the Xbox Slim is the Black one and the xbox 360 is the white one and the ps3 slim all fit"}
{"product_id": "B007SRM5U6", "context": "Does this game have an option for skill level? Can it be played on \"easy\" or \"beginner\" for instance?", "response": "Yes this game does have a diffulty option before you start."}
{"product_id": "B003O6CB6S", "context": "Does this game have any requirements like the downloadable version?", "response": "exactly the same as the d/l version except shorter install time cause you have the dvds"}
{"product_id": "B009Q8M816", "context": "does it work for black ops 2", "response": "Yes it does it works pretty good on that game"}
{"product_id": "B004C4U1VI", "context": "am I doing something wrong? the cable doesn't work", "response": "Probably, mine works perfect. You will need to provide more info about the setup for someone to give a meaningful answer."}
{"product_id": "B008SBZD9G", "context": "So I heard spam bots and farming bots rip this game to shreds, not a very wise purchase wouldn't you agree?", "response": "Absolutely not! I havent had a more friendly environment than this game. Sure there are gold spammers here and there, but thats pretty much EVERY game. But as far as bots go? Who? Where?"}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "There is a optional attachment that it comes with, a plastic hands rest"}
{"product_id": "B00HWMP0TU", "context": "Does the PC DVD version require any downloading or is it all on the DVDs?", "response": "The DVD is just a link to Steam and a CD Key.  So you do have to download all of it.  I didn't mind though, because the game is so awesome!!!  Good luck. : )"}
{"product_id": "B0080RAT42", "context": "will it work on a mac?", "response": "I wish I could say, but I have no familiarity with MacOS.  On a PC it was completely plug-and-play, no driver installation or anything, so it's possible, but I can't say for certain.  Sorry :("}
{"product_id": "B00B3PDHBU", "context": "Is it possible to use one set of headphones with an XBox 360, PS3, PS4, and XBox 1?", "response": "Yes, but different consoles may need extra accessories"}
{"product_id": "B00HHUSNPU", "context": "Will it affect the movement of the thumb sticks?", "response": "it will but not that much"}
{"product_id": "B003NSLGW2", "context": "Will these still fit snugly and not slip off easily if the original joystick cover has completely come off?", "response": "yes it will fit very snugly wont move at all"}
{"product_id": "B00CTKHXFO", "context": "I thought that older games, such as MGS2, were not backward compatible with the PS3. Will ALL these games work on the PS3 Super Slim?", "response": "Yes all these games have been altred to run on PS3"}
{"product_id": "B004MR3QY4", "context": "What is the difference with the black edition?", "response": "Well, DPI on Black Edition is up to 3500 on infrarred sensor, while on the 2013 edition is up to 6400 DPI optical. The texture is different and sidegrips is also other material. Also the 2013 has lights and stuff and the scroll isn't the same either. And the price. Hope it help!"}
{"product_id": "B004IK24MU", "context": "How long does it take to fully charge the batteries? Also is there an indicator to let you knowthey're charged?", "response": "Not long. The light changes colors when fully charged"}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "I also would like to know if this is compatible with Windows 7."}
{"product_id": "B009Q5XGO2", "context": "how many mha has this nyko battery?", "response": "Sorry to this man but it doesn't say. All I can tell you is that this battery is exceptional and can have you playing on your Wii U for over 15 hours if you can work it right. Its a real great find and I highly recommend it. I promise you won't be disappointed."}
{"product_id": "B0088MVQIM", "context": "includes version for bass or should I download?", "response": "Yeah, it has both guitar and bass options."}
{"product_id": "B008O510Y8", "context": "Is the adjustment band made out of metal?", "response": "nope. The adjustment band is made out of plastic, but let me tell you the headset are amazing."}
{"product_id": "B001CXYMFS", "context": "Would this work on Star Citizen alpha?", "response": "This is a great buy for Star Citizen's. One of the top reasons if not my number one reason for getting it. Tested and works great, surprisingly made well!"}
{"product_id": "B001444IN6", "context": "Dose it work on Windows 8 ??", "response": "I've heard the double deluxe works fine on windows 8 and 7. because the sys requirements were raised a little higher on the coding on the disc so it should work. It works fine on my win 7."}
{"product_id": "B00006C2HA", "context": "Will this work on Windows 8", "response": "Yes it does.  I have 8 and it works fine."}
{"product_id": "B00BGAA29M", "context": "I have a PS4 and looking for games for my 5 year old son. Would he be able to play this if not do you suggestions?", "response": "This game is excellent for kids and adults alike. An easy platformer that is clean and enjoyable."}
{"product_id": "B002I0KP4G", "context": "Does this come with the Baneling pet?", "response": "hello friend linda, this is the regular  non-fancy package. you may wanna look for the special edition one. =) have fun and LONG LIVE THE SWARM!!"}
{"product_id": "B00B5QLS4A", "context": "Is this mouse comfortable with large hands, i currently have a g600 and it just isn't comfortable for my meaty hands anymore....", "response": "I wear a large glove size and the Corsair feels comfortable to me."}
{"product_id": "B009DYOPK0", "context": "I was wondering on a level 1-10 how loud the clicks are? odd question but gaming annoys the girl friend lol", "response": "I'd say 2 or 3, but I don't know how you'd perceive that but it's tiny bit quieter than a normal mouse"}
{"product_id": "B00CX8VY4S", "context": "Is this watch dogs a disk or download", "response": "Both. You can grab the disc at a store or you can get the digital download in the Xbox or PS online stores."}
{"product_id": "B00576U8CC", "context": "On a scale of 1 to 10, how difficult is it to play the first couple hours of the game?", "response": "1, if you are familiar with shooters.  A tad more, maybe 3 if you are not."}
{"product_id": "B001B5U80K", "context": "I have a Netbook without internal DVD player. Do you need to have the DVD on the system (external) to play it?", "response": "You can Download the game and play it"}
{"product_id": "B002I0KP4G", "context": "Is there a way to redeem this through battle.net after I order so I can DL and start playing or do I have to wait for the physical copy to arrive?", "response": "You need the activation code from the disk."}
{"product_id": "B0094H8H78", "context": "Where do I find games to download onto the SD card?", "response": "coolroms.com, go on youtube and check out the videos on how to download them. ex. how to load genesis roms on atgames handheld."}
{"product_id": "B00E1L78N6", "context": "Did the controller update with little to no improvement for my mic. Did you guys have the same issue?", "response": "The near field Mic that snaps out of the headset still sounds far away. If you call Polk and ask for the tech department they will send you a boom Mic cable that works great"}
{"product_id": "B00008J7NZ", "context": "Does this play on xbox 360?", "response": "We couldn't get it to work on ours."}
{"product_id": "B000OLXX86", "context": "Does this come withthe bonus content disk?", "response": "Yes, it comes with the bonus content disc."}
{"product_id": "B00KGGJPYA", "context": "Does this work with an ipod touch 5??", "response": "It works on my iphone 4s, iphone 5, ipad air 3, and my ipod touch gen. 2 so I'd say it works."}
{"product_id": "B00E1DMWBM", "context": "Can this system emulate games other than Genesis, like SNES?", "response": "Sorry about the PS4 my phone auto corrected incorrectly. I meant PSP clone"}
{"product_id": "B005L38QK2", "context": "What is the actual size of the mouse?", "response": "About 5 inches by 3.5 inches it fits very comfortable in the hand because of its unique wave design."}
{"product_id": "B00HS5FETM", "context": "will this work for Xbox360? and also will it work for the turtle beach phantom headset?", "response": "This particular cable is specifically for the PS4. For an Xbox 360 talkback cable for a Phantom headset model, click here: Turtle Beach - Ear Force Xbox 360 Talkback Cable with Foam Windscreen- Xbox 360"}
{"product_id": "B004ASOLLM", "context": "I have one of these I got from a friend but no charger what kind of cable does it require to connect to headset?", "response": "A standard headset will connect."}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "Actually not sure as I have the steam drm version myself. I have also learned alot about the game since ive bought it and regqrdless 9f the previous faults or my confusion,  I have fallen in love"}
{"product_id": "B001CC8UBG", "context": "Does it include online playing?", "response": "Yes, I purchased this product and I am able to play online."}
{"product_id": "B00BMFIXEW", "context": "how many people can play at the same time? does it support the wii remote plus control? is t necesary the nunchuk controller??", "response": "This is a single player game. There is multiplayer for online only. It supports the gamepad & classic controller pro."}
{"product_id": "B004RMK4P8", "context": "What do I do if I'm buying the playstation card for someone do you give me a code to give them..I'm older and don't know anything about this.", "response": "It will email you a code"}
{"product_id": "B00H1FCUBE", "context": "If I use these headphones with ps3, would I hear the game sound in them also?", "response": "Yes, you could hear the sound.The headphone can connect with the PS3"}
{"product_id": "B003N3HEU0", "context": "We have the older Wii.  Will this game work on it?", "response": "It should! Mine's from 4-5 years ago and this game works on it."}
{"product_id": "B004N7HSGU", "context": "Does this really weigh 2.2 pounds? I ordered these and I might cancel my order....", "response": "The headset doesn't weigh 2.2 pounds, but everything together combined does weigh 2.2(wires, mix amp, headset, and a very nice box thats a little heavy)."}
{"product_id": "B00E447L8C", "context": "I ordered this item and does not fit my iphone 5? Am I missing something?If not I would like to return.", "response": "It says \"compatible\" with iphone 5, meaning it's BYOC--bring your own cord. Amazon sells their own knock off that's like 8-9$ which I found to be well worth it as this thing charges so well."}
{"product_id": "B0000695GX", "context": "What about Windows 8?", "response": "No. When I looked into upgrading to windows 8 that was one of the programs it listed as being non-compatible"}
{"product_id": "B00FOGFP0A", "context": "If this is a UK release what are the downsides of playing it in other country? i mean codes, or is it even playable outside UK?", "response": "you cant get the downloadable content. my boyfriend is able to play it just fine in the US. only downside is you have to download all of the games except AC3 onto the harddrive and it takes up a lot of space. wish I would have just bought them all separate now"}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "2 players on the same screen. 2 Xbox 360 controllers just work great for the PC."}
{"product_id": "B008M4BNQG", "context": "do you have to be online to hear the game 0r cani hear it off line by my self playing my game", "response": "You can hear the game when playing on-line and when playing alone off-line"}
{"product_id": "B00DFB99UI", "context": "Does this wheel work with any type of racing games for PS3 for expample Grand turimo?", "response": "Yes. It is PS3 capable. It should have no problem!"}
{"product_id": "B009DYCTY4", "context": "does the product come with a controler", "response": "Yes a controller is included as well as the charge cord for it."}
{"product_id": "B008UQWX0Q", "context": "can normal nintendo ds games work on this?", "response": "Yes, Nintendo DS  will work with this system, but the new one like 2 or 3 DS  will not wwork on this"}
{"product_id": "B00DB9JYFY", "context": "It states rated for M -- my son is 10 and loves that his friends play this game online with classmates -- how concerned should I be about the content?", "response": "I'll begin with I'm 30 and I'm not father. I play this game and it's really exciting, it has parkour, giant robots and a lot of guns, it's so fast that you don't realise the implied violence. You may want to keep an eye on your son if he start trying to run on walls ;)"}
{"product_id": "B00GV0LR64", "context": "can this be used with the xbox one", "response": "Ya it usb powered u can plug it in A wall and it would work"}
{"product_id": "B00B77OKNI", "context": "Is it updated to new firmware, to the one it makes it an HID-compatible?", "response": "no its not and with the operating software removed from all faucets of the app stores and anywhere for that matter its next to impossible to use personally I have not been able to use  it since ive owned it for almost a year now"}
{"product_id": "B00I9GZZGG", "context": "Does the microphone fold up?", "response": "Yeah! It works very well!"}
{"product_id": "B0098W4ZD4", "context": "will this work with windows 8 ?", "response": "It will work with anything if it has a usb hub, even a tablet."}
{"product_id": "B00D8S4GNS", "context": "Does the DLC from JD4 work with JD2014?", "response": "Tried two copies and neither worked."}
{"product_id": "B00CX8VY4S", "context": "Can you jump in this game?", "response": "No jumping. Hurdling over objects."}
{"product_id": "B004N7IIQ4", "context": "Is the Mixamp the 2011 ed. (pictured) or 2013 w the eq presets (as described in item) ?", "response": "got the black version from the maxproductsales seller listed (with Amazon fulfillment) and it was the 2011 edition"}
{"product_id": "B0086V5UF0", "context": "Do you have to buy another wii remote if you have another player?", "response": "You will need a remote for each player."}
{"product_id": "B000B6MLTG", "context": "would this fit a xbox 360 slim need help?", "response": "The 2010 360slim but not the new 360E"}
{"product_id": "B003O6CBIG", "context": "Is this game worth $11.90? The video looks dope and almost makes Eminem tolerable. I see good and terrible reviews. So is it worth 11.90 on PS3?", "response": "Lol not sure if you trollin' but for $12 its not bad if you planning to play just multiplayer online. The campaign (story) mode sucks ass tho."}
{"product_id": "B00HPU96FI", "context": "I have one question.  I get video from this cable, but no audio at all.  Is there any way to get sound from this cable when it's plugged in?", "response": "Your tv has to have a splitter that takes a 3.5m plug like StarTech MUYHSFMM 3.5mm 4 Pin to 2x3 Pin 3.5mm Headset Splitter Adapter - F/M"}
{"product_id": "B00AR1LX9O", "context": "are these headsets good for FPS games like Call of Duty and Battlefield", "response": "Yeah they are great I have yet to use them.in console but they are excellent on pc"}
{"product_id": "B006W41X36", "context": "can you pair wireless headphones to it", "response": "I think not. Its a wired system"}
{"product_id": "B006YDPU48", "context": "On the PS3 version, do you experience difficulty connecting to the servers due to overload (not due to a banned account)?", "response": "I never experienced any difficulty connecting to the servers. They seemed more stable than Dark Souls server. I also found that it was much easier to summon other pkayers or be summoned. Likewise, it`s more easier to invade or be invaded."}
{"product_id": "B0002XJBGE", "context": "rumble pad work on 64 bit vista???? Can these things work on the 64 bit vista program, and if not, which game pad does?????", "response": "I have windows 7 64bit, running Intel i7 extreme processor.i really wonder if there is any controller tested that can work on windows  64bit!!!!appriecate your output"}
{"product_id": "B005L38QK2", "context": "What is the actual size of the mouse?", "response": "6 inches long and three inches wide  (it's curved)"}
{"product_id": "B00FE8WKPQ", "context": "will this board work with my old wii disc", "response": "I'm not sure what your \"old wii disc\" is, but the balance board used with the Wii is the same for the Wii U."}
{"product_id": "B00DNHLFQA", "context": "will this work with win 8.1? Thank you.", "response": "Yes, I had to run it in compatibility mode to get it to run well and have better control the scrolling."}
{"product_id": "B0050SXFKE", "context": "Can you play this game on a PS4? I am looking to buy a PS4 for my son but he wants Assassin's Creed 3 and it looks as if its only for PS3. Ty", "response": "I think it can't played on PS4.Actually I don't like the AC3"}
{"product_id": "B00E88G054", "context": "How loud does the mouse click? Reviews say that they got wireless mouses instead, I will most definitely receive a wired mouse, correct?", "response": "It sounds normal like any other mouse clicks and you will get a wired mouse no doubt. It works very well."}
{"product_id": "B001AATQ0Y", "context": "does this work with ps2 DDR pad?", "response": "Not sure...  Different interface."}
{"product_id": "B001AATQ0Y", "context": "can i plug in the original play station 4 way multi tap and that way i can play 4 controllers on one plug?", "response": "I don't think so, the adapter is probably designed only for 2 controllers.  Also, I'm not actually certain if the adapter itself would work with the PS2."}
{"product_id": "B00H8NS1K8", "context": "Anyone else's ear cup joints a little loose/wiggly?", "response": "I've had mine for about a year and i can't say i've ever noticed it being loose in any way."}
{"product_id": "B00B1OK3TC", "context": "Does it works for wii", "response": "I don't think it does, I use it for xbox 360, and the box says it's used for xbox 360, PS3, or PSP. Nothing about wii."}
{"product_id": "B0018YXM3Y", "context": "why do I have to use steam?", "response": "to see your achievement, and you need steam to launch this game"}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "Its in one nice folding box, but its not steel."}
{"product_id": "B00I4C2EKA", "context": "Can I play this game on a non-gaming laptop that is just a couple years old, or will it run slowly?", "response": "Does your laptop have a graphics gard?  I suspect you may need dedicated graphics for this one.  It runs great on my 2012 laptop; but, I have a Geforce 600 series graphics card installed.  If in doubt, you might try www.systemrequirementslab.com, which may be able to give you a preliminary answer."}
{"product_id": "B0050SVNP8", "context": "I wasn't able to play the first Pokemon B&W due to Nintendo cutting the wifi access, will this game spoil the experience of the first game?", "response": "I never played the first one lol I love this game it's very fun I guess it doesn't matter longs u have fun"}
{"product_id": "B00G21VQ2M", "context": "Will this work on a US vita? Or does it have to be a Japan vita?", "response": "Yes it will and also the updates ..the game is awsome but remember the game is in Japanese so u have to go online and find translations to the menus"}
{"product_id": "B003O6EE4U", "context": "do you ship this item in its original box?", "response": "yes you can. Always keep the original box the product comes in."}
{"product_id": "B00HG0B8NA", "context": "I like the game but I don't here only thing", "response": "I love All-in-one Solitaire... It is fun to Play and has enough variety to keep me from getting bored. I would recommend it to anyone that likes to play Solitaire Games..."}
{"product_id": "B00C2B355W", "context": "does the mic work wirelessly with ps4 or does it need to be connected to the controller?", "response": "No I doesnt need to be connected with the control    You could do It but that's up to you"}
{"product_id": "B004SJFJUA", "context": "Does it come with just the base or the Base+Battery? , Battery by itself  is 20$ here Nyko Power Pak+ for 3DS", "response": "Yes it comes with the base and battery"}
{"product_id": "B00H7KDNBO", "context": "What is instant access? Is it like getting the digital code?  Will the same code work for Xbox Juan?", "response": "You put the code into Origin. Doesn't work for xbox."}
{"product_id": "B00DC9T2J6", "context": "Will Titanfall run on a macbook pro?", "response": "Yes, if you load Windows 7 or 8 on the MBP; however, you failed to mention what year your laptop is, and that will make a significant difference."}
{"product_id": "B008HPAXZ2", "context": "how many come in the pack?", "response": "2 screens, 1 for touchpad and 1 for Top screen"}
{"product_id": "B000TK99PS", "context": "Will this 2008 version work on Windows 8? Thank you Cee Cee", "response": "Yes it does work."}
{"product_id": "B000BAVN14", "context": "I've heard that since this is an older copy a Used copy links to one account, if I buy Used can my wife still play it + the expansions?", "response": "I got this and it plays fine on windows 8. And used codes work even if used."}
{"product_id": "B0000CNUUP", "context": "Does this have to be installed through steam?  I don not have internet on my gaming computer.", "response": "The copy that I received does. The US version does not, but I think I got the euro version, which requires steam activation."}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "Long enough? 3 feet between my keyboard and tower plus some extra slack."}
{"product_id": "B00D3RBZHY", "context": "Does this game have a online code inside required for online play?", "response": "No, none of EA's titles requires an online pass anymore."}
{"product_id": "B00D96BNGM", "context": "Does it come with OEM Box?", "response": "Mine did, factory sealed"}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "I have an United states based PlayStation three and it works fine.just to inform the game is completely in Japanese side from a few things but you should be able to get by without knowing it. Lastly there should be an updated version of this game available."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "Yes. That is what we used it for."}
{"product_id": "B004EJ0L8E", "context": "Is it usb plugged?", "response": "Nope, 3.5mm although I'm sure you can find a converter."}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3", "response": "No it DOES NOT work with the ps3 console. However there are a lot of blue tooth headsets that are great"}
{"product_id": "B004X56PWK", "context": "Can you use remote play with the playstation vita slim", "response": "I have not used it yet"}
{"product_id": "B00I9UVY7G", "context": "Will be able to see the coaches celebrations? Specially \"el piojo\" Herrera coach from mexico celebration", "response": "I used the USA and Germany so far and both coaches celebrated the same way (nothing unique) so I'm assuming Piojo would not celebrate like he would in real life."}
{"product_id": "B001E27DLM", "context": "Will this US version of the game work on a European version of the 3DS?", "response": "It works in my european DS Lite. The DS games don't have region lock. It should work in your european 3DS."}
{"product_id": "B000GCJ6MK", "context": "Does it work on Mac?", "response": "I don't think so."}
{"product_id": "B0033WFJFS", "context": "how can you use a xbox360 controller can you give a step by step intruction", "response": "this is not a 360 controller, but you can load it with xbox360ce and it will work in games that need a 360 pad... however only the pro version stays resident otherwise you have to copy the files in each game that needs it."}
{"product_id": "B00E1A1SP6", "context": "Can you play retro NES, SNES and N64 games with this?", "response": "No it cant play them. Only plays DS, DSi, and 3DS games. But some games have been rereleased as a game for DS. Example the classic sonic the hedgehog games got released as \"sonic classics\" a DS tittle. \"Namco museum DS\" is another good DS game, it rereleases old arcade games like \"galega\" and \" Pac-Man\"."}
{"product_id": "B004C4U1VI", "context": "am I doing something wrong? the cable doesn't work", "response": "The picture after mine was hooked up was black and white."}
{"product_id": "B00AIALGZK", "context": "i paid for this and downloaded it, it needs a code to activate the game, so where is the code?", "response": "It sent mine to my email so check your email and if it's not there then I don't know we're it would be."}
{"product_id": "B003O6EE4U", "context": "do you ship this item in its original box?", "response": "I ordered my 9yr old son this for Christmas, and it came in the original box."}
{"product_id": "B006QRMR4S", "context": "does the 3DS come with the animation app like the DSi did?", "response": "No and Yes.If you are buying/have a Japanese 3DS you can download Flipnote Studio 3D for free from the eshop.Flipnote Studio 3D is not available in other regions for now."}
{"product_id": "B004S5TDUQ", "context": "The description says it comes with the cable, but does it?  I already got burned by another seller where the description said it came with the cable.", "response": "I just received it today and it has the cable. In fact, if you look at the price of just the cable alone it is the same as this old version of the software, so you are really getting a good deal with the old software and cable bundled together."}
{"product_id": "B002B9XB0E", "context": "Does this work with raspberry pi?", "response": "I had it working with a Raspberry Pi for 3 days before it stopped working.  Was great while it worked."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay an additional  membership for playing the game or is  it enough with buying the game?", "response": "Nope, nothing added.  Last I played, too many hacks, but no additional membership."}
{"product_id": "B000P46NMA", "context": "Is this the first game in the series?", "response": "Yes this is the first game in the series. and http://en.wikipedia.org/wiki/Assassin's_Creed has a breakdown of the rest of the game in order."}
{"product_id": "B00D6NPFDK", "context": "Can you use the Swap force with the Trap team?", "response": "Dear value Amazon Customer,Thank you for your questionUnfortunately, the Trap Team will not work with the Swap Force. The Trap Team only works with the new portal, however all Skylanders figures will work in the new portalThank you for your interest and we wish this information help you."}
{"product_id": "B001IYR53W", "context": "Does this game have gin rummy included?", "response": "Hi. There is a game called Gin, and another called Gin 500. I don't play. Hope this helps."}
{"product_id": "B00AJILG1K", "context": "What do you people mean by this keyboard doesnt have a caps lock key? i see this in some of the lower ratings like 4/5 stars.... care to explain?", "response": "it has a caps lock but its serves other funcions as well its the arrow with the (+) sing you can see it on the main picture its a good keybord reccomend it"}
{"product_id": "B008XHCLFO", "context": "I'm sure it won't but will this fit with a plastic case already around a 3DS XL? Please only answer if you know. Thank you.", "response": "Second thought - If you mean the plastic case that is around the 3DS XL as it comes out of it's box then yes, the Dreamgear fits perfectly. If you have attached some other protective sleeve or cover then you would have to remove it before installing the Dreamgear. Sorry for my confusion, I'm 70."}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "Not in the original package.  Usually tree Rex comes in a pack.  When sold separately after coming in a pack he is \"loose\"."}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "It comes with an attachment that extends the arm rest"}
{"product_id": "B004QRKWLA", "context": "does it work with steam games?", "response": "Yes, it has worked with every Steam game that I've tried.  I have not had trouble getting any pre-XInput games to work, even older DOS games that use DOSBox.  What I *have* had trouble with is getting non-XInput controllers to work with newer games, but never the other way around."}
{"product_id": "B00D9FQAM0", "context": "Would I be better off buying the 250g Elite (the older, black model) or this newer version? I use my Xbox solely for FPS/Netflix", "response": "This one for sure , better system for the $ the elite made noises and always messed up so get this"}
{"product_id": "B00BDS415I", "context": "How durable is this headset? I want one that can last me a few years.", "response": "This headset is the most durable ones I have ever used. If you are looking for a headset to last you a few years, then I would recommend buying these."}
{"product_id": "B0083H4NG4", "context": "Does this mouse have a \"Sniper\" Function?  IE..can you lower the DPI by pressing a button, then release it and go back to your normal DPI?", "response": "i use dpi button quite often so yeah it's there and work fine"}
