{"product_id": "B008RA5DIY", "context": "If we purchase the actual disc, are we able to download also?", "response": "As long as you purchase the disc, you don't need to download.  You insert the disc and its installed on your computer."}
{"product_id": "B00CX8VYM0", "context": "is the sexual content strong in this game or mild,", "response": "no, it is just suggested adult theme behind it. The language can be rough though. There are a few 'F\" bombs scattered throughout it."}
{"product_id": "B000H67DDY", "context": "Is this product the standard Saitek Pro or the Combat version? Confusing because first photo is the combat version (metal pedals) and rest standard.", "response": "Combat and standard wdition"}
{"product_id": "B0032MM2P4", "context": "is there a shuffle feature during the game?", "response": "Not that I am aware of.  When you run out of moves it just stops the game."}
{"product_id": "B006SVUQNQ", "context": "Is this product originally associated with Xbox?", "response": "It's not made by Microsoft so it's not an official xBox product but it works exactly the same for half the price. It goes right int he bottom of a xbox 360 slim as a OEM harddrive would the same."}
{"product_id": "B00BGD6LMG", "context": "My bf likes Assasins creed, gta5, red dead redemption, kinda COD, would he like this?", "response": "Yes he would, it is almost like a combination between gta and assassins creed"}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "Only the first generation PS3 consoles can play PS2 games."}
{"product_id": "B00B23MO9Y", "context": "i have the 2008 version which does not have the 6 add-ons and the this expansion, if I buy this expansion and the 6 add-on codes what disc will need to be inserted?", "response": "The most recent disc which would be seekers"}
{"product_id": "B00CX9L30W", "context": "Does this come with the game itself?Or do you have to purchase the game and the CE to get it's benefits?", "response": "No, the collector's edition comes with the game itself."}
{"product_id": "B002RYLG4Q", "context": "Can this play and use every game and controller made for the original nes?", "response": "yes.  The NES.  they have other units that play SNES as well"}
{"product_id": "B0042J7I3C", "context": "Does it hook into the controller or the Xbox?", "response": "Hooks into the controller."}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "The gameplay is nearly identical."}
{"product_id": "B00A1Y2STQ", "context": "Is this a quiet keyboard or are the keys noisy when you strike them?   Thanks.", "response": "It's relatively quiet. It's not a mechanical keyboard so it's not that loud. It's average I'd say."}
{"product_id": "B000HZFCT2", "context": "Is this compatable with windows 7 ?", "response": "Yes. I run Windows 7 ultimate 64bit and it works just fine."}
{"product_id": "B00A7VK16A", "context": "can it fit the xbox one", "response": "Yes I use my ps3 and my xbox one alot very good"}
{"product_id": "B0095P5K8I", "context": "does we need to have a mouse pad or we can us it with out the pad?", "response": "I do not have a pad, but it still works well"}
{"product_id": "B00BGHUS58", "context": "Is the game worth it to buy it new, or is used a better deal? Also, does it have any istallation issues?", "response": "So far, the game is good. If you want to save money then buy it used. If you are sceptical about if it is going to play good without skipping or freezing, I would buy it new."}
{"product_id": "B00H3VJYD8", "context": "Will this controller work on windows 8.1? I am wanting a controller for Watch Dogs.", "response": "I'm not sure about windows 8.1 ,works well on 7 and 8"}
{"product_id": "B00HNJ4DTA", "context": "So.. . I look at one of the previous customer review on your product saying that the paddles are hard to press.. .? Why is that?", "response": "That might be subjective, because that's not the case with my controller."}
{"product_id": "B00IYWV5HS", "context": "i hace a laptop dv6 i7 2.oo ghz, 8 gb ram, ati radeon hd 6770m, can play this game?", "response": "You should be good. I have a 2.4 i7 with 8 GB ram but have a nvida. Just make sure you graphics card driver is up to date, I got an error when launching the game until I updated my graphics drivers. I played fine on medium settings"}
{"product_id": "B00FJWNSWQ", "context": "what is the difference between the ultimate and standard edition", "response": "It has the DLC that you would otherwise have to pay for if you get the standard."}
{"product_id": "B00008J7NZ", "context": "Can I play xbox live with this game? I mean online multiplayer. (interconnection)", "response": "no. The servers no longer support halo 2."}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "It should still work. However if they used the code to download the game it won't work bc it's linked to the original owner's account."}
{"product_id": "B00A7VK16A", "context": "What's the maximum dimensions for the console for it to fit? I want to use the case with an alienware x51, it's only a bit larger than an xbox/ps3, I need to make sure it fits.", "response": "The Xbox fits very snuggly in its foam base supplied with the case. I could measure it and give you exact dimensions if you still need them....."}
{"product_id": "B008FHL56S", "context": "If upgrading from a 250GB HDD to 320 GB HDD, is there a way to transfer all of my info from the first to the second so I won't have to swap them out?", "response": "The way im thinking is doing it by clonning software on a pc."}
{"product_id": "B00F9RGFEY", "context": "How long does it take to fully charge, and how long can you use it until it dies?", "response": "It takes less than two hours. The longest I have had it for continued used is 6 to 7 hours. Sometimes less depending on the volume configuration and the light setting."}
{"product_id": "B009RXUOD4", "context": "do you recomend something else", "response": "I still love this headset. I own 3 other turtle beach headsets. The only other I can recommend would be the X12 headset. It has good sound, just not as good, but it's cheaper, too."}
{"product_id": "B007VFHIHA", "context": "can you play this game without the internet and do you get disc & software package for disc?", "response": "Yes, you can play without thw internet, but only the story mode.You don't get a disc. You download the complete game from steam, which installs automatically, hence, no disc is.needed."}
{"product_id": "B0041RR0TW", "context": "does it work with windows 8", "response": "does it work in windows 8.1"}
{"product_id": "B00GPH7Y8S", "context": "is this game compatible with windows 8.1 ?", "response": "Yes it is but for some reason on my PC the game stops and minimizes - using the escape key and enter it does bring it back up - back to the same point in the game."}
{"product_id": "B0086UK7I6", "context": "Does it have any clicking issues that happen to it?", "response": "My new one seems to have the right click button not work sometimes when playing wow but it doesn't happen very often and only when I'm holding them both down at the same time to run"}
{"product_id": "B0053BCO00", "context": "Is this the Greatest Hits version? I don't want the red box.", "response": "Mine did not come w a case"}
{"product_id": "B00D2EGWDA", "context": "Hello , Does it include the original game + A free map pack ?", "response": "Yes , but it has the disk itself with the ORIGINAL game?"}
{"product_id": "B00CPS59CE", "context": "I have a feeling its a really dumb question to ask, but does it come in the original box of the headset or another box? Im just kinda curious", "response": "Yes, it is an \"original\" Turtle Beach box with Factory Refurbished markings."}
{"product_id": "B00DJYK9L4", "context": "What controllers are supported?", "response": "Wii contoller with motion plus..."}
{"product_id": "B002I0J4VQ", "context": "Is this PS3 model backwards compatible?", "response": "No, PS2 backward compatibility was dropped after the software capability of the 80GB fat model.  Hardware compatibility was only in the original 20 and 60 GB fat models."}
{"product_id": "B003O6E986", "context": "If I have the essentials edition, will my cars and progress transfer to the full version if I buy it?", "response": "So, sorry but when bough this item was for my nephew and I don't know about this video. sorry."}
{"product_id": "B0095D1CM8", "context": "Does it has all its accesories?", "response": "Mine came with a bunch of stuff."}
{"product_id": "B00B1N07QM", "context": "I have small hands and I'm used to three rows of buttons (nostromo). Are 4 rows doable for most people?", "response": "I have somewhat smaller hands and I can barely reach the third row. So I am currently just using the bottom 2."}
{"product_id": "B008M4BNQ6", "context": "?How do I get my head set to be able to heat the tv threw the headset?", "response": "The plugs are made to piggyback.  Plug the headset in first, then plug the TV into the headset plugs."}
{"product_id": "B0096L2SJ0", "context": "Can the controller be charged?", "response": "No, the controller doesn't support charging."}
{"product_id": "B00CMC6HCY", "context": "Is there only male Wrestlers?", "response": "I meant to say No, there are divas too"}
{"product_id": "B00BCEK2LK", "context": "Does this work on glass?", "response": "I guess it should. I do not have a slab of glass to test on. It works on paper, polished wood and plastic. It's got a good feel and weight to it."}
{"product_id": "B00AQ2BLI2", "context": "Does it contain the original game? I accidentally buy the part 2 but it does not contain the original game.I can't play it now.", "response": "It does have original shogun 2. Not 1, if that is what u r looking for. However, it requires update and I had to install the entire game from online basically. Don't know why they even bother to sell hard copies."}
{"product_id": "B0002XJBG4", "context": "My present controller's joy sticks are sticky on center making it hard to steer the cars in my racing game... is this controller good for racing games?", "response": "Yes, this controler is decent, and I use it on racing games.  No complaints."}
{"product_id": "B000035Y6D", "context": "Does it come in the original box?", "response": "Mine didn't. But they're not all sold by the same seller, you have to read the description to find out which ones are shipped in their original box. I will say that the ones that come with the original packaging are usually more expensive."}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "Its a one-stage trigger."}
{"product_id": "B005M2KSLC", "context": "its works with MAC/OS?", "response": "The hardware itself should work perfectly find. The software I'm not sure but to be honest I never use it"}
{"product_id": "B00FC1UH82", "context": "Is this wired or wireless?", "response": "Wired, I'd even say it has a long wire"}
{"product_id": "B003Y5AHPG", "context": "Does anyone have a problem when they try to load a Genesis game and it says an error message like \"this   game will only play on NTSC Sega consoles\"", "response": "There are Indeed a few sega games that do not work with this console.  If you search the internet there have been many attempts at compiling lists of Incompatible games. I believe it is something to do with a chip (fx?) used in some game cartridges at the time."}
{"product_id": "B00JM3R6M6", "context": "How are nicknames used in the game?", "response": "Nicknames are used whenever a Mii is referred to. Only when a Mii is hosting a news program or is one of the interview subjects is their full name used or spoken, so use nicknames you don't mind hearing a lot!"}
{"product_id": "B00EZPCWWA", "context": "Do you need wifi to operate the ds", "response": "When I first got mine I did not have Wifi, I just couldn't access online parts of the game. The System works fine without Wifi."}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes it's for 2 players or a single one"}
{"product_id": "B00H7KDNBO", "context": "Is it possible to buy a copy of the Instant Access version for someone else's account?", "response": "should be if they send you a code of the digital copy. Thats how I got Super Street fighter IV AE. They send me key code as well."}
{"product_id": "B000P46NMA", "context": "what is the order of the assassin's creed games.", "response": "Assassin's CreedAssassin's Creed IIAssassin's Creed BrotherhoodAssassin's Creed RevelationsAssassin's Creed III Assassin's Creed IV Black Flag"}
{"product_id": "B00166N6SA", "context": "How large is the case itself that it comes in?", "response": "It was very thin   It did not work"}
{"product_id": "B00GANWVJE", "context": "I want to buy this game but it says 3Ds, is it eligible with a regular DS or just 3Ds", "response": "Nintendo 3DS games can be played with a Nintendo 3DS, a 3DS XL (bigger screens) or a Nintendo 2DS (same technical \"guts\" as the 3DS, but no 3D capabilities and it doesn't fold in half).  This game will NOT play on any of the \"original\" DS systems (the ones without a number preceding \"DS\")."}
{"product_id": "B0099OZR9W", "context": "After installing, I get disc reading errors and it takes multiple tries for it to read. If I remove it, it reads the disc fine. Is it a bad drive?", "response": "No it means that the laser lens needs to be cleaned with a disk with brushes. U can get 1 at the dollar store for 5$ and when you use it, let the whole cd run. I had the same problem till i used a laser lense cleaning disk"}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "No, first month is included."}
{"product_id": "B005J2LW6A", "context": "Does this game support English (Menu)?", "response": "The game has English words in the menu, so it's easy to navigate through."}
{"product_id": "B000OPOCFU", "context": "Will this work with Windows 8.1 64 bit?", "response": "I think it will work, but not really sure."}
{"product_id": "B0099OZR9W", "context": "Stupid question but i need to know if there are directions for the install?  I'm not tech savvy at all  lol", "response": "No directions needed. Just simply plug and play once the HD is out the packaging."}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "No, but soon will be.  The next expansion is expected to make it two player, possibly with fun cannibalism options!  Whether this expansion will be sold separately or not is probably worth waiting a couple weeks to find out."}
{"product_id": "B003Y5AHPG", "context": "Do you have to buy the controllers for all 3 platforms or will the SNES old controllers work for all three platforms (nes/snes/genesis)?", "response": "The console itself comes with 2 wireless controllers that work for all 3 consoles. However, if you want to go down the traditional route (original wired-controllers), then you will in fact need to buy the specific controllers for each console. I've bought a NES controller, I love it. Brings me back to my childhood!"}
{"product_id": "B00EWEHI5K", "context": "If I remove the battery, and plug in the USB cable - will it work?", "response": "Yes, i just tried and it worked"}
{"product_id": "B005OSFUZI", "context": "This may be a dumb question but is this is like a legitimate cable for recording guitar on a laptop? Not just for the game but fo recording software?", "response": "It absolutely works with every daw software ive used as well as Amplitube or any other digital amp emulater ive used in almost 2 years although the price has gone up since i got mine in 2013"}
{"product_id": "B008M4BNQG", "context": "does this head set also work with a PC", "response": "Turtle Beach website says that it is compatible."}
{"product_id": "B005UI8V6C", "context": "can you play it offline?", "response": "You can not play it online, it's an offline game only. Played by yourself."}
{"product_id": "B00F8W9SWQ", "context": "Does it have programmable keys? I want a pause/play key for my media", "response": "If you consider the volume knob to be a media key, then yes. if not, then no."}
{"product_id": "B002I0HD9G", "context": "Can I control the weather in this game while free-roaming??", "response": "Unfortunately no. There is no option to do it. it only changes automatically."}
{"product_id": "B00F2ENJY8", "context": "can you play any WII game on this or just what comes with it", "response": "Every Wii game we tried with it works great (old and new). It doesn't have Internet access, so games that require it wouldn't work."}
{"product_id": "B0041RR0TW", "context": "When in Xinput mode does a computer recognize it as a wireless Xbox 360 controller or a wired Xbox 360 controller?", "response": "Its recognized as wireless."}
{"product_id": "B00FC1UH82", "context": "Is this a smaller version of the other Mad Catz arcade sticks? The dimensions state 9.1 inches in length. Most other sticks are 17 - 19 inches.", "response": "Hmm something is definitely not correct either dimensions. The pro versions is wider a bit but not twice the length. Check YouTube."}
{"product_id": "B00DFB99UI", "context": "How many degree does it turn", "response": "90º to your left and 90º to your right. I attached a video review that might be useful for you: http://www.youtube.com/watch?v=qpAj265IzaY"}
{"product_id": "B00JB4WHWU", "context": "Is this a physical package that is actually shipped or just the code that will be received via the downloads tab or email?", "response": "They shipped me a package in the mail.  It contained a video game case with a code inside the case."}
{"product_id": "B00DCDZM2I", "context": "does it only come with the same three characters, or are there choices", "response": "These are the starter pack characters.  I'm not aware of any choices.  They're included in the box."}
{"product_id": "B003O6EDSM", "context": "Is the online pass for Mass Effect 3 included, or do I have to pay extra, and is it worthwhile in 2014?", "response": "I can't speak for the PS3 version, but the MP is still active on the PC."}
{"product_id": "B00G6IJ5QK", "context": "Is this good for CS:GO?", "response": "I have about 700 hours in CS:GO, I have this and the Steelseries XXL mousepad I think it's called, tracking is absolutely perfect though the mouse is a tad bit on the large+heavy side. I'm 5'6\" and have medium hands if you were curious."}
{"product_id": "B005J37I4Y", "context": "Can this work on px4", "response": "No. This is meant for the Xbox 360's controller, so you can't plug it into the Playstation DS4."}
{"product_id": "B00BZOBE78", "context": "Does the pc dvd work with a mac???", "response": "It might work, but only if you have a windows operating system running on your Mac."}
{"product_id": "B00CJ7IUGS", "context": "If i buy a used version will i still get all the DLC?", "response": "Yes, because the content on the disc is permanent.  Just make sure that when you order it used that it comes with the second disc, and also make sure that the disc isn't too scratched up."}
{"product_id": "B00C2B2Y9A", "context": "I have a PC and a PS3  on one TV. Can I connect this to the TV via optical and get full surround and mic capabilities, or must it go into the devices?", "response": "You can get surround. But you can't get mic function."}
{"product_id": "B00FEOR4MY", "context": "It looks as if you can play on it without taking it out of the case?  Has anyone been able to do that?", "response": "You can play it while it is in the case.  However, my six year old thinks it's easier if you take it out."}
{"product_id": "B00H7KDNBO", "context": "We have a MacBook Pro 2011.  What version should we purchase (DVD, instant download, PC?)  We want to make sure it's compatible on a Mac.", "response": "None of these editions are compatible with MacOS X, this game requires Windows. See the system requirements."}
{"product_id": "B0016HG4H4", "context": "Does this work with Wii Rock Band 3?", "response": "I am sorry I do not know the answer. But look at the other answers."}
{"product_id": "B00FJWNSU8", "context": "Anyone know if this game is still actively played online? I don't want to be waiting too long for a match.", "response": "Absolutely...it's a good one. Defetiniely off the beaten path for your \"go to\" superhero vs villian storyline. Lol Lots of online players!"}
{"product_id": "B00E369SDM", "context": "How many wired controllers can I hook up to this?  And how many total (wired+wireless)?  Trying to see how I can have 4 players if possible.", "response": "You can connect 4 controllers in total, the PS have 2 USB, you can connect 2 controllers in this USB, but i recomend to use wireless controllers,i hope this can help you."}
{"product_id": "B00EZPCWWA", "context": "Can the 2DS take a beating? How durable is it exactly?", "response": "I wouldn't purposely beat it up lol But i've dropped it more than a few times and it's alive and kicking. It's made to be used by children so I believe it's the most durable system they've made recently."}
{"product_id": "B003VH5Z2C", "context": "Does this work with Famicom (Japanese) carts?", "response": "if you have a converter, yes. I have a converter found in the old gyromite games along with 4 famicom games and they all work perfectly fine (aside from the expansion audio found in some games, but with a little bit of tinkering you can add that feature to the system :D)"}
{"product_id": "B00656HLGO", "context": "Will this play the original XBOX games that are compatible with the XBOX 360?", "response": "If you follow the instructions detailed in some of the reviews to \"restore partition 2\" it will play compatible Xbox games.  It's pretty easy to do, you just need to hook the hard drive up to a Windows computer using a transfer cable and follow the instructions."}
{"product_id": "B00BGA9X9W", "context": "Does it work for pc?", "response": "Yes, but you need to find another driver to completely support this controller on PC."}
{"product_id": "B005BLAJ68", "context": "what 20 games does it have?", "response": "does t have 3 handed cut throat pinochle"}
{"product_id": "B00EV4O7B4", "context": "If i buy this and it breaks does this has warranty?, sorry for asking it's for my little cousin.", "response": "It's been a while since I purchased, but I don't believe there is a warranty with it from the seller, but certainly a manufacturer warranty. I would contact the seller for this information"}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "Okay, question? Why do this portable of Sega Genesis audio sound weird and odd when the music and sounded low pitched on speaker?"}
{"product_id": "B00EADTVL2", "context": "will this work with a controller that has a silicone skin around it?", "response": "No it will not its harder to adjust in the charger"}
{"product_id": "B00FRESQYG", "context": "If I buy this one, can I get the game key? or it's only the content of game?", "response": "You get the game, code and free game time"}
{"product_id": "B00006B84X", "context": "Does anyone here have one the lasted more than 10 years?  How is it holding up?", "response": "My experience is that the connection technology doesn't last 10 years.  I replaced mine when I couldn't find a good adaptor to switch from the old pins to USB.  The old one probably still works fine if my newer computer had a port for it."}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "I would hold off on buying this game until they make a better version. I emailed the company the other day and the woman told me that they haven't finished the new version yet. she said it woulnt be finished till after the first of the year. so who knows when that will be."}
{"product_id": "B007MM9E42", "context": "Have to have the paintbrush", "response": "No, you can use the Wii remote as the paintbrush"}
{"product_id": "B00B3PDHBU", "context": "Was the packaging already opened upon arrival?", "response": "Unless you bought a used set. For me brand new."}
{"product_id": "B005OSFUZI", "context": "These cables are 29$ list direct from ubisoft.  Why are they so expensive on amazon, especially if they break so easily?", "response": "It's back! Order one quickly!"}
{"product_id": "B0002XJBGE", "context": "does the controller sqaure sticks affect gameplay", "response": "Kids use them and have had no issues with these. They are compatible with all the games they play."}
{"product_id": "B00CPKUV98", "context": "Is this 720p or 1080p resolution?", "response": "the game wolfenstein the new order has 720p resolution on the playstation 3 version.  1080p resolution one is only on ps4/xboxone."}
{"product_id": "B008SBZF4Y", "context": "Do the graphics differ depending on different consoles?", "response": "Should not ...I think they are universal but Google probably knows better than I."}
{"product_id": "B00CD1FC6G", "context": "Corsair Vengeance K70 or CM Storm QuickFire TK?", "response": "If you want red back lights and switch types other than red, the k70 seems to be the only option I could find, and it is a great keyboard as well."}
{"product_id": "B003JVF728", "context": "Is getting stuck in a dark building part of the game ? because i can't get out.", "response": "DUDE, look on internet if anyone has same problem, if u don't find any fixes, u should ask for a refund and buy antoher game like MW2 that is more optimized for pc than BO."}
{"product_id": "B004QRKWLA", "context": "Do I need to calibrate or download programs and are the programs included?", "response": "No, drivers were instantly downloaded when I plugged the device in, and once automatically configured, the device worked perfectly with all programs."}
{"product_id": "B00DGZDFO4", "context": "Can this game can be run Locally on my Pc? I dont like to play online, I prefer play against myself.", "response": "Yes, you can do local matches with other players or against yourself."}
{"product_id": "B000266786", "context": "Does it run on Windows 7 or 8?", "response": "I didn't try to load on it 8...it did not work on 7 effectively."}
{"product_id": "B00286BZ4Y", "context": "Does this come with a CD", "response": "Yes it does and is very easy to upload to your pc."}
{"product_id": "B00F4GSAYI", "context": "Why does it have a M rating?", "response": "I think because of the violence , blood , some gore, there is also a brothel, and just the subject matter over all else. But Those are the only reasons that I can think of. And why they gave it an M rating."}
{"product_id": "B00IU3MSF4", "context": "Can I connect it to my regular, old flat screen tv? I'm not exactly sure, but most prob it does not have HDMI", "response": "You can connect It with an HDMI cable or the regular audio video cables."}
{"product_id": "B00635N6YI", "context": "Led lighting on star wars gaming mouse?", "response": "Yes and you can change the color of the light in the settings."}
{"product_id": "B0095D1CM8", "context": "folks where do i get replacement batteries for this amazing mouse?", "response": "It doesn't need Batteries.. is not wireless uses a USB cable"}
{"product_id": "B0050SYILE", "context": "I have two questions. 1: how much storage is required to play the game. 2: Would you get this for a person that is turning 11", "response": "12.5 gb and no to much violence"}
{"product_id": "B002I098JE", "context": "does it require xbox live gold?", "response": "No, unless you play it online."}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "No you need an Xbox slim (black) and it goes into the side of it. There is an empty slot it pushes all the way in."}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "Altough you require it to play multiplayer and to share your findings in single player with your friends, no sonya, it is not required at all :)"}
{"product_id": "B0088MVODO", "context": "I would like to know if there is just 1 CD or if the quantity is different, just because I heard there is a version of 3 CD's", "response": "There's only one disc and it's the RE 6 copy. Games 1 through 5 are digital downloads. The codes are on the instruction manual."}
{"product_id": "B003O6G5TW", "context": "Want to buy my nephew a Battlefield game and #4 seems to have to many glitches. Between #2 & #3 was wondering which was the better game?", "response": "We LOVE Battlefield #3! It has self help tutorials along the way and has great graphics in our opinion. Happy we went with #3. Depending on age of nephew and how fast he picks up on games it is an awesome game!!"}
{"product_id": "B0029M6VKA", "context": "What is this thing? Is it a new type of monitor, is it something you wear or is it something like the Kinect for the PC? I don't really understand it.", "response": "Its a IR receiver that connects to your computer via hdmi. It use is for the Micro Soft Flight Simulator Program. If it can be used elsewhere, I don't know. Ps: mine works great."}
{"product_id": "B00FRESQYG", "context": "Since this does not include Mists of Pandaria, will my Padaren I created on the trial version be deleted? Should I purchase that expansion with this?", "response": "It does not include the full Mists of Pandaria package: you can create a Pandaren but you cannot go to Pandaren from elsewhere or leave Pandaren. I don't know if your starting Pandaren will be deleted, but I would suggest you buy Mists of Pandaria if you want to use that package."}
{"product_id": "B00CBQO930", "context": "So does it go up to 2000 DPI or 4000 DPI?", "response": "Without the software from Anker, it's max DPI is set to 2000, but with it, the DPI goes to 4000."}
{"product_id": "B0056JPS84", "context": "Is this for xbox 360 phat or xbox 360 slim?", "response": "the new hard drive will not work with the brain it has in there you have to put the old brain from the old hard drive in order for it to work they show you how to do it on YouTube"}
{"product_id": "B00F68LBE0", "context": "How long is the included cable?", "response": "Long--I have not measured it but u can play with it pluged in with no problem. One thing thou the rubber covers on the sticks only last about 3 months and u can't get replacements."}
{"product_id": "B000VRCNLG", "context": "what air combat game ww2 will operate in windows 7 64 bit", "response": "So far, I'm having troubles with the graphics: there are planes' in view but only by there names and the scree is and otherwise blank. I'm waiting for a new joystick to see if that solves the problem."}
{"product_id": "B00BHSTXV6", "context": "Is this keyboard wireless or wired?", "response": "It comes with a sturdy, braided wire. This is one of the most durable cords I've ever seen in a PC device."}
{"product_id": "B00C2B355W", "context": "does this headset have a 3.5 mm jack for mobile? are they comparable to the a50? better? worse?", "response": "The headset is self only has a micro USB port for charging. The wireless base has a 3.5 mm jack. This means the base needs a power source (wall plug), but can be used with a mobile device. Just not very practical for mobile use. I've never used a50, so I can't compare them."}
{"product_id": "B009LGO88E", "context": "Will this function with an American 3DS XL, or is it only compatible with Japanese 3DSXLs?", "response": "yes it will my daughter uses it for her American 3dsxl"}
{"product_id": "B009DYOPK0", "context": "Does this mouse have an accurate scroller? Meaning that its not that sensitive and scrolls very easily", "response": "I think so.  The scroller works well for me.  The only issue I have is the accuracy of the sensor is not high enough."}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "The version I ordered and received is English. It appears the version in the photo is French."}
{"product_id": "B000ZKA0J6", "context": "Is this the base game?", "response": "Yes this is the entry to the storyline of SC2. Wings of liberty is the first of 3, Heart of swarm will be the next one you'll want and coming out in a year I believe will be Legacy of the void very good games"}
{"product_id": "B005OSFUZI", "context": "Does it work with both Rocksmith and Rocksmith 2014?", "response": "I would think that it would work on rocksmith. I know it works on the 2014 for fact."}
{"product_id": "B009RXUOD4", "context": "do you recomend something else", "response": "No, its a good set for its price range."}
{"product_id": "B00CJ7IUI6", "context": "Is there a difference between the game if I buy it new or i can just buy a used?", "response": "No. New or used, it is all the same."}
{"product_id": "B00DLDEKOK", "context": "Can this be used with the Xbox 360 wireless controller?", "response": "yes...it connects to the controller"}
{"product_id": "B006PP404Q", "context": "Would this fit a Vita slim?", "response": "I have the \"Walking Dead\" PS Vita so I can't be sure.  I would hate to give misleading information.  Just try it!"}
{"product_id": "B003BKWEHS", "context": "doesn't work on windows 8 for me...just goes to a few countries and that's it", "response": "It goes to a few countries at a time on Windows 7.  Once you complete these, more pops up."}
{"product_id": "B000B9RI00", "context": "Is it a physical card that needs to be mailed, or is it a code I can have e-mailed to my account?", "response": "This particular one is a physical card.  If you want a digital code, go here- Xbox Live 12 Month Gold Membership [Online Game Code]"}
{"product_id": "B0096L2SJ0", "context": "Has anyone tried this on the Galaxy S5??", "response": "Sure have and it works flawlessly! !!!"}
{"product_id": "B004W1IX1G", "context": "Is this the tall case version? I don't want the cardboard one.", "response": "Hard tall case! Awesome by the way!"}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "Yes, cord runs from the pedals to the wheel.  Then a USB connection from wheel to XBOX."}
{"product_id": "B00ARD5410", "context": "is this mouse for right or left hand??", "response": "Right. The sniper button is for the thumb."}
{"product_id": "B009K7QB8O", "context": "Is it compatible with Mac? or Windows 8?", "response": "I tried using it on Mac but sadly it didn't work. Fortunately, works on Windows 8. Hoped I help!"}
{"product_id": "B000IBELZG", "context": "Does this camera work with the PS Vita?", "response": "No.  It will plug into the accessory port on PSP series: 1,000/2,000 & 3000, but not the Vita.  I don't know of anything that will."}
{"product_id": "B00B70WKUK", "context": "is this like a CD and you put it in the computer and all good will be able to play  or i have to install program and be online .?thanks", "response": "Hi this is a CD, and you do not have to be online to play it."}
{"product_id": "B006PP404Q", "context": "Would this fit a Vita slim?", "response": "It should cause the screens r the same size"}
{"product_id": "B00F34LZT8", "context": "Do you need to have the DVD on the system to play this? I have a Netbook with external DVD.", "response": "The DVD is needed to install the game.  It is not needed to play the game."}
{"product_id": "B0053BCML6", "context": "I've never played any of the Animal Crossing games before. Do you have to have played the previous games for this one to make sense?", "response": "No not at all there are some old characters but nothing major"}
{"product_id": "B0072A4JVW", "context": "Does this allow for access to a portable charger?", "response": "If you mean to the charger provided by Sony, then yes, you have access to the charging port at the bottom of your Vita"}
{"product_id": "B00CJD4HD2", "context": "Odd question but how loud are the button clicks for this mouse? I.e. would it annoy anyone sleeping in the same room as you? Or one room over?", "response": "Well all mice click. This one is actually pretty quiet. It shouldn't be annoying but it all depends on the people."}
{"product_id": "B0097CUREG", "context": "Does anyone notice that the Kaboom slot is missing the button with a \"$\" that is used to load in more credits during game play? Or is it just mine?", "response": "I really don't play that game enough to know.  Sorry"}
{"product_id": "B009ZDPYKO", "context": "Are the giant figures compatable with the origional adventure packs?", "response": "The giant figures will not work in Pryro's adventure.  If you are in doubt, look at the original packaging and it will tell you."}
{"product_id": "B0053B5RGI", "context": "does this play on the dsi xl 2d?", "response": "I believe it onky plays on the 3ds and 2ds, not the dsi"}
{"product_id": "B00F27JGVA", "context": "Is this PS Vita card in sealed original packaging?", "response": "Yes.It's sealed original packaging.If you dislike this product after purchasing from us, you can return this product to Amazom.com.Best regards,"}
{"product_id": "B00FOGFP0A", "context": "I have already purchased the dlc for these games us region, the only think i want to know is if i purchase this game will i be able to use the dlc?", "response": "No Luis, the only thing you can do is change the save from US to UK version."}
{"product_id": "B000PD0HQE", "context": "does this come with the 120 gb harddrive?", "response": "Yes it does. There is an additional hard drive on top."}
{"product_id": "B003NVMEVQ", "context": "does it change colors", "response": "nopefull-time Blue, like the pic. and it Doesn't turn off. never! even if the PC is turned off. as long as there is electric current this thing lights up!"}
{"product_id": "B00CMQTUSS", "context": "does it come with the cable", "response": "Yes, it includes the plug/play USB cable along with controller & rechargeable battery pack."}
{"product_id": "B009RHEBWA", "context": "can you transfer saved information from turbotax?", "response": "Yes, you can.  See http://www.officedepot.com/a/products/100753/H-R-Block-At-Home-2012/ (only one of several ads and reviews that specifically state this)."}
{"product_id": "B00I4BGNVM", "context": "does this game works on windows 7 or 8?", "response": "Yes, in either 32 or 64 bit versions."}
{"product_id": "B001NXDBI6", "context": "Does VOIP also work with Teamspeak?", "response": "I use this headset with Vent, Teamspeak, Mumble, RazorComms and others. Not sure if that answers your question. If not, please be more specific."}
{"product_id": "B00DBDPOZ4", "context": "Can you use the cable to connect to a windows PC?", "response": "Microsoft promised controller support for Windows 8 in late 2014. So keep trying and it will eventually work. http://support.xbox.com/en-US/xbox-one/accessories/controller-pc-compatibility If you can't get it to work try the drivers from the link."}
{"product_id": "B004N7HSGU", "context": "Are these capable of using USB for a PC hookup or are they the green/pink cables?", "response": "you can use usb.  the mixamp is it's own sound card."}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "No the only wire is from the headset to the controller. It uses the controllers power. If you're expecting good surround sound do NOT choose this headset. I have a turtle beach for Xbox 360 that I bought in 2007 that blows this headset away. I'm still somewhat angry about purchasing this headset."}
{"product_id": "B00DUARBTA", "context": "Does it have 2 player mode, i mean can 2 players play with two controllers at the same time, on same ps4 (i dont mean online)", "response": "Yes.  You are able to play with two characters and a third in tow, allowing one of you to switch to that third character depending on the task to be completed."}
{"product_id": "B00H3VJYD8", "context": "Will this controller work on windows 8.1? I am wanting a controller for Watch Dogs.", "response": "It worked fine on Windows 8 for me. Make sure Watch Dogs has controller support though first, which it should considering it's a console port. If not, download Xpadder to map the buttons."}
{"product_id": "B0088MVQIM", "context": "does it come with guitar?", "response": "Rocksmith comes with a lead to plug in to your own guitar and your game system."}
{"product_id": "B000BAVN14", "context": "Which expansion packs does it include ? Does it have Apartment life ?", "response": "The Sims: Complete Collection includes: Livin' Large, Hot Date, Superstar, Makin' Magic, House Party, Vacation, Unleashed, and of course the base game. The Sims Apartment Life is part of the Sims 2 games."}
{"product_id": "B003VAM392", "context": "Is this thinner than the F710? I like the F710 but it feels a little too bulky for my comfort due to the battery pack. Thanks in advance!", "response": "I do not own a F710, but this model doesn't have a battery pack. Thus, it stands to reason that it would be thinner and lighter by default"}
{"product_id": "B00HWMP0OU", "context": "Does this work on the Nintendo DS XL?", "response": "It will not work on a regular Nintendo DS or Nintendo DS XL, it only works on Nintendo 3DS, 3DS XL, or the Nintendo 2DS systems."}
{"product_id": "B009NQPGOW", "context": "If you switch it to English language can you play American game So?", "response": "Yes, I can still play english games on this handheld. Only thing i noticed that was different was the controls on the main menu are different ( like to enter the game). Awesome looking system though. Would recommend getting a clear case to protect the system."}
{"product_id": "B00EHBKUTE", "context": "Does this work well under Windows 8.1?", "response": "I've used in the entire time on 8.1 and haven't had any problems"}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "While I had the choice to select the driver that came with Windows 8, this driver had an error 10 from the device. Instead, I used a 2009 Windows 7 driver from the Microsoft site and this worked."}
{"product_id": "B00KGGJPYA", "context": "so I just bought the Gembonics Battery Back up -  how do you recharge the unit to a full charge ?", "response": "The Gembonics charger comes with a 3-in-1 cable which includes micro USB port so you can just use that to charge it by using your wall adapter or Alternatively you can connect it to the computer or laptop USB port."}
{"product_id": "B00CD1FC6G", "context": "The only thought that I have for this keyboard is how are the LEDs?", "response": "Corsair still has problems with their backlighting, do not recommend buying."}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "I believe it's not system specific. As long as you have a portal and skylanders giants it should be fine. My son uses it on Wii."}
{"product_id": "B000M6DHA2", "context": "What does \"Bulk Packaging\" means? Why is it cheaper?Whats the diference with the other SD card? If any.Thanks", "response": "Nothing at all. You are not paying for all the non-recyclable plastic waste for individual unit packaging."}
{"product_id": "B00D7UHT0E", "context": "Just Dance Nintendo is Ok to use with regulat TV?", "response": "Yes as long as all of the wires fit into that specific t.v it's fine. Enjoy!"}
{"product_id": "B00DLRLDBO", "context": "Do you need any extra cords or items to use with xbox 360", "response": "no actually I've been trying to get in touch with you guys because the mic does not work what can I do about that"}
{"product_id": "B0002EAA36", "context": "Is it usable in the left hsnd?", "response": "I have on rare occasions used mine left handed when my right arm wanted a break, however, it is definitely right handed.  I used mine only for directional and speed control, if you needed to use it and all the buttons, right handed would be definitely the way to go."}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "it comes with auto clutch. hit lb rb and a at the same time to engage it. then you are driving with clutch, but you don't hit the a button after you start the race. very easy to use."}
{"product_id": "B0002L88HE", "context": "When I click on the Desktop icon to play The Titans Expansion it says \"please enter The Titans Expansion CD ROM. Any advice on what to do?", "response": "Put the game in your CD tray. It may need to download something to your computer"}
{"product_id": "B005764CWO", "context": "What kind of plug does this have? I'm looking for s USB controller.", "response": "Yes it's a USB & plugs directly into PS3s existing USB ports."}
{"product_id": "B005764CWO", "context": "Does this count as a dual shock 3 controller?", "response": "I dont think so it does work with play station and has all the functionality as one but id xbox formatted it is a great controller"}
{"product_id": "B00ATHFLZS", "context": "Just ararived and does not work at all. tried several computers, not a problem on my end, the mouse is dead. unless there is some secret magic dance..", "response": "It should work right out of the box.  There's an on/off switch on the bottom of the mouse for the lights but if the mouse is not working at all then you may need to return it, hopefully you can."}
{"product_id": "B00DH1KRQQ", "context": "does it comes with its own gamepad software?", "response": "Yeah,it installs some crazyness automatically..i think it was auto,don't remember. key mapping n such,but it crashes when you even just click on the vibration settings."}
{"product_id": "B00965WK8K", "context": "Can any serious gamer here comment on how flawless the sensor in this mouse is? Any (even slight) positive/negative acceleration, angle snapping, etc?", "response": "To me after about a years worth of heavy use on the mouse the sensor is starting to become a bit poor on accuracy and will sometimes skip a bit."}
{"product_id": "B00FYAQUPU", "context": "I have Swap force already...do i need to buy the starter kit for dark edition game or do I just need the game??", "response": "Dark edition is a starter kit and comes with the base and game plus 5 dark edition skylanders."}
{"product_id": "B0050SX9I2", "context": "Does this work on ps4 consoles?", "response": "sorry would go back with original remote for the play station you have  model#"}
