{"product_id": "B00JC9SWSC", "context": "Is the hobbit game that comes with this bundle the retail case version of the game or does it come in just a cardboard sleeve?", "response": "I once bought the 250GB Uncharted 3 bundle, as well as the 500GB GTAV bundle later on when it first came out, and both Uncharted 3 and GTAV were in retail cases.  Why would this be any different?"}
{"product_id": "B002J9GDXI", "context": "Does this mouse work with Win 8? Having trouble programming G400 buttons?", "response": "According to Logitech's own website, they completely support your mouse on the Windows 8 platform (source: http://logitech-en-amr.custhelp.com/app/answers/detail/a_id/32425#Mice)You would program your mouse's macro buttons using the 'Mouse and Keyboard Settings' program that comes with the Logitech drivers package. The program may also be called and titled, 'Logitech SetPoint'."}
{"product_id": "B00B0QONB0", "context": "My Xbox 360 4GB will not recognize it. What do I do??", "response": "Mine did the same thing and I tried on an other xbox and did the same so I just bought a different one from a different manufacturer. I don't know why it didn't recognize it but the new I bought from Microsoft I didn't have to format it. It was just a plug and play. Hope it helps you."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 8.1 64 bit", "response": "I'm sure there is a way to make it work, however I wasn't able to properly install it on windows 8.1. But best of luck to you"}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "Mine was in English."}
{"product_id": "B00DH1KRQQ", "context": "does it have the rumble feature?", "response": "The packaging claims it does but I have yet to experience it.  I even make sure that the \"rumble\" option on the games I play is set to 'ON'.  Doesn't bother me though."}
{"product_id": "B000IZAQD8", "context": "Does it come with Dvd remote?", "response": "It came with a PlayStation remotecontroller not with a DVD remote"}
{"product_id": "B009LGO88E", "context": "Has anyone noticed any scratches on the system after using the Circle Pad?I have a Gold 3DS XL & have always used a protector so it's important to me.", "response": "I also have the Gold Zelda XL, But it hasn't scratched my 3DS. I guess it's hard to scratch plastic with a softer plastic."}
{"product_id": "B00F2ENJY8", "context": "Do the regular wii controllers work with this system?", "response": "Yes, they sure do."}
{"product_id": "B0050SX7BQ", "context": "Are there actually puzzles in the game - and are they good?", "response": "Puzzles not really they are not the kind of puzzles that are in heavy rain or uncharted More like real life situations there is one level where u deliver a baby The game is really more like a movie! You play it's a good game fun and worth your money heavy rain it's not"}
{"product_id": "B001H4NMNA", "context": "An odd reply for this question below so I'll ask it again: Can I put a PS3 and a PS4 controller on this charger?", "response": "since the new controller is a different style it may not line up in the notches of the charger i would compare them first"}
{"product_id": "B00111SFEU", "context": "Does it work with andriod phones as well?", "response": "I`m using the andriod phone,it work well with the earphone."}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "http://store.gameshark.com/viewItem.asp?idProduct=4769&idCategory;=262 has a release date of 11/12/2010 and it is the link from Cyborg' store."}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "Yes, you TV audio will be payed through the headset and your TV. You can mute the TV if you want."}
{"product_id": "B00BGAA0SU", "context": "Tomb raider, this or watch dogs", "response": "Tomb Raider is probably the best game of the 3 but if you want something that was developed only for new gen then Second Son is the way to go. The graphics are stunning in this game and it has a lot of replay value with the good vs evil choice system."}
{"product_id": "B009D3HSTG", "context": "Does it work on Windows 8.1 and does it come with a CD?", "response": "No idea about 8.1 but it does come w a driver CD"}
{"product_id": "B005G4CXPK", "context": "Am I able to use a keyboard and mouse to play or do i specifically need an Xbox controller that plugs into the USB port", "response": "I tried to use an Xbox controller but it was really weird (for example, clicking in the stick will pause the game). But I've only tried Assassin's creed one I don't know if its better on assassin's creed two but in my opinion its much easier and better using keyboard and mouse."}
{"product_id": "B00CRL9TU2", "context": "is it better than GT5??does it has too much difference??please help me to choose..thnx", "response": "Well it's more of the same. Same format, but better cars graphics! And Yes it's better!"}
{"product_id": "B00IRHE892", "context": "Is this really a worthy successor to the G500?", "response": "I had to go back to my g500 due to an issue with my g502. The g500 felt like a wet turd in my hand. Instantly went back to my g502 when it came in the mail."}
{"product_id": "B00B23MO9Y", "context": "If I buy this disc, will I code to add it to my account? Will I get it instant or have to wait?", "response": "Immediately.  The registration code comes included in your package."}
{"product_id": "B005BLAJRC", "context": "is this compatable with windows 8?", "response": "My daughter says she loaded it into her windows 8."}
{"product_id": "B008VQ68C4", "context": "is this headset compatible with the ps4?", "response": "Yes, but you cannot adjust the games and chat volume separately."}
{"product_id": "B00DC9T2J6", "context": "Is this for Digital Download?", "response": "I purchased the CDs and they had issues loading into my PC.  I wound up returning and purchasing the downloadable version.  No need for cds anymore!"}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "Shake needed only to illuminate charge status indicator"}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "I'm currently running all the c&c; versions on my 8.1 laptop.. Works fine.. happy gaming."}
{"product_id": "B00ANHBJBY", "context": "Does anyone know how well this holds up in games like Super Smash bros? The responsiveness and durability for example.", "response": "I played a few games with mine but then the charger port broke..."}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "Standard play and charge kit"}
{"product_id": "B00EWEHI5K", "context": "Are the side buttons easily pressed accidentally? Is the feel of those buttons \"clicky\" or \"mushy\"?", "response": "I never accidentally pressed the side buttons on this unit. They feel very clicky to me."}
{"product_id": "B00F27JN8Q", "context": "Can the Japanese Vita TV's AC adapter plug into a US wall socket without problems?", "response": "Yes, it works fine."}
{"product_id": "B000035Y6D", "context": "Does this include the original box?", "response": "Only if the seller you select advertises it as 'includes original box'.  Most are fairly specific saying 'console only 'or 'console and power, no video cable', etc.  If you want the box, check the 'collectible' section of resellers."}
{"product_id": "B0071NH8B8", "context": "How many hour's of gameplay will it last before the battery needs to be re-charged?", "response": "Ive Never Personally Timed it myself but If I had to Estimate it about 3-4 Hrs of Gameplay."}
{"product_id": "B00EZKNT5O", "context": "If I were to use this on my PC (Windows 7) would it still light up and vibrate? Or is that just an Xbox thing?", "response": "It will still light up and vibrate"}
{"product_id": "B004XIQN3I", "context": "will it work on windows 7?", "response": "Yes it will i have windows 7 on both my alienware laptops and it works on both"}
{"product_id": "B0045ZB66I", "context": "Does this version (the physical PC version) require Origin or Steam?", "response": "To play the first scenerio, no, but to play the other, listed scenerios, yes."}
{"product_id": "B00886XQNQ", "context": "Are these compatible with the Xbox one", "response": "Yes, but you need the Xbox One chat adapter."}
{"product_id": "B008D7F47Q", "context": "Does it Work with Windows 8.1? Trabaja bien con W8.1?", "response": "Si, funciona bien con Win 8.1 ;de hecho el juego funciona mejor con la version 8.1 que con la 8.0; también funciona bien con Windows 7"}
{"product_id": "B003VAM392", "context": "can it play retro games from Sega Genesis era? any fighting games like Mortal Kombat or Street Fighter 2.", "response": "I'm not sure about the sega games but it has x input and direct input,which means the older games you can map the buttons to play them .The button mapper in on the cd that you get with the controller,hope that helps."}
{"product_id": "B0065NP6NC", "context": "Is this version more, or less buggy then the regular edition? Less crash/freeze prone?", "response": "From my experience of playig both versions, i would say this one is less buggy and glitchy. A lot of time in the regular version i would get stuck in a moutain or tight spot. It was annoying. But i never had any problems like that im this one."}
{"product_id": "B002RRLQIO", "context": "Does this keyboard use Cherry MX keys and if so which color?", "response": "This keyboard has backlit keys.  You can change the colors between blue and red and purple and eve make a custom color."}
{"product_id": "B00EHBKUTE", "context": "Can you change the colors of the backlighting to red?", "response": "No - you can only change the intensity or turn it off all together, but you can't change the color."}
{"product_id": "B00F2ENJY8", "context": "can you play any WII game on this or just what comes with it", "response": "Every Wii game we tried with it works great (old and new)."}
{"product_id": "B00D84DRNC", "context": "Does this fit New 3ds xl?", "response": "Per Nintendo, the sizes are nearly identical, with the new 3DS XL being just 004mm wider. You should be fine!"}
{"product_id": "B0040UAYI4", "context": "Can i use this and play MW3 on the ps3 with the Eagle Eye?", "response": "Yes you can. Just watch out that their services on warrenties are super bad. Ive been waiting more than a year for my replacement unit. I just bough anouther one just to play. I would rather look at one of the other makes."}
{"product_id": "B0088MVODO", "context": "are these the games?", "response": "Yes. Resident Evil 6 is an actual disc, and Resident Evil 1-5 are codes you'll use/redeem on the PS Network, so they'll be saved on your PS3. I personally didn't enjoy RE6, but 1-5 were terrific."}
{"product_id": "B00DHF39KS", "context": "Just getting into these games; are there levels of difficulty on this game so a newbee can learn easily???", "response": "Definitely! There's 5 separate difficulty levels, which is more than what most games have.  With each difficulty level, enemies become slightly stronger and more accurate, and you become more susceptible to damage."}
{"product_id": "B00CMQTVUA", "context": "How long until they fix (patch-update) the backwards compatibility to allow xbox 360 discs ?", "response": "they just announced it will now be backwards compatible so you will be able to play your 360 games on it!"}
{"product_id": "B004C34D2M", "context": "So you have to buy something else for Motion Plus?  I thought it says it rubmles.   What is the adapter?", "response": "there is no adapter this works actually better than the one wireless with motion plus meaning that the wii realizes the controller is there all the time even if you swap games with motion plus from time to time you have to take the battery off to reset the remote or reset the wii. Cheaper quality but better performance."}
{"product_id": "B00C710AT6", "context": "is a controller needed?", "response": "Not really,u can use the keyboard /mouse.But if u play with controller it does feel better"}
{"product_id": "B00E447L8C", "context": "How do u guys apply to iPhone 5? It is a micro USB port!", "response": "sorry I cant help you Aria. I have a Samsung. Hope someone else can"}
{"product_id": "B0098W4ZD4", "context": "I purchased this item from you less than a year ago, and it is now not working. Is there any type of warranty on this product?", "response": "I'm pretty sure there is, however I had the same issue and they refused to honor the warranty."}
{"product_id": "B00FFL0T46", "context": "Is this for the whole series or just for the first 2 episodes?", "response": "All episodes in the series."}
{"product_id": "B00B70WKUK", "context": "is this like a CD and you put it in the computer and all good will be able to play  or i have to install program and be online .?thanks", "response": "You play the game through steam. Inatall the dvd and sign up for free steam account and play"}
{"product_id": "B00DUANBQM", "context": "Did this version of the psp fix the awful ghosting issues the original version suffered from?", "response": "I don't know, is 'ghsoting' motion blurring?If it is, then I think so, I have it and never noticed."}
{"product_id": "B00D96BNGM", "context": "What cables do I need if I want them to work on ps4", "response": "Not sure about PS4, everything needed was included for my XBox 360."}
{"product_id": "B00F9RGFEY", "context": "I just want some clarification. Some customers are saying it works on Xbox One. The advertisement does not. So, is it compatible or not?", "response": "Yes they are compatible with Xbox one. Having said that you'll need to buy the adapter for the Xbox one controller. They are an excellent head set. You'll eenjoy them."}
{"product_id": "B0050SZE2G", "context": "will this also work with windows 7?", "response": "Yes!   Regards, IWD"}
{"product_id": "B00009WAUO", "context": "Does it come with the bonus level card?", "response": "No it didn't come with bonus level card I bought it used maybe new it will or it just depends on the seller"}
{"product_id": "B00IA2NYT4", "context": "can Ps2 games be palyede in this Ps3", "response": "Not on this model, unless you buy the specific digital version from the PS3 store.You should check their website to see if the games you're interested on are there (even if you have a phisical copy, you'll have to buy it again)."}
{"product_id": "B003Q9RGRW", "context": "Can you plug the headset directly into the controller without the chatpad?", "response": "Yes, it works with or without the chatpad."}
{"product_id": "B009CEM332", "context": "- Does this game have multiplayer mode?", "response": "No there is not."}
{"product_id": "B002DUCF8A", "context": "I have a Saitek Pro Flight Multi Panel but recently the knob to select alt, vs, etc is stuck, how can I do in order to fix it??", "response": "I have the same problem. would like the answer"}
{"product_id": "B000OPOCFU", "context": "Where on the DVD is the product key.I tried entering and it still wont take it", "response": "its not on the dvd, Its on the package that the dvd is in"}
{"product_id": "B00G6IJ5QK", "context": "Does anyone have any opinions on the lift off distance of the Rival vs some other competitors (g500, DA, etc.)?", "response": "I have the G500s, Roccat Kone Pure Optical and the Rival. The Rival has a little bit more of a lift off distance then the G500s (a smiggin), but not by much and the same lift off distance as the Pure Optical."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "It is NOT a mechanical keyboard.  The price is the main giveaway on that.  The keys feel fine though.  I use it more for typing and that works well (I use the Logitech G13 for gaming).  So far so good!"}
{"product_id": "B00E8RVP0U", "context": "Does this work on wii mini?", "response": "I sent this to my daughter to answer, I got this for my Grandchildren. She will know."}
{"product_id": "B00AKIPBNS", "context": "If I've never played a Fire Emblem game, will I still understand/enjoy this game?", "response": "If you're interested in tactical/strategic games AND waifu sim-date with award (sometimes funny) dialogue and character classing and re-classing, then yes!"}
{"product_id": "B006LVZEN0", "context": "Does the scroll wheel retain its inertia or click into place (i.e. behave like a flywheel or like the wheel from Wheel of Fortune)?", "response": "To put it in the context you suggested, \"Wheel of Fortune\". It does not retain any real inertia, and basically only moves when you have your finger on it."}
{"product_id": "B00ACMM9BO", "context": "So this works for call of duty black ops 2?", "response": "Yes. .some modes don't work for multiplayer. Tho"}
{"product_id": "B00004VUFG", "context": "I have a formula force set I bought this for my autistic grandson Im not very familar with tech it doesn't have the software how do I get it", "response": "Go to Logitech website to download"}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "yes. on vista also which is what I have."}
{"product_id": "B003O6E986", "context": "Is this a full game?", "response": "this is the full game"}
{"product_id": "B00292OW1U", "context": "DOES IT WORK WITH WINDOWS 8 AND 8.1?", "response": "Sorry, I'm still quite happy with Windows 7 so haven't personally tested it. That said, their latest driver claims to be compatible with Windows 8."}
{"product_id": "B00IVJ1M7M", "context": "does the 3ds action replay work on games downloaded onto the system? or do you have to have the game card for the game?", "response": "you have to have a physical copy of the game."}
{"product_id": "B00CX8VY4S", "context": "So you can just play straight campaign even if you have an Xbox live membership? Or are you forced to play online?", "response": "You can just play campaign if you wish. You can turn  off the online aspects."}
{"product_id": "B00D9FQAM0", "context": "is there a headset included with the new xbox", "response": "This is a used one so no"}
{"product_id": "B008X73CE8", "context": "Will this run on Windows 7?", "response": "Also,  run the installer with administrative privileges.  No problems"}
{"product_id": "B00656HLGO", "context": "I keep reading reviews about not working with \"original title games\", what does that mean? If I don't have any games over 3 yrs old will this work?", "response": "Just do not even bother to buy this. Buy a Microsoft brand if you need a HDD so badly. I still have mine and it's collected dust. Waste of money"}
{"product_id": "B005G4CXPK", "context": "Is this the Director's cut and Deluxe Editions?", "response": "I think it isn't. It would say so on the box if it was. Delux, Director, and/or Game of the Year Editions are available on Steam though. They are planning a huge sale on Black Friday weekend/ Cyber Monday if you want those verison cheap."}
{"product_id": "B000OPOCFU", "context": "is this compatible with windows 7 64 bit", "response": "Yes it will play on Win7 x64, I do daily."}
{"product_id": "B00IVHQ0KI", "context": "can i drift on that in forza horizon 2 ?", "response": "You can, you have to press \"B\" on the wheel quickly or the brake but of course you need to find your sensitivity on the wheel otherwise you'll turn to hard  or to little"}
{"product_id": "B00DGZDFO4", "context": "what controller is best to play this game on PC?", "response": "i'm using a Microsoft XBOX 360 Wireless controller. Great game."}
{"product_id": "B00EZAWV6W", "context": "How long did it take you to download onto PC (Windows 8)?  I have DSL and it is saying it's going to take 9 hours for download!", "response": "Unfortunately it did take a long time to download, about 5 hrs at least. The status bar did estimate about 6-7 hrs but did it in less time. The game is worth it though and runs great now that it's installed on my pc."}
{"product_id": "B00GY4OAM0", "context": "Forgive me if this seems a stupid question, but how do you get it into two player mode on the PS3? I don't see any options anywhere!", "response": "Well usually hitting a button on the second controller should start the second player. At least that is what it was like on the ps3 version of Indiana Jones I had."}
{"product_id": "B0050SYX8W", "context": "do you have to have xbox live to play this game?", "response": "No you don't...that's only applied if you wish to play online with someone outside of your home. Thats what online play means...playing over a internet connection with soneone else...but that other person needs to have the same game as well."}
{"product_id": "B00FE8WKPQ", "context": "Does the balance board work well on carpet?", "response": "Yup!  Works just fine - use the feet that come in the box if you're putting it on carpet."}
{"product_id": "B002I0J4VQ", "context": "can ps3slim play with newer version", "response": "I apologize but I'm not sure exactly what your question is. Please give a little more detail so I may properly give you any answer to any questions you may have. Thank you"}
{"product_id": "B00D96BO7K", "context": "will these work with a pc", "response": "Yup. I use them frequently with my PC. Just plug the USB and microphone jack in and you are good to go."}
{"product_id": "B008CP6MA2", "context": "It is in Spanish or English ?", "response": "Yes it is. But I must warn you that only the first 3 games have only english audio, the remaining 2 Chains of Olympus and Ghost of Sparta have spanish audio, therefore don't need subtitles."}
{"product_id": "B00IRHE892", "context": "If anybody plays CS:GO with this mouse ---- When flick-sniping or playing scoutzknives, is the scroll-wheel accurate? Does 1 notch switch ONE weapon?", "response": "lol who actually switches with mousewheel"}
{"product_id": "B00GG4BBUM", "context": "I received this for the PS4 on Tuesday via pre-order, but there is no book in the game case.  Is this normal, or was my game just missing it?", "response": "I received mine yesterday via pre-order too and mine didn't come with one either."}
{"product_id": "B00ANHBJBY", "context": "Does anyone know how well this holds up in games like Super Smash bros? The responsiveness and durability for example.", "response": "dont buy the control Brandon, its totally garbage .."}
{"product_id": "B003O6E986", "context": "Does it have split screen so that 2 people can play at the same time on same screen?", "response": "Yes, you can, but not at all modes..."}
{"product_id": "B006W41X1S", "context": "Can I just play my games offline and hear game sound on headphones or do I need to play online?", "response": "Your headset receives whatever sounds are coming over your TV.  You can hear your games just as much as you can on your TV.  In fact, if you need, you will hear your standard TV channels, DVDs, etc., over your headset"}
{"product_id": "B003O6N64Y", "context": "Will they Play 7.1 through Smart TV?", "response": "Your TV will need Dolby Digital Live output and an Optical output."}
{"product_id": "B0089OBLDO", "context": "I have a PS3 arcade stick which is getting detected in Win 8.1 64 bit, but the buttons aren't working due to nodrivers. Will this adapter work for me?", "response": "You actually don't need an adapter, install a program called Motion Joy, it should be the first result when you search for ps3 controller drivers. Once you have the program load it up and it should see you have a ps3 stick in and you'll be able to play"}
{"product_id": "B00FJWNSWQ", "context": "Do you need XBOX live to play the ultimate edition?", "response": "You don't need XBL to play any of the single player or couch two player features, but it is required to play online."}
{"product_id": "B0000512IE", "context": "How far are the pedals apart? i.e. the spacing distance.", "response": "the space between the pedals is 9.5cm. the width of each pedal is 10.5cm. personally i wish they were further apart but that can be overcome through simple mods. using a wood overlay that extends the pedal sideways."}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "Nope. You get free and discounted games as a PS plus member"}
{"product_id": "B0050SX7BQ", "context": "Please, is this game translated to spanish?", "response": "no :( just english and french sadly for me"}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "No need to shake.  Plug and play."}
{"product_id": "B00HG0B8NA", "context": "I get the following error while updating the game: \"The application could not be installed because an application with that name already exists...\"", "response": "Dear Margie,You have to uninstall old version of the game manually, then you will be able to update the game without any problems.Thank you!"}
{"product_id": "B00FXOP1MU", "context": "can you play regular ds games on this unit?", "response": "Yes, you can.  You'll have to research but there is a way to make the DS resize its screen to make it mimick the smaller DS."}
{"product_id": "B0000CNUUP", "context": "If I don't want to install through the dvd, can I just redeem the code on steam?", "response": "If I recall, you should be able to."}
{"product_id": "B002BSA20M", "context": "Can anyone tell me which game is better, Halo 4 or Halo Reach?", "response": "I don't know personally but my nephew like the halo 4 better, because when he play with multiple players. There is apart that her really like where he can be a juggernott. My sugguest is the halo 4  is better and has great features"}
{"product_id": "B00JM3R6M6", "context": "I have three children that all love Tomodachi Life demo and are now asking for the full version.  Do I have to buy 3 copies of the game for $30?", "response": "Unfortunately, there is only one save file. You would have to buy 3 copies. Or they could share."}
{"product_id": "B00FRESQYG", "context": "Is this version contains World of Warcraft, The Burning Crusade, The Wrath of the Lich King and Cataclysm ?", "response": "Yes, absolutely. All expansions are in this except Mists of Pandaria."}
{"product_id": "B000BAVN14", "context": "Will this still work with Windows 7?", "response": "Yes, it does! Very well infact, thank you!"}
{"product_id": "B00CERXJNW", "context": "Is this the keyboard that has 16.8 million color schemes", "response": "No, this keyboard only gave blue led"}
{"product_id": "B006LVZEN0", "context": "There doesn't seem to be an option to map mouse keys to launch software? The profile configuration only allows macros and pre-determined hotkeys.", "response": "The mouse macro options in  the software should allow you to program the buttons to activate keyboard keys, repeat recorded mouse actions, and mouse buttons. To open software, you could record presses involving the windows key, but it cannot natively open software."}
{"product_id": "B0086UK7IQ", "context": "Anybody but me use gaming mice for non-game stuff?", "response": "Big time. I use it for opening and closing windows, holding down command and shift while clicking, switching desktops, revealing my mouse cursor across my triple-monitor setup, back and forwards, volume control, etc. I make liberal use of the ring finger shifter."}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "On my experience on the PS3 version, yes you can"}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "Affirmative - works very well with my pc."}
{"product_id": "B002I0K3CK", "context": "Is the gamepad required, or can I play this with a Wiimote only?", "response": "You can use any mix of gamepad, wiimote, and WiiU pro."}
{"product_id": "B00BFOEY3Y", "context": "Can someone please explain dpi scaling to me? I understand that the higher dpi the easier it is to click on a pixel. Why do people want low dpi?", "response": "If u g to higher dpi like 8200 which is highest of this mouse its not possible for any human to control it, and lower dpi helps in shooting games for accuracy eg when sniping in cs"}
{"product_id": "B002Z7BE24", "context": "Can this edition be played with the Move controllers (like RE4 for the Wii)?", "response": "not all the edition for Rresident evil 5 can use the PSmove to play，there are must a ＇PSmove＇logo on the box. but all the edition can use the PS3 traditional controller to play."}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "I just saw this game showcased at Target, and it claims there that it will play on a regular DS, only not in 3d (the picture will be flat).Update: I asked at the store, and they said it will only play on 3DS in 3d, and 2DS in 2d (regular picture), but not DS."}
{"product_id": "B000ZHMRTA", "context": "Does this monopoly game play fine in Windows 8 pro and RT?", "response": "I don't know because I run Vista.  It works fine in Vista however, I don't like it as well as traditional Monopoly because of the updates."}
{"product_id": "B004RMK57U", "context": "how can i use ps plus memnbership from my ps3 to my ps4 system? can i use in my ps4 and delete from ps3?", "response": "Actually you membership goes with your psn account so it doesn't matter if you have psi3ps4 or psvita"}
{"product_id": "B00DLDEKOK", "context": "Where do you plug in the headsets for xbox 360?  To the controller?  I don't see a place for plug in on it.", "response": "lol. The plugin is right between the handles at the bottom. You'll see a small circular hole with two symmetrically rectangular holes next to it. Hope that helped :)"}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "If someone redeemed the code already, otherwise it should be downloadable."}
{"product_id": "B009O8HH3M", "context": "Will this fit my 12 year old son?", "response": "They are adjustable, and the smallest sizing looks like it would fit a middle school child. I would think they would fit him well enough to stay on his head and be comfortable."}
{"product_id": "B00JFCA6V2", "context": "Can you play games off of the game cards without purchasing a Sony memory card?", "response": "I'm not sure about some games,  but for games you need to save yes you need one."}
{"product_id": "B00FE8WKMO", "context": "does it have the white fit meter?", "response": "Yes, but I purchased an additional one. My daughter and I track our steps every day."}
{"product_id": "B00F27JE1C", "context": "Anyone else having wireless issues with this unit?  See my write up on my vita slim green/white.  I'm assuming I got a lemon but would like to hear.", "response": "I had it for 4 months now and have not get any problems of any kind."}
{"product_id": "B00ERDGMT4", "context": "Is this the unupdated version of Borderlands 2, meaning no bug fixes/patch updates?  Will I need an internet connection to patch the game if so?", "response": "This is updated version. The only new download I needed was compatibltity pack. You need Internet for the comp pack."}
{"product_id": "B008O510Y8", "context": "my microphone will not unmute! Any help will be appreciated.", "response": "Check your webcam settings."}
{"product_id": "B009IR1SR0", "context": "If I download this game on my current computer and eventually upgrade to a new pc, will I be able to transfer the game ?", "response": "Yes, I'v been able to do that as well."}
{"product_id": "B00FLLFJ68", "context": "Had this less than 6 months and both broke the things on the back(is that called a dongle?) -is this normal and is it something under warranty?", "response": "I don't believe it's under warranty but if you call nyko they may have replacement parts"}
{"product_id": "B005EOOT90", "context": "can these be used with an Xbox one?", "response": "Yes ,but u need a dss converter. I use it on my xbox 360,xbox one and ps3"}
{"product_id": "B00E0H5J8M", "context": "Does the mouse make noise when clicking or is it silent?", "response": "It does, but it is not loud enough to be noticed"}
{"product_id": "B004NRN5DU", "context": "Is this Free region game, so i can start it on my PAL xbox ?", "response": "I'm not entirely sure, but I have never heard of this game being region locked before. I would assume it is a free region game, so I say it should be safe to play."}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "Because this is a Japanese version. The Nintendo 3DS LL, means Japanese version and it only support Japanese language games. The Nintendo 3DS XL is the English version, it works with English games. You can't run English version games on LL, and the Japanese version games will not working on XL"}
{"product_id": "B0002GTXDM", "context": "Does the other gameboy need a wireless adapter, too? Also does this work with a GBA SP to a GB Pocket?", "response": "Yes the other gameboy need one too"}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "I just received this yesterday and no belt was included. :-/"}
{"product_id": "B00FENJVOE", "context": "i am using all 10 character slots already and im wondering if the xpac gives you more slots or will i have to delete a character to make a crusader?", "response": "I have no idea.  I have only established two characters.  I suggest you contact Blizzard, creator of Diablo III,  at https://us.battle.net/support/en/article/gameplay-questions to find your answer."}
{"product_id": "B000A2R54M", "context": "Can this game be played on the dsi", "response": "My 8 year old grandson says yes."}
{"product_id": "B00178630A", "context": "Do you get the key immediately on purchase? Or do you have to wait for the physical box?", "response": "You have to wait for the physical box to come in the mail to get the key, if you want a digital key right away, buy a digital copy from a store like macgamestore.com or from blizzard themselves"}
{"product_id": "B004QRKWKQ", "context": "In the \"i need the receiver for play in pc?\" question, somebody stated that it no longer comes with a receiver. Is this still the case?", "response": "Yes, It comes with the receiver."}
{"product_id": "B00178630A", "context": "Do you get the key immediately on purchase? Or do you have to wait for the physical box?", "response": "The key comes with the package as you need the disc to play the game."}
{"product_id": "B004QRKWLA", "context": "Although this controller is meant for the pc, can it still be used for the console as well?", "response": "It is a Console controller, but it has a unplug-able Adapter to change it to USB. But unplug it and it's console!"}
{"product_id": "B00AAQRNQ8", "context": "I have very large hands, how will this mouse work out with that? I prefer palm grip, and most mice force me to use claw because they are too small.", "response": "I have big hands also and it fits ok... Better than the Razer's I've been using for years..."}
{"product_id": "B00GQTZ8TM", "context": "Does it have pokemon on the console or is the ds plain red?", "response": "The 2DS is red and black."}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "Have you verified the requirements are supported by your cpu?"}
{"product_id": "B008OQTR3S", "context": "does it have offline multiplayer?", "response": "It does have offline Multi-player (split-screen) up to 4 players.  We've done 2 player split-screen mostly."}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "I preordered this last month and since I'm a prime member, I selected 2 day shipping. Just got an email last night from Amazon informing me I'll get it on release day. So, what you may have to do is go back into your order and update your shipping preference. But you CAN get it on release day."}
{"product_id": "B00519C7JC", "context": "What does the \"Standard LTO\" edition come with and what does \"Standard LTO\" mean?", "response": "I don't know what stand for but if you get the the LTO edtion you get a free map pack code included"}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "The adapter is included in the stereo headset package."}
{"product_id": "B00DC7O3K6", "context": "if i add a motion sensor to the back of my normal wii remote, does that work with this? or do i need a new remote all together?", "response": "Yeah it will work. I end buying one too cuz the motion sensor wasn't that much cheap"}
{"product_id": "B009LGO88E", "context": "does it work for the american 3ds xl", "response": "Yes, it's a hardware application so you won't have to worry about region locking."}
{"product_id": "B002B9FIUU", "context": "can I use the controller for any PC games, not just N64 emulation?", "response": "I think it depends on if the game itself would support the N64 controller."}
{"product_id": "B00F27JE1C", "context": "Anyone else having wireless issues with this unit?  See my write up on my vita slim green/white.  I'm assuming I got a lemon but would like to hear.", "response": "Yeah I've had mine for a while too, and haven't encountered any problems with the wireless, however sometimes the joystick becomes unresponsive and moves my character spuratically."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "it takes just 2 AA batteries (included). The battery pack is optional."}
{"product_id": "B00D6PTMB4", "context": "Is this a single player only game, or can two people plug in and play together?", "response": "Two people can plug and play it supports guitar bass and microphone. On guitar you can pick rhythm or lead."}
{"product_id": "B00BV72X1U", "context": "Would this work with a chromebook?", "response": "considering that the chrome OS is less of a full function OS and more of a straight-to-internet type...I'm going to say NO...no it will not. A wired controller however would work , you might want to check the youtube video  \"chromebook how to connect a xbox/ps3 controller and what games\""}
{"product_id": "B002QHDKE8", "context": "It is rated T for language.  What words are used that are inappropriate for kids?  Thanks.", "response": "I think its ok."}
{"product_id": "B00FATRKWM", "context": "Is the controller included ?", "response": "Yes, I think it is."}
{"product_id": "B00HWMP0TU", "context": "Does the complete edition have all expansion packs included?", "response": "Yes, The Complete Edition incorporates the expansion packs Gods and Kings and Brave New World in addition to several scenarios.  These are all downloaded from Steam when you do the install.  They are not separately loadable or playable though, just incorporated into the final game version."}
{"product_id": "B003VUNWG0", "context": "Loads great, but will not play. What do i need to do to correct?", "response": "try to unload and and then reload. also you can try to ...first try and start at hard drive .    this is all working on fact that your os  is compat with the game.    other than that check for fingerprint and scratches    possible you got a bum disc."}
{"product_id": "B00B98HDNO", "context": "How many gigabytes does it use after I buy the disk and insert into my xbox?", "response": "Hi. Please note this is a PC game. It Will not work with your Xbox."}
{"product_id": "B004N7HSGU", "context": "Does this work with the XBone?", "response": "They sure do. You need to buy the chat adapter though. This one here: Xbox One Stereo Headset Adapter That's only if you want it to work with chat though. It does work perfectly fine without it, you can just use the kinect for chat if you want to."}
{"product_id": "B00EPC3PY2", "context": "What language are the dialogues, subtitles, and the game menu?", "response": "Japanese lenguage , english sub,english menu..."}
{"product_id": "B00FNKMVUO", "context": "I'm sure this is dumb question but, does the mouse change colors?", "response": "NO it does not change color it just light UP."}
{"product_id": "B004XGN8W4", "context": "Does it come with all the power cords, or will i have to get them seprate?", "response": "yes comes with all the cords"}
{"product_id": "B00HN9LS48", "context": "I want to play my kinect on my old LCD tv which is 3 inches wide. Does this fit on it?? Does it have enough width so that the back flap works?", "response": "The back arm that extends has a soft pad and that lays on your TV. But that part moves and pivots that is like a second arm so it makes the range of the arm wider, so yes it can fit a really thick tv"}
{"product_id": "B0017TFLBQ", "context": "After installation, does it require the CD to play?", "response": "Yes, you do need to have the disk inserted to play. That's really the only bad part about the game, in my opinion."}
{"product_id": "B00JFPO7JG", "context": "After download the patch to start the program it start but after I hit the play button it turn off or said it can be run. What I need to do to fix it?", "response": "You need to up date your graphic, then go to www.Kalypso.com To fix the patch. If you have a old computer then sol."}
{"product_id": "B009K7U6IK", "context": "dose this keyboard use USB", "response": "yes it uses usb but not gold plated its just a regular silver looking usb connection"}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "No, but the latest PS4 update allows you to play your own music through the USB slot while gaming, so there's that as an option. I haven't tried it out yet, but it was supposedly released in the last large update."}
{"product_id": "B000ZKA0J6", "context": "Does it work on Windows 8.1?", "response": "Yes it does, my nephew has it on his and he has had no problems"}
{"product_id": "B0036VO4XO", "context": "Will this work with Mac OS X?  Yosemite?", "response": "It works for me."}
{"product_id": "B00AKIPBNS", "context": "I've heard that in the Fire Emblem series, there is something called PermaDeath. Is that Permanent Death? If it is, can it be turned off?", "response": "Yes, permadeath is permanent death. The option to turn off permadeath is actually something unique to this particular fire emblem game. Previous fire emblem games don't have this option."}
{"product_id": "B00B3PDHBU", "context": "On Turtle Beach website it says it's compatible with XBOX One via the earforce headset adapter. Are you sure it's not compatible?", "response": "It is compatible. I am using it after receiving it for Christmas. You need the adapter for CHAT communication, otherwise, it will still work for sound."}
{"product_id": "B008CP6Q6M", "context": "Does this game sold from the Official Amazon, will it include ALL Discs and DLC Codes? Alot of people have been complaining about missing games.", "response": "We have this game includes all discs however the codes may have been redeemed already. Thank you."}
{"product_id": "B0041RY3W4", "context": "Is it 110~240V ?", "response": "Yes, I use it with 220V and work very well!!"}
{"product_id": "B00CERXJNW", "context": "Is the wrist rest removable?", "response": "Yes, two large-headed screws on either end. You can use a flat-head or your fingers"}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "you can buy an astro gaming mix amp for that."}
{"product_id": "B001MGNWDI", "context": "Does it have a Yaw capability?", "response": "I only played this stick with the game \" War Thunder\" I could find nothing this stick could not do.  It is pretty easy to program as well."}
{"product_id": "B007XVTR12", "context": "i want to get bo2 on pc but if i get it in physical form will this come in a code so i can download it since my pc doesnt have a dvd writer/reader", "response": "There is two ways one u have to buy it from steam and download it or u can buy a dvd of that game and use some one elses pc to copy every file from that dvd and get ghose on a different flash drive and transfer it to u r pc."}
{"product_id": "B002BS47JE", "context": "Do you realy need the balance board?", "response": "Yes.  Only the yoga is done without it.  All the other games require it."}
{"product_id": "B000096L71", "context": "I read that others supply 4CDs with this software. it so with this offer?", "response": "Mine came with 4 CDs."}
{"product_id": "B00AJZNUUI", "context": "what is the difference between a wii and a wii mini?", "response": "Wii mini only plays wii disks.  It does not have Internet access."}
{"product_id": "B00CERXJNW", "context": "i have a k70 and a buddy is trading it from me for a k90, should i do it ? is mine better ?", "response": "Not sure if the 90 is better,  however my oldest son has the k70, and I have the k95.  The only complaint I have is the led stopped working on my u key. And the cap locks is very sensitive."}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "taiwan yes and yes"}
{"product_id": "B003VAM392", "context": "How long is the USB cord?", "response": "I'm not sure about imperial units,  but it felt like 1.5 -2 meters. it's long,  even for a corded controller."}
{"product_id": "B004L6C6BK", "context": "Is there a way to mute my mic? I'm thinking of matching this mixamp with Audio Technica's ATHADG1 which requires you to hold the mute button closed.", "response": "There is no mute button on the mixamp its self. I own a pair of A40s and the mute button is on the cord of the the headset."}
{"product_id": "B00EPZ8POY", "context": "does this bring athena hades and poseidon", "response": "Yes, they can be used as playable characters"}
{"product_id": "B003O6JLZ2", "context": "How many controllers come with this listing and are ALL cables included?", "response": "One controller. Yes, all cables are included. enjoy"}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "Sorry. I really can't give you a good answer. The first one I bought was broken. I have a new one, I charged it and now it works. I've used it several times and haven't had to recharge."}
