{"product_id": "B000OPOCFU", "context": "Does it play on Windows 8.1?", "response": "I don't know if this game does, but using the compatibility settings, quite a few of my older games (most of them are pre-2012 before 2012) play just fine."}
{"product_id": "B0096L2SJ0", "context": "where are the games stored", "response": "I'll need to ask my son but I'm assuming in the devices memory"}
{"product_id": "B00D6NPFDK", "context": "Does the SWAP force starter pack for wii work with wii u?", "response": "No. The disk did not work. It was anly for USA and South America, not for Europe."}
{"product_id": "B00F27JDUY", "context": "Could i change the language", "response": "No I don't think so"}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "That is exactly what I use it with and it works perfectly. It is just a hassle to setup; at least it was for me."}
{"product_id": "B00H3VJYD8", "context": "Does it work on Mac?", "response": "It Hasn't arrive yet, when it does I will tell you"}
{"product_id": "B00008J7NZ", "context": "Do these copies contain version 1.0 or the updated ones that deleted all of the glitches.", "response": "The game does not update if you don't have an Internet connection, if you have Internet connection, the game updates itself."}
{"product_id": "B00BGAA3S2", "context": "Is this just an upgraded version of the Playstation Eye? I play the champions game, will this work better than the eye?", "response": "It's not sorry it's beyond what the eye was and more."}
{"product_id": "B00BKF5IXS", "context": "Does this bundle have everything needed to play regular ps 3 games. Not just move games. Or do I need another console?", "response": "Yes it plays all ps3 games it also plays movies including blue rays"}
{"product_id": "B00D8S4GNS", "context": "is it like dance central", "response": "The kids say its better!"}
{"product_id": "B00292OW1U", "context": "Do the Home/End buttons require additional keys to be pressed (aka Function key)? What about F-keys (F1, F2, etc)? Location of Home/End?", "response": "Home and End are located on the Num Pad and require Num Lock to be off. The F-keys are standard set up, nothing special."}
{"product_id": "B00DHF39KS", "context": "Does this have the \"Legacy\" control options (\"turn\" on left thumbstick and \"strafe\" right thumbstick), please?", "response": "Oh you mean lefty option? Then yes I guess so,  most games do."}
{"product_id": "B002I0HD9G", "context": "Hi everyone, is this supported on PAL system in Britain?", "response": "Xbox 360 games are not region free. There should be a PAL version available. However the online servers are no longer online, you can still play the offline single player."}
{"product_id": "B00FE8WKMO", "context": "Does the Wii balance board work well on carpet?  I notice all the pictures show it on hard surfaces like wood, tile, etc.", "response": "I always use it on a rug. No problem."}
{"product_id": "B008RA5AWS", "context": "Can I install it on my business computer and my home computer so that I can work at home if necessary?", "response": "Yes you can install quick books on both of your computers. You will have to restore your information from your business machine to your home machine so they are identical.Ron"}
{"product_id": "B009SJR28W", "context": "Are the keys noisy", "response": "Yes, the keys take a little bit of oomph to push down."}
{"product_id": "B0065NP6NC", "context": "Are the missions like Call of Duty (mission 1 must be completed before mission 2) or like Far Cry (you can complete missions in different order)?", "response": "Kind of a mix it's not a mission type game it's a quest game as expected it is an rpg"}
{"product_id": "B005QUQP80", "context": "Does this keyboard response with Windows 8.1?", "response": "You betcha. Everything works great. USB3, multimedia keys, volume rocker."}
{"product_id": "B0050SVNP8", "context": "I wasn't able to play the first Pokemon B&W due to Nintendo cutting the wifi access, will this game spoil the experience of the first game?", "response": "No it will not because of the multiple changes"}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "Yes it works for me.  Do not use the MS drivers - Win7 installs its own.  I use it in Battlefield 3 and other games with no issues."}
{"product_id": "B009AFLXQQ", "context": "Does the Charging Cable connect to the system and acts like a wired controller? Having the responsiveness of a wired one, or is it just a charging cab", "response": "It is actually works really well, as do most wireless controllers these days. I would highly recommend it. It is a rechargeable wireless controller, it makes no difference whether it is wired or not, it remains a wireless controller. The charging cable just charges the controller."}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "is for the model 1000, original model, and fits well. improves grip and more comfortable to play."}
{"product_id": "B00BDX1M00", "context": "Does this work on Windows 8 PC and is it wireless even for PC's?", "response": "It does work with pc and yes it is wireless even for pc"}
{"product_id": "B004FS8LYK", "context": "why is it rated m for mature", "response": "There's blood and gore, intense violence, and strong language. That's why I believe it's rated M for mature"}
{"product_id": "B00ENFVS5Y", "context": "How is this wheel mounted? Example I have the  Microsoft 360 Wheel & it has a clamp to attach it to a desk.", "response": "If you are going to use this with a 360 One.....you will want to buy a stand or build one. No Lap this is a heavy wheel with a lot of tork. (SP)"}
{"product_id": "B00DE2W33I", "context": "was everything in the packaging", "response": "Yes it was, inside the main PS4 Box"}
{"product_id": "B000056SPM", "context": "What are the default assignments to the buttons and levers in Flight Simulator X?", "response": "Hi jerry, follow this link http://www.chproducts.com/13-29620-Downloads-and-Community-Links.php you can find what you need, and with this one http://www.ch-hangar.com/forum/index.php/files/file/109-control-manager-dummies-guide/ you will have a full guide."}
{"product_id": "B00DJYK9L4", "context": "I am in a wheelchair, does it work if you use the arm band or by holding the remote? If I was to wear the belt higher, in theory would it work?", "response": "I guess it is not going to work that well because i found out if I put the bell higher and put remote into it, most of the sound indicated that I missed a lot of actions.  I guess the hip movement counts the point.  if the score doesnt matter to you, then it should be work."}
{"product_id": "B004N7HSGU", "context": "Will the ASTRO A40 PC version sold on the Astro website work on the Xbox One using the MixAmp Pro?", "response": "yes but you need another adapter however the mic sucks so good luck communicating with anyone"}
{"product_id": "B00GU4F4OM", "context": "Will this mouse work with Windows 8.1? I have been seeing some reviews of some that have issues with 8.1 for some reason...", "response": "It worked great with my windows 8.1 I love this mouse best you can get for the price"}
{"product_id": "B0072A4JVW", "context": "Does it come with l2/r2 buttons because I am trying to play ff8", "response": "No it doesnt. I also would recommend abother product like the Nyko grips"}
{"product_id": "B00HKCKA0G", "context": "Can you hear your own voice with these headphones?", "response": "Not unless youre testing the mic"}
{"product_id": "B00A7VK16A", "context": "Has anyone used a xbox slim when in a car? Will the disk get messed up?", "response": "Keep in mind that you will need a 110V power outlet or a capeable inverter in your car, first."}
{"product_id": "B00J128FPA", "context": "So I have a square enix account on my Ps3. If I get the ps4 Version can I still use my ps3 account and characters? Or do have to start over?", "response": "you can login with the same account, then do a character transfer"}
{"product_id": "B00519C7JC", "context": "What does the \"Standard LTO\" edition come with and what does \"Standard LTO\" mean?", "response": "It just came with ascension bundle.  Guessing limited time offer I could be wrong ;)"}
{"product_id": "B006NU6HAS", "context": "Does this include the 800/900 and the 600/700 or just the 800/900 ?", "response": "Doesn't pertain to any particular plane if you can't install microsoft flight sim x ser. Pack 2 most add on planes may not work."}
{"product_id": "B00A1AQJAO", "context": "Does it have a place for inserting the cartridge or do you insert the action replay then remove the action replay once the codelist is loaded?", "response": "All you have to do is place the game inside the action replay and select your codes for the supported game"}
{"product_id": "B000YQ639M", "context": "could this game run on a windows 7?", "response": "No, it will not.  It was made for Windows 98, will work on 2000, possibly Vista."}
{"product_id": "B0072A4JVW", "context": "Does it work well with the PS Vita Slim?", "response": "No! It is not for the slim version. It is for the original vita."}
{"product_id": "B000OPOCFU", "context": "Does it play on Windows 8.1?", "response": "I am almost positive that you can. I have not fully downloaded to Windows 8.1."}
{"product_id": "B004RMK4BC", "context": "How do I get my code", "response": "Just pay for it and they will give your code by two ways, first one is in the browser page where you did the payment and second they send the code to the email you're registered with. I already bought codes a few times and never got any trouble"}
{"product_id": "B00CXCCH1I", "context": "Does this need to be connected to internet or can I play offline.?", "response": "I don't believe you need to be connected to the internet to play."}
{"product_id": "B005UI8V6C", "context": "Does this work with an Xbox 360 controller?  Or is it strictly Keyboard and Mouse?", "response": "Its definitely a Computer game,  you cannot play it on an x-box 360 Controller.  You have to have a computer.with keyboard and mouse.  But one thing I can tell you is that its an excellent three Games. and Easy to use."}
{"product_id": "B00965WK8K", "context": "How is the middle click (scroll wheel) on this mouse? Stiff? Light? Is it easy to click without accidentally scrolling at the same time?", "response": "The wheel is grooved and the mouse itself is heavy, so it's easy to press the wheel without scrolling or moving the pointer. It gives very little resistance when rolling, just enough that you can feel the grooves; and the wheel won't spin on its own if you flick it."}
{"product_id": "B00965WK8K", "context": "Can this mouse be put in rapid fire mode?", "response": "I think this mouse is not for FPS game.. in my opinion.."}
{"product_id": "B00005NIMB", "context": "Will this work on Win8 64bits?  I will play mostly the \"Battlefield\" games.", "response": "Not sure.  I play BF4 on Win7 Pro without any issues, however."}
{"product_id": "B001AWBYRA", "context": "does it already have all the update patches", "response": "The Game is up to date"}
{"product_id": "B00A8HIGSS", "context": "Konnichiwa!! Is this copy of the game the first print, or is it the re-release version that has 'the BEST' on the box? Could you e-mail me a photo?", "response": "Hello konnichiwa!This is first print version!I can not sent picture. Because Stock is located in the Amazon warehouse."}
{"product_id": "B00HN9LS48", "context": "I want to play my kinect on my old LCD tv which is 3 inches wide. Does this fit on it?? Does it have enough width so that the back flap works?", "response": "It should work as my son's TV is an older LCD (at least 3-4 years old) also; I never measured it exactly but he had no trouble attaching.  I know for sure it's not one of those very slim edges that are on the market today.  Should work fine."}
{"product_id": "B0050SZE2G", "context": "Whats in the box? Just the game? If thats the case will it better to download it?", "response": "Yes, this game does include the physical disc in the case. It is your preference if you would like to own a physical copy of the game, or download a version to play."}
{"product_id": "B00CPS59CE", "context": "Does this come with the bluetooth wireless chat adapter as shown in the photo?", "response": "For PC? No. You will need to get a Bluetooth adapter for your PC. Audio is terrible with the bluetooth feature for PC."}
{"product_id": "B00EZKNSTQ", "context": "does it come with a cord", "response": "yes, and thankfully its attached"}
{"product_id": "B008RA5AWS", "context": "Can you have more than one company on this version?", "response": "Yes. I currently have 3"}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "It does...no free scroll like the G700."}
{"product_id": "B0056JPS84", "context": "My XBOX 360 drive is the DG-16D2S-09C and does not work, if I order the same model, I just have to switch it and my XBOX will work without any problem", "response": "Yep.as long as u switch the chip between the 2 drives.involves soldering.....or you can flash the new drive with the old drives firmware"}
{"product_id": "B00GJXMRX0", "context": "has anyone else had there pc completely shut down while playing assissins creed 4? mine does after about 25min. it has happened 5 times so far.", "response": "nope.. it doesn't.. check your cpu/gpu temperatures.."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "It is pretty clicky. If you are skilled and keyboarding, it's like hearing a typewriter all over again."}
{"product_id": "B00CH923NE", "context": "Does it come with the PIN for the Nintendo shop? I can't seem to find the code anywhere.", "response": "No i did not get one probably the only way to get it is if you get the game brand new unopened"}
{"product_id": "B0042J7I3C", "context": "Can i hear the gaming sound and friends chat on the headset", "response": "Yes. The mic stopped working on ours"}
{"product_id": "B0085P7U0U", "context": "Does this really work with OSX 10.9.5?  I bought games recently and they wouldn't work on this operating system.  It was a pain to try to get my money", "response": "Yes I have OSX 10.9.5 and I can play the games on this."}
{"product_id": "B0065NP6NC", "context": "Is this version more, or less buggy then the regular edition? Less crash/freeze prone?", "response": "I'm not really sure, but never buy this for the PS3.  The lagging and freezing is far worse!"}
{"product_id": "B0072A4JVW", "context": "Does this get rid of having to use the rear touch pad?", "response": "No. It covers the entire back part of the Vita leaving only the rear touch pad exposed for use."}
{"product_id": "B003VAHYQY", "context": "DOES IT WORKS WITH A MAC???", "response": "To reiterate, it seems to work just fine as long as it's in D-mode.  The switch is on the back.  I put it on D-mode before plugging it in for the first time and just reveled in 18 glorious minutes of Contra on OpenEmu."}
{"product_id": "B0000512IE", "context": "Can I use these with Window 8/8.1?", "response": "Yes. I installed on windows 8 and had no problems"}
{"product_id": "B008TP1OKI", "context": "Can i download my Xbox deals and Games with Gold Deals from the marketplace in this hardrive?", "response": "We do and it works just fine."}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "No. The light blue. slightly arced background at the top of the box means it is for the Wii-U. You need to get a copy that just say Wii on it if that is the system you have. However, wii games are usable on the Wii-u if you ever decide to upgrade to that console."}
{"product_id": "B0050SX9I2", "context": "I'm trying to use my ps3 remote control/blue ray remote and when I try using my ps3 to turn it on the ps3 button on top just blinks???", "response": "Mine does the same exact thing. It was working for 2 months...now it controls the tv, but just blinks when trying to use the PS3."}
{"product_id": "B00F34LZT8", "context": "Since it's from Germany .. is this game in English?   Only info is Region 2/PAL.The box doesn't indicate and there's German printing... thanks", "response": "I bought this and the box is not in english. However once game is installed from main menu you can choose english and game plays 100% fine. Great game hope this helped you out. :)"}
{"product_id": "B000ZKA0J6", "context": "So this is like Warcraft you have to play on line.. I hate that", "response": "..... Since Starcraft been out its been like that"}
{"product_id": "B0094H8H7I", "context": "does any one know how this is compared to the hyperkin retcron 3? excluding the part of retcron 3 being compatible with nes and snes games", "response": "It's completely different retron 3 as no games built in this one does"}
{"product_id": "B00E8RVP0U", "context": "Do you need the Zumba fitness belt for Wii to use this?", "response": "No - it is not needed."}
{"product_id": "B000TK99PS", "context": "What games are actually on this ? is there Gravity Tiles and Majong and Backgammon etc.????", "response": "Yes there is Gravity Majong tiles Backgammon - chinese checkers - regular checkers - Paschi - Dominos- Bump - just some of the games -"}
{"product_id": "B00D96BJSO", "context": "I recently got the XO Four Turtle Beach and the only major issue I have is how it's very uncomfortable on my head. Is this one better?", "response": "Yeah, very comftarble and excellent quality, I as a gamer I highly recommend them."}
{"product_id": "B009RHEBWA", "context": "How do I know that the Federal fom did get e-mailed? Didn't see anything in my \"sent\" e-mail box.", "response": "First, I received an e-mail from H&Block; that said the IRS received my return. A little while later I received this one saying... \"Congratulations! The IRS has accepted your federal return.\""}
{"product_id": "B000HZFCT2", "context": "Does this work on Windows 8?", "response": "Indeed it does, without any issues or driver installs. Works right out of the box."}
{"product_id": "B009D3HSTG", "context": "Can you get this to run on Android? I have one arriving and didn't think to check.", "response": "As long as you have a USB 2.0 and you should be fine. Just when you go into the key bindings hit the button on the controller, I found it was as simple as that."}
{"product_id": "B00GOOSORM", "context": "do u need it if u buy the ps3game", "response": "Yes it handles the ps3&ps4; subscription,you put the code on the card in the mog station acct and they apply it to your acct"}
{"product_id": "B0050SVNP8", "context": "Can this be played on a ds lite?", "response": "yes, it should b able to<3 mine plays it and my DS was one of the first models released in Austalia. it should b able to run on any ds, it's just 3ds games U gotta b careful about"}
{"product_id": "B00009VRG5", "context": "In I Spy Fantasy, where is the scroll in the wizards room?", "response": "it is the rolled up paper with the ribbon around it laying on the desk"}
{"product_id": "B005L38QK2", "context": "My mouse stopped working. How can I return this product and replace it with another ?", "response": "Call Amazon if you have had the mouse less than 30 days. If not call steelseries."}
{"product_id": "B00001LDCK", "context": "will this game work on windows 7", "response": "Yes, but don't buy it because Homeworld 1 and 2 coming out later this year remastered, and they will work on any modern PC."}
{"product_id": "B0041RR0TW", "context": "Any Ubuntu Linux users? I'd like to buy this for my Ubuntu 13.10 gaming rig.", "response": "It works great. If you want to map the buttons, use xboxdrv. It's in the Ubuntu main repository."}
{"product_id": "B007VPZR5U", "context": "can this mouse make macros for GW2?", "response": "its probably the best mouse on the market for macroing, i use it for control groups on starcraft and hotkeys in WoW and DotA2.  just bind them to the keys on the mouse and go have fun"}
{"product_id": "B002672Z80", "context": "do these have the wrist straps with them?", "response": "do not buy,it dosen't work in USA"}
{"product_id": "B008SBZD9G", "context": "Which is better the steam version or the FF14 client? (I mean the steam version uses the FF14 client anyways right?)", "response": "Wherever you buy it, the game will need to update anyway. MMOs thrive on weekly patches."}
{"product_id": "B00BGGIWZM", "context": "I just downloaded sims 3 Island paradise but I cannot run it because it says I need to download Sims 3 first. Does any one know if this is the case?", "response": "Yes that is the case.  Island Paradise is an expansion pack and expands on the Sims  3 Base game. You'll need to have the Sims 3 before you can run and play Island Paradise."}
{"product_id": "B00FEDP968", "context": "Does anyone know if this headset works with the ps4 either through Blutooth or by the cable?", "response": "I  thinks primarily designed for the PC, but you may want to check out this link. It has bluetooth that pairs with your phone, but I'm not sure if would working that way for full audio support for gaming http://www.roccat.org/Products/Gaming-Sound/ROCCAT-Kave-XTD-5-1-Digital/#crb_2"}
{"product_id": "B00GJ2HZ7E", "context": "Is there gamepad support?", "response": "I have been using a 3rd party wired X-box 360 controller with no issues."}
{"product_id": "B004RMK57U", "context": "If i use the playstation plus for 1 month can i stop it so the days would not run down??", "response": "No. Once you activate your membership, it started the subtracting from your days."}
{"product_id": "B0007TJ7TE", "context": "Lighted keyboards won't work with KVM switch ??? A previous posting suggested same (i.e., 6V to produce lighting not available through KVM switch).", "response": "I have the iomega USB KVM switch.  My Saitek keyboard's lights worked fine.  The trick is that I had it plugged into the USB port on the PC, turned the lights on, then plugged it into the KVM switch.  Works fine!"}
{"product_id": "B00DC7G2W8", "context": "Do you need the wii motion plus or the regular wiimote  work with this game?", "response": "You can use the Gamepad, Wii U Pro controller, Wiimote, or Wii Motion Plus with this game."}
{"product_id": "B0042J7I3C", "context": "Can you hear your own voice when talking?", "response": "Yea it's a echo it happens it means the other person as there mic to close to there tv or there mic it to loud and it's repeating what you say!!"}
{"product_id": "B00D3RBYM0", "context": "Does this game require the kinect to play?", "response": "Nope but does requires Internet for the saves"}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "I would say yes as long as the tv is facing at a downward angle with at least 3 inches or more space between wall and mount if that makes any sense. Hope that helps if flat it will either fit or won't. Sorry if it doesn't as my tv is not on my wall."}
{"product_id": "B00DNGQTFI", "context": "Why are all dragon ball fighting games? Where can i purchase role playing DB games?", "response": "Dragon ball z budokai HD collection from gamestop has some roleplay in budokai 3"}
{"product_id": "B00EF1OGOG", "context": "How do you recharge", "response": "You can use the same charger you use for your phone or tab. You could also use the computer usb port but it takes much longer. If you want rapid charging you could also buy a rapid charger."}
{"product_id": "B001CXYMFS", "context": "How long is the USB cord?", "response": "mine is 8ft plus some because i didn't have someone to hold it stretched out. The cord that separates thruster and joystick is approx. 2 feet."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "Normally you get the code immediately. I think it could take up to 4 hours or so, never happened to me, I always got it within the 5 minutes if not right away. When you got the code it will be sent automatically to your email (the one linked to your amazon account)."}
{"product_id": "B0050SYILE", "context": "Say i have borrowed the game from a friend and have already downloaded the 8 gb. Would i have to download it again if i bought it here??", "response": "No it just needs a disc to run the game."}
{"product_id": "B000QJ1NS8", "context": "The picture says 850 mAh but the description says 600 mAh.  Which is true?", "response": "the picture is usually correct, unless the battery is a used product."}
{"product_id": "B00DVEJA7G", "context": "Odd question, I use Spotify instead of iTunes on my iPod Touch...is this ok or must music run through iTunes?", "response": "I really do not know..."}
{"product_id": "B002I0KP4G", "context": "Does the latest version of 13 inch retina 128GB works for this game?", "response": "mmmm well, i think that its importan to review the specification of the retina 128gb, but this game are very hard in graphics"}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "On the top of the Wii is a spot that you can flip up and it reveals GameCube controller ports as well as memory card slots"}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "You can give the code to anyone, no its linked to your amazon account."}
{"product_id": "B00ANHBJBY", "context": "Will this controller work with the new Super Smash Bros. Wii U game? Does it register as a pro controller?", "response": "Yes and Yes. I play the SSB wii u version with friends and family. Everyone likes the controller."}
{"product_id": "B003G6ISRC", "context": "Does the game install completely on the hard drive or does it need the cd to be in the computer to play the game?", "response": "You don't need the CD in computer when you play the game. You can copy the CD in your hard drive, or start game from CD then you can take the CD out while continue playing. Please let me know if any further questions."}
{"product_id": "B0036WTVNG", "context": "I got one.......says to put in disc but it did not come with one.", "response": "I got this for my husband. He said he never got the cd and thought that was odd. He said he has never been able to configure it to any games correctly because he didn't have the cd."}
{"product_id": "B004C34D2M", "context": "I bought this for my grandson's Wii.  IT WILL NOT SYNC!!!!!I tried to sync it to two other Wii units and IT WILL NOT SYNC!!!!What do I do?", "response": "They dont sync right. Mine do not sync either. Took a chance and got burned."}
{"product_id": "B009DYCTY4", "context": "Does it come with controllers?", "response": "Yes only one though"}
{"product_id": "B00EV4O8VS", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "I am pretty sure it is the old one. The battery lasts 4 to 5 hours."}
{"product_id": "B0091A3AHA", "context": "Are there big diferences between the models in size, or all of them can cary next gen console? (ps4 and x-one)", "response": "Hi Felipe,It fits the PS3 Slim and the XBOX 360 perfectly. As far as next generation, if you go to the GAEMS website (gaemspge.com) it states that it fits the PS4, however a \"kit\" is needed so that the XBOXONE can fit more \"stable\". Check the website for further information. I hope this helps."}
{"product_id": "B003EUPCZG", "context": "Does this left handed mouse click on the right side so I can rest my whole hand on the mouse and click with my index finger like righties do?", "response": "The answer to the question you asked is \"yes.\" It's not an \"ambidextrous\" mouse, but a true \"left-handed\" mouse, shaped to fit the palm of your left hand exactly as you described. Yes, the buttons are configurable, but that's not what you asked."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "I was confused about that as well but no, the keyboard is a typical American layout. This company should really get marketing pictures of each keyboard. The only thing that's not usual is that the caps lock button is a key sequence rather than a one touch key in the usual location. I'm very happy with this keyboard."}
{"product_id": "B00DLRLDBO", "context": "Do you need any extra cords or items to use with xbox 360", "response": "All the cords that you need are included with the headset. That includes everything you need for the 360."}
{"product_id": "B00BMFIXEW", "context": "how many people can play at the same time? does it support the wii remote plus control? is t necesary the nunchuk controller??", "response": "All I know is it was a good game, and I played it with the wii u game pad controller that comes with the console."}
{"product_id": "B00FENJVOE", "context": "Can you use characters developed from D3, or do you have to start fresh from lvl 1?", "response": "Do not let the high price fool you. This is not a complete game but rather a DLC.So, yes, you can continue with you old characters or (if not used up all 10 of the allowed characters) create new ones."}
{"product_id": "B00HN9LS48", "context": "Would the Xbox 360 Kinect clip work for the Xbox One Kinect?", "response": "Yes. It's harder to couple but once it's connected it works just fine. The xbox one clip doesn't support the weight of the sensor."}
{"product_id": "B000B9RI00", "context": "Are the codes used for the xbox live or will we be able to use the codes after we purchase it", "response": "After you purchase this, it gets delivered to your home. When delivered your code will be on the card. Go to your Xbox or Xbox.com and redeem it (Enter It) Through your account."}
{"product_id": "B00D6NPFDK", "context": "will other skylanders work with it(as in normal skylanders and skylanders giants)?", "response": "Yes my boys play all the time from spyros and giants all work"}
{"product_id": "B00B5QLS4A", "context": "I have a SteelSeries 4HD mouse pad,would this work well with a plastic coated pad? I currently have a Naos 5000 that's getting worn out.", "response": "It worked well on my laminated/plastic tabletop, but I got the best performance on a cloth mousemat from xtrac pads. I bought the ripper, it's large, but so useful and made in the USA if that appeals to you."}
{"product_id": "B00EVWZHLK", "context": "Is this trilogy a good place to start for a totally new beginner to the entire AC franchise?", "response": "If you want to know the story behind the Assassin's Creed saga."}
{"product_id": "B000B78F72", "context": "Does this cd have the ORIGINAL CLASSIC SOLITAIRE????    I already purchased a cd that had 100's but did NOT have the classic game I wanted.....", "response": "What do you mean original classic, Klondike? yes it has that."}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes, only versus mode and online, but no co perative mode, only versus"}
{"product_id": "B00IVJ1M7M", "context": "Will this work with Pokemon Omega Ruby and Alpha Sapphire?", "response": "Yes, is working already."}
{"product_id": "B007CM0K86", "context": "Do it has scary zombies?", "response": "The \"scary\" thing here is the piss-poor grammar and spelling."}
{"product_id": "B009JZ04BC", "context": "As a right handed user, do the side buttons on the right side get in the way when playing games? Does your finger rest on them thus pressing them?", "response": "When I first got the mouse, it was a \"problem\" and one that was really annoying, but after a while I changed the way I gripped this particular mouse . Keep in mind you can always set those buttons to do nothing via the included software if needed."}
{"product_id": "B000RT2868", "context": "I am wanting to use this adapter on my xbox contoller to connect to my Xbox 360 usb port to play games. Will it work for that?", "response": "No, I've tried it.  This cable is for connecting your old xbox controller to a computer where, along with some downloadable software, you can use it to play games."}
{"product_id": "B004RMK57U", "context": "If i use the playstation plus for 1 month can i stop it so the days would not run down??", "response": "No, playstation plus comes in 3 packages..1 month..3 months..Full Year..Once u redeem that code it doesn't run out until date says it will run out"}
{"product_id": "B0076DO5A0", "context": "Can this be played on windows vista 32 Bit?", "response": "Yes  I played it on a machine with that configuration."}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "Not that were aware of. There was only amazons producct guarantee."}
{"product_id": "B002RYLG4Q", "context": "How long are the cables? The distance from my TV to couch is 8 feet. I know I won't have a problem with the Original NES, not sure about this one.", "response": "I can't tell you a measurement but with they power cord and controller cords you shouldn't have any problems"}
{"product_id": "B003YC4D9A", "context": "I just got mine in the mail and I'm wondering how do I connect it to the Wii U?", "response": "Plug it to the stick. Instead of the nunchuck."}
{"product_id": "B006JKARP8", "context": "where is the other cable for the portable charger", "response": "I Do have one thought"}
{"product_id": "B003VUNWG0", "context": "it wont download on my windows 7", "response": "It wouldn't work on mine either!"}
{"product_id": "B00FC1UH82", "context": "does it work on ps2", "response": "No its just for ps3"}
{"product_id": "B0088MVQIM", "context": "includes version for bass or should I download?", "response": "Guitar AND bass. No need to buy the bass dlc. It's included."}
{"product_id": "B008FHL56S", "context": "Does this product play Titan Falls?", "response": "If its an Xbox 360 game yes"}
{"product_id": "B00CJ7IUI6", "context": "Does it require internet?", "response": "The game does not require internet."}
{"product_id": "B009WI7V9E", "context": "I'm wondering about sexual content because I have younger kids in the house.", "response": "I haven't seen any sexual con tent but I don't know if kids should be playing this game because it is so very violent. The language is not good and is anti-God."}
{"product_id": "B006SVUQNQ", "context": "Does it work for installing Battlefield 4?And do you know this from experience?", "response": "Installing a game, Idk, but I do know from experience that it is not formated like a normal hard drive is, and will need someone with advanced programing experience for some features to work."}
{"product_id": "B00FLLFJ68", "context": "Can this charger be mounted vertically (ex: on a wall) and still work without the controllers falling?", "response": "No, Must lay flat. I do not recommend this product though. Mine failed after 2 months."}
{"product_id": "B0086V5UF0", "context": "will this work in South America?", "response": "That depends on your gaming system. You might have to ask Nintendo. I thought all gaming systems were the same not like DVD players."}
{"product_id": "B0053BCML6", "context": "Can you play 2 player with just 1 cartridge (2 3ds) or do you need to purchase it 2x for 2 player?", "response": "You need 2 cartridges (or digital copy) to play with other people because you need to make your own character and your own town."}
{"product_id": "B00E88G054", "context": "Does anyone know if this will work with Windows 8?", "response": "Yes I have been using it with windows 8 and haven't encountered any problems"}
{"product_id": "B00D96BNGM", "context": "What cables do I need if I want them to work on ps4", "response": "None.  HOWEVER, you will need to go to turtlebeach.com and connect thg\\e headset to your computer (cables are all supplied)  to download the PS4 compatibility software.  You will also get a ton of really neat presets for the headset as well."}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "Yes... as long as it is a PS3 game it will play on any PS3."}
{"product_id": "B0054JGGGY", "context": "how long is the battery life?", "response": "It seemed to last me about 8 hours of straight use before it would die."}
{"product_id": "B00F68LBE0", "context": "What's the wireless range on this controller?", "response": "About 10 feet. Give or take."}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "Nope...I was disappointed to"}
{"product_id": "B000O5DY0E", "context": "This game does come with the manual and code, correct? I just want to be sure because most games sold forget to include the manuals.", "response": "The version we purchased did."}
{"product_id": "B002W8D0EQ", "context": "this gift card work on my PS4", "response": "im pretty sure it would"}
{"product_id": "B002ZS6Y64", "context": "Does this come with a cord that will plug in to an xbox 360 controller", "response": "Digital Audio Control Box ?"}
{"product_id": "B00DGZDFLW", "context": "Is it worth buying on PC if I already own it for PS3?", "response": "i wouldnt buy the pc version. i think you will be disappointed"}
{"product_id": "B009Q8PP16", "context": "is it compatible with black ops 2 and how would you program it to the game if it is possible", "response": "Yes it is compatible with black ops 2 and pretty much any call of duty game. You don't have to program anything you just turn the mods on and enjoy all mods."}
{"product_id": "B00FB45YFQ", "context": "Do these completely cancel out all noise?", "response": "No, they are very uncomfortable for long hours of gaming as well."}
{"product_id": "B00CBNV7UQ", "context": "Is it Chinese subtitle or English?", "response": "My son, Joe states the copy he has is only English."}
{"product_id": "B000H1V56U", "context": "Does this work with the XBOX 360 core? And does it actually improve performance?", "response": "Core is non-slim?  Then yes it will work.  It is quieter than stock but will still get loud during game play."}
{"product_id": "B00H45K6KS", "context": "I have never played any games in the Atelier series, does this game provide tutorials for newcomers to the alchemy system?", "response": "yes ,but the system is simple to under stand an they present them to you through out the length of the game ,I would encourage you to experiment with different traits and effect as they do stack"}
{"product_id": "B000O5DY0E", "context": "Did you have any problems with the downloads?My old CD would stop downloading and will tell me to retry again because a specific file will this happen", "response": "I never had this problem but usually when the game starts cutting up it is because it needs to be cleaned or it has been scratched. Also I've always purchased the game not download it.Well if your having problems with downloading the game the best thing to do is to contact customer support."}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "Yes, you plug one part of a mic control into your Xbox and then plug the included 2.5mm cable into your controller."}
{"product_id": "B002FY0CM0", "context": "I have a late model 1 sega genesis.  Will this cable work?  The RF connector in the pic doesn't look as though it will fit my system.  Thanks!", "response": "If all else fails, look underneath your console for the model number. It should be Model# 1601. If it's anything else, then this won't work for you."}
{"product_id": "B00BGGIWZM", "context": "I just downloaded sims 3 Island paradise but I cannot run it because it says I need to download Sims 3 first. Does any one know if this is the case?", "response": "You have to have sims 3 before you download any expansion packs."}
{"product_id": "B00H8NS1K8", "context": "I have ATH-M50, is it okay to buy this or stay with M50? Thanks.", "response": "If you're using them for gaming. I would say yes, the mic quality is very good in this headset. The highs and lows are also supreme for knowing where the enemy is or just the ambiance"}
{"product_id": "B004N7HSGU", "context": "Would this work for the PS4?", "response": "Absolutely, the mix amp pro that comes with it has multiple inputs, you would go straight out of the ps4 optical output into the mix amp pro and the mix amp would send the signal to the headphones, crisp and clear."}
{"product_id": "B00CMQTVUA", "context": "Can you use the Kinect from Xbox 360 on the Xbox One?", "response": "no you cannot they are different versions sorry one is 1.0 the other 2.0"}
{"product_id": "B008BGXYBM", "context": "Does this Razer Taipan have Dual Sensor (two holes, one optical, one laser in the bottom)?", "response": "I have the BF4 edition of the Taipan, which means mine has a fancy paint job. There are two sensors and there is no LED light for an optical sensor, so I'm gonna say there are two laser sensors, but no optical."}
{"product_id": "B00AR1LX9O", "context": "what is the battery life for this product?", "response": "I would say I get a good 10-15 hours of runtime on a single charge, and standby time is also pretty good, charges up pretty fast also!"}
{"product_id": "B000FQ9R4E", "context": "For some reason my Wii console will not read this disk. We are on our second disk now and it hasn't read either one. Does any one know why this is?", "response": "The game's messed up. Something about how they made it that causes it to break after awhile. Went through like 3 already"}
{"product_id": "B00FENJVOE", "context": "Is the entire \"expansion\" really just one additional Act V?", "response": "They added Act V as well as adventure mode where you travel to the various areas and do \"bounties.\" There are also rifts that you can open where the goal is to kill monsters until the rift guardian spawns and you kill that. All for loot."}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "It is included with any Xbox One headset purchase."}
{"product_id": "B00JM3R6M6", "context": "I have three children that all love Tomodachi Life demo and are now asking for the full version.  Do I have to buy 3 copies of the game for $30?", "response": "Yes.  Buy 3 = 3 happy kids = happy parents."}
{"product_id": "B003O6E986", "context": "Does this game have a multiplayer mode (not online) with a split screen", "response": "I honestly don't know. I only play the game myself. Sorry"}
{"product_id": "B004IK24MU", "context": "Does this work with any and all wii controllers? How?", "response": "Yes it does, it's a good value for the price also. This charger comes with a replacment battery cover which is the battery pack that is rechargeable. If the battery cover is the same it will work."}
{"product_id": "B002TLTBN0", "context": "WIll these classic controllers when plugged into the wii remote, be compatible with Smash brothers?", "response": "I can say mine did and I have a couple of their games to include mario party's"}
{"product_id": "B00F8W9SWQ", "context": "Is the LED dimmable?", "response": "It can be turned OFF, but no, it can't be dimmed"}
{"product_id": "B0017HLYNC", "context": "does it work on windows 8?", "response": "Don't know.  I run Windows 7 now.  I could never finish Syberia 1 but did finish Syberia 2, but I think then it was on my last computer XP. Sorry I cannot help any more than that."}
{"product_id": "B008NMPSEU", "context": "Can you list all the games in this software, please. Thank you so much in advance.", "response": "Sorry, I can't answer your question.  Would not install and so never played it.  Just wasted my money and my time.  Sorry I can't help."}
{"product_id": "B00ERDGMT4", "context": "Is an internet connection required to play this, and is it an open non-linear playing field? I have Skyrim GOTY and FalloutIII GOTY, love them both.", "response": "You don't need an internet connection to play it, and it's kinda open ended, it's linear in a Skyrim sense, but parts of the world can only be unlocked through story quests."}
{"product_id": "B00DH1KRQQ", "context": "does it comes with its own gamepad software?", "response": "I do not know. As I have a same gamepad long ago (which I bought with $4), the driver has already been installed to my PC. So I can use this one directly without installing the driver."}
{"product_id": "B00ENFVS5Y", "context": "Is there a version of this wheel to avoid?  I heard some of the earlier batches had problems.", "response": "The people having problems didnt take the time to update to the newest and correct firmware. Even the one I ordered had issues when I first tried it. After the update and applying the correct in game settings, everything worked perfectly and continues to this day. I hope this helps."}
{"product_id": "B00BI4VVGY", "context": "Are the blue LED's brighter than the picture, or are they really that dull blue?", "response": "i have no issue with this unit..love it actually, only con is usb needs to be connected to mother board."}
{"product_id": "B00AWEMODK", "context": "does it come with register code and buddy key? if so il buy", "response": "no.. it doesnt have buddy key. because this is digital its just for one user."}
{"product_id": "B0076HD2W8", "context": "Will this still work without a CD Drive?", "response": "Yes, if you have Internet you can search for the drive. Windows 7 had available drives ready but I had to select them manually (microsoft xbox360 controller adaptor)."}
{"product_id": "B003RS1A7Y", "context": "is it compatible with rocksmith guitar game for PS3 ?", "response": "Hi!  No, because Rocksmith converts the analog signals from an electric guitar with its special cable, and this guitar is basically sending a MIDI (digital) signal.  I hope that helps... I know I wanted to do the same, but ended up buying a nice Acoustic/Electric (Ovation) for Rocksmith."}
{"product_id": "B004L5SJ4Y", "context": "il2 cod-has force feedback? steam activation required with dvd version?", "response": "Hi, yes it has force feedback and you need Steam to activate. Make sure you go here for advice on setting up and getting the latest patches. http://theairtacticalassaultgroup.com/forum/showthread.php?t=5058&p;=52711"}
{"product_id": "B00BMFIXKQ", "context": "My son is 12 years old and really wants to get this game. Is this game appropriate for his age? Should I wait a year or two? What say you???", "response": "mybe you want to wait a year o two, is possible that your son don't like it, this game has  one o two strong language."}
{"product_id": "B007Y7OP8K", "context": "Does this work on American Windows 7?", "response": "No, sadly it doesn'tI have windows 7 and it didn't work on it"}
{"product_id": "B003ZJ1VD8", "context": "is this the blue LED Razer blackwidow?", "response": "No, this is the non backlit one. the blue razer icon is lit though"}
{"product_id": "B004J6KRD6", "context": "could i use the warranty if i take this to america latina?", "response": "I believe you could use the manufacturers warranty yes"}
{"product_id": "B000TK99PS", "context": "what games are on it", "response": "Hi and Happy Holidays!  There are a ton of games.  The regulars like sudoku, backgammon, checkers, chess, chinese checkers, battle ship, tile games, lots of word games, dominos, etc.  Just look at the list.  What makes it a lot of fun is the avatars that talk and make comments."}
