{"product_id": "B00EV4O7B4", "context": "is this include Pokemon x y", "response": "This does not come with the game its just the console that is X&Y; version"}
{"product_id": "B00HGAWFJG", "context": "Can you turn the light off? Or, does it turn off while in stand-by mode?", "response": "It turns off in standbye mode and I believe there is a swich I Sure I read that but dont take my word I don't own this idk why Amazon asked me to review lol"}
{"product_id": "B00GJXMRX0", "context": "hey does anybody know how to replay a video scene that was accidently skipped?", "response": "Look up the misson you were on on YouTube. Or watch a walk through on YouTube until you find the misson you were on."}
{"product_id": "B006W3ZXEW", "context": "This could potentially be a stupid question, but: Is this mouse good to play League of Legends with? :]", "response": "I'm using it play Leagues every day and it's worth buying. 6 buttons could be new for you but I think you'll get used to it. If you don't like the 6 buttons on the left so you should buy Razer deathadder"}
{"product_id": "B00BMFIXOW", "context": "Are there many sessions going on in MP in general? And how is the support? MP in the PS3 version is dismal at best.", "response": "Pretty much the same. I really don't think 3rd person mp can exist in an industry of fps shooters. If it was like gta's mp. I'm sure they'd be better off. Co-op would be a better choice. Mp matches in ac is dismal as well. Hopefully this answers your question"}
{"product_id": "B008M4BNQ6", "context": "can these be used on my pc to watch videos", "response": "Yes you may need an adapter to convert your your headphone/line out jack to the RCA connections for the headphones."}
{"product_id": "B00C2B355W", "context": "why is mine all crackly? do i need a new audio cord? 2.5mm to 3.5mm? Where do i get it?", "response": "It should of came with a 2.5 cord.  If you need a new one, you can order them right here on AmazonNaisa"}
{"product_id": "B00GJXMRX0", "context": "hey does anybody know how to replay a video scene that was accidently skipped?", "response": "Once you beat the game you'll be able to relay any mission you didn't fully complete. Once it's done you pick up wherever you were originally."}
{"product_id": "B008HPAXZ2", "context": "It's only one screed protector filter?", "response": "No , Two filters one for the top screen and one for the bottom ."}
{"product_id": "B00EPC3PY2", "context": "Will it work with a US playstation?  I've never bought a game that was rated by PEGI (usually ESRB) so I don't know if its a different region.", "response": "No it won't. This product is for Region 2 only. It's region locked for us here in the USA."}
{"product_id": "B00E1L78N6", "context": "does audio pass over usb on the xbox one?", "response": "It passes through the controller with the Xbox one adapter I will include it it comes with two audio cables"}
{"product_id": "B0094H8H7I", "context": "Can I use regular Genesis wired controllers with this system?", "response": "yes. However this does not mean it's compatible with everything, since the BatterUp controller will not work on it, nor the Konami Justifier gun for Lethal Enforcers 1 and 2 (it does acknowledge button presses, but it will not register any shots on the screen)."}
{"product_id": "B008X73CE8", "context": "will this run on windows 8.1?", "response": "I'm not sure. I use windows7.  However, you can go to subsim.com.  It is a forum for all kinds of subsim games.  I'm sure you'll be able to find the answer there along with tons of information about the game."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "if you do not update then you can play with no problem if you update it take time and no you not have to have wifi but you you need the internet to get updates"}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "This one works with the American games listed on the Action Replay website codejunkies.com. The only difference between this and the \"Pro\" one seems to be the packaging, according to the online forums I've read."}
{"product_id": "B0000CNUUP", "context": "Does this come in a bog box?", "response": "What is a bog box?  It doesn't come in any form of box. Downloaded it through steam"}
{"product_id": "B0009WPZOA", "context": "Is it okay for an eight year old? I worry about language.", "response": "do a search online for ratings on this game.  there are several sites that give ratings on content, positive or negative content, profanity, sex etc.  that will help you make more of an informed decision."}
{"product_id": "B00E1L786S", "context": "Anyone know if there's any issues using this with a PS4? I'm guessing probably not. It's just audio inputs, etc.", "response": "No issues at all. Works great I also have a PS4. Great sound ."}
{"product_id": "B00FJWNSU8", "context": "Does this have the TV show Green Arrow skin?", "response": "It a lot different superheros costumes"}
{"product_id": "B004RMK57U", "context": "how can i use ps plus memnbership from my ps3 to my ps4 system? can i use in my ps4 and delete from ps3?", "response": "I think once you log off your ps3 and log in to the ps4, you are good to use the subscription. I am not a hundred percent sure, but I know you cannot use them on both accounts at the same time."}
{"product_id": "B00F27JN8Q", "context": "Does Conception 2 work with PS Vita TV?", "response": "Games are region free but you need to update the vita itself before you get the games running. Do so in the settings somehow."}
{"product_id": "B00CY92XUA", "context": "Say i have borrowed the game from a friend and have already downloaded the 8 gb. Would i have to download it again if i bought it here??", "response": "Well if you bought it on the system you would not need to buy it. But.. If you downloaded it with a disc you need the copy of the multiplayer/story disc."}
{"product_id": "B0076DO5A0", "context": "Do I have to have Steam to play this game?", "response": "Yes, the game requires Steam to play."}
{"product_id": "B00CWFUHT0", "context": "What is included in the box?", "response": "The consule, controller which was white also, and the power cable. Also there is a home cable. It was used so when I got it there was dirt around some parts of the outside. It only took 5 Seconds to clean it off. But besides that the consule works perfectly and never overheated. So I recommend it. :)"}
{"product_id": "B006YDPU48", "context": "Does this game have an online co-op mode where you can play private with a friend?", "response": "Yes, but you need an item that's purchasable from a cat...it costs about 5000 souls, I believe.  And you both need to be part of the same covenant."}
{"product_id": "B00DNGQTFI", "context": "Is the offline mode single player only?  My son wants this game, but I'm pretty sure he will want me to play couch co-op with him if possible.", "response": "Sorry to say this, but Offline is in fact, single player only. You'll have to go to a friends house or set a LAN network (Have two Ps3's/Xbox's in the house and play online.)"}
{"product_id": "B008GEH8LQ", "context": "good afternoon .. have to change it to Spanish mode", "response": "En el menu primo escoja Configuracion de la consola/ entonce Otras opciones/ #4, el primero opcion es Idioma/ escoja la tercera linea- Espanol. From the main menu select System Settings/ Other Settings/ #4- Language/ the third line is Spanish."}
{"product_id": "B00EFFW0HC", "context": "does it still have bugs now", "response": "Not nearly as many bugs, but yes it still has issues (for example, graphics and audio loading issues when a multiplayer round is started). Still fun to play."}
{"product_id": "B00656HLGO", "context": "My 320 is showing up as an unformatted USB device. If I format it, does it just become 32gb max? Shouldn't it be formatted right already?", "response": "It might need formatting dependent on your version of the 360 dashboard. I think I did the same with mine and its never given me a problem."}
{"product_id": "B00I9UVY30", "context": "Can I play as the goalie?", "response": "I gave this as a gift.  I'm sorry I do not know."}
{"product_id": "B0006HHI3E", "context": "Can you run this game on Windows 7?", "response": "I am using Windows 7 Home Premium, and it ran perfectly when I tested it."}
{"product_id": "B00656HLGO", "context": "I keep reading reviews about not working with \"original title games\", what does that mean? If I don't have any games over 3 yrs old will this work?", "response": "I have had this for about 4  and never had an issue years i think and never had an issue with single game. I would say i have played a good 30 games on that hard drive with no issue."}
{"product_id": "B00CPKUV9I", "context": "Will this game work with a joystick?", "response": "If by joystick you mean the Xbox one controller, yes the game will work with it.  I use it myself."}
{"product_id": "B00A8HIGSS", "context": "will it play on sony ps3 north america?", "response": "Yes it will. English menu and subs to"}
{"product_id": "B003Q55Y5C", "context": "does it come with a steam key?", "response": "yes i believe all games does ."}
{"product_id": "B002I0IIPY", "context": "is this a two player game?", "response": "Yes it can be a 2 player game."}
{"product_id": "B001V9PTVE", "context": "Is this version of fallout censored?", "response": "The games overall are not censored. Although there is an option in the pause menu that allows you to turn off the gore/blood and guts when someone dies."}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "single with the pinky to make two stage."}
{"product_id": "B0086UK7I6", "context": "Why is the white mouse $20 more than the black mouse?", "response": "The black mouse might just have been on a specific sale. No difference. More of people's preference."}
{"product_id": "B00ESN8YGW", "context": "Region locked?? Is this game region locked or not? There seems to be conflicting info", "response": "In Ireland and it works fine."}
{"product_id": "B003S9WJ9A", "context": "I was told that you need a utility disk to make the transfer happen.  Does the cable come with the utility disk?", "response": "I never had to use a disk. You just plug it in an it will give you an option to transfer data to the new HDD under the memory section of your console settings."}
{"product_id": "B0040UAYI4", "context": "Can you play Destiny on this mouse and keyboard in PS3?", "response": "It works, but the aim assist gets in the way unfortunately.  If you could turn that off, I would start using it again."}
{"product_id": "B00D6PTMB4", "context": "Could someone suggest a good guitar to use this with? Something cheap yet not horrible and sold on Amazon? Thanks!", "response": "I bought a great Dean Vendetta XM for under $100. Plays easy, not fret buzz.Dean Vendetta XM Electric Guitar - Natural"}
{"product_id": "B009GWLSFY", "context": "There is no list of the games in the product details. Can you list them please?", "response": "YES I CAN. BUT IT MIGHT TAKE A DAY OR SO. IS THAT OK"}
{"product_id": "B00DCBDNW6", "context": "I've never played FF before it looks really good Is this the type of game i can just buy the newest 1 n jump right in or do i need to start with 1?", "response": "You can definitely just buy this one and jump in if you are looking for an online multi player game. If you start with 1 it is not online or multi player, it is just a solo game. It depends what you are looking for."}
{"product_id": "B0058GMO0A", "context": "Is it compatible with macs", "response": "I have a Hewlett Packard and do not know if it is compatible with \"macs.\"  I would assume so but I am no expert.Sorry but I just don't know."}
{"product_id": "B0088MVPFQ", "context": "what is the newest mario for the 3ds", "response": "The most newest game is Captain Toad: Treasure Tracker for the Wii U"}
{"product_id": "B006W41X1S", "context": "does the mic work good", "response": "Yes. My son loves it. If you ever have a problem contact turtle beach directly they have a great support system."}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "Not at all, and it's very useful for games where a certain button has a confusing placement on the keyboard and instead of having to move your hand across the keyboard you just need to click the third button."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "When you sign up for Amazon you have to inform your email . This email is used to send you the code. Once the payment is completed and processed you have the chance  to reveal the code beyond receiving it by email."}
{"product_id": "B00CD1FCAC", "context": "A key's light already went out after a month. Is this a normal problem or i there a way to get a new one from the warranty?", "response": "Some people have this problem.  Apparently it is due to electrostatic discharge.  Talk to Corsair and they can start the warranty process."}
{"product_id": "B000266786", "context": "is it    a c.d or        dvd", "response": "It is a CD. It must be run on a computer. It runs good on my laptop on Windows 7. You have to have the CD in to play though. It just installs an \"access\" program on the computer. My grandkids love it!"}
{"product_id": "B00475AYUA", "context": "I am buying for a Christmas gift.  Does it have to be downloaded when purchased or can I purchase now for my grandson to download after Christmas?", "response": "It had to be downloaded to whatever pc you are using. You can buy it now then access the person's computer and download from Amazon from there.  I have downloaded it to 2 different pc's no problem."}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "It isn't free-spin, and it does have tactile feedback of the scrolling. It's not as pronounced as some mice that have more of a ratcheting feel to them, but it should be fine for fps gaming. I use it that way myself."}
{"product_id": "B00EZAWV6W", "context": "So, is it possible to play against the computer only, or are you always playing against other people online? (I know nothing about shooter games)", "response": "Hi. You play only against human players."}
{"product_id": "B009LWQ0H0", "context": "Is it Mac compatible?", "response": "Yes the version I have has the Mac requirements listed on the slip."}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "No, only work on Wii U system"}
{"product_id": "B00EH5V1IO", "context": "Do these work with an XBOX 360?", "response": "I have no idea, because I do not own an XBOX 360 but would assume yes given that they are a gaming headset and plug in with no problems to everything else."}
{"product_id": "B0050SWBAE", "context": "My 5 year old loves the Pikmin mini game in Nintendoland do you think Pikmin 3 would be too advanced for her?", "response": "you'd be surprised at how fast they pick things up.. our almost 6 year old picks up the games quicker than me..  either way she'll grow into it..  who knows how much the game will be in a couple years if they don't produce more.."}
{"product_id": "B00IPTUJ8G", "context": "What was sacrificed to place this on the PS-Vita?-  Frame Rate-  Number of Co-op/Multi-Player Users at once-  Image Quality -  Load Timesetc", "response": "Load times are not bad.  Frame rate drops some.  I don't play multiplayer so I dont know if it reduces the number.   Its better on console, but all in all a very enjoyable vita game."}
{"product_id": "B007TMFD7C", "context": "hi. i have macbook air 2012. can i play this game well on my macbook?", "response": "i have an earlier macbook pro and play X-plane 10 on it.  I don't see any reason why not."}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "X-Box 360 is the correct answer, and is  no longer the newest system the \"X-Box ONE\" is the newest.  I asked to make sure."}
{"product_id": "B004C4U1VI", "context": "It seems like the other 1 in 1 PS2 component cables don't play PS1 games if hooked up to a HDTV.  So does this one do the job?", "response": "This one plays all my games on ps2. The ps1 games work on ps2"}
{"product_id": "B006IOAHPK", "context": "Has multilanguage? Thank u!", "response": "Yes it has multilanguage, but the audio is always english."}
{"product_id": "B00D96BNGM", "context": "IT WORK DOR PC", "response": "Yes it does if your PC's sound card has a digital output (toslink/optical) a line out analog output (RCA)."}
{"product_id": "B00FJWNSWQ", "context": "Are the new characters on a disc or as a digital code? TY.", "response": "The new characters are actually on the disc"}
{"product_id": "B008XHCLFO", "context": "Does this case also fit the Nintendo DSi XL? (not 3DSi)....for which there is no available case at the moment?", "response": "Unfortunately it cannot fit the DSi XL....sorry. Yes I do have the DSi XL and tried it but it didn't work :p"}
{"product_id": "B00I9UVY30", "context": "can you play with trinidad and tobago", "response": "yes, but I don't want to"}
{"product_id": "B000H1V56U", "context": "Does this work on the xbox 360 slim?", "response": "One of the blades wouldn't even work on my 360 no matter what I did and I ended up using the original fan instead. So I would say do not waste your time and money on it."}
{"product_id": "B004H7P0B6", "context": "How many grey caps come in the package?", "response": "There are 0 grey caps that come in the package. Its a Trick!"}
{"product_id": "B005J37I4Y", "context": "I HAVE XP400 IS THIS COMPATIBLE", "response": "My hubby loves it."}
{"product_id": "B003O6E986", "context": "Does this game have \"Open World\" where I can drive without being in a  race or being on a mission?", "response": "No, it doesnt. Its more of a racing simulator than an actual racer, like NFS or Burnout. I still recommend it, because it has a super realistic feel and the customization is actually pretty good."}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "If your Psn account belongs to US, you can use the code and the US Psn account without problems."}
{"product_id": "B00GU4F4OM", "context": "How loud is the sound when clicking? Right and Left, if there's a difference. Thanks,", "response": "In my experience I havent really noticed a real loud clicking at all. Seems real quiet to me, but then again thats just me."}
{"product_id": "B00F27JDY0", "context": "Can it Play North American game cartridges?", "response": "Yes! It's because all PS Vitas are not region locked. You can also use the NA PSN as well."}
{"product_id": "B00DOD0TZG", "context": "is this 1 code for all three games? or 3 separate codes for all 3 games?", "response": "It's three separate codes, one for each game."}
{"product_id": "B000096L71", "context": "What type accessories (yoke vs joystick, etc.) do people recommend?  Any recommendations on particular (older, cheaper) models of them?", "response": "I use a LOGITECH EXTREME PRO. It is a joystick that is around $30. Google it to see what it looks like. There are much better and more expensive yokes and joysticks out there, but if you are just starting out, this is a good one to use."}
{"product_id": "B000A2R54M", "context": "Does this game work with the dsi XML?", "response": "I don't know what XML is. I know it works on DSi."}
{"product_id": "B002DUCF8A", "context": "Is the flap control a 3-way rotating lever, or an up/middle/down switch? I currently use one of the levers from a throttle quadrant as a flap control.", "response": "The flap lever is a up/down switch. I also use a lever on the TQ to control the flaps. Either will wok though."}
{"product_id": "B00FLLFGO8", "context": "I have Sony Z3 since its a clip is it going to hit the power and volume buttons?", "response": "The clip will rest on top of the power and volume button however as long as there is no pressure on the clip, (pushing down on the clip) it should not interfere with the game play."}
{"product_id": "B00DB9JYFY", "context": "It states rated for M -- my son is 10 and loves that his friends play this game online with classmates -- how concerned should I be about the content?", "response": "I'm 18, and I've been playing this game for a while now. In my opinion it does not have really graphic content or strong obscene language, just a fun sci-if game."}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "Answers say ok for 13, why is it rated M? For few curse words?"}
{"product_id": "B00FATRKWM", "context": "Is the controller included ?", "response": "Yes, just one controller."}
{"product_id": "B005BLAJRC", "context": "Does it work on Mac os x maverick?", "response": "I don't see Maverick listed."}
{"product_id": "B00ATHFLZS", "context": "Does it bring an installation cd? I bought one but the box was lost the mouse freeze and I am not able to select dpi options. Thks in advance", "response": "This is probably because the shotty wiring in the mouse and it not fully connecting. You can file a complaint and easily get another one. Unfortunately no matter what you do you won't be getting your money back though."}
{"product_id": "B00B5QLS4A", "context": "can I set the side buttons as keyboard keys? e.g. side button 1 is \" R \" , so if I press that, I can reload in games", "response": "Yes, yes you can."}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "Yes, actually i use it with windows 7 64bits , buuuuut, you have to download the drivers from the web , windows doesn't recognize it automatically."}
{"product_id": "B001DPZE84", "context": "How come these are so expensive when you can get FSX Steam for $4.99 on Steam", "response": "Steam is dumbed down for non-advanced users.  You have the whole thing on your own system to tweek, etc. with this program."}
{"product_id": "B000PD0HQE", "context": "will this xbox 360 include all listed items?", "response": "Please read the seller notes to confirm what is included as each seller may provide a different bundle."}
{"product_id": "B00BQZ5EWW", "context": "are there black people?", "response": "Very few.  The Garamantia and Nasamones are two African tribes you can interact with as the Carthage Empire.  In the diplomatic screen, their leaders are black.  I don't think you can play as those tribes, though."}
{"product_id": "B009O8HH3M", "context": "Is this compatible for xbox 360?", "response": "This particular one is for PC only. There is a Turtle Beach headset for Xbox that works great."}
{"product_id": "B00EOI2MRS", "context": "Does it work on a Mac?  Please no guess or opinions.  A feedback from someone that's using it on a mac would be appreciated.  Thanks", "response": "It only works with the PS3, so no it does not work on a MAC."}
{"product_id": "B009Q8PP16", "context": "Will this work for TitanFall?", "response": "I Really Dont Know Because I dont Own Titanfall yet."}
{"product_id": "B007OVHW90", "context": "Are the end connectors 2.5 mm or 3.5 mm?  My son's X31 uses 2.5 mm and a white talkback cable.  Newer X31 models appear to be 3.5mm.", "response": "They seem to be  2.5 mm"}
{"product_id": "B00EWEHI5K", "context": "Are the side buttons easily pressed accidentally? Is the feel of those buttons \"clicky\" or \"mushy\"?", "response": "Clicky. All the buttons are hard plastic, so you can feel and hear when you press something."}
{"product_id": "B00FZ12F34", "context": "Will these work on a Wii U console?", "response": "Yes, all figures can be used in Wii U, if you have the Wii U Infinity Base."}
{"product_id": "B000HZFCT2", "context": "how many controllers work at a time", "response": "The Xbox 360 Wireless Gaming Receiver for Windows lets you connect up to four wireless headsets and four wireless controllers to a computer running Microsoft Windows XP with Service Pack (SP2) or a later version of Windows."}
{"product_id": "B00GJ2HZ7E", "context": "Is there gamepad support?", "response": "Yes, there is for most of the games.And the others can be played with a gamepad with software like Xpadder."}
{"product_id": "B008MI7MWQ", "context": "Can you list all the games in this pack? Thank you in advance.", "response": "Other than those listed in WJ Barnel's answer, also has Stonehenge, Triple Stars, Double Diamond, Lucky Lines, Triple Double 7's Red Hot. Think that all, wouldn't work on my computer also, so not sure. Son and daughter use it on their laptops."}
{"product_id": "B00F27JE1C", "context": "Is this package with Japanese?", "response": "The packaging and instructions and stuff actually comes in multiple languages (Japanese and English). That being said, it's still an import, so be aware that your X and O buttons are going to be swapped when on the main menu."}
{"product_id": "B00D96BMV8", "context": "How good is the headset adapter? Is it the official xbox headset adapter or Turtle Beach's version?", "response": "Yeah it's a Xbox adapter not turtle beach"}
{"product_id": "B0098W4ZD4", "context": "Is the Precision Aim Mode button programmable, or can it only be used to drop the DPI?", "response": "My son says it is really just to drop the DPI. Hope this helps."}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "Yes, it works fine with the ps vita slim in the US."}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3?", "response": "I don't know. But for the ps4 it's awsome"}
{"product_id": "B006W41X36", "context": "What is the difference between the DSS2 and the DSS1?", "response": "Both products process Dolby Digital 5.1/7.1 surround-sound audio through a digital optical connection. The original DSS has variable bass boost. The DSS2 replaces the variable bass boost with a fixed (on/off) bass boost, adjustable surround-sound angle presets, and includes an auxiliary analog audio input in additional to the main analog audio input."}
{"product_id": "B006IOAHPK", "context": "Any different if i buy a used or new one?", "response": "No and yes..No because it's same game . yes because  you know when something  is new  when  used  it can be buyers  beware."}
{"product_id": "B00562O78S", "context": "normal tv functions? for example, can i also have my xbox360/wii hooked up to this?", "response": "This past year at college the cable just came out the wall with a coaxial cable. Not everyone uses hdmi for cable tv."}
{"product_id": "B000ZHMRTA", "context": "do you have to hook this up to our tv?", "response": "I played it on my laptop.  Use whatever scdreen you want.  What matters is the unit that plays the program."}
{"product_id": "B00CPS59CE", "context": "I have a feeling its a really dumb question to ask, but does it come in the original box of the headset or another box? Im just kinda curious", "response": "Ours was not. It was in a company refurbished box."}
{"product_id": "B005J37I4Y", "context": "Has anyone got this to work with the Turtle Beach PX4?", "response": "It's a Bluetooth transmitter. YES, it will work!"}
{"product_id": "B00E1L78N6", "context": "I use the Xbox One to watch TV, when I use the TV app does it play through the headsets?", "response": "I haven't tried this but it should.  If you have a receiver that controls audio, make sure you mute the receiver so that audio does not go out both sources."}
{"product_id": "B004GINKNQ", "context": "Will it be compatible with the 360 slim, i got one once but it crashed.", "response": "Yes I believe it will"}
{"product_id": "B005MQ3BSK", "context": "Does it work on Windows 64bit?", "response": "Yes - I'm running it with 64 bit Windows 7 Professional"}
{"product_id": "B009CL6LA6", "context": "is this rely worth the money to buy it, when i can get similar quality for cheaper?", "response": "Idk what head set you are looking at but the head set lasted me 2 years until I broke it and it gave me little to no problems. So I think it is  worth it."}
{"product_id": "B00BU3ZLJQ", "context": "can this game and others be played without signing up for xbox live?", "response": "Yes. I didn't want my 8 year old on X box live. So far it hasn't effected any of our games."}
{"product_id": "B000TK99PS", "context": "what games are on it", "response": "Backgammon battling ships, bump em, checkers, Chinese checkers, chest, dominos, crazy contraptions, tile games, master match, maximum pool, maze racer, maze Raider, parchisi, panic, placer racer, raise, Reversi, rummy squares, rUnes of Avalon, solitaire arcade, star collector, sodoku, time breaker, word games, yacht, and zilch."}
{"product_id": "B0097CUREG", "context": "1. The coins i had one day was not there the next. Anything i can do to keep my last pay balance. Then how do i get more coins from the \"bank\"", "response": "I have never had that problem. Maybe it was a fluke on that one program one time. I suggest if it continues you contact the tech dept. of the publisher. I have found most tech support departments have a great public relations record."}
{"product_id": "B00BU3ZLJQ", "context": "is it the full version with redstone?", "response": "Yes it has redstone it is the full version"}
{"product_id": "B0002EAA36", "context": "Is it usable in the left hsnd?", "response": "Unfortunately no the controller is designed for the right hand only."}
{"product_id": "B0017HLYNC", "context": "Does this game work with Windows seven or just XP?", "response": "yes works on XP"}
{"product_id": "B00F27JDUY", "context": "So i can game online and there will no prob considering it from japan?", "response": "It shouldn't be a problem gaming online. Its a region free device."}
{"product_id": "B004GINKNQ", "context": "How do I install the 60gb hard disk drive for Xbox 360?:", "response": "It's for the slim model with is common nowadays and there is a panel on the right side when it's laying on its side. You should be able to find a video on YouTube also you'll have to go to storage and format it in settings/storage"}
{"product_id": "B003O6CBIG", "context": "Hello, can anyone please tell me if I can play as Michael Myers in this COD? or is it only the ps4 version? Thank You!", "response": "There is one map, Fog, on the first DLC map pack that you can, if you complete a field order, play as Michael Myers on PS3."}
{"product_id": "B00F47ZNP6", "context": "the mouse pointer wont move even though it says the drivers were installed. is there a way to fix this issue?", "response": "Restart your computer. Use ctrl+alt+del If you don't have a mouse that does work. Do any lights turn on on the mouse? It should be a plug and play, if it doesn't work it must be a bad mouse. Get a new one."}
{"product_id": "B00F27JN8Q", "context": "can you put ps vita cartridges in it?", "response": "Yes you can however there is an compatibility list. Not every game on ps vita will function correctly right now."}
{"product_id": "B00B312UDU", "context": "is the mouse a silent click mouse ?", "response": "User, says pretty quiet..."}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "It's a good 5-6 ft I would guess. I did not measure it but it's about my height in length."}
{"product_id": "B002DUCF8A", "context": "Does this require a driver download for Windows 8.1?", "response": "This is a good Question. Mine is running (or was running because they broke into my place and stole my setup) in Windows 7. However, knowing SAITEK they will have drivers for you if they are required. Sorry I can be of more help. (Paul)"}
{"product_id": "B001AWBYRA", "context": "does the pc version have the zombie levels? thanks", "response": "Treyarch studio head Mark Lamia almost canceled Call of Duty: World at War's zombie mode, ... allowed fans to discover it and share it and \"make it their own.\""}
{"product_id": "B002CJ8Z04", "context": "Does it come with a Gameboy Advance Cartridge, and a DS Cartridge? Or just a Gameboy?", "response": "if you order a gameboy cartridge like this game it will be able to work on the ds gameboy slot they are the same"}
{"product_id": "B004S5PBM0", "context": "Can you use a hollow body electric/ electric acoustic?", "response": "Any guitar, or bass, that will plug in can be used."}
{"product_id": "B0098F1Y3K", "context": "will this game run on Nintendo DS XL?", "response": "3DS games will only work on 3DS gaming system.  You can play nintendo ds games on a 3DS gaming system but the way the game cartridge for the 3ds is shaped it won't fit into a ds gaming system.  Sorry."}
{"product_id": "B0065NP6NC", "context": "Do i need a Microsoft HDD to install this or can I install to the flash drives I use for extra storage?", "response": "Yes, you can install just about any Xbox 360 stuff on a flash drive which has been formatted for the Xbox 360.  I had to perform a manual update to my console because I can't connect to the Internet, so I downloaded the console update to my flash drive and installed it manually.  Flash drives are awesome!"}
{"product_id": "B00BTOAFXS", "context": "Will it make me have a faster trigger finger then now? People say I have a mod?", "response": "For me it made my trigger finger faster it just takes time  getting used to. Yes it's some what of a mod but the pro's  use them"}
{"product_id": "B004G5TUJM", "context": "How big is it?", "response": "the steering wheel is about 9\" in dia."}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes both offline and online"}
{"product_id": "B00BCEK2LU", "context": "I have an old G15 keyboard and love it, but the keys are way too loud and \"clacky\". Are he G510's keys loud or quiet?", "response": "No they are not."}
{"product_id": "B004J6KRD6", "context": "Will this work with the Playstation 4 without any sort of adapters?", "response": "Yes, I have used it with 3 racing games so far without any adapters."}
{"product_id": "B00BMFIXZG", "context": "I bought this game and I can not play , I get it already been registered before. I could say I go to play ?", "response": "You can play if you select play without connection, and then play single player. Try by this way."}
{"product_id": "B0065NP6NC", "context": "Is this version more, or less buggy then the regular edition? Less crash/freeze prone?", "response": "To some extent, yes. It is less buggy then the regular version."}
{"product_id": "B00C71034I", "context": "Is it free Roam?", "response": "Not so much, can see around in different rooms but not so freely as previous versions."}
{"product_id": "B0050SZE2G", "context": "is this a online game only or can be single played", "response": "It is not and \"Only\" online game.  You may play the single player missions and/or play online multiplayer games."}
{"product_id": "B00BGGIWZM", "context": "When you 1st get into town do they show how to play it, or you have to know it from the other games?", "response": "The tutorials will help you. Warning: the game does freeze occasionally."}
{"product_id": "B00E6OLJ88", "context": "Does this product work for any call of duty specificly for MW3?", "response": "Yes. I mainly use mine on MW3. Using the striker, pp90,g36c, and rsas works best with my experience."}
{"product_id": "B000B6MLPU", "context": "the cable does not seem to fit into the x box anywhere.  Do I have the wrong cable? Or is there somewhere it should connect?", "response": "should be in the back near the HDMI input"}
{"product_id": "B00DC7O77A", "context": "does this work on the Wii????", "response": "No. Only for the Wii U"}
{"product_id": "B001UIG6M2", "context": "will this device work on ps2 model number SCPH - 77004?", "response": "I don't think it matters which model number the PS2 is.I have heard that it does better on the old PS2 \"fat\".I've had both the newer slim and the older fat consoles, and I like the older PS2 'fat\" better."}
{"product_id": "B003RS1A7Y", "context": "Does this guitar work with Rock Band 2 for PS3?", "response": "Is compatible with the beatles rock band?"}
{"product_id": "B004QRKWLA", "context": "Do I need to calibrate or download programs and are the programs included?", "response": "Good question.   No you do not.   While previous controllers came with installation disc, this one does not .   You plug it in and play no extras needed.   very user friendly."}
{"product_id": "B0017Q4DGI", "context": "CAn you use this game on the wii u?", "response": "Yes, we have the Wii u. I think you can use Wii games on the Wii U but not the other way around."}
{"product_id": "B0089OBLDO", "context": "can I connect 2 controllers simultaneously? (for instance connect a PS2 and Xbox 360 controller to a PS3)", "response": "yes you can play two 2 controllers at the same time."}
{"product_id": "B00IPTUJ8G", "context": "can you play this game on the vita and invite/join people playing this on the pc?", "response": "No, online play is with vita players only"}
{"product_id": "B00965WK8K", "context": "Is this mouse wired or wireless? I can't quite tell from the pictures.", "response": "It is wired but the cord is pretty long."}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine", "response": "My son has updated his Xbox and his game still works.  I think that you need to contact Xbox Customer Support."}
{"product_id": "B005D5M1P4", "context": "WoW Will these work(voice activated) with World Of Warcraft? And, if so---have they been \"tested\" with this game? What were the results?", "response": "Yes they work well on vent, and in game chat on both world of warcraft (aka wow) and EvE online (aka EVE). If your running win7 then run vent as admin."}
{"product_id": "B00FNKMVUO", "context": "can you program this for things like Adobe Photoshop editing steps? thanks.", "response": "Yes but you cant change 1 through 12 so really its more for gaming but it works the same as all mouse all but for he extra buttons"}
{"product_id": "B00EOI2MRS", "context": "Does this work with the God of War Saga games? I can't press the buttons fast enough and want to play the games.", "response": "The turbo feature would most certainly help with that."}
{"product_id": "B00AXI9WFS", "context": "Which system is the best to play infinity on ?", "response": "Xbox 360 is great and I've had no problems with it �"}
{"product_id": "B004NRN5EO", "context": "Does this come with the DLC?", "response": "The DLC must be bought in the PSN store."}
{"product_id": "B002DUCF8A", "context": "Can this panel work with X-Plane 10?", "response": "I've seen it working with X-plane but I haven't tried it myself."}
{"product_id": "B00BHSTXV6", "context": "How is the size compared to say a logictech G15? i like the larger surface area of keys instead of having them crammed together will this be similar?", "response": "\"This is great for gaming. \"- my nephew.  I had Logitech gaming keyboards myself and this one seems bigger and better built."}
{"product_id": "B005LUUWL6", "context": "does this work for 3ds xl for cheat code?", "response": "These do not work for 3DS games, only DS games. The action replay software is compatible with a 3DS XL though, if you want to play normal DS games with your 3DS."}
{"product_id": "B0002L88HE", "context": "Can I play this on a new system with my sister windows 8?", "response": "I was unable to plsy on Windows 7"}
{"product_id": "B002YVD3KM", "context": "Does this work on a Mac?", "response": "Judging by the product description, no. Both the title and product specifications say it is for Windows computers."}
{"product_id": "B00A8HIGSS", "context": "is this a physical copy or is a box with the code inside, i hope its physical?", "response": "It is a physical copy with a disk coming in it (a code is also included at the back cover of the game cover, although I'm not sure whether it has expired yet)."}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "Yes it does obviously but no 3D effect"}
{"product_id": "B00FB45YFQ", "context": "How well do these work with placing calls on an iphone?  For example, is there crosstalk?  Is the mic clear and does it pick up background noise?", "response": "It works well with iPhone and no crosstalk, background noise is ok as well. The Only problem is it's weird to use it for phone calls."}
{"product_id": "B0089NVTDM", "context": "Does this have Steam support? Like, would I be able to play most games with this?", "response": "I use it for Dolphin for emulating and it works great.  Havent used it for any steam games yet i will have to test it.  But Like Fig Martin said it does act as a normal controller, so I would assume it works."}
{"product_id": "B007Y7OP8K", "context": "Does this work on American Windows 7?", "response": "Yes, it does. I installed it on my laptop which runs windows 7 and it works fine. Also if it doesn't for some reason I think you can have the game run under a older operating system emulator on your computer by right clicking the game desktop icon/as a reinstall option. Hope this helps it's a very fun game."}
{"product_id": "B00IVHQ0KI", "context": "Has anyone had any problems with the gas pedal? Ours is not responding. Any tips? I am about to return it. So frustrating.", "response": "Having problems with the gas pedal as well. If it doesn't start working as advertised, Im sending it back."}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "I downloaded it through Steam and it works just fine with Windows 8.1."}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "I don't know. I have windows 8.2"}
{"product_id": "B004J6KRD6", "context": "is it better than t300rs ?", "response": "hello dan  i dont no about the t300rs i have the t500rs  i like it a lot  check out the  fanatec  go to fanatec.com and check out vesaro.com let me no if you like them"}
{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "Yeah, how I played my copy."}
{"product_id": "B009AFLXZM", "context": "I know that the box says \"no,\" but will this mic work with the wii (as in not the wii u)?", "response": "Gave as a gift-will have to ask"}
{"product_id": "B002B9XB0E", "context": "Has anybody tried this with an emulator on Android?", "response": "I am currently using it on a Matricom G-Box Midnight edition, which looks like a Apple tv box and runs a Android Jelly Bean O/S."}
{"product_id": "B00DCBDNW6", "context": "Do you have to buy a subscription to play this game?", "response": "After the 30day free trial yes."}
{"product_id": "B00EEMLRTS", "context": "Does this include a code to download the ghost camo? Thanks", "response": "yes it does but the code may be outdated by now"}
{"product_id": "B00DCBDNW6", "context": "If I own the pc version, and decide to buy the ps4 version can I still play my with same account from the pc version?", "response": "As far as I know you should be able to use same account"}
{"product_id": "B00DBDPOZ4", "context": "Can you use the cable to connect to a windows PC?", "response": "No, you cannot.  It is just like the xbox 360 kit, you need a wired controller."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "madden 15 can two play against each other not online"}
{"product_id": "B00AYBKQRW", "context": "I have a LW1011ER (10,000 BTU) and I'm unsure if this remote is compatible. Can anyone confirm?", "response": "yes it will  thanks EF and Dime"}
{"product_id": "B00BZOBE78", "context": "Does the pc dvd work with a mac???", "response": "There is an option for Mac. But it is download only. Hope this helps."}
{"product_id": "B00AK4QB22", "context": "Do I have to have X Box live for this game?", "response": "Not unless you wanted to play online!"}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "not at all, just new to have it there"}
{"product_id": "B006IOAHPK", "context": "Has multilanguage? Thank u!", "response": "I don't believe so, my copy does not have any indication that it is multilingual. sorry I couldn't be more help."}
{"product_id": "B001DNGCN2", "context": "does this fan fit the 60 gig ps3 or the 40 gig ?", "response": "Yes it should fit both. The fan is a USB fan, just plug it in and attach the hooks on the fan to your ventilation port on the back of the system."}
{"product_id": "B0091WIOJ2", "context": "these headphones work with ps3", "response": "They shure do! They work with xbox one and 360 ps4 and ps3. MAC, WindowsNote: for xbox one and ps4 you need to buy the headset adapter seperatly"}
{"product_id": "B007JM8ULS", "context": "Will I be able to play my original xbox games on my 360 slim with kinect with this hard drive plugged in?", "response": "Yes it's the real deal"}
