{"product_id": "B009RXUNGM", "context": "Would you need to have the USB hooked in for them to work on iPads and such?", "response": "No you wouldn't. It works as a gaming headset and regular pair of headphones the wires disconnect from the mix amp piece."}
{"product_id": "B005EOOT90", "context": "can theses be used on a pc", "response": "You can, but I would not recommend it. I got a pair today and, while you can hear, it is poor quality sound. Almost like they are forcing Mono audio or something."}
{"product_id": "B00DRKJBC8", "context": "is this a game download or a streaming game? I have never bought a game from amazon before Just wondering", "response": "This is a streaming game.  My icon links to the internet to play... Not really what I wanted, but the game plays excellently.  I hope that helps."}
{"product_id": "B000TLU67W", "context": "can it play the ps1 games like the ps2 original did?", "response": "Yes ma'am. I had no problem playing any of my couple dozen PS1 games on this version of the PS2. However, you will need PS1 memory cards, not PS2 memory cards, to save your PS1 game."}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "There are three profiles but I cannot get them to work in World of Warcraft.  I followed the instructions but it didn't work for me.  It's possible I did it incorrectly though."}
{"product_id": "B00286BZ4Y", "context": "can it be used on a regular pc", "response": "Yes, I play on my PC"}
{"product_id": "B008GEH8LQ", "context": "Can you watch videos on this?", "response": "I know for a fact that you can watch youtube videos on it"}
{"product_id": "B00BM7NXMW", "context": "The scroll wheel won't scroll back, is there any way to fix that?", "response": "I suggest you e-mail Perixx to see if they give you a new mouse or maybe it's time for a new one"}
{"product_id": "B00EZPCX1A", "context": "This system does play the regulards and 3ds games right?", "response": "Yes every single one, including e-shop and DS and DSi games."}
{"product_id": "B000P46NMA", "context": "I bought AC2. My friend now says I \"Have\" to play 1 to get the entire storyline understood? Without spoiling it, should I really start from the first?", "response": "No you do not, it plays the same.  To understand the story then yes but we played them out of order and enjoyed them all very much."}
{"product_id": "B006IR6NH8", "context": "Can I be able to attach this to my G27, I know that the buttons wont work, but is it attachable?", "response": "I dont understand why you would want to do that.....but I believe your answer is no."}
{"product_id": "B0073J8BYS", "context": "Does this work for the playstation 4 as well?", "response": "Yes, there are Move compatible games for PS4, just not as many for PS3."}
{"product_id": "B00H3VJYD8", "context": "will this work on windows XP? i am wanting a contorller for astronat simulatior.", "response": "It could if you customize it but I had a very hard time doing that. In the end I just gave up on this product."}
{"product_id": "B002I0HJG8", "context": "Is the mount Account wide or does it bind to only 1 char?", "response": "It is account wide."}
{"product_id": "B002I0JJ2U", "context": "does this game still work and can you play it on windows", "response": "No, servers are completely down. It's realm reborn or nothing but i gave in and gave it another chance. Did not disappoint."}
{"product_id": "B000B78F72", "context": "I'm looking for simple games such as Number 10, Coppermine, Buffalo Bill.Does this or any other software have these?", "response": "Number 10 and Buffalo Bill are on my version.  No Coppermine by that name."}
{"product_id": "B001CXYMFS", "context": "Does the stick have twist motion for yaw?", "response": "Yes and yes. The Joystick twists AND the throttle has a rocker bar (you can't see in this photo) for rudder control on the back. Both snap back to default when not actually twisting/rocking."}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "It has female USB 2.0 Micro-B receptacle. You will need male USB 2.0 (not 3.0) Micro-B plug."}
{"product_id": "B007LQG9A6", "context": "does it word with dell", "response": "This is junk and a waste of money. Spend the extra and get a real xbox controller. And yes, that will work with any windows OS."}
{"product_id": "B008B3AVPC", "context": "Is this really worth it? I heard this was the second worst CoD out there! And should I just get the Standard Edition or with 1st DLC collection?", "response": "The game is a really great game. I plan to purchase COD Modern Warfare Black Ops I & II and then Ghosts. Enjoy!"}
{"product_id": "B007SO6USW", "context": "does it come with a battery pack for the controller?", "response": "It does not come with a battery pack. It does come with a short USB cord that you can connect to your PS3 or computer for charging of the controllers. As long as the controller has the connection jack on it, you can plug it in to the charger."}
{"product_id": "B00292OW1U", "context": "What are the overall dimensions ?", "response": "It might be about 2 inches  wider than normal, I would say its not much bigger than a normal keyboard."}
{"product_id": "B003O6C0V4", "context": "I just got mine today in the mail and the leg sensor WILL NOT SYNC AT ALL!! I used 10 different batteries, and stood there for 30 minutes pressing the", "response": "Bummer :( I hope you return it and get another one, for I really believe this workout game helped me with my strength training and helped me get through some of the tough obstacles that I just competed in at Warrior Dash and I am only working out at the easy level."}
{"product_id": "B00B1N07QM", "context": "I am looking to hook my computer up to my TV and play on the couch with a lap desk. Will a keypad enable me to do that without needing a keyboard?", "response": "If you were just playing video games it would work fine though the cable isn't really that long so that would be something to look at. It won't fully have the full functionality of a keyboard or replace it but it works perfectly for gaming."}
{"product_id": "B004AM5RAW", "context": "Does it get hot? With the way it's shaped it seems like it would get a little hot...", "response": "No, it does not get hot. I have never had it overheat or even get warm to the touch."}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "The wheel clicks surely and precisely, without feeling clunky. Just the right amount of tension between wheel clicks."}
{"product_id": "B00HFZ5KCG", "context": "Does the product come with charger and usb cable? Along with the games in a separate package?", "response": "Mine came with a charger and a case with the screen protector on it"}
{"product_id": "B008SBZD9G", "context": "So I heard spam bots and farming bots rip this game to shreds, not a very wise purchase wouldn't you agree?", "response": "when I played up until a month ago there were hardly any gold spammers left and never really heard about bots."}
{"product_id": "B0096L2SJ0", "context": "where are the games stored", "response": "Games are stored on your phone.  The controller has no flash memory."}
{"product_id": "B000I10PY2", "context": "Can the ds lite play any ds game (excluding ones for later models)?", "response": "It can play the older games"}
{"product_id": "B007W8S2MG", "context": "In terms of the story line, will everything still make sense if I haven't played Persona 1, 2, or 3?", "response": "Persona 3 and 4 take place in different areas of Japan and are based in the same universe. But in answer to your question yes it will, the story is unique to this game, but the Persona 4 Arena games expand on this story and include characters from the third game."}
{"product_id": "B00EM5UFF4", "context": "Two Xbox live accounts needed to split screen for two players for online gameplay?", "response": "Yes you do need 2 Xbox live account's to do split screen"}
{"product_id": "B00DCDZM2I", "context": "is this compatible with xbox 360?", "response": "No, this version is for the Xbox One console. They do make one for the Xbox 360 though and in order to play Skylanders Swap Force on the Xbox 360, you would just need to purchase the Xbox 360 version. :) it is a great game, my 4 yr old son loves it!"}
{"product_id": "B001DPZE84", "context": "will this program work on Windows 8.1?", "response": "it should. The game worked pretty well on my windows 8."}
{"product_id": "B002YVD3KM", "context": "Just received it.  Nestopia is recognizing it is plugged in, but there's no gaming response to any of the buttons.  What am I doing wrong?  Win7, hp", "response": "You may have to map the buttons inside the settings panel.  For example, once you get to the menu, if you click on the left arrow with your mouse, you press left on your nes pad, this will map just the left stick."}
{"product_id": "B0036WTVNG", "context": "I got one.......says to put in disc but it did not come with one.", "response": "Ours did not come with one either. It also didn't work  we sent it back. You should also."}
{"product_id": "B00EF1OGOG", "context": "should I get this or the anker astro 9000 2nd gen. all I want it to do is recharge my device at school or on the go. I have a samsung s2. 2-3 charges", "response": "If you have the money, buy two .... leave one charging always at home and the other to take with you. Perfect situation. Awesome product"}
{"product_id": "B00919RM1Q", "context": "Can this verison be used on Windows8?", "response": "yes it works great & was easy to install"}
{"product_id": "B00EZKNSTQ", "context": "does it come with a cord", "response": "Yes, it is a wired controller"}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "You must buy a disk for Playstation or download on Playstation to play the game. Better yet call PlaystationI'm sure they will answers all your questions."}
{"product_id": "B00FENJVOE", "context": "Do I need an original diablo 3 before I installed this expansion?", "response": "Yes like all blizz games"}
{"product_id": "B008J16AP6", "context": "Is this a multiplayer?", "response": "Not that I know of"}
{"product_id": "B0033WFJFS", "context": "how do I get the instructions to use this control", "response": "My instructions came inside the box. Also I live with a brother that knows how to set one up... Sorry I couldn't be more help."}
{"product_id": "B00BMFIXZG", "context": "is this a steam activation code or uplay?", "response": "The DVD says Uplay:)"}
{"product_id": "B00576U8CC", "context": "Does this game force you into PvP scenarios, or are you mainly fighting WITH or AROUND other players, but AGAINST AI enemies?", "response": "this game does not force pvp you have to manually ativate the pvp missions"}
{"product_id": "B00F27JGVA", "context": "is it a good idea to format the mamory card 64 gb when you get it new?", "response": "Format or not it only lets you use 60gb"}
{"product_id": "B003Y5AHPG", "context": "Where are the L & R buttons on the controller?", "response": "Mine never worked so I can not answer the question"}
{"product_id": "B007XVTR3K", "context": "does it have offline multiplayer", "response": "Yes, you can play 2-4 player split screen off line."}
{"product_id": "B00DHF39KS", "context": "Sorry, first game I buy for PS4, is this the digital download or physical version of the game?", "response": "This is the physical version of the game."}
{"product_id": "B0011E4J7O", "context": "can you use it on a black xbox 360", "response": "Yeah, works fine on mine"}
{"product_id": "B002LMX5ZW", "context": "Does the game fill the screen?  The version by another maker that I have does not. My resolution is 1366X758 on a lap top.", "response": "Yes it fills all of the screen. It's a great game, you'll love to play it."}
{"product_id": "B0072HYRNK", "context": "What is bulk packaging?", "response": "The bulk packaging is the official Sony packaging that was sealed by Sony."}
{"product_id": "B000VRCNLG", "context": "will this game work on Windows 7 64bit?", "response": "would not  download  on my windows 7  64 bit-but get a second opion"}
{"product_id": "B00ERDGMSA", "context": "Does this come with all the DLC if you buy the Game of the Year Edition of Borderlands for Xbox 360 or PC?", "response": "no it doesn't come with all the DLC you still have to buy some and the skins have to be purchased seperatly as well."}
{"product_id": "B009AFLXZM", "context": "Trying to use this on wii u with dance party 2014 and it doesn't seem to work?  Is there a setup of any kind?", "response": "Wish I could help, my son used the mic for sing party and just dance. We haven't had any set up issues. Are u sure u can use it for that disc/ game ?"}
{"product_id": "B003XNU1JQ", "context": "Do these codes actually work?", "response": "Can i download this on to my Wii U?"}
{"product_id": "B0088MVQIM", "context": "Could one plug in an electric cello or violin and learn them or is it just strictly for the bass and guitar?", "response": "just guitar and bass, i see no option for cello or violin"}
{"product_id": "B00FC1UH82", "context": "Is the default gate for the stick square or octagonal?", "response": "Square, though I imagine you could mod it to have an octagonal gate without too much fuss."}
{"product_id": "B00HHAIY72", "context": "does this stick come with a cd at all and is this batter then hotas warhog.", "response": "If you have internet, there is no reason for it to come with a CD; instructions tell you where to download the updated drivers.As to better than the Warthog, probably not, but it's nearly $300 less expensive, so..."}
{"product_id": "B009SJR28W", "context": "What do the LED lights C, 1 and S represent?", "response": "C stands for Caps. 1 stands for Numlock. S is for scroll lock."}
{"product_id": "B00GV0LR64", "context": "Is this safe to use on plasma TV ?", "response": "I use it on my plasma TV without any problems.  As long as it's sticking to something like a glass surface, you won't run into any issues."}
{"product_id": "B005BLAJRC", "context": "will this game work on windows 8?", "response": "Yes. I use Windows 8 and have no problems at all. Enjoy."}
{"product_id": "B004S5PBM0", "context": "Does this include the real tone cable?", "response": "No!!  No cable in the one we received!!"}
{"product_id": "B001AWBYRA", "context": "Does this have single player mode ?", "response": "Yes, its the full game"}
{"product_id": "B00ENFVJJO", "context": "How do you know when it's done charging is there like some light or something", "response": "yes, it will show you in light in the controller. when its full charged, the light will disappear from controller."}
{"product_id": "B00DPJBTM6", "context": "Does it work on the ps4?", "response": "Yes, works good on the ps4"}
{"product_id": "B00JM3R6M6", "context": "will this work on 2ds?", "response": "yes 3ds games can successfully be played on a 2ds but not a ds or a dsi those can not fit in the game slot thing"}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "This is what it reads on the adapter's label:INPUT: 100-240VAC50/60Hz 0.4A MaxOUTPUT: 5.0v =-= 2000mA"}
{"product_id": "B007VFHIHA", "context": "what is this code guys? can i or not play this game on my windows 7 desktop", "response": "The code is to use the game on a steam account.  I believe steam is free to downlaod.  Got this for my son."}
{"product_id": "B003ESDQW4", "context": "I'm wondering about the T rating... what about this game makes it worth a \"T\"- considering it for an 8 yr old", "response": "Some mild language, suggestive themes, and (as with most superhero games) violence. If you need help in understanding game ratings, visit ESRB.org."}
{"product_id": "B006W41X36", "context": "does it work with ps3", "response": "Yes it does it work really good with ps3 I love it"}
{"product_id": "B004RMK5QG", "context": "Hi guys, I'm from Bolivia, I created a US account in my PS4, I don't have a credit card from US, only from Bolivia, will this work for me?", "response": "no idea, i would send a message to psn."}
{"product_id": "B00BMFIXOW", "context": "Could I free roam this open world map? Like for ex: Skyrim. Or is this a sand box map, ex: Dishonored?Thank you", "response": "Yes you can free roam the world like skyrim."}
{"product_id": "B00DVEJA7G", "context": "I have a Sony non Bluetooth CD player and I was going to order a Bluetooth transmitter for it. Will these headphones pickup from that transmitter?", "response": "I'm not sure about that sorry"}
{"product_id": "B008X73CE8", "context": "What is the difference between SH4 and SH4 gold edition?", "response": "Pretty simple.  The Gold edition includes the expansion, which is several more mission.  I got mine during the winter sale, so the price difference was small to none.  Great game though."}
{"product_id": "B003Q55Y5C", "context": "does it come with a steam key?", "response": "The version I purchased, did not. You can purchase it through steam, however I liked having the discs and if memory serves, it was less expensive from Amazon. I do have it listed in my steam library and can boot from steam that way."}
{"product_id": "B00D4WTO1M", "context": "How long is the campaign?", "response": "15 or 16 hours?????? i beat it in 5, like every other COD game. even on the hardest setting."}
{"product_id": "B00BDX1M00", "context": "i just got mine and im not to sure that im happy with it. i don't think it is charging and the users manual isn't exactly to clear. PLEASE CONTACT ME", "response": "My son will contact u when he gets home from the football game."}
{"product_id": "B00CD1FCAC", "context": "So I've noticed that, despite the good quality build, the LED's fail rather quickly for such an expensive keyboard. Has anyone NOT experienced this?", "response": "I've had mine for 3 months and haven't seen any problem with the LEDs"}
{"product_id": "B00FATRKOK", "context": "My son wants an xbox. What do I need to buy him so he can play online with his friends? Does this bundle come with all he needs to get started? Fees?", "response": "This bundle has everything he needs to play the system. You will still need an Xbox Live card in order to play online which is $60 a year. If you have a High Definition TV you will also need to buy an HDMI cord in order to play at the highest definition."}
{"product_id": "B00I4C2EKA", "context": "It says it uses steam for DRM so I cannot play this on the MAC? even though I have steam on my mac?", "response": "I think steam is just terrible if I were you I just wouldn't use steam, I had problems of my own getting the game to run on the version it was meant for sorry dude I just complained to amazon and got a refund"}
{"product_id": "B00G21VQ2M", "context": "Is there an english version?", "response": "There is not unfortunatley. But there is talk about a possible english version being released Fall 2014."}
{"product_id": "B002BSA298", "context": "Is this compatible with windows 7?", "response": "They have working models for windows \"Not sure were to buy them\" but this model is for all the 360 models."}
{"product_id": "B00ENFVS5Y", "context": "Can you buy the power cable separately, as I've lost mine. Or is it a proprietary connector, which I need to buy one direct from thrustmasters", "response": "you'll most likely have to get it directly from Thrustmaster since the connector setup looks like it is specific to their product."}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "No, the scroll wheel locks and the scroll is quite tight. I use the scroll wheel as an additional button because it won't inadvertently scroll or move around. It is sturdy."}
{"product_id": "B006W41X36", "context": "does it work with xbox one?", "response": "Works perfectly. Just needs an optical connection and USB power and your on."}
{"product_id": "B00GOOSORM", "context": "Is pc game time and ps4 game time on the same account?", "response": "Yup, you can pretty much switch freely between the two versions. I say pretty much because it may ask you to verify that you are indeed the same person. After you do it's smooth sailing! Enjoy your time in Eorzea, and if you happen to join Leviathan server maybe I'll see you on your adventures!"}
{"product_id": "B00CMQTVUA", "context": "Does the xbox one only support hdmi?", "response": "Yes only hdmi and you need a tv with 720p or 1080p resolution"}
{"product_id": "B005LUUWL6", "context": "Does it work on Pokemon ORAS", "response": "No. For that you will need to purchase the powersaves 3DS"}
{"product_id": "B00DGZDFO4", "context": "not opening and im trying to get help but NOBODY is helping me..I have windows 8????", "response": "The downloaded version didn't work for me either. I copied the game key from amazon into steam and I downloaded it that way.You can download steam here: http://store.steampowered.com/"}
{"product_id": "B00BCEK2LA", "context": "Is there warranty if you buy it from Amazon? Tried to get my G400 replaced but because the order was fulfilled by CT-X (through amazon) they declined.", "response": "Logitech is awesome with customer support, i would contact them directly"}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "Hi, yes :)Under the name of the game, on the top of the page -> \"DRM: Steam DRM\""}
{"product_id": "B003Q55Y5C", "context": "Will this run on Windows XP SP3?", "response": "The box states that the minimum system requirements are Windows XP, Windows Vista or Windows 7.  Intel Pentium Core 2 Duo 2.4 GHz or AMD Athlon X2 2.8GHz.  I hope this helps."}
{"product_id": "B001GIOGBY", "context": "Has anyone tried it with Windows 8? Does it work like in Windows 7?", "response": "Yes it works perfectly. I've used it with flight simulator X and have had no problems. If you do happen to have any issues just calibrate the joystick when you plug it in, and that's it. I'm not sure how it compares to Windows 7 because I didn't use FSX with that operating system."}
{"product_id": "B008MI7MWQ", "context": "why wont it download to my computer", "response": "Are you still having trouble? Please let me know.-Jason Carver Volunteer Forums Moderator for Encore / Hoyle Games http://forums.encoreusa.comhttp://forums.hoylegaming.comOfficial Technical Support can be found at http://support.encore.com"}
{"product_id": "B00BGGIWZM", "context": "Do you need sims 3 to play expansion packs", "response": "Yes. However, be wary of Island Paradise. It freezes often and you have to reset the Sim every time."}
{"product_id": "B003VUNWG0", "context": "Will it actually work with Windows 7 now?", "response": "i can not say for sure."}
{"product_id": "B0057WDBHA", "context": "does it have L1 and L2 buttons? the picture doesnt show any", "response": "it does, but they are located right above the joystick. That is probably the only inconvenient thing about this stick,although i dont really use them,since i mainly play fighting games that use six buttons or less. This is the perfect stick for anyone transitioning from a regular PS3 controller. Highly recommended."}
{"product_id": "B006POYBUA", "context": "Does it works with the white Xbox 360 (non slim)?", "response": "Yes.  Thats what i have and its worked fine so far"}
{"product_id": "B00E88G054", "context": "How is the packaging? does it come in the original box and would it look presentable as a gift?", "response": "Packaging is very good. I received mine in original packaging and the box is presentable as a gift. Be forewarned, the text is in Chinese."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "The box says it works on; Windows 8 64-bit."}
{"product_id": "B00F27JE1C", "context": "can u play with friends", "response": "Yup!Depending on the game,  you can play with friends in the same room or you can play online"}
{"product_id": "B002L93F0A", "context": "Do you get two controllers from this order or one?", "response": "TWO, yes...two controllers for the price of one. It's a great deal."}
{"product_id": "B004X56PWK", "context": "Will this game work with Playstation 4?", "response": "I am sorry I am not sure I now playstaion 2 games will not play on 3 sorry I could not help u."}
{"product_id": "B002DUCF8A", "context": "I have a Cessna trim wheel for pitch control -- will the trim wheel on this panel conflict with its operation?  And if so, what's the recommended workaround? Thanks!", "response": "I doubt there will be conflict between the two. I once had two controls for the flaps, one on the panel, one on the throttle quadrant. You'd just have two controls for one thing. Plus in Flight Sim it splits the different controllers into categories, so it may do that for your wheel."}
{"product_id": "B00BDX1M00", "context": "i just got mine and im not to sure that im happy with it. i don't think it is charging and the users manual isn't exactly to clear. PLEASE CONTACT ME", "response": "Dont use them until fully charged"}
{"product_id": "B0057WDBHA", "context": "is it wireless or wired?", "response": "Wired. On top of that, I would never advise buying a wireless stick. A few ms of input lag is enough to lose you the match or miss a confirm in a game."}
{"product_id": "B004N7IIQ4", "context": "Is the headset over-the-ear or on-the-ear?", "response": "The headset is on the ear."}
{"product_id": "B00D6PTMSW", "context": "Can I use the front USB ports for the cables?", "response": "My daughter says yes, thats what she uses :)"}
{"product_id": "B005764CWO", "context": "Hello, does this controller have sixaxis support?", "response": "Not sure, but it broke after a week"}
{"product_id": "B00EF1OGOG", "context": "what is the size of the unit? length and width?", "response": "3.7 x 1.8 x 1 inches"}
{"product_id": "B00BGAA3S2", "context": "does this have motion gaming like the kinect", "response": "Yeah but limited, playstation doesnt really focus gaming around camera compared to xbox"}
{"product_id": "B00IVJ1M7M", "context": "does the 3ds action replay work on games downloaded onto the system? or do you have to have the game card for the game?", "response": "It only works when you have the game card."}
{"product_id": "B00HVBPRUO", "context": "Has anyone tried it on the xbox?", "response": "no , it does NOT work with xbox !  I've tried it !"}
{"product_id": "B000PD0HQE", "context": "what games will this xbox 360 come with?", "response": "It includes NO games...its just a system only. You have to remember to read each individual sellers used description!"}
{"product_id": "B000OYMYZQ", "context": "How long is the cord?", "response": "About 5 or 6 feet long. Not long enough to reach the couch here, so the one time we've actually ever needed it I sat in a desk chair for a bit while I played."}
{"product_id": "B004RMK4BC", "context": "does it work for Mexican accounts?", "response": "Hablas español? Si tu cuenta es Mexicana en cualquier tienda departamental o en los 7/11 venden las Mexicanas. Estas son para cuentas de Estados Unidos"}
{"product_id": "B009DL2TBA", "context": "Is compatible with move?", "response": "can i play the ps and ps2 games on this ps3 please help i want to know it before i buy it."}
{"product_id": "B00726ARTE", "context": "is this 4 xbox 360 or ps", "response": "It's more for tablet or ipod, it has a 3.5mm jack, it will work with an xbox 360 if you get an adapter"}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "Will defiantly work with ED"}
{"product_id": "B00GV0LR64", "context": "whats the difference b/w this and me using a red dry erase marker?", "response": "It's alot easier to see in the dark both for quick sighting and spraying with accuracy in a dark building or room. It gives you that extra edge if you need to even the odds alittle."}
{"product_id": "B00EHBKUTE", "context": "I am purchasing equipment for an Oculus Rift that will be released next year. Does this work well for first person games? I know only WASD.", "response": "It works well for those and at least 15 other keys as well and can be configured for individual games.  It quickly becomes second nature and saves time looking away from the screen for the correct key."}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "Speaking as somebody who doesn't have Xbox Live, you don't need it to play the single player portion, which was the only part I cared about. Hope this helps!"}
{"product_id": "B000I10PY2", "context": "Does this feature a gba compatable link cable port?", "response": "Yes but the system itself isn't worth it, there's a screw missing so the screen doesn't stay up while you try and play it"}
{"product_id": "B00I9UVY7G", "context": "My grandson sent me a text which said, here is a gift idea for Xmas for him, 2014 FIFA World Cup for xbox 360. Is this the game EA Sports 2014 FIFA?", "response": "No! there are 2 different games!  He told you about brazil world cup game ( 2014 fifa World Cup )"}
{"product_id": "B001BYMZ5W", "context": "Is there an inline mute for the mic?", "response": "No, there are no inline controls."}
{"product_id": "B00DGZDFLW", "context": "Is this game independent of Steam?", "response": "No. It is ran through Steam."}
{"product_id": "B009ZDPYKO", "context": "Does this giant work on the wii?", "response": "Been told that it will."}
{"product_id": "B00FJWNSWQ", "context": "is this worth 20 bucks??", "response": "Absolutely!! The game versus mode alone is worth the $20.. There is an original story mode also! It plays identical to Mortal Combat, it is made by the same developers after all!"}
{"product_id": "B00B5QLS4A", "context": "This mouse is 100Hz or 1000Hz? Just wondering if it was a typo or not.", "response": "It can be adjusted up to 1000Hz, at least from my understanding and what my searches have turned up."}
{"product_id": "B005CELN8W", "context": "I'm Looking For Life Of Luxury made by WMS , is it available on PC or Mac ? Thanks you", "response": "Found it available to play online at http://www.wmsgamingslots.com/"}
{"product_id": "B003O6CB6S", "context": "Does the multiplayer include xbox and playstation players?", "response": "no.  and the PC multiplayer community is very very small.  the only games i was able to get into was either team deathmatch or kill confirmed.  everything else had almost no one playing and could never get into a game.  if you are buying this for multiplayer...id pass."}
{"product_id": "B00EOUL7T0", "context": "Will this work with a Universal Afterglow headset", "response": "I have bought it for my Tritton 720 it worked great and now I own a afterglow I think It will work in my opinion"}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "yes, I suggest you keep on the wrist because it makes typing more comfortable. :D"}
{"product_id": "B00FLLFGO8", "context": "Works to place tablet 8.3 inch LG G PAD?", "response": "At first I thought no, but it actually telescopes out enough for my google nexus 7. It still had about an inch more of telescoping it could do"}
{"product_id": "B002LARYGA", "context": "Will it work with comcast xfinity cable box?", "response": "From Blu-LinkSadly, The X-Finity cable box series uses an IR bandwidth that operates outside the range of the Blu-Link IR range. It is not compatible with the X-Finity and another previous series of cable boxes, also distributed by Comcast. Sorry.Ody ZabalaCustomer Support AdministratorSMK-Link Electronics Corporation"}
{"product_id": "B001BYMZ5W", "context": "this or beyerdynamic dt 880? why?", "response": "The DT 880 doesn't have a mic, so if you have a decent external one, you should be covered. But personally I always prefer a full set. Their prices are almost the same, so I think you should go with gaming, IF you will use it as gaming headset."}
{"product_id": "B004IK24MU", "context": "Does it work with control with silicon case??", "response": "No, you will have to remove the silicone case to charge."}
{"product_id": "B00B98HBTA", "context": "how many players can play at once?", "response": "Two players at the same time"}
{"product_id": "B00F68LBE0", "context": "How long is the included cable?", "response": "Like 8 ft or a little higher, but the controller is wireless"}
{"product_id": "B000KMCF0G", "context": "Just to clarify, this IS  just a cd-rom game, right? You just pop it in the drive and play?", "response": "That is coorrect. D"}
{"product_id": "B00CH923NE", "context": "Is this game better than Mario and Luigi 'Bowser's Inside Story'?", "response": "I don't personally think so.  It seems the newer the Mario Luigi game, the easier and more chalk full of instructions it is.  It's still a decent game but tedious at times."}
{"product_id": "B009D3HSTG", "context": "When I connect the controller to my PC it installs the driver but it wont recognize it in the game controller menu. Please help.", "response": "Some of ours that we bought don't work either. I think they are just cheaply made :/"}
{"product_id": "B003ZSN600", "context": "Is the end cable USB or do i need a USB dongle for PC use?", "response": "It ends on an USB :)  ready for your pc"}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "It plugs into the controller."}
{"product_id": "B00AIALGZK", "context": "is this download the full game or a free trial", "response": "The download I purchased was a full game.  It's a fun game."}
{"product_id": "B00E88G054", "context": "Wired or Wireless? (one star reviews say they recieved wireless instead of the wired version)", "response": "The is the wired one. Search the same product name just wireless where it says wired."}
{"product_id": "B002J9GDXI", "context": "Does this mouse work with Win 8? Having trouble programming G400 buttons?", "response": "Basic functions work but i have not attempted to install the gaming software for it or program buttons."}
{"product_id": "B001444IN6", "context": "will this run on windows 8", "response": "It does not work well on Windows 8."}
{"product_id": "B00BQMGW4Y", "context": "How long is the cord, and does it have an extenion to the cord to plug into xbox? & What is the warrenty?", "response": "at least five feet maybe 5.5ft. with no extension.  mine has no warrenty"}
{"product_id": "B00DE2W33I", "context": "How many controllers does the console come with?", "response": "One. I had to buy a second."}
{"product_id": "B000QJ1NS8", "context": "Does this come with the tri point screw driver? I ordered one that came w/ a Philips that doesn't fit.", "response": "When I purchased my replacement battery, it came with a yellow screwdriver that fit perfectly."}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "No individual key colors. The entire keyboard board changes color"}
{"product_id": "B000VRCNLG", "context": "Q: Is this program compatible with Windows 8?", "response": "I would imagine it does. As I have used it with Windows NT4.0/Xp/Vista/and Windows 7.I have a Sidewinder II,and it works with all programs as such as it is supposed to."}
{"product_id": "B0000C7GHG", "context": "How long is the controller cord? Also, doesn't the PS2 make noise?", "response": "The cord is about 4 feet long. A new PS2 should not make noise however a used one may make some noise."}
{"product_id": "B003ZSN600", "context": "Does this work with the Skyrim Legendary PC game?", "response": "I have windows 7 and it's plug and play yes."}
{"product_id": "B001L5TIR4", "context": "Can I download this to my ipad?", "response": "There should be a compatible version - the version I have was downloaded to my laptop."}
{"product_id": "B00F27JDUY", "context": "can i change the full internal language to english?", "response": "Of course! I know the whole \"japan import\" throws people off but yeah, it's like setting up a brand new Vita. The only difference in the vita is the \"O\" is used for Enter. Meaning that normal when you wanna press X for yes It's O instead if that makes sense? Hope I'm so what of a help"}
{"product_id": "B00EI4V3FU", "context": "Can you hear game sound through this headset, or do I still have to have my TV volume turned up?", "response": "You still have to turn up the TV."}
{"product_id": "B00BQWTGIS", "context": "will the game be installed on steam or at least will you be allowed you to play without the disc ?", "response": "You don't need the disk.. and its u play instead of steam! You install it with the disk and after you should not need the disk."}
{"product_id": "B00008J7NZ", "context": "Will it work with out x box live?", "response": "Yes.  No Problem"}
{"product_id": "B00E8JZILA", "context": "If I buy this game I need to buy the chapters also or no", "response": "no it already comes with all the chapters of season one plus the 400 Days DLC(special episode)"}
{"product_id": "B0047ERZ7Q", "context": "dose it work with the pspvita", "response": "Sorry Mike, I do not have the Vita so I don't know the answer to your Question."}
{"product_id": "B007MM9E42", "context": "What ages can play this game?", "response": "Honestly, any age. Its a fun co-op game for anyone with a sense of humor. Me and my sister are in are early college days, yet we still played this game. Good story plot and fun animations."}
{"product_id": "B007A7K60A", "context": "Do you need Internet. Connection to play these games?", "response": "To be honest you shouldn't  ... but since I can't get it to play at all on my lap top I can't say more."}
{"product_id": "B00DOD0TZG", "context": "If I buy this will I be able to play the Mac versions of Infinite and Bioshock 1?", "response": "\"Platform : Windows Vista, Windows 7\" It does not list OSX."}
{"product_id": "B009RXUOD4", "context": "Will this headset's game and chat audio work with both next gen consoles? (Xbox One and PS4)", "response": "Hello David, Yes this headset works on PS4 And Xbox one Also the sound is Very Very Good.... Very good I headset I recommend it!!"}
{"product_id": "B00E88G054", "context": "Will this work on ubuntu?", "response": "This mouse works on all 3 of my computers that run Ubuntu.  The necessary drivers appear to be included in the Ubuntu install disc, as it worked when installing 14.04 on my laptop prior to connecting it to the internet."}
{"product_id": "B00H7KDNBO", "context": "What does buying instant access get you? like a code for origin?", "response": "Exactly. The game(on PC) is exclusively for the origin platform. It is a digital purchase either way, but it was cheaper to buy on amazon."}
{"product_id": "B00DBRM3G8", "context": "Can 1 player play this game?", "response": "Yes, one player can play this game. You can also \"switch\" between the basketball players by going to the menu section and scrolling to the Options tab at the top and choose for preferred player none. Hope this helps!"}
{"product_id": "B002LARYGA", "context": "Is this a line of sight remote or can the signal go thru a wall?", "response": "If you mean for the ps3 control then I'd figure within 20ft you'll be good. For the ps3 it works on Bluetooth. All the other things you control it would need a line of sight because it uses IR single not Bluetooth"}
{"product_id": "B00HWMP0TU", "context": "Labeled as COMPLETE ED., but does't have EXT. PACKS & DLC as box describes. What do you recommend?", "response": "It includes the expansion paks \"Gods & Kings\" and\"Brave New World\", which is the latest expansion pak. The DLC, if that's the version you bought, or the registration code, is on the back cover of the manual.  The Manual itself is incomplete, however, the expansion pak manuals are available as an PDF download."}
{"product_id": "B00562O8U0", "context": "what does sony ps3 games mean when they say 3d compatable", "response": "It means those games with 3d compatable can be played in 3d mode, where u would need the 3d glasses to see it displayed in 3d, but it also has the regular mode which is called 2d. So u should have the option to select 3d or 2d/regular on those types of ps3 games."}
{"product_id": "B004RMK4BC", "context": "How do I get my code", "response": "it is emailed to your amazon email"}
{"product_id": "B0072A4JVW", "context": "Does it come with l2/r2 buttons because I am trying to play ff8", "response": "It only comes with 1 pair of triger and theyre the size of the r2/l2 and semi curved like the xbox triggers"}
{"product_id": "B005UI8V6C", "context": "Do you need internet to download this game?", "response": "No, thankfully this game was made by people who understand how to distribute games.It comes as a CD but it will install #3 and you will have to choose to play in the #1 or #2 story lines."}
{"product_id": "B004N7HSGU", "context": "Are these capable of using USB for a PC hookup or are they the green/pink cables?", "response": "They are pretty much made for PC so yes."}
{"product_id": "B005J2LW6A", "context": "Does this game support English (Menu)?", "response": "It really doesn't, it will only show on the right of each selection whether it's online or offline mode, but you can google it. I've played it without knowing what it says, just mess with it to give you and idea of what each selection does."}
{"product_id": "B00CX8VY4S", "context": "I own the 360 version; is there any new material on the Xbox One version, or is it pretty the same except for improved graphics? Thanks!", "response": "It's pretty the same except for improved graphics"}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "Yes, you can play this game offline."}
{"product_id": "B00FQFFPZO", "context": "can you vary the number of laps in a race or does the game force you into 400 or 500 miles?", "response": "I can do one race then it freezes even when I splitscreen it freezes I cant race on vertain tracks either"}
{"product_id": "B00H72EMP8", "context": "can you hear your own voice with this headset?", "response": "No I don't think any of them do that, it would be distracting."}
{"product_id": "B002I0K6X6", "context": "Does the stick have a input for pressing in?", "response": "On yes it does"}
{"product_id": "B00EZKNT18", "context": "Will this work on a Windows PC or not?", "response": "I have windows 7 and it works perfectly with my computer"}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "Yes, and u can put subtitles if u want."}
{"product_id": "B00B23MO9Y", "context": "Hello, I ordered this game and when i tried registering for my playonline account it said the Registration code was invalid/used.", "response": "That is just the addd-on. You needed to get the original game that included the expansions. Now you have to buy disc with original game."}
{"product_id": "B00FNKMVUO", "context": "I'm sure this is dumb question but, does the mouse change colors?", "response": "You can change its color, however, it will merely 'pulse' with the color you select, not cycle or change."}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "Yes, It worked on my Dell XPS"}
{"product_id": "B0098F1Y3K", "context": "Is it possible to turn off the demon head?", "response": "I haven't tried. Very evil if you ask me. I know you can fast forward through the speeches if you press and hold the stylus to the bottom screen when he is speaking."}
{"product_id": "B00000K4MC", "context": "Will this game work on a windows 7 laptop?", "response": "I have a Windows 7 laptop and it works :]"}
