{"product_id": "B00BCEK2LA", "context": "Is there warranty if you buy it from Amazon? Tried to get my G400 replaced but because the order was fulfilled by CT-X (through amazon) they declined.", "response": "did you received a receipt with the purpose? if amazon or CT-X still declined the replacement, contact the manufacture \"Logitech\". go to http://www.logitech.com and click on the contact us link. just make sure you got the original purchase receipt."}
{"product_id": "B00EFFW0HC", "context": "How do you get the Premium for Battlefield 4? Can you purchase the code on Live?", "response": "Yes. You can unlock in game."}
{"product_id": "B008GEH9HO", "context": "can you use old games that were purchased for a DS and a DSi?", "response": "I'm not sure, I haven't tried any. But the Nintendo 3DS wiki probably has the info you're looking for."}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "Yes it does. Nicely actually."}
{"product_id": "B008OQTUKS", "context": "If I buy the disk can I download the game from there or do i have to use the disk every time I want to play the game?", "response": "Download the game from disc and go. Disc doesn't have to be in computer to use."}
{"product_id": "B00EFFW0HC", "context": "Can you turn off the lights in a building so enemy's cant see anything?", "response": "No I don't think so. But there are switches that can stop vehicles from entering a certain area. You can also have a flashlight on your gun which can blond enemy's. This feature can be toggle on or off. Hope this help"}
{"product_id": "B007SRM5U6", "context": "Is internet connection required to play this game?", "response": "No only for download content :-)"}
{"product_id": "B00EW6QT76", "context": "Does this include Playstation Plus?", "response": "no. just an extra controller."}
{"product_id": "B00EZPCWWA", "context": "Can the 2DS take a beating? How durable is it exactly?", "response": "I drop it all on the time,face first even,and there still isn't any indication of damage or wear."}
{"product_id": "B00DC7O3K6", "context": "will this game work with a normal wii, or only wii u?", "response": "Only with Wii U"}
{"product_id": "B00EI4V3FU", "context": "Does this plug into the system? or does it plug into the controller?", "response": "It has a 3.5mm jack into the controller, really freakin' short too."}
{"product_id": "B00E88G054", "context": "Does anyone know if this will work with Windows 8?", "response": "This works perfectly windows 8"}
{"product_id": "B006LVZEN0", "context": "Are the measurements listed for the mouse or mouse package?", "response": "Measurements are listed on the package holding the mouse, however the mouse is fully customizable."}
{"product_id": "B003VH5Z2C", "context": "Can you use original NES controllers?", "response": "Yes you can use original nes controllers and I highly recommend those instead of what comes with the retrobit if you have kids. For some reason my kids have tore up 4 retrobit controllers! But the nes ones have held up fantastic!"}
{"product_id": "B003O6N64Y", "context": "Is it possible for this headset to work on the Xbox One ?", "response": "It works great and No adapter needed!  Plug in the fiber optic audio cable to the unit,  turn on headset with power button,  double click the power button on headset until you hear \"X-Box Mode\" (two modes: PS and Xbox), after that your connected.  Enjoy!"}
{"product_id": "B00FB45YFQ", "context": "Will these work with a PS4? I am tired of this stringy little black wire that came with it. I need an upgrade, will these work?", "response": "Yes any 3.5mm headphones will work but i wouldnt recomend you buying these headphones just because they are to heavy and the top is made out of metal"}
{"product_id": "B0009VXBAQ", "context": "All I use it for is net flix.  What unit do you suggest?", "response": "Its definately the way to go. With the free internet and wifi capability its perfect for watching movies on the net whether it be netflix or others."}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "No. This headset requires a connection to your controller. The controller can be wireless though, so you won't have to run any cords across your living space to the Xbox itself."}
{"product_id": "B00DPJBTM6", "context": "Does it come with a docking station?", "response": "It does not include the little mixamp box with the volume knob on it. It has 2 3.5mm jacks, and the headset has its own port on the left ear cup bottom to connect a jack to."}
{"product_id": "B0036VO4XO", "context": "Can I connect a headset that only has one 3.5mm connection and be able to use both the headset and the mic? There is only one line from the headset.", "response": "Mine has two holes, one for a mic and one for the headset audio.  So I can connect a separate mic and a straight non-mic headset.  Or my headset with mic has two male plugs.  If you only have one hole it must be a different model."}
{"product_id": "B00AWEMODK", "context": "Just wondering, does this collection has separate registration codes for the different expansions or just one for the whole package?", "response": "It is one registration code to activate all expansion packs and add ons. It has a 2nd registration code to get 2 unique items in game to start."}
{"product_id": "B008WZRZJY", "context": "A great game, especially the graphics. Does anybody else have blurry pictures in the strategy guide?", "response": "No, my strategy guide does not have blurry pictures."}
{"product_id": "B00D96BO7K", "context": "can this be used wirelessly to watch movies from my xbox 360? thanks", "response": "No, this can't be used to watch movies wiht wireless from your xbox"}
{"product_id": "B00FC1UH82", "context": "Is it wireless? or you have to plug it via usb?", "response": "No, you need to plug it. The usb cable it's pretty long and it can be stored inside a compartment in the back of the stick."}
{"product_id": "B001AH8YSW", "context": "Is the \"Enhanced\" physical copy the same as the download \" Enhanced directors cut\" version?", "response": "No this not the directors cut version"}
{"product_id": "B00001IVRD", "context": "Does this game work on Windows 8?", "response": "I have windows 8.0/8.1 and I had no issues with it whatsoever. I upgraded to 8.1 little before I downloaded and played SC1-SCBW so I'd double check with a FAQ or something. But tbh I think you'll be fine."}
{"product_id": "B007TFOO6K", "context": "is this keyboard audible? like, can i hear the key when i type? (getting the cherry mx blue)", "response": "It is i would say. I got the red as well but you only hear a thump, while this has a mechanical metal like click. I wish I could compare it to my IBM m though side by side. Other than going unicomp, mx blue seem like the only alternative"}
{"product_id": "B0091WIOJ2", "context": "these headphones work with ps3", "response": "yes, I have them connected with the optical Toslink for game audio and I believe Bluetooth for chat."}
{"product_id": "B00F8W9SWQ", "context": "how many keys can you press simultaneously and have the correct response? I ask this specifically for gaming.", "response": "Can anyone help test it? To test the NKRO functionality, reply to this thread and do the following..1. Hold both shift buttons (left and right).2. While holding both Shift button, Type in the following sentence.. \"The quick brown fox jumps over the lazy dog\"Thank you for the help"}
{"product_id": "B002FY0CM0", "context": "Will this fit the Sega Genesis system model number MK-1631 9 pin?", "response": "Not sure.  It fit my Sega Genesis (model 1601)."}
{"product_id": "B005Q1YA5O", "context": "it says i need to intall the sims 3 platform or gateway before it can install someone please help", "response": "You need the sims 3 to play this... this is an expansion pack for the sims 3."}
{"product_id": "B00FLZ4FS2", "context": "I only have xbox 1 can I reedem in the computer in the xbox page and then download on xbox 1", "response": "Yes.you should be able."}
{"product_id": "B003NSLGW2", "context": "how many are there", "response": "four, two in black and two in blue."}
{"product_id": "B00B312UDU", "context": "Do the side buttons (page up/page down) work on mac?  My keyboard doesn't have page up/down keys?", "response": "no this did not work for me ether."}
{"product_id": "B00GLZQR96", "context": "Is there a monthly fee?", "response": "Yes the monthly fee is how the drop rate will slowly drain your soul"}
{"product_id": "B00EPZ8POY", "context": "is this like a story mode or it's your standard fighting game?", "response": "is a fighting game"}
{"product_id": "B00BMFIXT2", "context": "does it have any downloadable content?", "response": "Yes, according to my son !"}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "I'm not sure about hardware. I have heard that Windows 8 does not work well with Windows 8. I purchased a new computer last January and I removed 8 and installed 7. I've had no problems."}
{"product_id": "B00DPJBTM6", "context": "is the mic worse than average?", "response": "It's a really nice mic for a headset. There's a very slight hissing that I'm told only I notice (Because I'm listening for it), but otherwise it's super clear; Doesn't pick up sounds like my AC at all."}
{"product_id": "B003VANOFY", "context": "Is the wireless quality really \"Gaming grade\"? Can anyone compare to the wired version of the product? I have that one now.", "response": "I've personally tried every other Wireless headset that's out and this is by far the best in sound and range. As for wired headsets, definately beats or matches everything in it's price range.I'll admit though some of the higher end Turtle Beaches/Razer I've tried definitely beat it though."}
{"product_id": "B00AJXEYOG", "context": "What games are included on this program?", "response": "100 Ladies,Billy Goat Bucks,Blackbeard's Doubloons,Bean to be Wild,Bonus Bubbles,Cougarlicious,Crazy Chameleon,Diamond Jubilee,Frantic Antics,Miss Red,Whale Song,Wilde Red Sevens,Blue Blazes,Red White & Blue,Wolf Run 2.Most of the games are ones that you find in casinos.They are fun to play and have acheivements to try to get.Hope this helps.Sorry I took so long, I was on vacation."}
{"product_id": "B00EI4V3X2", "context": "Are these able to be connected to a PC with microphone and speaker functions?", "response": "I haven't used it with a PC, but they works fine with a smartphone like a bluetooth earphone......"}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "Yes, and also on Win 8.1"}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "Nope. I have, on several occasions, pre-ordered games from amazon and they never come on launch date. Best way for launch day is gamestop."}
{"product_id": "B00JM3R6M6", "context": "Is this game appropriate for an 11yr old girl?", "response": "Yeah, I guess so, great for all ages."}
{"product_id": "B008X73CE8", "context": "What is the difference between SH4 and SH4 gold edition?", "response": "The core application is for the U.S. subs in the pacific against the Japanese.  SH4 Gold includes all of the U-Boat missions that occurred in the Pacific.  So it is like two games in one."}
{"product_id": "B0010WS20W", "context": "Do you need an internet connection to play this game?", "response": "No and I highly recommend this game to improve your poker game! Can play more hands per hour than even online poker sites if you choose to skip all the AI reaction time or skip to next hand once you fold."}
{"product_id": "B002ZS6Y64", "context": "what can i do to make it work whith the xbox one ( i have the adapter too)", "response": "These are ps3 only"}
{"product_id": "B0095C0I4W", "context": "does this work on windows 8.1?", "response": "A few of the games might work if you are lucky. For the most part, no."}
{"product_id": "B00E6OLJ88", "context": "will this work for call of duty ghost", "response": "Yes it works really good"}
{"product_id": "B00D96BNGM", "context": "This or the Tangos?", "response": "Not sure about the Tangos, but I am INCREDIBLY satisfied with my Ghost Phantoms. The adjustment options make it easy to customize the headset to whatever I'm doing, and the Bluetooth syncs up with my phone so I can take calls while gaming"}
{"product_id": "B00BU3ZLJQ", "context": "can you install \"mods\" on the Xbox 360 version?", "response": "As my son has told me...yes, yes you can"}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "I'm Not sure its is a standard Micro USB port"}
{"product_id": "B0050SWBAE", "context": "can two people play this game?", "response": "For the main \"Story\" part of the game, it is a single player. That part is NOT co-op.  There are Missions and Bingo Battle that are two player. My husband and I are addicted to playing the Missions which are co-op and very fun."}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac OS Mavericks? If so, how smoothly?", "response": "It works great on Mavericks!"}
{"product_id": "B003Y5AHPG", "context": "Where are the L & R buttons on the controller?", "response": "The L & R buttons are mapped the the 2 face buttons farthest to the right on the controller.  It works, but it obviously feels better if you can just connect a SNES controller to the R3"}
{"product_id": "B0050SYDEQ", "context": "does this game have free roam?", "response": "It does have Free-Roam. The game itself is Free-Roam. You drive wherever you want whenever you want."}
{"product_id": "B00B98HBTA", "context": "does this have hawkeye", "response": "Yes this has Hawkeye as well as an superhero that has been an avenger plus tons of villains. 150 characters in all I think plus tons of vehicles"}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "No, it does not have onboard memory."}
{"product_id": "B0087ZMAUS", "context": "Are these open eared?  Will i be able to hear whats going on around me and myself talk? Thanks.", "response": "Yes they are open eared."}
{"product_id": "B000AOJ7FK", "context": "Does this actually work with Windows 7?  It says on the back of the disk case \"O.S. - Windows 98/2000/ME/XP.", "response": "Yes it does I currently play on Windows 7."}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "Can anybody tell me whether it is 250 GB or 500 GB ??"}
{"product_id": "B002QHDKE8", "context": "Is their a difference with skate 3 platinum hits and regular skate 3, besides the price?", "response": "There is no difference."}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "Yes it has the standard av cables"}
{"product_id": "B0050SYILE", "context": "Say i have borrowed the game from a friend and have already downloaded the 8 gb. Would i have to download it again if i bought it here??", "response": "There is 2 discs with the game. One is the install disc and the other disc you have to leave it in console when you play game. Did you load the install disc to your xbox?"}
{"product_id": "B00HWMP0OU", "context": "Do the characters speak their lines, or do you need to be able to read?", "response": "You need to be able to read"}
{"product_id": "B004N7HSGU", "context": "Would this work for the PS4?", "response": "Katelyn,It does work with the PlayStation 4. You just have to make sure in the settings at the home screen, you change the primary audio output from hdmi to optical output."}
{"product_id": "B003ZSP0WW", "context": "Will the play and charge kit work with this charger if I already have one?", "response": "I believe it will."}
{"product_id": "B005EQE0YM", "context": "Would this be a useful headset for other PC applications, specifically Skype?", "response": "but im not sure about skype. ive never done that."}
{"product_id": "B001444IN6", "context": "is this compatible to a windows 8.1", "response": "When first installing I had a bunch of force close issues, but I was able to make it work. If you're not set on sims 2 I would suggest 3 instead, which is made to run Windows 8.1"}
{"product_id": "B001CXYMFS", "context": "does the Thrustmaster T-Flight Hotas X Flight Stick by Thrustmaster work on all flight simulators games for macs", "response": "I can't answer that because I have only used it with X-plane on Mac."}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "It covers the camera and IR sensors. There was concern that the kinect could be activated remotely and view your residence."}
{"product_id": "B00ESN8YGW", "context": "Is there Polish language int his game?", "response": "Hi, I think ther is. I'm playingthis game in czech language."}
{"product_id": "B008NMPSEU", "context": "Can you list all the games in this software, please. Thank you so much in advance.", "response": "Off hand, No.  I can't list the games, however, there are quite a few games and it is extremely enjoyable.  You have to play to unlock future games.  When you gain enough points or charms, it allows you to open a new game.  You will like it."}
{"product_id": "B00A378L4C", "context": "are the leds very bright?", "response": "Their brightness can be adjusted, so they can be, but if you don't like them to be that harsh, they can be adjusted to be dimmer.  Hope this helps!"}
{"product_id": "B00EI4V3FU", "context": "Does this plug into the system? or does it plug into the controller?", "response": "It plugs into controller ."}
{"product_id": "B00BI83EVU", "context": "Does this game come with one of those activation code papers inside? I'm considering a used copy.", "response": "New copies come with activation papers on the inside cover of the game, I'm not sure if a used copy would have a code that has not been used"}
{"product_id": "B009DZTXR4", "context": "Does this game has two disks or codes for the DLCs?", "response": "Yes the game comes with a disc for dlc"}
{"product_id": "B00F4GSAYI", "context": "i now know that there is a separate disc for the dlcs, but do i need xbox live to download and play them?", "response": "Nope! Everything is on the disk. One of the great things about GotY games is they come packed with everything ready to go."}
{"product_id": "B00B98HBTA", "context": "does this have hawkeye", "response": "Yes hawkeye needs to  be unlocked"}
{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel click into place as you scroll, or does it roll too smoothly?", "response": "Is does have slight clicks but it is slight enough that I would still consider it to be smooth."}
{"product_id": "B00IIHU44E", "context": "Can I use my 360 controllers with the new system? Thanks!", "response": "sadly you can't. The Titanfall bundle only comes with one Xbox One controller, but currently that's all you'll need since there aren't too many multiplayer Xbox One games available yet. I ordered a second controller on Amazon for the future but still haven't needed to open it. Hope this helps"}
{"product_id": "B00HVYBWQO", "context": "Does this take the place of the mouse in controlling the OS and all apps, or only on the special apps that come with the Leap Motion device?", "response": "You CAN use the Leap Motion as a mouse but clicking and maneuvering is very tricky...You'll constantly find yourself performing actions you didnt mean to...in addition to being quite naccurate and insanely tiring to use."}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "mind did not be careful I had 3 months missing"}
{"product_id": "B008SBZF2Q", "context": "when playing swap force and the narrator says you need a giant to get into this.. are these the giants they are meaning?", "response": "Yes! There are 8 kinds of element giant skylander, you can use any one to explore a place or to break something where you find a giant icon.  And you may some bonus or some stuff.  Anyway you don't need to use giants still can finish the game (not completed), otherwise waste $$ on giants."}
{"product_id": "B00J6DLPLK", "context": "Japanese voice & English subtitles  Support?", "response": "You can only get the Japanese voice with the special edition."}
{"product_id": "B005CELN8W", "context": "So this game does not work on Windows 8, I presume?", "response": "Sorry, I don't know.  I refuse to upgrade to W8."}
{"product_id": "B00EPZ8POY", "context": "does work on any HDTV?", "response": "Yes, it has nothing to do with tv itself, it is more related to the console region, but this one is region free so will work on any ps3."}
{"product_id": "B00B5QLS4A", "context": "Is this mouse comfortable with large hands, i currently have a g600 and it just isn't comfortable for my meaty hands anymore....", "response": "I have large hands as well, and I have very few issues with the mouse. The buttons that are closer to the base of the thumb are difficult to use, but there are more than enough buttons elsewhere to compensate."}
{"product_id": "B0087OZ5FG", "context": "When using with a PC, are you still getting 7.1 Surround sound? Or is 7.1 only work with Playstation 3/4?", "response": "They arent true 7.1... It states virtual 7.1 stereo sound."}
{"product_id": "B008O510Y8", "context": "How long are the audio/mic jack wires?", "response": "They cord is quite long. I measured and it is approximately 9.5 feet long."}
{"product_id": "B000BAVN14", "context": "Which expansion packs does it include ? Does it have Apartment life ?", "response": "I don't believe it has apartment life, but I was sorely disappointed with my entire purchase of the expansion packet.  I could not register any of it because they were all used"}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "Yes, mines is hooked up to a Samsung Smart TV and it works fine."}
{"product_id": "B00H72EMP8", "context": "Can I connect these to my PS4 so I can use the inline controller?  It is a must-have for me to have a quick mute for my headset.", "response": "Hello, You can use the Inline cable as long as your TV has an audio output section on it which is attached to the inline. The PS4 itself does not have these connections so as long as you can connect to a RCA output via your TV you will be able to use the inline."}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "Yes, other than the color. It's the same as the black controller."}
{"product_id": "B00562O8U0", "context": "would they work with the sony VPL-HW40ES", "response": "They work GREAT with my VPL-HW40ES!"}
{"product_id": "B003VH5Z2C", "context": "does it work with a flat screen", "response": "As long as you have the rca or composite connections, yes"}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "It does, it opens up to 4-8 i believe. Its been awhile since i played but its also applies to each server so its not only limited to one."}
{"product_id": "B000087H7T", "context": "does this unit come with the charging cord? Im not seeing any infor about included with system or pics of any accessories.", "response": "No, I had to purchase one separately, but you can find one for only 4$"}
{"product_id": "B003O6N64Y", "context": "So if I plug the receiver in to my PS4, and then also plug the headset in to the controller will it play in game sound, and allow chat at the same tim", "response": "I have a ps3, but I only plug the receiver/transmitter into the console,  and the removable microphone into the headset. I don't ever have to plug the headset into the controller."}
{"product_id": "B00B3PDHBU", "context": "is this xbox one compatibility", "response": "I don't have Xbox one but from other answers I have got they all say yes"}
{"product_id": "B00009W5WB", "context": "Is  this the cable for older style S controller?", "response": "It fits all breakaway controlers for the classic Xbox.The Slim and Batboy included."}
{"product_id": "B005S0KH7I", "context": "Is this compatible with windows 8?", "response": "I'm not entirely sure, I have windows 7, try and look to see if there a forum for its compatibility"}
{"product_id": "B00F27JDY0", "context": "A friend of mine said that the materials used for the Japan version are \" less reliable\", is this true?", "response": "I work in a used electronics store, and the US vita feels the same as the Japanese version. I've personally tested 2 US Vita slims."}
{"product_id": "B00CD1FCAC", "context": "Is the USB on the back 2.0 or 3.0?", "response": "2.0 but i plugged it into 3.0 & it worked too."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "Yep it does w/ Netflix and amazon prime. It's the greatest!"}
{"product_id": "B0096L2SJ0", "context": "Will it work on emulated games?", "response": "I have only used Super GNES through the Google Play Store and it works great. I would make sure that the emulator application you are planning to use supports the Moga platform before you purchase it."}
{"product_id": "B000O5DY0E", "context": "how do u get these games to work on windows 7 ...", "response": "you must first turn off any virus protection, then you download using the autorun that should work"}
{"product_id": "B0050SVNP8", "context": "Can this work on a DSI.", "response": "Yes, that what my grandchild has."}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "Yes,  it is a query keyboard."}
{"product_id": "B001BZ2F56", "context": "Does this work with a new windows 8 computer? Would like to know before i buy it.", "response": "Yeah it works great on windows 8"}
{"product_id": "B00EADTVL2", "context": "do the lights turn off when no controller is attached, or are they constantly on when the unit is plugged into the wall?", "response": "Only when a controller is docked. Orange while charging and blue when complete."}
{"product_id": "B004RMK4BC", "context": "if i have a Mexico PSN acct . would there be a problem purchasing a USA PS Store card?", "response": "It's depend on the store if your store is USA than there's np"}
{"product_id": "B00DHF39KS", "context": "is their a monthly subscription needed for this game", "response": "no, its a single player only game. no online play, no subscription"}
{"product_id": "B00GJSUUC0", "context": "I heard there was a dog and the dog would allow you to throw it like a fighting star?", "response": "I don't think so....I haven't gotten far into the game yet but I haven't even seen any dogs."}
{"product_id": "B008KH7NZA", "context": "how to setup with pc? Is it simple or am I gonna need a bunch of cables?", "response": "I use it for ps3 and ps4 so I'm not completely sure. You may need a PC adapter to connect it. But there is a pair of these headphones that say it's for the PC on Tritton's website. I hope this helps!"}
{"product_id": "B002DUCF7Q", "context": "What Does This Do?", "response": "It is a fake radio panel to use with Microsoft flight simulator"}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "why would you even ask this? it's a \"retro\" version of an old school game gear. not everything needs facebook or wifi lol"}
{"product_id": "B00BGD6LMG", "context": "How many gigs is this game and can I install it to a flash drive?", "response": "its on 2 disks....you have to store the installation disk (disk 1) completely on the Hard Drive to play (you need atleast 5-7 GB of space). I would not recommend a flash drive."}
{"product_id": "B002QHDKE8", "context": "is the become a skate mogol mode only online or is it also available for single player?", "response": "I am not sure on this as it was a gift for my nieces son-"}
{"product_id": "B005CELN8W", "context": "I'm Looking For Life Of Luxury made by WMS , is it available on PC or Mac ? Thanks you", "response": "Hi Danny I have not seen any as of yet jeannie"}
{"product_id": "B00965WK8K", "context": "Is this mouse wired or wireless? I can't quite tell from the pictures.", "response": "It is wired. Definitely not wireless."}
{"product_id": "B001O3066U", "context": "Will this game work with Windows 8?", "response": "Yes, it works great.  No problem what so ever."}
{"product_id": "B004G5TUJM", "context": "does it work with midnight club", "response": "Yes it does i have la compleate edition and it works on there."}
{"product_id": "B00HGLLRV2", "context": "which is the best standard edition or limited edition?", "response": "Limited edition has a couple of bonus missions and a special cover on the box. It's probably not worth the extra money but if you can get it for the same price, go for the limited edition"}
{"product_id": "B00FZLE9JW", "context": "Will this hard drive work to play original games on my XBOX 360 Slim?", "response": "This hard drive is an expansion pack. If you have a 4g now you will have a 64g. It plays and stores any xbox 360 game you may gave or download."}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "plays on Linux if you want to get techical"}
{"product_id": "B000B78F72", "context": "Do you have to download this game to play or can you take the cd and use it on another computer?", "response": "Yes, you do have to download it to play, and yes you can use it on other computers. I hope this helps."}
{"product_id": "B00CD90R4K", "context": "- Does this game have multiplayer mode?", "response": "Yes it does. It has a numberof multiplayer options including co-op. It works very well."}
{"product_id": "B00EI4V3X2", "context": "Can you let ME know what kind of (Headset) I have by this Information here:**Model:TB300 3276-01(?) ;**FCC ID:X4B-TB2278(?) ;**S/N:G3276D3702106(?)", "response": "It's the Turtle Beach PX4. If it's wireless that will confirm it. Also if you have the accessories of the PX4"}
{"product_id": "B00DTWES6I", "context": "Is this a digital key for uplay?", "response": "Yep. And due to that I wouldn't waste your time on it. Uplay's online service is spotty at best, so unless you ONLY want to play Singleplayer, the game isn't worth it."}
{"product_id": "B004GINKNQ", "context": "can you use it on the xbox 360 E?", "response": "I bought it for my brother XBOX 360 slim.. didn't work"}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "It's a key. Just put it into steam and you're all set."}
{"product_id": "B0087OZ5FG", "context": "A)  Does software work with PS4.  (Lower Mic Volume normally)  B) How comforable are they?", "response": "B) after a week youll settle with comfort over mobility."}
{"product_id": "B003O6EDSM", "context": "Is this a hard copy, or just a psn download? I'd prefer to just have it as a hard copy instead of downloading a terrabyte!!", "response": "Don´t worry it's a hard copy of the game."}
{"product_id": "B003O6EDSM", "context": "how much space is required", "response": "5.3G minimum (for PlayStation 3)..but to be safe I would keep more than that free because it doesn't specify if that's for one game of the entire trilogy."}
{"product_id": "B000H1V56U", "context": "Does it work with the xbox 360E", "response": "I have an original xbox 360, so I cannot tell you for sure."}
{"product_id": "B00DBCAT3W", "context": "does this game have multiplayer mode?", "response": "No, unfortunately it only has single player."}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "Yes it's made to work on windows 7. I have not tried it on windows 8 but I am very sure that if it works on windows 7 it will work on 8. Both Windows have the same arquitecture only the GUI is different. Hope this helps"}
{"product_id": "B00519C7CE", "context": "Can a 12 year old boy play this game? And not have it to many curse words", "response": "Well COD: Black Ops has quite a lot of foul language and its based on the idea that at war people curse a lot."}
{"product_id": "B007JDMPOK", "context": "Does it actually come with the soundtrack? I've seen some unboxing videos where it doesn't come with the OST.", "response": "Yes it does.  Comes with a CD."}
{"product_id": "B00CQOG8MM", "context": "I've seen a disturbing amount of negative reviews for this. Is there any common denominator like older computers/operating systems...", "response": "I'm not sure but it works perfectly fine on my computer. I have a mac that isn't brand new but not super old."}
{"product_id": "B0050SVNP8", "context": "I wasn't able to play the first Pokemon B&W due to Nintendo cutting the wifi access, will this game spoil the experience of the first game?", "response": "You don't \"need\" the Wi-Fi features any more than you \"need\" to battle/trade with someone living in Japan. The core \"Gotta catch 'em all\" experience will remain intact, but the extras (competitive battling) will be missing."}
{"product_id": "B00FVQCFGA", "context": "hook this up via usb?", "response": "The drive is contained in an enclosure for internal installation only in the Xbox. There is no USB interface available. I suppose if required you could remove it from the enclosure and use a USB to SATA adapter, but not sure why you would want to. This device is made specifically to fit inside the Xbox."}
{"product_id": "B0050SY4DG", "context": "The game comes in several languages?", "response": "Yes.. There is a bonus disc for language packs."}
{"product_id": "B00008J7NZ", "context": "does this game work on Xbox 360", "response": "Like everyone said, you need a hard drive to play it. I guess it doesn't come with the Xbox 360 and is something you have to add on. It didn't work for us."}
{"product_id": "B00A750QIE", "context": "Can u play online against other players", "response": "You can!  You can play standard exhibitions, seasons, or even in Diamond Dynasty mode."}
{"product_id": "B0050SYK44", "context": "why is it rated m", "response": "There is swearing, lots of blood/gore, crazy psychotic peoples, gory language, and tons of explosive awesomeness."}
{"product_id": "B002I0H09Y", "context": "Is this any good?", "response": "Honestly, no, not really.  If you're deadset on a handheld FPS for the Vita you can't go wrong with Killzone: Mercenaries, but this game is just terrible.  If you come into it looking for something akin to the console Black Ops experience you'll be extremely disappointed."}
{"product_id": "B0050SXKU4", "context": "I heard a rumor that this game will no longer work properly on the PS3. I have a 500 G system. Will it work?", "response": "I bought about a month ago and it works great. Play nearly every day and i have cloned my system to an SSD. No problems."}
{"product_id": "B00ESN8YGW", "context": "do i need steam to play this? what if i don't have it? can't play?", "response": "If you have the disc noHowever if you have the code yesLuckily you can play off line after you download it, and downloading steam is very simple and fast"}
{"product_id": "B00GPH7Y8S", "context": "When you got this did it come with 2 CD's?? Mine only has 1.", "response": "The game comes with 1 DVD that contains all the games listed on the package."}
{"product_id": "B009AFLXZM", "context": "Trying to use this on wii u with dance party 2014 and it doesn't seem to work?  Is there a setup of any kind?", "response": "We don't have dance party, but on the other wii u sing party, it was just a plug and play and the mic worked great!"}
{"product_id": "B00IYWV5HS", "context": "Does this version come with the new pre-order rewards?", "response": "You get everything except for a title, green dye, and a hoverboard."}
{"product_id": "B00GY4OAM0", "context": "Does this game require the use of nunchucks?  Or can I use a classic controller and Wii U gamepad?  Nunchucks never work long for us...", "response": "you can use either the wii u pad or the classic controllers"}
{"product_id": "B008BT2FWI", "context": "are these games 3 hiden objects system", "response": "No they r three or more matches."}
{"product_id": "B004TTNTYW", "context": "Does this actually work for Nintendo 3DS? Because I brought this for a replacement charger because I lost my previous one.", "response": "Works perfectly. No issues so far!"}
{"product_id": "B00001LDBZ", "context": "Will this work on Windows 8.1?", "response": "YES,It run Ok.I just reinstalled it on my new pc."}
{"product_id": "B00CORA9GC", "context": "F18 Carrier Landing:  I have a Mac Mini with only 4mb of RAM. Would this be a problem?", "response": "It should work. Does on my 4 yr old macbook pro with 4gb of ram!"}
{"product_id": "B00EOPT5ZS", "context": "Does this support \"Repeat Hotkey while Pressed\"?", "response": "Honestly I have never tried but as it literally just acts as the assigned key such that you could type with sufficient numbers of boards I am going to guess yes."}
{"product_id": "B003Q9RGRW", "context": "Can you plug the headset directly into the controller without the chatpad?", "response": "Yes at the bottom of the controller"}
{"product_id": "B009DZTXR4", "context": "Does this game has two disks or codes for the DLCs?", "response": "There are two discs. One for the game and one for the dlc. No codes required."}
{"product_id": "B00DB9JYFY", "context": "Does anyone play this game online anymore?", "response": "I just got my XBOX One and thousands of people are playing this. Hell, there are people still playing HALO Reach since it has the best HALO multiplayer gameplay."}
{"product_id": "B003VH5Z2C", "context": "is it hard to hook up", "response": "Its really easy. Just like any other game sysystem"}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "Every game except Ground Zeroes."}
{"product_id": "B00BU3ZLJQ", "context": "Can this be played offline? The person who I am buying this for does NOT have internet. Will he still be able to play the full game?", "response": "yes I play offline all the time"}
{"product_id": "B00F27JDY0", "context": "How long is the warranty of product", "response": "All the instructions and other vital documents that come in the box are all in Japanese, so I couldn't tell you exactly. But the product is indeed used, as the box has been opened prior to shipping, so I'd assume it would be under a year."}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "I have 4 activated right now. Redeem away."}
{"product_id": "B00GG4BBUM", "context": "what means canadian cover?", "response": "i mean the picture on the box cover ."}
{"product_id": "B00C71034I", "context": "Does this game allow split screen mode?", "response": "Sorry, no, for neither single or multiplayer"}
{"product_id": "B00IRHE892", "context": "why does it say \"Batteries 2 AA batteries required.\"? never seen a wired mouse that needs batteries, could that be a mistake?", "response": "I thought mine came with a battery, but it appears to just be a magnet"}
{"product_id": "B001CXYMFS", "context": "Does it work with Windows 8 and 8.1?", "response": "yes, i have windows 8 and works perfectly."}
{"product_id": "B00E8JZILA", "context": "What is the sexual content in this game?", "response": "well there nothing sexual about this game they dont do nothing sexual"}
{"product_id": "B00DPJBTM6", "context": "Does it come with a docking station?", "response": "No. Also no mix amp."}
{"product_id": "B0054JGGGY", "context": "How is the mamba's tracking while wired? I don't intend to use the wireless at all. I currently use a 3500 Deathadder", "response": "The Razer Mamba Tournament Edition is wired, if you just want wired that can be a good option"}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "I tried Yuri's Revenge, and it skips once you get into the game. So sad."}
{"product_id": "B001IYR53W", "context": "Will it work on Windows 7?", "response": "I am sorry to say that on my windows 7 it failed to load.  I am not very computer savvy so I complained and the company refunded my money."}
{"product_id": "B007OVHW90", "context": "Are the end connectors 2.5 mm or 3.5 mm?  My son's X31 uses 2.5 mm and a white talkback cable.  Newer X31 models appear to be 3.5mm.", "response": "2.5 on both ends."}
{"product_id": "B0098F1Y3K", "context": "How many save files are there? My girlfriend wants to play as well, can it track multiple people?", "response": "Yes!  It holds up to 3 save files."}
{"product_id": "B002B9XB0E", "context": "Does this Buffalo Game controller have R and L buttons?  Pic doesn't show it.", "response": "Yes it has the L and R bumpers on the top of the controller. I did a video review of this controller that people seem to like, you can watch it here:http://youtu.be/UgiI711zZiw"}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "You recharge it just like the Sony ps3 controller"}
{"product_id": "B000TT2D2A", "context": "Are these Rock Band 1 or Rock Band 2 drums?  I need Rock Band 2 to attach cymbals to that aren't compatible with Rock Band 1 Drums.", "response": "The picture I see is an Rock Band 1 and the cymbals will not work. The Rock Band I bought my grandson is a Rock Band drum set 2 and battery operated and the cymbals will work on it for the XBOX 360. Hope that was helpful to you!"}
{"product_id": "B009RXUNGM", "context": "does it do both chat and game audio on the xbox one when using the adapter", "response": "Yes but your going to be experiencing issues while trying to adjust BOTH the adaptor volume and the Skull candy volume."}
{"product_id": "B000A2R54M", "context": "I would like to play multiplayer between a DSi with Mario Kart DS and a newer 3DS console.  Do I need to purchase another Mario Kart DS for the 3DS?", "response": "The game is compatible through Download play on all versions of the DS Console. The 3DS has a DS Download Play (to play DS games trough local W-Fi) and 3DS Download Play (to play 3DS game through local Wi-Fi) so you don't need two copies."}
{"product_id": "B008YRITPO", "context": "What is the size (Length and Width)? I was wondering if It could fit in the pull-out tray of my desk.", "response": "it is 8.5 inches by 20 inches, it fits on a small keyboard tray, not a lot of room left, but enough to tightly fit a mouse"}
{"product_id": "B00F27JDY0", "context": "can you change language to english and have everything like us version and can you use your us psn account?", "response": "I use HK psn account, I think you can choose any psn account. And yes, you can change language. I bought several us version games and they all work well."}
{"product_id": "B00GU8W5AE", "context": "Can I program the keys to enter passwords?", "response": "You can set macros, however that's a very unreliable way of doing it since anyone could press the button. The side keys are meant to be used as a number pad or action buttons in video games such as what this mouse is designed for."}
{"product_id": "B0085P7U0U", "context": "Does this really work with OSX 10.9.5?  I bought games recently and they wouldn't work on this operating system.  It was a pain to try to get my money", "response": "It works but I went from PC Hoyle to Mac and do not like it and they have removed a lot of games."}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "I cant imagine that it would be. The graphics are better and the wii u has a better processor.  While you can play your old wii games on the wii u, I don't think it goes in reverse."}
