{"product_id": "B007MM9E42", "context": "What controllers are needed? Do I need the classic controller or will the regular one and nunchuk work fine?", "response": "classic controller works fine"}
{"product_id": "B007W8S2MG", "context": "In terms of the story line, will everything still make sense if I haven't played Persona 1, 2, or 3?", "response": "The whole series is one giant story, but the connections aren't that relevant. Each game has their own story and set of characters. There are references/cameos that you wouldn't get unless you've played the previous games, but this won't hinder your experience at all."}
{"product_id": "B0072G4LB4", "context": "Does it works on win 8?", "response": "Yes it does and quite well."}
{"product_id": "B00FM5IY4W", "context": "Are all of the cars that you can buy be earned through playing the game, or are some only available through micro transactions alone ?", "response": "Can't earn all of them...gotta buy with real money...sucks."}
{"product_id": "B002BS47JE", "context": "I enjoy the original WII Fit but dislike that it goes to a rating and time screen after each activity. Does the Plus program do this also?", "response": "Yes it does.that part is just like the regular wii fit. But the plus has so much more fun activities and is way better then just the reg.fit."}
{"product_id": "B002XLR0JI", "context": "Is this windows 8.1 compatible?", "response": "No idea, it should be. It's the basic function mouse. It works on OS Mavericks (Apple) just fine."}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "All are amazing but Klondike is good old fashion fun."}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "I  grought a menmbershoip tru amazon who do I redeem my membership"}
{"product_id": "B0089NVTDM", "context": "What different emulators will this work with?", "response": "You can install a driver on Mayflash's website, and the controllers will show up in Windows Devices. So far, I've used it with Dolphin and some Steam games have been able to utilize it."}
{"product_id": "B00AJXEYOG", "context": "What games are included on this program?", "response": "As Sew It Seams said. You can also go to IGT's site and look at the pictures and see video of the game in action. http://www.masque.com/game/2906/igt-slots-miss-red"}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "This kit was boxed together!"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game.", "response": "The characters that come with an hexagon (6 sided)  clear game piece, yes they are more of the game. But not all characters have these clear hexagon pieces. These can only be played in the toy box: like Mickey, the skeleton, the frozen girls. I hope this helps."}
{"product_id": "B00FM5IY4W", "context": "Do you need a steering wheel to play this or can you use the standard controller?", "response": "No, a steering wheel is not needed and you can use the standard Xbox One controller."}
{"product_id": "B00821ME4O", "context": "is their rapid fire", "response": "yes, it has programmable rapid fire, also it lights up and has a switch for stronger force feedback, but the battery doesn't last as long as a normal controller. I charge mine regularly so its not a big deal for me..........."}
{"product_id": "B003ZSN600", "context": "Is this original one?", "response": "The specific buyer(haunted) that I got from gave me a madcatz version of the product. It looks like most of the other sellers are giving the official product"}
{"product_id": "B006NU6HAS", "context": "Does it come with any liveries other than the default shown on the package?", "response": "PMDG has liveries that are free to download maybe 15 or so."}
{"product_id": "B005EQE0YM", "context": "Would this be a useful headset for other PC applications, specifically Skype?", "response": "Yes, you can use it on your PC and Skype."}
{"product_id": "B00JFCA6V2", "context": "Does this item come with the charger and USB cable?", "response": "Yes! And in perfect condition. It does NOT come with a ps vita memory card though."}
{"product_id": "B001NT9TK4", "context": "Is the gas pedal realistic? I mean, in real cars, there is a big difference if you floor the gas pedal or only press a little bit.", "response": "It is very realistic!"}
{"product_id": "B002RRLQIO", "context": "Does the keyboard come in the original box sealed, with everything in it like the software?", "response": "Unfortunately no, I was pretty disappointed."}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "No, this game can only be played on systems from the Nintendo 3DS family (meaning the 3DS, 3DS XL, and 2DS)."}
{"product_id": "B00B67ZTUW", "context": "How does this series compare to final fantasy?", "response": "story line is good but differ from final fantasy. also battle system is differ. I like both of them. Final Fantasy is more complex compare with Tales of Xillia. Hope  you enjoy them as I do."}
{"product_id": "B0029LJIFG", "context": "What is the difference between this gold card and the newer version - besides price - wouldn't this one still provide 12 months of xbox live?  thanks!", "response": "Everything is just like it says. It's great, provides all month and great price. I will most likely buy it again."}
{"product_id": "B002I0F5I2", "context": "Will this come in a video game case, or a video game envelope?", "response": "Game case game case game case"}
{"product_id": "B005THAX5Q", "context": "this game is the spanish ?", "response": "No it isn't. It is in English"}
{"product_id": "B006SVUQNQ", "context": "Is this hard drive backwards compatible with Xbox 1 games?  I know these hard drives need to have a partition in them for older Xbox 1 games to play.", "response": "I put an Xbox 1 game in and got an error message :-("}
{"product_id": "B00AIALGZK", "context": "i paid for this and downloaded it, it needs a code to activate the game, so where is the code?", "response": "Is better if u buy  in staem buy it in www.staem.com"}
{"product_id": "B005UI8V6C", "context": "Does it work on windows 8?", "response": "Hasn't worked for me, but it may not be because of Windows 8...I am unsure."}
{"product_id": "B004RMK5QG", "context": "How do I receive the code? Will be via email or snail mail to my billing address? Cos the address belongs to my friend not mine.", "response": "i never got the code after bought playstation plus membership"}
{"product_id": "B00BS520SG", "context": "Why does my start button not work when i use this to play super smash bros brawl? Neither the start button on the gamecube controller or the + button.", "response": "I got this item and it never worked for me."}
{"product_id": "B00CX8VY4S", "context": "Is this game appropriate for my 12 yo son? Haven't looked into it yet.", "response": "This is always a good source for this type of info: https://www.commonsensemedia.org/game-reviews/watch-dogs#"}
{"product_id": "B00BQWTGIS", "context": "What are the bare minimum PC system requirements?", "response": "Yes it is all good"}
{"product_id": "B009DYCTY4", "context": "can I use my ps2 games in it", "response": "No you cant. Only the original ps3"}
{"product_id": "B0041G5SD8", "context": "Why did you guys make it so hard to do ANYTHING with this game OR steam?", "response": "define ANYTHING? are you having issues installing it? if so contact the Sega Tech Support, they helped me out!"}
{"product_id": "B00BV72X1U", "context": "will this work for xbox live?", "response": "no. It is an adapter for a PC."}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "I have 2 other controls, and this is inferior in every respect, if Microsoft are declining in their products!"}
{"product_id": "B002VBWIP6", "context": "Does this work with xbox one?", "response": "Supposedly! I wouldn't know for sure, my husband and son have the Xbox 360 system and that is what I got the Gold card for. Good Luck!"}
{"product_id": "B005S0KHIC", "context": "does this work with windows 8?", "response": "I have absolutely no problems with this mouse working on my Windows 8 set-up.  It's the OS itself that I am having issues with."}
{"product_id": "B007A7K60A", "context": "will it work with HP touch screen?", "response": "As long as you have the proper drivers for your unit, it should work."}
{"product_id": "B0050SVHZO", "context": "the old wii remote works with wii U?", "response": "Yes, you just need to sync it with the console."}
{"product_id": "B00009TW6R", "context": "Does this game work on a Powerbook G4 (Apple) and does it support controller? if so what controller", "response": "I would say use bootcamp to use windows on the mac, as for the powerbook itself I believe that it should support the game, though I don't know if it supports controllers or not"}
{"product_id": "B001V9PTVE", "context": "Is this version of fallout censored?", "response": "European version - censoredAmerican version - not censoredCan you chose? probably not. Essentially the same game and most people don't look to check the versions."}
{"product_id": "B00EWEHI5K", "context": "If I remove the battery, and plug in the USB cable - will it work?", "response": "Yes it will. That is how I ran it since the wireless would not work."}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "I play the game on xp not a single issue runs amazing so i don't see how it wouldn't run on something higher"}
{"product_id": "B009RXUOD4", "context": "how long is the wire?", "response": "It is pretty long. Around 6 to 8 feet"}
{"product_id": "B00CMQTVK0", "context": "What games come with the Day One Edition?", "response": "None, Or at least mine was not packaged as a bundle. Only difference is the \"special\" Day One Controller."}
{"product_id": "B008XHCLFO", "context": "If I put my 3ds xl in this case would it be able to still fit in here?: HORI Retro Mario Hard Pouch for NEW 3DS XL and Nintendo 3DS XL", "response": "I dont think it will ... that pouch looks a little slim and with that dreamgear case it does get a little beefy"}
{"product_id": "B003ZSHN0O", "context": "can i play this gme on my laotop,with windows7", "response": "Yes and this is a fun game too."}
{"product_id": "B00ANHBJBY", "context": "Does anyone know how well this holds up in games like Super Smash bros? The responsiveness and durability for example.", "response": "it works well but you would be better off getting the official Nintendo controller"}
{"product_id": "B00EOUL7T0", "context": "Would tritton ax 180", "response": "Turns out that this is a replacement for the Xbox 360 Only! It may work im not sure but i have Turtle Beach x12s and it didnt work."}
{"product_id": "B002I0HJG8", "context": "Seems like it is  for for the NA version for TERA enmasse? And who knows is this match the EU vision?", "response": "If the question is whether the NA version is the same as the EU version, the answer is yes....it is just a different set of servers and of course a different set of players.  I have played on both and it is the same ga.e."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 7 64 bit", "response": "Im not sure, Ive got a 64bit computer running a windows 7 32bit ultimate, I didnt like the 64bit ver it had too many hick-ups"}
{"product_id": "B007R9PWLY", "context": "hello,in technical details it says that the harddisk is 1TB7200rpm,but in the product disccription it says 750gb 7200rpm+256GB SSD? so which one is it", "response": "It does indeed come with a 750GB and a 256GB SSD which in total is 1TB."}
{"product_id": "B005YR1VP2", "context": "Does it require any thing else to work", "response": "No not at all"}
{"product_id": "B000QJ1NS8", "context": "how long do the battery last?", "response": "From a full charge it will last at least 3 to 4 days of playing it pretty hard. For the price it's worth it for when your old battery burns out"}
{"product_id": "B0005PHYPO", "context": "Will this load on Windows 7?", "response": "I haven't tried yet I've been busy with morrowind and modding"}
{"product_id": "B004AM5RAM", "context": "Does it come in the Razer box and does it have all the pieces and paperwork included that it would have if it came from the website?", "response": "Yes, it ships as it would had it shipped directly from the manufacture."}
{"product_id": "B0053B66KE", "context": "Which languages does it have? Is Spanish included?", "response": "Its been awhile but I do remember that Korean, German, Japanese, and other languages were included in the game. If those languages are included, then I'm pretty sure Spanish would be one too."}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "Starts soon as u plug in.  The shake only tells u how much power the anker has on it"}
{"product_id": "B007SO6USW", "context": "will this work with a wall charger for a phone like say an htc one?", "response": "We tried it and it works that way as well."}
{"product_id": "B008HPAXZ2", "context": "Would this work for the \"new\" 3ds xl?", "response": "Yes it will, I have it on my 3ds xl and it fits perfectly"}
{"product_id": "B002I0JZIS", "context": "can i play with someone on the ps3 with the vita", "response": "Yes if your vita connect to ps3 mines play on the p4 fine"}
{"product_id": "B00D3RBYM0", "context": "Does this game have multiplayer mode", "response": "Single player and multiplayer are merged as one in this game. This seems like a good idea but I oftentimes found myself being reconnected after the connection was disrupted and so I ended up turning the feature off anyways."}
{"product_id": "B00H7KDNBO", "context": "How well does this game run on a 2012 non-Retina 13-inch MacBook Pro (Windows 8)? Is it playable on at least the minimum settings?", "response": "Sorry dude never had a mac I'm running the game with a Core i-7 4790K and GTX 680 FTW and 16 Gb Ram on Win 7"}
{"product_id": "B0045ZB66I", "context": "Does this game run on windows 7?", "response": "I run in on Windows 8 with no problems.  I don't recall any issues on Windows 7 either."}
{"product_id": "B0050SZ0SY", "context": "Will it run on Windows 8.1?", "response": "Yes I play it on mine .. I have windows8.1pro"}
{"product_id": "B0007MZWQS", "context": "Why is almost every genesis not have the cords and controller(s)", "response": "I guess people lose them while in storage or something. Regardless you should just check amazon in a week or even a day or so because sometime there are plenty systems with the cords and sometimes not"}
{"product_id": "B000PT18OS", "context": "How do I know which one I need? I had two 360's and one got stolen.  Apparently I had the bricks switched because the one I have left wont plug in.", "response": "Not sure, my xbox is from 2009 and i'd just recommend you look at the connections and see if they are similar"}
{"product_id": "B00HGLLRV2", "context": "Out of all these editions, which is the better one with many bonus features and such?", "response": "I liked Second son the best then infamous 2 then one"}
{"product_id": "B00DWXUYN0", "context": "Will a regular 3ds fit well in this case? Would it have too much room and slide around?", "response": "I have a 3ds XL and fits perfectly. although it will add some weight to the device, if you carried it around. but all in all, its a good buy for me. my boyfrd has the luigi version, and he liked it too"}
{"product_id": "B007SRM5MO", "context": "So why does the box say Internet connection required if the DLC is on the disc? Or is it only required for the Harley Quinn content?", "response": "It doesn't need it, it's a two disc game."}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "If your child is a mario fan they would love it."}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "In case you wanted to block the camera from seeing anything. I personally never use it but you never know someone might need it."}
{"product_id": "B00ATHFLZS", "context": "Just ararived and does not work at all. tried several computers, not a problem on my end, the mouse is dead. unless there is some secret magic dance..", "response": "I think you may have defective product. I just plugged mine in and worked right away. Just contact amazon and get replacement sent"}
{"product_id": "B007MM9E42", "context": "Does this game have parts that require reading? And can you die? If so, how easily? My 5 yr old has been playing Kirby's epic yarn for 2 yes now.", "response": "This game has a track that require reading, children use their logic at times to find the answer without reading, opportunities are lost and you return to previous game spaces, I recommend starting with Epic one"}
{"product_id": "B00CJ7IUGS", "context": "Do I have to start a fresh game to play the DLC? I have a level 12 character and I don't want to start from scratch.", "response": "No, all of the content can be played going forward.  If you were level 40 or above it might not be as fun but that's a low enough level it will be no problem."}
{"product_id": "B00B5QLS4A", "context": "I have a SteelSeries 4HD mouse pad,would this work well with a plastic coated pad? I currently have a Naos 5000 that's getting worn out.", "response": "I use a hard pad and it is what is recommended for better performance."}
{"product_id": "B0000C7GHG", "context": "does it come with memory card?", "response": "Mine did gotta read the sellers item description if it says it has a memory card then yes"}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "No this is so you can add money to your PSN account so you can buy music, movies, video games, and DLC from the PlayStation Store This is not PlayStation Plus and even with PS+ you only get free games PS+ doesn't give out free movies"}
{"product_id": "B00G6YJ60E", "context": "can  you use your xbox controller???", "response": "I don't know I just used a mouse but don't see why not that's just my opinion though. Hope this helps"}
{"product_id": "B003JETPHS", "context": "Does it work with PS2 Guitar Hero World Tour?", "response": "Sorry Steph I am not to sure, I am using it on the wii and on my laptop. I don't see why it shouldn't though."}
{"product_id": "B00A7VK16A", "context": "work with xbox 360 e console?", "response": "If it uses an HD mi cable the answer is yes"}
{"product_id": "B000BAVN14", "context": "Will this work on Windows Vista?", "response": "Not sure but we are running it on Windows 7. To run it on 7 you have to run it on compatibility mode windows xp service pack 2. Hope this helps"}
{"product_id": "B00DVEJA7G", "context": "how are these for running on treadmill? want something thats secure and wont fall off when im running", "response": "I don't think they would stay in place while jogging....They are really good earphones, but don't fit tight.  Hope this helps."}
{"product_id": "B005F1ZUU4", "context": "Will this work for multi-player? Could I connect two wireless controllers to this one adapter?", "response": "I believe it will work for up to four, although I've only had two connected personally."}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "The remote no longer works with at least Netflix and YouTube. Or rather, using it requires you to powercycle your console every time you use it and you never use the remote to turn on your console. Microsoft is aware if the error but has shown no interest in fixing it."}
{"product_id": "B00GJXMRX0", "context": "What is actually the difference between gold steam and standard steam for PC download? Thank you.", "response": "I think the gold has all the dlc"}
{"product_id": "B001PO2BJI", "context": "will these work for wii u?", "response": "I can't answer that question. My grandchildren have the mini wii. I would think that one of the stores that carry this item would be able to answer that for you."}
{"product_id": "B009WI7V9E", "context": "Does this game come with all of the DLC stuff for the first two games?", "response": "Bio:plasmids pack,Challenge rooms pack,Bonus museum levelBio2:Sinclair solutions tester,Rapture metro,Kill'em kindly,The protector trials,Minervas den, collectible stickers (3)"}
{"product_id": "B009SJR278", "context": "does this on xbox one", "response": "Yes, But the mic has to go through two transistors that cause the Xbox One to think everything is background noise, The result being that you ether sound real far away, underwater, or the mic not working at all. You will need a separate mic and a Splitter. you also need the Xbox One Headset adapter its $25usd"}
{"product_id": "B003Q9RGRW", "context": "can you plug in both at the same time", "response": "Yes, the chatpad connects to the controller and the headset plugs into the chatpad."}
{"product_id": "B005EOOT90", "context": "there seems to be a static sound when using this, does anyone else have this issue?", "response": "un plug the red cable in the back of the tv"}
{"product_id": "B009RXUNZI", "context": "When you \"stash\" the mic, does it mute? I would like this to act like PTT during games.", "response": "Unfortunately no. No way to mute except using the inline control or via console or pc"}
{"product_id": "B004C34D2M", "context": "does this Wii controller come with motion plus ?", "response": "No, it does not.  Also, there is no wrist strap on the controller.  I was disappointed with that."}
{"product_id": "B00BGA9YZK", "context": "Can 2 people play this game with 2 controllers on one console in co-op mode? If yes and is not too much trouble, please explain how to do that.", "response": "if it does have a sign on option for a 2nd controller when you're in the Co-op main menu, then it should be possible."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "Yes. It will play on Windows 7 as well as Windows 8."}
{"product_id": "B007A7UJ4S", "context": "how many Gigabytes are required to install this game on the ps3? In save data tool (i think) you can see it", "response": "THIS GAMES USES FOUR GIGS OF HARD DRIVE SPACE."}
{"product_id": "B00HG0B8NA", "context": "I like the game but I don't here only thing", "response": "I really can't find a good Solitaire game.  This one is okay but there are several things about it that I do not like.  One is once you play a card it cannot be moved.  Also the graphics are not very good unless you use it full screen."}
{"product_id": "B00AQ2BLI2", "context": "Does this come with an install disk? Yes I have a steam account but cannot buy content for some reason.", "response": "It came with multiple install disks. One for Shogun 2, and another for the expansion sets."}
{"product_id": "B00BU7WVG8", "context": "is this a 2 players", "response": "yes it is a 2 players"}
{"product_id": "B00F2ENJY8", "context": "Does it come with everything you need to hook it up?", "response": "Yes--although it only has one controller/numchuck so you will need to order second pair fpor most two player games. But it comes with everything except batteries for maon controller. Uses composite (red and white audio and yellow video) cables to hool to your tv. Easy to set up"}
{"product_id": "B004HYIAPM", "context": "Does it work on a computer with Windows 8.1 ?", "response": "Yes, it should work fine on Windows 8.1. If you are switching to 8.1, after you install the game update everything to do with windows and allow a little time for Windows Update to apply all the game patches/updates. It should work smoothly with little to no glitches."}
{"product_id": "B003ZSN600", "context": "Does the wired controller can connet to PC through USB directly? or I need other tool support ?", "response": "It comes with some adapter that lets it connect to USB directly."}
{"product_id": "B003O6CBIG", "context": "will online work or do i have to buy it myself, because online is the best part of Cod games", "response": "Yes online works. You can also go through coupon codes and apply them for a deeper discount.  Out of all the times I've ordered from Amazon, I was unsatisfied about twice but Amazon worked with me to assure my satisfaction."}
{"product_id": "B00FLZ4FS2", "context": "Hi! Will this code work on a foreign account or just on an american one? Also, how long after the payment confirmation till the code is emailed?", "response": "Not sure about the account thing but I ordered mine with one day shipping and it came the next day so..."}
{"product_id": "B002I090AG", "context": "Does it come with a Charger", "response": "Yes, it came with a charger. :]"}
{"product_id": "B00EZPCWWA", "context": "I have two kids who likes the same games.  Do I have to buy two of the same games or is there a \"share\" function to this console?", "response": "Not that I am aware of.  If it's an actual game, I believe you have to buy two or just have them share (easier said than done!)."}
{"product_id": "B009GTV5HS", "context": "Is this a wired or wireless mouse? I have read online that this is a Hybrid with both features, but the pictures look like a wired mouse.", "response": "It's a wired mouse."}
{"product_id": "B0045ZB66I", "context": "My sister would like to play it but she has a windows 8, could she?", "response": "Yes. I play it on Windows 8, and it works perfectly."}
{"product_id": "B0001BR9Q6", "context": "will Hoyle Card Games 2005 play on Windows 7?", "response": "Yes! It works just fine."}
{"product_id": "B00BGD6LMG", "context": "Do you have to have Xbox Live to play this game?", "response": "Not for single player. Muliplayer online needs xbox live."}
{"product_id": "B00D6PTMHI", "context": "Will this enable a person to read music and play other pieces, or do you only learn the songs included?", "response": "This game actually teaches you the cords so you could pick up other songs and play them after you get good at this game. It won't really help with \"Sheet music\" and music theory as much though."}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "Yes, It does work with windows 8The corsair website has the most update drivers, software and firmware."}
{"product_id": "B004TTNTYW", "context": "Does this actually work for Nintendo 3DS? Because I brought this for a replacement charger because I lost my previous one.", "response": "It does but it's a piece of junk and stops working after one or two uses."}
{"product_id": "B00DBDPOZ4", "context": "Is there any type of warranty? I bought one barely 5 months ago and the cord isn't charging the controller anymore.", "response": "There isn't any warranty just that it would arrive dead on arrival."}
{"product_id": "B00030GSJY", "context": "i have windows 8.1 will this system work with my system?", "response": "Yes, though you will have to download the drivers from the Saitek website (Uses the same drivers for Vista, 7 and 8)"}
{"product_id": "B00EWEHI5K", "context": "If I remove the battery, and plug in the USB cable - will it work?", "response": "Yes it's a fully wired mouse"}
{"product_id": "B00CMSCTA2", "context": "can i play on mac", "response": "No. Unless you have a virtual machine running on your mac and a Steam account. If you have a virtual machine I'd still recommend ordering the cd; steam is a pain."}
{"product_id": "B00EOI2MRS", "context": "does this controller work on pc?", "response": "I haven't tried, I use a Xbox 360 corded controller for pc."}
{"product_id": "B00CERXJNW", "context": "is it compatible with window 8.1", "response": "dont know. you can ask them directly from their website http://www.corsair.com/us/company/contact/"}
{"product_id": "B00AR1LX9O", "context": "are these headsets good for FPS games like Call of Duty and Battlefield", "response": "Honestly The sound is great but the Mic is very complicated and is either great or awful.  The settings are not easy to work with.  You would be better off either going the step higher or using a Logitech headset.  But the wireless is VERY nice."}
{"product_id": "B006IOAHPK", "context": "this version is censored?? thanks", "response": "No this version isn't censored."}
{"product_id": "B0041RR0TW", "context": "does it work with windows 8", "response": "Apparently, but has issues with 8.1."}
{"product_id": "B009D3HSTG", "context": "Can this be used in place of mouse for regular computer use like browsing the internet?", "response": "No it's used for game emulators, but I'm sure with some software you could manage to get that effect."}
{"product_id": "B00GPH7Y8S", "context": "When you got this did it come with 2 CD's?? Mine only has 1.", "response": "Mine came with 1 CD."}
{"product_id": "B007SRM5U6", "context": "I bought this game, and comes without a code for Harley Queen's Revenge, is this normal?, or I'm doing something wrong?", "response": "If you got the Game of the Year edition, it should be a part of the game itself, no code necessary. You wouldn't even need to start a new game before starting HQR. The only reason you would need a code is if you got the standard edition instead."}
{"product_id": "B003VUO6LU", "context": "does this load DVD/BD disks from the front (like the original PS3) or from the top?  My components are in a stack and I need front load .", "response": "If you have what is pictured then it loads straight in the front right on top of the on/off buttons you can see in pic."}
{"product_id": "B000BIZR72", "context": "Does this include Galaxia?", "response": "It includes; Galaga and Galaxian."}
{"product_id": "B00FATRKOK", "context": "Do you need internet connection to use xBox 360?", "response": "no you do not"}
{"product_id": "B00030GSJY", "context": "does it work with mac", "response": "The Saitek website as of January 30 2015 says it IS supported on MacOS."}
{"product_id": "B00DLRLDBO", "context": "so it works with the xbox 360 controller perfectly and i dont have to do anything special and does it work with anything else like PS3 IPhones PC", "response": "It works on my iPod and laptop perfectly and on ps3 n xbox"}
{"product_id": "B00B98HDNO", "context": "Does this game have to be played only when installed previous versions?or buy and play just right away with internet?", "response": "also its a steam install version only you cant just download straight to desktop."}
{"product_id": "B00726ARTE", "context": "Does it require separate ports for the headphones & mike, or will a single headphone jack for remote phone or cell allow hearing AND speaking Thanks!", "response": "The headphones come with an adapter that splits into 2 jacks. One for recieving audio& another for the microphone"}
{"product_id": "B00DWXUYN0", "context": "I have a 3ds with a small case on it. Would it fit well inside of this carrying case?", "response": "If it's a regular 3DS you don't have a problem, but if you have a 3DS XL it depends on how thick is your small case. If you can tell me the case you have I can help you better."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "yes it works i have it and use it with the xbox one chat adapter"}
{"product_id": "B003O6JJKY", "context": "If i buy a used did it come with  controller ?", "response": "Yes. Minecame with a headset a controller and brand new batteries for it"}
{"product_id": "B00AEX81SG", "context": "Does this come with the Sony Manufacturer warranty of 1 Year?", "response": "No. That would only be a new item. This is used."}
{"product_id": "B00E1A1SP6", "context": "is this the new nintendo 3ds xl? and if so how can i be sure its not a knock off or fake?", "response": "It is a genuine product, but the one I received is the OLD 3DS XL."}
{"product_id": "B00D6PTMB4", "context": "how long is the cable?", "response": "7-8 foot you can get a double female and another guitar cable from a music store and go all over the house"}
{"product_id": "B00EOI2MRS", "context": "Does this controller have a USB plug?", "response": "Yes its a USB device to connect to PS3 but it's a wired controller,  no battery"}
{"product_id": "B00CMQTVUA", "context": "Does this come with a controller?", "response": "Comes with one game controller and a headset."}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Hi Braedon! I bought this item too! Yes it fits the 3ds LL and AC adapter! Also I an extra stylus and some games! Great item! Well worth the money!"}
{"product_id": "B0041RR0TW", "context": "How does this compare in physical size to the PS3 controller? I'm looking for a controller smaller than the 360 one, hopefully PS3 size.", "response": "It's roughly the same. The width across from end-to-end is pretty much the same. It's thicker though, because of the need for AA batteries. That also adds a little to the weight. But I have a PS3 at home and have used it for many years, and I find this controller quite comfortable, very similar layout."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "I've played both versions. They are a lot different. PS4's graphics blows the PS3 out of the water, even though I was using an HDMI with the ps3. Still a big difference."}
{"product_id": "B0072HYRNK", "context": "Does this come with a USB cable for charging?", "response": "Yes.  It plugs directly into the PS3."}
{"product_id": "B00EF1OGOG", "context": "How do you recharge", "response": "You plug it in and charge it as you would your phone. You can charg to device using your computer or any wall charger."}
{"product_id": "B002BSA20M", "context": "Can this be played without an XBOX Live membership?", "response": "Yes, campaign mode can still be played without an Xbox live mebership.  You can also play your friends on your Xbox via multilayer mode.  Xbox live gold is required to play people online."}
{"product_id": "B00286BZ4Y", "context": "will this work on widows 7?", "response": "I have NO problem playing this with Windows 7.  Great game.  If only the money you win would shoot out the computer. lol"}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "Works great. Just gotta make sure to get the adapter so you can use it."}
{"product_id": "B000FRU1UM", "context": "what is different from this one and the other one bellow it?", "response": "What do you mean the one below it?"}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "No. It must first be activated on your Xbox 360. Then the game will show up as a free download inside the Xbox One marketplace."}
{"product_id": "B0057S9SYY", "context": "does it work with the xbox one console?", "response": "No it says it specifically on the xbox adapter page on xbox.com that it does not work with the xbox one."}
{"product_id": "B000H67DDY", "context": "what is the warrenty?", "response": "2 years parts and labor"}
{"product_id": "B003G6ISRC", "context": "can this be used on windows 8 or 8.1?", "response": "I have no idea."}
{"product_id": "B00B312UDU", "context": "Will this work on a Mac / OS X and being that the instructions aren't in English, are the buttons programmable without instructions?", "response": "Definitely works on OSX Mavericks but I don't think they're programmable even with English instructions and even on Windows"}
{"product_id": "B00EOUL7T0", "context": "Will this work with Tritton Triggers?", "response": "Yes it will I just turn the stuff on the HDE cord all the way up and adjust with trition instead."}
{"product_id": "B00DC7G2W8", "context": "Will I be able to play this game on my regular Wii?  Or do I have to have the Wii U console?", "response": "No, but if you get a Wii U, you will be very happy! HAPPY!"}
{"product_id": "B002DOC93C", "context": "Are many of these games good for a single player with no wifi?", "response": "Yes you play this on a DS and you don't need WIFI.  I bought this game for my mom and she loves it"}
{"product_id": "B0057SDCLY", "context": "how can i use this with the xbox 360 e if i am using hdmi", "response": "The component HD is better, however, you can use them.. they just won't be heard only by you.  those around you will hear it too."}
{"product_id": "B00FEOR4MY", "context": "The description says it holds 6 games, but it looks like it holds 12 in the photo.  Which is correct?", "response": "It does hold 12."}
{"product_id": "B008CXTW5G", "context": "How long is the USB cable?", "response": "As long as any other keyboard, but it takes 2 USB ports to connect to your PC, good luck with you buy and hope you get a good keyboard with the enter key failure."}
{"product_id": "B0045ZB66I", "context": "My sister would like to play it but she has a windows 8, could she?", "response": "yes it will play"}
{"product_id": "B00E88G054", "context": "how is this mouse compared to the mazer 1 type r? better? worse? improvements?", "response": "Mazer II 2500 DPI is better,it is second generation Mazer,more improvements,thanks"}
{"product_id": "B002Q4U5DK", "context": "Does the LED light always stay on? Is there a way to turn it off?", "response": "Razer has a free downloadable program called Razer Synapse that allows configuration of the mouse, Including the lights. The Wheel light and logo light can be toggled off individually. There's also an option to toggle all lighting to off when system displays are turned off"}
{"product_id": "B009DYCTY4", "context": "can I use my ps2 games in it", "response": "You will not be able to play PS2 games in this PS3.  Sony only made one PS3 that could play PS2 games and that was the big fat 60GB model.  After that one, no PS3 can play PS2 games."}
{"product_id": "B00005NIMA", "context": "Is this a USB stick?", "response": "yes mine is. but be careful some are not. the old models are not usb"}
{"product_id": "B00E1L78N6", "context": "Does these include the boom mic?", "response": "Actually they will call you and confirm you received the boom mic"}
{"product_id": "B009Q8PP16", "context": "Will this work for TitanFall?", "response": "The kids use it while they play titanfall but I'm hearing conflicting answers on how well it works with the game. I hear only some of the features and some are funky."}
{"product_id": "B005764CWO", "context": "My controller wont turn on when i put it in my ps3 or anything else. Any tips?", "response": "Mine would do that exact thing then stopped working after a few months, they aren't built too well. I threw it out."}
{"product_id": "B00FB4BUMW", "context": "does this come as a usa keyboard layout if i order from the us?", "response": "I asked a rep and they said it's US layout"}
{"product_id": "B004X56PWK", "context": "Will this game work with Playstation 4?", "response": "Idk cause I haven't tried it but I've been told that all of em can"}
{"product_id": "B00A378L10", "context": "Can the LED lights be turned off?", "response": "You can alter the brightness level, only have WASD lit, or turn it off/on.So yes."}
{"product_id": "B008OQTR3S", "context": "do you have to have a racing wheel to play? is there a specific wheel that i should buy?", "response": "No, you can play with regular controller."}
{"product_id": "B0011E4J7O", "context": "How long is the cord?", "response": "Prob about 6 feet, but the chargers are crap. Don't waste your money."}
{"product_id": "B00F27JE1C", "context": "Does this model come with a memory card?", "response": "No, it's built In"}
{"product_id": "B0050SYR74", "context": "can the mic be connected to the PC in any way? if so what is the quality?", "response": "Yes. very good quality sound"}
{"product_id": "B007MM9E42", "context": "Does this game require two players?", "response": "No,  but parts there are a few parts that are easier with two,  but still possible with one."}
{"product_id": "B002DUCF7Q", "context": "Does it work with DCS?", "response": "Have no idea what DCS is, I'm using MSFS X"}
{"product_id": "B000BD9PBQ", "context": "Palm Tungsten E2 Compatiblility Is this item good for a Palm Tungsten E2?I need to know before ordering it.Thank you", "response": "Quisiera saber si funciona con la treo 650 smartphone. Les agradeceria me respondieran lo mas pronto posible. Gracias Luciano Batres"}
{"product_id": "B00FATRKOK", "context": "what features make it a holiday bundle package as opposed to a standard package?", "response": "Buyer Beware!!! I bought this by mistake meaning to buy and XboxOne, returned it to Amazon UNOPENED and they charged me a $122 restocking fee.  Totally ABSURD"}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "It's hard to describe in words how the mic control works in words, I recommend watching a YouTube vid to see the part of the headset control where you plug in the headphones and 2.5mm cable. If you got this headset I believe you could use your monster headphones with the mic control or use the slyrs."}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "I didn't have any issues running it on Win7 64bit that I recall."}
{"product_id": "B00FZ12F34", "context": "Is buying this bundle just like buying them in store? Do each of characters and play sets come in boxes with power discs, and original packaging?", "response": "Yes.  They all come in their original packaging as you would find them in retail stores."}
{"product_id": "B00FLLFJE0", "context": "How does the base recharge the batteries? Does it plug in? Or does it have to have batteries in it?", "response": "It Plugs into a wall outlet."}
{"product_id": "B000PT18OS", "context": "does this have a part number on the back?", "response": "Not that I saw."}
{"product_id": "B0047ERZ7Q", "context": "is this an actual psp player or an accessory?", "response": "This is an accessory for made specifically for the PSP and will work with any of the PSP models in the correct format."}
{"product_id": "B009CL6LA6", "context": "Whuch are better these or the PDP afterglows Kral Wireless headset?", "response": "They are both good. The difference is PDP is good for adults, the reason is the band is larger. I gave these to my 8 yr old daughter and the PDP is for me."}
{"product_id": "B002I090AG", "context": "Does it come with a Charger", "response": "I realize now that you're asking if this one does. The one I bought did not, I ha to purchase my own as well as an sd card."}
{"product_id": "B0050SY77E", "context": "How long is this  campaign?", "response": "If you take the game seriously and don't run through it like an idiot then it should last you about 7 1/2 hours, by that i mean, using cover, scanning around, using some stealth, thats how much time i got"}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "Yes it does, it works just as it should, you are correct, it doesn't have the 3d effect, but it is bigger than the normal DS you know how the bottom screen is smaller than the top one, well the top screen for the DS games is the same size as the bottom one."}
