{"product_id": "B0079V29EI", "context": "Can I charge my vita with this grip on?", "response": "Yes the port on the bottom of the grip allows you to be plugged in while it is on the vita (in the event you forgot to charge the grip and Vita and are both dead). Personally I never ran into this issue as the grip gives you that second charge for your vita :)"}
{"product_id": "B00AAS88K6", "context": "Anyone know the difference between the 2013 and the standard edition?", "response": "2013 is green, slight performance improvements and that's pretty much it"}
{"product_id": "B00E1DMWBM", "context": "this may be a stupid question but can it play sega genesis cartriges?", "response": "No it cannot. Its just a preloaded gaming handheld."}
{"product_id": "B002JTWODG", "context": "Is this the 6400dpi found on the Razer website?", "response": "No its not. That is the 2013 model. They arent selling them on amazon yet.This is the older model."}
{"product_id": "B00009WAUO", "context": "Does it come with the bonus level card?", "response": "I think it depends on who's selling it, but I didn't get them from the person I ordered from. I don't have an eReader anyway, so I wasn't really looking for them in the first place."}
{"product_id": "B00CHYOP80", "context": "does it say ps4 on the box", "response": "No but you can use it for a ps4 it comes with a manual on how to set it up."}
{"product_id": "B006KYYOSO", "context": "Does this game offer anything to single players/non-online gamers?", "response": "Besides character customization and fight lab i don't think there's something more offered in the game. Over 50 characters to play with in story and arcade mode i guess"}
{"product_id": "B00BCEK2LK", "context": "Can I use the wheel to click?", "response": "I believe can do that yes."}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "Unless it is a realy thin LED and is flush against the wall then I'm pretty sure it will.. It's adjustable to fit most TVs."}
{"product_id": "B008VQ68C4", "context": "How long are the cables? I plan to game on the couch with these bad boys, but I need to make sure I don't have to be close to my tv.", "response": "The cable is like 9' i believe, way too long for my computer but long enough for my couch"}
{"product_id": "B0087ZMATE", "context": "I am wondering if the mic volume is very good or not. I have a cheaper headset and the mic is almost inaudible, even when boosted from the PC", "response": "yes the mic volume is nice and loud, these head sets are a steal for their price"}
{"product_id": "B00IPTUJ8G", "context": "can you play this game on the vita and invite/join people playing this on the pc?", "response": "No, the only cross platform functionality for this game is being able to transfer a save from PS3 to Vita and Vita to PS3"}
{"product_id": "B009GWLSFY", "context": "Does it have Galaga?", "response": "Sorry,it dosent. But it should have."}
{"product_id": "B00BMFIXZG", "context": "Why is game in slooow motion and video is like watching old kung fu movies?", "response": "Because your computer sucks"}
{"product_id": "B00886XQO0", "context": "I have the Headset Adapter that came with another set of Turtle Beach headphones, can I plug these into that for my Xbox One?", "response": "as far as i know you need an xbox one audio adapter."}
{"product_id": "B00DC9T2J6", "context": "My son really wants this game but M rating isn't going to fly with Mom. Is there a way to turn off blood / gore for PC version?", "response": "Nope. I couldnt find one."}
{"product_id": "B00FOHP8XI", "context": "this \"PlayStation 3 250GB Console - Blue Azure\" includes the vertical stand?", "response": "some listed for sale on amazon do but some will not. i have one listed and it does not include the stand but you can still set it on it's side."}
{"product_id": "B00GHJ6X8G", "context": "Does this game require an ONLINE PASS in order to play online??", "response": "No. This game does not require an Online Pass. Online is free to play"}
{"product_id": "B00EVWZHLK", "context": "Must I install the games or can I directly play them from disc?", "response": "Play straight from disc."}
{"product_id": "B000A2R54M", "context": "Is this a 3ds game", "response": "No but it can still be played on a 3 ds console"}
{"product_id": "B003O6N64Y", "context": "can I connect this headset to a tv,thankyou.", "response": "Yes, you can connect it even the ps4 or cellphones"}
{"product_id": "B005764CWO", "context": "My controller wont turn on when i put it in my ps3 or anything else. Any tips?", "response": "The one I had the cord was damaged. I had to  play with the cord"}
{"product_id": "B00GHTP7SS", "context": "This is only the code? Where do i download the game from after buying the code?", "response": "If I remember rightly it is a Steam code, pretty sure. So you need the Steam client and you put the code in there and then download the game throughout there. Assuming it's the PC version you are buying."}
{"product_id": "B00519C7JC", "context": "Is the sever either for multiplayer or zombie still working???", "response": "Yes. You can still play online AND offline for both Zombies and Multiplayer. There is still a large number of people playing too. I can always find plenty of people to play with."}
{"product_id": "B00GV0LR64", "context": "can this be used with the xbox one", "response": "Absolutely. I use it with mine. It will work with any powered USB."}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "No, you can play it without XBOX Live."}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes. There are three or four small screws under the rest for removal. I'd double check on the number but it's packed for moving currently."}
{"product_id": "B005CELN8W", "context": "Do you need an internet connection to play this game?", "response": "You need to install it but no I do not use the cd. I play it without being on the internet. It puts a i con up and you go to it and it comes up for you to play."}
{"product_id": "B00FFL0T46", "context": "I wanted to purchase this game but I do have a Steam account will this game will be able to be played through Steam?", "response": "Sorry it has it own DRM from Telltale so you cant activate it on steam."}
{"product_id": "B00DC9SWWE", "context": "My son is about to be 11 and is dying for this game.  I've never bought him an M rated game.  How is the violence and language in this game?", "response": "You shoot pixel soldiers and robots with pixel guns until they fall over or blow up. When you sneak behind an enemy you can snap his or her neck. It's a shooter so of course there will be blood and violence, but it's nothing that'll traumatize him. As for language, he probably hears worse things during recess at school."}
{"product_id": "B0042J7I3C", "context": "Does it hook into the controller or the Xbox?", "response": "into the controller Xbox 360"}
{"product_id": "B00BCEK2LK", "context": "what does the button do?", "response": "The button under the mousewheel changes the sensitivity of the mouse.  You can preset 3 different dpi settings and cycle through them by pressing the button."}
{"product_id": "B0096L2SJ0", "context": "where are the games stored", "response": "The games, regardless of whether they're the paid-for MOGA games that you can buy through the app, or the ones that you've downloaded from the Google Play, Amazon app, or any other store, are all downloaded and installed to your phone's memory, or your micro SD card, depending on your phone's software and file storage options."}
{"product_id": "B000R9A9JG", "context": "how many batteries are included in this. just 1 with choice of colors or all those in the picture?", "response": "Same as previous answer. 1 battery and cover per package, no choice of color."}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "i think so, but you may have to check your ram and video card"}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "No, it can be played offline too. In fact, I NEVER play this game online. Both \"Star Craft\" and \"Brood War\" can be played offline."}
{"product_id": "B001IYR53W", "context": "DOES IT HAVE  CARD GAME MEMORY MATCH", "response": "Nina, I hit the wrong key, so this may be a repeat. But, yes it does. Thank you for bringing it to my attention. I play Bridge and just love this Hoyle version. Cassie Maull"}
{"product_id": "B00BY0G0YU", "context": "Does this game work outside of the US", "response": "I have no idea, I live in the USA"}
{"product_id": "B00562O78S", "context": "Which should we buy Playstation 3D Display or HMZ-T1? Playstation 3d display is $499 and available on Nov.HMZ-T1 is $799 and available on Oct 26th.Which sould we buy?", "response": "I already have a big 2D lcd, 24\" would be a downgrade. I have not yet seen a 3D tv that didn't have left-right image crosstalk, so the HMZ with separate right-left screens sounds interesting. After all, I had a lot of fun with the Virtual Boy back in the day..."}
{"product_id": "B00B3PDH5G", "context": "PS4 users, while playing and chatting, are there any cables connected to/from the headset/controller? or only cables between console/transmitter?", "response": "A PS4 talkback cable is required between headset and controller (Cable included)"}
{"product_id": "B0057WDBHA", "context": "Will this work with the Disney Infinity games? I bought a different one specifically to use with those and for some reason it won't work.", "response": "If it doesn't use the right thumbstick for camera control it should be fine, also on the top of the fightstick there is a switch to to change it from the pad, left stick, and right stick. And sometimes the PS3 wont recognize the stick so unplug it and plug it back in."}
{"product_id": "B00I4C2EKA", "context": "What is steam client?", "response": "The service that keeps the game software up to date."}
{"product_id": "B00CWFUHT0", "context": "Does it come with a controller?", "response": "Yes a white controller came with my game system"}
{"product_id": "B004AM5RAW", "context": "Ok, so this may sound lame, but what does MMO mean, and is this wireless?", "response": "Mouse is not wireles MMO means \"massively multiplayer online\" - used for online gaming programs."}
{"product_id": "B00BGAA3S2", "context": "Is there an extension cord for the camera available?", "response": "Just found this.  Not many reviews. No idea if it works.  Still too short but a step in the right direction.Camera Extension Cable (PS4)"}
{"product_id": "B0065NP6NC", "context": "Are the missions like Call of Duty (mission 1 must be completed before mission 2) or like Far Cry (you can complete missions in different order)?", "response": "This is an exploration game, so you come across people, places, or events that tell you about or trigger individual missions or quests.  However, the main storyline must be played in the given order."}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "The vita is region free. This means you can use your existing account and also access your downloads. Only thing that has changed with this model is that circle is the accept button as opposed to the cross. That carries into some games but not all."}
{"product_id": "B007CM0K86", "context": "Can you play the girl as the main character? or do you have to play the man?", "response": "You play as the guy (Joel) for the majority of the game but play as girl (Ellie) for a small part. You can't switch charecters though."}
{"product_id": "B00D78Q4UM", "context": "Do the keys have the tactile click? My K95 with cherry red switches don't have the click and I hate it. I need the click for my typing style.", "response": "No, they do not have a click feature."}
{"product_id": "B00A378L4C", "context": "I just recently received this keyboard. My F5 key is not lit up when I have it fully lit.  Do I have a dead led?", "response": "You must have a bad led. My f5 key has a backlight."}
{"product_id": "B0002XJBGE", "context": "I bought this, along with the Special Edition Doom DVD, to play on my Asus laptop.  Game plays okay, but does not recognize pad.", "response": "depends on the operating system you're using AND the game itself. You may want to go to the Doom forum and see what pad works with it, and your OP"}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "Yes. Windows 8, 7, vista, xp. Processor 2.4 or higher. 1 gig memory. 4 gig hard drive  256mb graphics"}
{"product_id": "B003O6E986", "context": "Can I use 1 Kinnect (xBox 360) on 2 players with split screen simultaneously? Thanks", "response": "as far as i know i dont think so, but i have not tried it"}
{"product_id": "B00DE2W4PK", "context": "DOES THE PS4 PLAY THE PS3 GAMES?", "response": "no it does not"}
{"product_id": "B00J6DLPLK", "context": "What is required to get Branch A in Drakengard 3?", "response": "There are 4 branches A,B,C, and D. You just have to play through the game once to get branch A. Then just play through a second and third time for B and C. You have to beat the lost verses and get all weapons for D."}
{"product_id": "B00F9RGFEY", "context": "Is it possible to listen to my mobile device without the aux cable? via bluetooth?", "response": "No. You must use the aux cable."}
{"product_id": "B00GJXMRX0", "context": "has anyone else had there pc completely shut down while playing assissins creed 4? mine does after about 25min. it has happened 5 times so far.", "response": "that's typically an issue of your power supply either failing or not supplying adequate power."}
{"product_id": "B00CHGYUE2", "context": "Okay what is the difference between the map pack version and the regular black ops two?", "response": "It just gives you 4 extra maps"}
{"product_id": "B00286BZ4Y", "context": "will this work on widows 7?", "response": "I bought it for my granddaughter. She has not found a computer that it will work on. So to answer  your question"}
{"product_id": "B00BU3ZLJQ", "context": "Can this be played offline? The person who I am buying this for does NOT have internet. Will he still be able to play the full game?", "response": "Good, I don't have Internet either."}
{"product_id": "B00DPQ6GPO", "context": "I did comment earlier but I would also like to ask: Is this controller good for quick scoping?", "response": "Hey yes it works am nt a big quick scope fan but it works good u can set it to fire rapid fire and scope at da same time wit one button"}
{"product_id": "B001MGNWDI", "context": "Is this stick durable? Can it tolerate stressful actions  like, trigger pulls under duress or a high anxiety turn?", "response": "I haven't had any trouble and no signs of it weakening on me at all its been overall the best one I have ever had"}
{"product_id": "B005LUUWL6", "context": "i have an older ds and just wanna make sure it would work if seems that it would but just wanna double check before i do", "response": "my son uses his on a DS lite"}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "I played it on xbox 360 and I think it's available for wii"}
{"product_id": "B00B0QONB0", "context": "Can you tell me your  actual experience about this HDD, ? How many time do you have one ? And,  still working ?", "response": "Yes I have it installed in my console. It works great!"}
{"product_id": "B00BQWTGIS", "context": "will it work on windows vista?", "response": "You should have no problems with using it on vista"}
{"product_id": "B00B98HF1O", "context": "Hi.  I have a US Xbox 360.  Will this play or it is locked to some other Zone", "response": "I bought my Xbox in Colombia (same USA region). I can not help in this part.  What I can tell you is that the game did not work at all."}
{"product_id": "B00519C7JC", "context": "What does Lto meanWhat does Lto mean?", "response": "It comes with an extra map Ascension for zombie mode and some for multiplayer maps but I dont care about that part. Zombies is already unlocked on this game"}
{"product_id": "B009O8HH3M", "context": "Is this compatible for xbox 360?", "response": "No it is not. If you are looking for a set that is compatible for the Xbox 360, I would recommend the Turtle Beach X12."}
{"product_id": "B004GZ2RCY", "context": "unlike the legendary WoW mouse that I just bought and had to return because it some how not compatible with win 8.1, so I guess my question is this?", "response": "Did you download the driver from steelseries? If you did then I would recommend going back to windows 7 since windows 8 blows anyway"}
{"product_id": "B004L5SJ4Y", "context": "It just goes repeatedly through first time set up.  I'm guessing that there is a patch out there that will solve my problem.", "response": "Sorry....I never got it to work on my XP machine with 4 gig of memory, AMD Phenom quad 4 processor, and nvdia video card."}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "Yes, I believe so.The cables that came with the product:One SPDIF to MixAmpOne USB to Mini-USBTwo \"Standard\" Aux cablesOne Aux cable with 3 and 4 \"black rings\"One 2-to-1 aux connector (for use in planes, I guess)"}
{"product_id": "B005YR1VP2", "context": "Does it require any thing else to work", "response": "Everything you need is in the box.  You do need to buy games, though. Enjoy."}
{"product_id": "B0049B2FP4", "context": "can the game install", "response": "I would buy the disk before installing it off of amazon"}
{"product_id": "B00BFOEY3Y", "context": "can this be used on a mac?", "response": "Hi Will,It can be used with Mac OS 10.6.8 to 10.8.x.Thanks,PCrush"}
{"product_id": "B005DKZSVS", "context": "What tricks did you use to get this to install on your computer? I had them running on windows 8 but had to wipe my comp. Now no luck.", "response": "all I did was install the drivers that came with it .I have installed on 2 different pc's both with windows 7 I have only had problems with getting them to work with music ..I have 2 sets of them on same pc and like i said had zero install issues"}
{"product_id": "B0076HD2W8", "context": "does it work under Windows 8.1?", "response": "We couldn't get it to work on our Windows 8.1 computer.  The disk is not usable, and the gaming receiver would not work on the computer."}
{"product_id": "B00DE2W5XG", "context": "the ps plus code is about how many time?", "response": "One years worth of online time"}
{"product_id": "B008SBZF2Q", "context": "WIll this work with xbox?", "response": "Yes, I bought this character for my son who has an the xbox version of skylanders."}
{"product_id": "B001E27DLM", "context": "it works on Nintendo 3ds?", "response": "It does, as do all DS games.However, 3DS games do not work on a DS."}
{"product_id": "B00DNHLFQA", "context": "do you have to make some stupid online account to play this game", "response": "Yes, this game is tied to Origin from EA unfortunately."}
{"product_id": "B00JM3R6M6", "context": "Can you play the Tomodachi Life on a regular Nintendo DS?", "response": "3DS games can only be played on a 3DS, 3DS XL, or 2DS."}
{"product_id": "B00BCEK2LU", "context": "Are the WASD keys textured or simply just a different shell color?", "response": "They are just a different color."}
{"product_id": "B008CP6Q6M", "context": "Does this game sold from the Official Amazon, will it include ALL Discs and DLC Codes? Alot of people have been complaining about missing games.", "response": "I think I got mine from Official Amazon and I got all my disks and codes. Everything worked great. If you don't get everything you can call customer service and tell them what your missing and you can return it and they'll send you a new one!!"}
{"product_id": "B007LQG9A6", "context": "does it work on a xbox 360?", "response": "yes but it glitches a lot and brakes easily get the real thing."}
{"product_id": "B00EADTVL2", "context": "will this work with a controller that has a silicone skin around it?", "response": "Yes it will as long as the silicone isn't too thick."}
{"product_id": "B00519C7JC", "context": "can you play it on the ps4?", "response": "no way this is a ps3 version ONLY, its a great great game, but violent"}
{"product_id": "B001AWBYRA", "context": "Can u play modded zombie maps ?", "response": "Yes, it works just fine. Even using Steam, it works perfectly."}
{"product_id": "B003VAHYQY", "context": "Anyone know if this is Linux Compatible? Is this controller Linux Compatible? Specifically I would like to use it for the Mupen64Plus emulator on Ubuntu. Thanks for any helpful response.", "response": "Yes, it works out of the box, highly recommended for any Linux distro: SteamOS, Ubuntu, Linux Mint, etc.  Great for games!  Works flawlessly with Steam and Steam games.  Not sure about ChromeOS or Android but I assume those include all the same drivers as every other Linux distribution does."}
{"product_id": "B00IYWV5HS", "context": "i hace a laptop dv6 i7 2.oo ghz, 8 gb ram, ati radeon hd 6770m, can play this game?", "response": "Please see the system requirements at the following link:https://support.wildstar-online.com/entries/31187868-System-Requirements"}
{"product_id": "B00006C2HA", "context": "what is difference doom 3 for 39.99 / doom 3 bfg edition for 15.99 ??????", "response": "with doom 3 you get doom 3 but with DOOM 3 BFG edition you get doom 3 and it's expansion remastered for HD displays and DOOM 1&2"}
{"product_id": "B007XVTR3K", "context": "does it have offline multiplayer", "response": "yes you can play with 4 players controller and you can add bots (bots are ai players)."}
{"product_id": "B00ARCWQOO", "context": "So....MLB2k13 is the last in the series?  No version for 2014 for xbox 360?  Do they at least update rosters for 2013?", "response": "In 2014, 2K games announced that the series had been discontinued, following the release of 2K13. In December, 2013, 2K Sports said they will be only focusing on NBA and WWE Games for now on and have no further plans to make any more MLB Games."}
{"product_id": "B000FQ2D5E", "context": "Can this be run on the PC?", "response": "No, unfortunately it's exclusive to the PS3."}
{"product_id": "B008CP6Q6M", "context": "Are DLC Vouchers still valid as of 5/13/2015 | May 5, 2015?", "response": "Sorry our copies are used. So no way to guarantee that have been unused."}
{"product_id": "B0041RR0TW", "context": "Do I have to set the buttons to play games like assassin creed 3 will this controller have already default setting just like consoles style", "response": "If the controller is in \"Xinput\" mode, then most recent games (Including Assassin's Creed 3) will already have the buttons set for you. :)"}
{"product_id": "B0007MZWQS", "context": "I want to order the new Sega. would like to know if it's sealed or not if not what is included in the box", "response": "It depends on the seller."}
{"product_id": "B007MJSZDQ", "context": ". 1.Does this work for any Batter pack or is it just the 2 given to you?", "response": "Hi, it works with any battery I have the original batteries and the 2 I received with the charger and they all fit in."}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "it gives you a steam key =]"}
{"product_id": "B007WPM9GO", "context": "I just want to confirm this works with the regular nintendo 3ds?", "response": "Not sure what you mean by \"regular\". I bought my grandson an Nintendo 3ds for Christmas and this cover fit just fine."}
{"product_id": "B0085VIILY", "context": "Does this come with a model plane? because the picture makes it look like that.", "response": "No it dose not I never got one out of the box"}
{"product_id": "B00EV4O8VS", "context": "Does this Bundle come with the Legend of Zelda Windwaker game?", "response": "Yes, but it is digital so you'll need an internet connection to load it onto the system.  I've seen more and more games going to this format at Gamestop.  My kids love the control pad with the runes!"}
{"product_id": "B0054JGGGY", "context": "Does this come with a bluetooth doggle or does the charging stand act as the receiver?", "response": "I use the charging stand as a receiver. It's plugged into the computer via USB. You can also use the cord for the receiver to directly plug it into the mouse. But yeah, not sure about the bluetooth"}
{"product_id": "B002TLTBN0", "context": "is this controller wireless", "response": "It has a wire that plugs into the Wii remote control. The Wii remote control is wireless though. The picture shows that it has a wire protruding from it."}
{"product_id": "B00EOPT5ZS", "context": "Is it possible to bind the Windows Volume control to this? One YouTube review said it cannot be done.", "response": "The device itself is nothing more than a keyboard controller. To do what you want to do requires a third party application to assign a macro function to control the audio volume with hot keys. Once this is established, then you could assign those hot keys to the foot board."}
{"product_id": "B0050SY77E", "context": "Will I have to have played 1 & 2 in order to follow the story?", "response": "No my friend, they are independent."}
{"product_id": "B00BGA9V2Q", "context": "is there a multiplayer mode", "response": "Yes it's co-op and you can play with up to 4 players online or offline."}
{"product_id": "B00IIHU44E", "context": "I want to know if NSA could spy inside my home thanks to the Kinnecht apparatus. Thanks.", "response": "Please try to ask serious questions, without bringing personal bias into it."}
{"product_id": "B001GIUWX0", "context": "do you need the wheel to play the game?", "response": "No. Not at all. You can just hold the remote control that comes with the wii sideways and still play. The wheel is just an accessory that gives you the feel that you are driving."}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "It's not the color, it's the fact it's coming from japan. It's not available in the us until septrmber"}
{"product_id": "B0097CUREG", "context": "Is a mouse required to play ?", "response": "no, if you have a laptop with thumb pad.  If you are using a desktop, you will need a mouse."}
{"product_id": "B002YVD3KM", "context": "Can you hook up two of the controllers for co-op games like contra?", "response": "You can hook up as many controllers as you want since they're USB. Supporting them depends on the emulator. There are some sports games that support up to 8 players, and I think most modern emulators even support those."}
{"product_id": "B00D96BMV8", "context": "Can you hear your voice in the headphones during chat, so you do not begin to shout?", "response": "Yes I can hear myself and everyone else fine."}
{"product_id": "B000YMQGWU", "context": "can this work on a ps2 logitech wireless controller?", "response": "I had no success with my Logitech RF wireless controller but that controller was spotty at best when plugged into a real PS2. It may work but it cant be said for certain."}
{"product_id": "B00DBKSN8M", "context": "Hello friend, I would like to know that quality is the PS3 has a defect ?", "response": "I bought the PS3 like 2 years ago. I believe that the slim version is the most trustable PS3 models. I've run heavy games like skyrim and GTA5 and haven't had any issues. Proper cleaning and ventilation is required in order to keep the console in good conditions since over heating may be given."}
{"product_id": "B004FS8LYK", "context": "How much hard drive space is needed for the ps3 version. It should say at the back of the case.", "response": "5.2MB. Hope that helps!"}
{"product_id": "B00BCEK2LU", "context": "Are the WASD keys textured or simply just a different shell color?", "response": "Just different shell color."}
{"product_id": "B00EM5UFEK", "context": "What is the xbox gold live membership?", "response": "Only way to play this game is to have membership. Allows you to play with others online. Costs ~50 dollars a year... Expensive but my sons favorite game by far"}
{"product_id": "B004HYIAPM", "context": "To activate you need a steam account, why/", "response": "I dont know when  I got it I tried for about a week and could not get the game to install properly  so I gave up I have not been able to get into the game or even play it so I quit trying"}
{"product_id": "B006JSY3MI", "context": "Are the controls for the PC version easy to use?", "response": "Yes, for the most part. W,A,S,D and later in the game, Q, F, and G are added (as you get more abilities). I had no problem playing with a mouse and these keys."}
{"product_id": "B00BCEK2LK", "context": "Can I use the wheel to click?", "response": "yes, very easily too"}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "Definitely.. I have the same problem but it's easily adjustable because all music players come with the option of balancing between drivers. So just go to your music player's settings and tweak to suit"}
{"product_id": "B00DPQ6GPO", "context": "Can all those mods work for online if it does i will buy it then just want my question answer", "response": "Well, Amazon sent me a different controller by accident but I'm sure MOST of the mods work"}
{"product_id": "B00I14395A", "context": "Do the rechargeable batteries 'really' only last 48-hours? (if so, then it's not 'really' wireless)", "response": "I go several days between charges..."}
{"product_id": "B00CX8VY4S", "context": "Is this game appropriate for my 12 yo son? Haven't looked into it yet.", "response": "No it's not, there's lots of cussing, and things most parents, at least good parents, would want to shield their kids from. Feels more like a college plus game. The more you allow, the more likely your child will vote for the next Barack Obama. Nobody wants that."}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "Long as your flat screen TV has RCA inputs it will hook up. I have a Samsung but it is about 7 years old. No issues using RCA inputs. Wireless remotes are the big issue. Stock up on remotes. Each systems games need to use that systems remotes unfortunately."}
{"product_id": "B00886XQO0", "context": "Will these work with the new Xbox E console, since the \"E\" does not have an optical connection?", "response": "Directly no, but if you have a optical out on your TV or Receiver you can run the optical into it, and get sound that will also let you use it for other uses. There is also a adapter from TB that will make it work as well."}
{"product_id": "B00292OW1U", "context": "The keypad to the left, can we use it to move the character about similar to the arrow keys?", "response": "Yes it works the same just make sure to download the right software from the steelseries website or it will only partially work"}
{"product_id": "B00GOOSORM", "context": "Does this time card add \"Crysta\" points, since Ultimate Game Card is already voided. Just wondering because I plan to world transfer.", "response": "Sorry to say no it will not."}
{"product_id": "B001ELWMHI", "context": "does it come with controllers?", "response": "No it did not come with controllers, just the console."}
{"product_id": "B008CXTW5G", "context": "How long is the USB cable?", "response": "I'm not positive but I have mine running from under my desk and through the back of desk and I can sit it in my lap and recline in my big mens chair is say about six feet but I don't have a tape measure"}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "Hi. This hard drive is for XBOX slim with 4gig hard drive internal. This hard drive is plug and play no cable is needed.  U need to unplug the power cable. They have a videos on YouTube show you how to it.  Holp that help Good luck"}
{"product_id": "B00B3PDHBU", "context": "Does it have a warranty?", "response": "Yes, it has a one year \"limited\" manufacturer's warranty, which is typical for electronics. However, because of the cost of the headset I would buy the extended warranty, if available. I purchased my headset at Best Buy and paid an additional 89 bucks (?) I think for 2 more years of warranty over the standard warranty."}
{"product_id": "B00BI9MDSO", "context": "why do half of the people say the vita 2000 fits, and the other half say it doesn't?", "response": "The vita 2000 will fit but there will be extra room in the case so it won't be as nice a fit as the 1000. I personally would wait to buy a case specifically for the 2000."}
{"product_id": "B00GPH7Y8S", "context": "I see some reviewers complain that the game does not work with Windows 7.  I have Win 7 32 bit version.  Will it work?", "response": "I have Windows 7 Professional on my laptop. The processor is an Intel core 15 and the game runs but sometime it takes a while to being each new game. Not a computer expert here but hope this helps"}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes it has screws on the sides which will remove the wrist rest.  I prefer it on though."}
{"product_id": "B00CMC6HCY", "context": "Will there be a Game of the Year edition released with all DLC included on the disc?", "response": "No sorry i would love one to happen but the game is not goty worthy."}
{"product_id": "B00B77OKNI", "context": "The controller shows up on my FireTv stick but will not pair. Anyone else run in to this? Anyone figure out how to fix it?", "response": "I had the same problem. I read somewhere that the app to connect the remote is no longer available & that the controller was useless. I'm not sure why they are still selling it."}
{"product_id": "B00BCEK2LA", "context": "Is the G 400 S the same size as the G400?", "response": "As far as i can tell the only difference is the pattern on the mouse. My friend has the G400 and they work and feel the same."}
{"product_id": "B004W1IX1G", "context": "Does this work with the Wii U?", "response": "Yes, it definitely works on the Wii U."}
{"product_id": "B003S9WJ9A", "context": "Do you need 2 xbox's to transfer? I want to move my games from my 120G HD to a new 320G", "response": "No. Just one. You attach the old hard drive to the connection cable and plug the other end of the cord into the new console. It will commence the operation automatically."}
{"product_id": "B004HYIAPM", "context": "Does it work on a computer with Windows 8.1 ?", "response": "Yes and it runs very well."}
{"product_id": "B00ATF5YYI", "context": "So if I buy this, I can put this code into steam, correct? and then it will be in my games library?", "response": "If you purchase through STEAM directly or have a valid STEAM code, you will need to download the game from your STEAM account (create one if you don't have one).  After the download is finished, the game will appear in your library and can then be played."}
{"product_id": "B008SBZF4Y", "context": "can this figure be played with other skylander games or just the skylander giants game only?", "response": "It can be played with Giants, Swapforce and Trap Team. It cannot be played on Spyro's Adventure. Like Pokémon you can bring previous gens forward but you can't bring them back in a game they didn't debut in. :)"}
{"product_id": "B009DYOPK0", "context": "Is there functionality to switch the DPI (CPI) on the fly? Such as a precision aiming button found on other comparable gaming mice?", "response": "Yes, you can switch the DPI with two of the buttons located under the scroll wheel."}
{"product_id": "B001COU9I6", "context": "Does it play PS2 games?", "response": "Yes, it plays PS1 and PS2 games. It has a built-in data/game utility setting that saves data from other playstation consoles."}
{"product_id": "B00ARD5410", "context": "how long is the mouse cord?", "response": "Its quite long. Close to 2 meters"}
{"product_id": "B00HS5FETM", "context": "I have px3. I hooked it up where my game in sound on the transmitter is connected to my headphone Jack on TV. why do I need this cable??", "response": "You don't its for ps4 to connect to controller"}
{"product_id": "B00GJSUUC0", "context": "please can anyone tell me if this is a blue ray CD or PSN code?", "response": "This is the disc copy."}
{"product_id": "B0056JPS84", "context": "My XBOX 360 drive is the DG-16D2S-09C and does not work, if I order the same model, I just have to switch it and my XBOX will work without any problem", "response": "You must remove the motherboard out of the new one and replace with the motherboard in your old DVD drive. The old one will be put in the new DVD drive case. The old one has all the licences and info that you'll need. If it's only a mechanical issue than this will work fine. Hope that helps."}
{"product_id": "B00CMQTVUA", "context": "Can you use the Kinect from Xbox 360 on the Xbox One?", "response": "I am not a 100% sure, buy if like the games and other hardware than no it won't  work"}
{"product_id": "B006JKARP8", "context": "Will this work with the new vita to be released on may 6th?", "response": "It should work just fine."}
{"product_id": "B005761IOY", "context": "Where do I find a copy of the Quick Start Guide to download for the batarang controller ps3 wireless", "response": "If you have any questions about it you can ask me. I bought this new and spent hours trying to work out the kinks to no avail."}
{"product_id": "B005VO5ZVY", "context": "Will this fit XL size?", "response": "No. It is only fit 3ds"}
{"product_id": "B00AAQRNQ8", "context": "Can you program one of the buttons (side button preferably) to drop the DPI to a specified level only while being held then back to normal on release?", "response": "4000 version also has a top botton that has an up and down end to cycle through your preset DPI settings."}
{"product_id": "B00DC7G3Q8", "context": "Is this for handheld Nintendo?", "response": "This was for my granddaughter.  I was only referring to the item as being age appropriate and it looked like fun.  The PS3 is the only Nintendo she has, to my knowledge.  Hope this helps."}
{"product_id": "B002I098JE", "context": "is it split screen", "response": "The story mode is only for 1 player but going against each other in multiplayer is split screen and only for up to 2 people."}
{"product_id": "B009DYOPK0", "context": "Can the LED's be turned off completely?", "response": "Yes they can. In the settings you have an option to change the colors, the way it pulsates, and also just turning them off completely."}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "Nope the space is just nice for the vita"}
{"product_id": "B00001LDCK", "context": "does it work on Windows 7?", "response": "Yes it does,  You may have to tweak a little.  but I installed and was able to run it"}
{"product_id": "B009CL6LA6", "context": "Are these Headphones over ear or on ear?", "response": "They are over ear. If they were on ear they would be a hassle"}
{"product_id": "B005D5M1P4", "context": "Should I get it? I have the wireless mic I use but I mean is this worth the money? Is it wireless?", "response": "nahh these are not wireless it all depends on what ur looking for if ur a hardcore gamer then sure i would buy them turtles beaches are top nothc headphones the only thing keeping them from being the is that they are made with cheap plastic even the expensive ones"}
{"product_id": "B00503EAG2", "context": "How long does this take to install complete?", "response": "The whole complete process is about 2 hours depending on internet speed and laptop"}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "It will fit if you have a big head, but it will be uncomfortable if you have big ears."}
{"product_id": "B002BSA20M", "context": "can this be played online with friends", "response": "Yes it can you can play a four player co-op and up sixteen players in a multiplayer match"}
{"product_id": "B00BGAA0SU", "context": "Tomb raider, this or watch dogs", "response": "All three games are awesome. But if I had to choose,  I would choose Infamous: Second Son"}
{"product_id": "B009WI7V9E", "context": "Does this game come with all of the DLC stuff for the first two games?", "response": "Ya it comes with all dlc and a special surprise for bioshock infinite"}
{"product_id": "B00E369SDM", "context": "Does this PS3 have a disc drive to play game discs?", "response": "Yes it has a disc drive but the memory is limited for a hard core gamer external hard drive may be needed"}
{"product_id": "B003O6JJKY", "context": "is it working good?", "response": "Yes but I had to order a cord to charge the batter pack cause it didn't come with one, just the battery pack"}
{"product_id": "B0073QM45I", "context": "This cable works without having a battery? I mean, It will charge my controller without a battery inside?", "response": "yes the cable work with out the battery, plus it keeps your controller on with the charging cable pluged in the controller. but it wont carge your controller on it own with out charging battery that is attached to the controller, it would need a charging battery that can be charged to keep the controller on and active."}
{"product_id": "B0097CUREG", "context": "why cant i play this game on kindle ? Is there someway that i could ?", "response": "Paul, wish that was an option, I have the Zeus II and it will only play on my computer when a disc from EFX is inserted (it doesn't have to be specifically that disc)"}
{"product_id": "B00F27JGVA", "context": "I have one 8GB card and one 4GB card, with same PSN login. How do I copy all contents to this card?", "response": "Once you hook your vita up to the PC it should prompt you to install the content manager program. Using that program you can copy the data from the memory card to your PC. Then insert the new memory card into the vita and copy the data onto the new memory card."}
{"product_id": "B00AYBKQRW", "context": "will this work on a sharp confort touch window a/c", "response": "You need to find model # on AC Unit then Google Model # remote unit to see determine which ones will work. just providing the name doesn't go far enough"}
{"product_id": "B003O6G5TW", "context": "what disc region is this game?", "response": "This is NTSC (i think that answers your question right?)"}
{"product_id": "B00GZ1GUSY", "context": "Do you have to have internet to play this?", "response": "You don't have to have Internet to play the story mode, you just need the Internet to use the online features"}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "Yes, you can play offline"}
{"product_id": "B00CX9L30W", "context": "I have a question, even if this is an MMO, does this have a universal goal?", "response": "Yes, it's got a universal goal to stop an opposing force"}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "It is not multiplayer on the PC. The next game in the series is promising to be"}
{"product_id": "B00DPJBTM6", "context": "Does it come with everything? mixamp and all?", "response": "No that's going to cost you more but if if you do want to get everything you can buy bundle with the mixamp and headset"}
{"product_id": "B002L6HJCI", "context": "Could you tell me if this comes with all expansions for Age of Empires 3?", "response": "It comes with the asian dynasty expansion the Indian Expansion and the main game."}
{"product_id": "B00FLZ4FS2", "context": "Can I use this code on my Xbox one and on our xbox 360 in the home or is it an either or code?", "response": "It's one code. You enter in to the xbox 360 and it downloads, and then you go I cod ghosts in the Xbox one store and it will be free. So you get both versions"}
{"product_id": "B00CD90R72", "context": "What about the teams from Argentina, Colombia or Brazil, are there in this game ???", "response": "Yes they do, is limited number of International teams, but I'm not so sure on Colombia national team."}
{"product_id": "B003VUNWG0", "context": "it wont download on my windows 7", "response": "my only suggestion is to double check on your security systems.perhaps your anti malware or virus or wall is putting a halt to the download.other than that? it could be a bum disk."}
{"product_id": "B00EWEHI5K", "context": "Is there basic support in linux?", "response": "I am not sure if Razer Synapse is available for linux. I am pretty sure that you CAN use it on linux, though, but I have never tried to configure it (change dpi, etc)"}
{"product_id": "B002CZ7P04", "context": "I have a problem with the contoller.  When I am in the menu for pause/save, etc., the controller arrow floats and I can't control it.  Does anyone else have this problem?", "response": "I'm sorry I can't help you.   I haven't had that problem.  Good luck."}
{"product_id": "B00J128FPA", "context": "If someone has already been playing the game as standard on ps3, will they get the collectors' edition bonuses if they upgrade to it on ps4?", "response": "Yes, it will be in you mail in the gm"}
{"product_id": "B000TLU67W", "context": "can it play the ps1 games like the ps2 original did?", "response": "Yes, that's the reason why I bought it. After buying a PS3 and not being able to play old games, I had to find another PS2."}
{"product_id": "B00I14395A", "context": "Is there any noticeable latency when using the keyboard?", "response": "I am just using this and yes, I do find it a wee bit laggy compared to my MX5500. The wheel on the mouse also have a rollback effect.."}
{"product_id": "B00B77OKNI", "context": "Since this is Bluetooth, will it work on a pc or laptop with bluetooth?", "response": "It might have worked in the past. It probably won't anymore with Win7. Haven't tried Win8."}
{"product_id": "B00ATF5YYI", "context": "will this play on win8", "response": "yes it will play on 7, 8, and 8.1 any problems with the game will not be operating system related."}
