{"product_id": "B003VAHYQY", "context": "Does this controller have X-input capability?", "response": "Yes it does. X-input as well as direct-input."}
{"product_id": "B00A878J5I", "context": "My son damaged the original charger cord for the Wii u pad , the one that comes with the system . Will i have to replace it now that Im buying this?", "response": "Well this item will charge the wii u game pad and wiimotes alone or at the same time.So No... Unless your talking about the USB cable, that can be plug in to the machine and keep playing while charging."}
{"product_id": "B008TP1OKI", "context": "Can this hard drive recognize original xbox games, most aftermarket HDD's don't", "response": "My son got this and he said he's not sure, but probably."}
{"product_id": "B001CXYMFS", "context": "How long is the USB cord?", "response": "The cable is 100 inches long."}
{"product_id": "B0050SZE2G", "context": "Whats in the box? Just the game? If thats the case will it better to download it?", "response": "as per the warehouse: the game. i can not tell whether there are instructions but, nothing else special. it's up to the buyer. some people still like having a tangible item to put on their shelf.  best, iwd"}
{"product_id": "B009O8HH3M", "context": "Will this fit my 12 year old son?", "response": "Yes, I purchased one for my 14 year old son to use with his gaming PC. He likes it, says its comfortable and its adjustable."}
{"product_id": "B009K7QB8O", "context": "WIll this increase my no scope abilities?", "response": "Only if you are a man 360 no scoper"}
{"product_id": "B000RT2868", "context": "Is this for xbox 360 controller??", "response": "nope. original xbox only. 360 controllers do not need any adapters to work with windows OS."}
{"product_id": "B00ENFVS5Y", "context": "Is there a version of this wheel to avoid?  I heard some of the earlier batches had problems.", "response": "Yes. I believe the early ones had problems with the motors. Mine has worked wonderfully. Love it no problems"}
{"product_id": "B000TKH6H6", "context": "does it play on mac osx10.6.8?", "response": "Yes, Hoyle 2008 does, but I'm not sure about other editions."}
{"product_id": "B00H8NS1K8", "context": "How well does the microphone pick up noise from the keyboard? I use a blue switch mechanical keyboard.", "response": "I got no complaints about my keyboard clicks. I have mechenical keyboard from razor it's a black widow"}
{"product_id": "B006JSY3MI", "context": "If I buy the download version would I be able to play? Reason I'm asking its because I'm in Japan, and I cannot buy it from Steam. Thank you", "response": "I actually bought the DVD, but it does require a Steam account to play.  Once I got onto Steam, I saw that it offered the download version.  So, although I can't be sure, I think you could download the game to play through Steam."}
{"product_id": "B000VBFWAG", "context": "what computer did you use for this game, brand and version.", "response": "I bought it for a friend, its an hp I believe."}
{"product_id": "B00BGA9X9W", "context": "Are the sticks confortable to play with? Meaning it won't slide my thumbs by mistake like with the DS3?", "response": "They are very comfortable to use."}
{"product_id": "B00CHGYUE2", "context": "Is the Map pack included within the game or is there a code included?", "response": "There is a code for the extra maps.. Also just an FYI you should get the New nuketown with it.. :) Hope that helps.. Best of the call of duty if you ask me.."}
{"product_id": "B00EI4V3FU", "context": "How come I just bought this headset and it does not work on my PS4?", "response": "I don't Know, when I bought it. It  was working fine maybe you got  a one that wasn't working right. If you can try 2 take it back an exchange for another one."}
{"product_id": "B007CM0K86", "context": "Do it has scary zombies?", "response": "No, but they are scary to beat when they outnumber you 4 to 1. That's what makes it fun!!"}
{"product_id": "B00H72EMP8", "context": "IS THIS HEADSET WIRELESS?", "response": "No. If you're using the PS4, it plugs in the wireless controller."}
{"product_id": "B00CTKHXFO", "context": "Does it include MGS: Twin Snakes?", "response": "kind of. It includes Metal Gear Solid 1. Twin Snakes is a remake of this game made specially for the game cube. MGS1 includes the same storyline and characters as Twin Snakes"}
{"product_id": "B00F27JN8Q", "context": "Can I plug a Skylanders portal into the USB slot to remote play from PS4?", "response": "No it has to be plugged into the ps4 for it to work."}
{"product_id": "B0098EVZZ8", "context": "New to all of this...can you use on PS3?", "response": "Not sure. I bought it as a gift."}
{"product_id": "B0050SYR74", "context": "Does this have a jack to plug your own music into?? Thanks..", "response": "It has the red and white LR audio inputs on the base stand. You'll need to get a 3.5mm to RCA cable to plug an iPod or something with a headphone jack in. If your PC has an optical output you should be sweet for that, though"}
{"product_id": "B0086V5UF0", "context": "will this work in South America?", "response": "Yes. Ritms are easy to get into and like them."}
{"product_id": "B002I0K3PM", "context": "Is this game free roam like other Lego games?", "response": "Yes, its free roaming like Batman 2. You can explore the city as yu wish or follow the story.  There is a lot of back tracking within the city because you need some specific abiliies to accomplish tasks."}
{"product_id": "B00DHUUTEM", "context": "Is the clicking on the keyboard quiet?", "response": "It isn't silent. The keys have good built-in resistance to spring back-up, which I like...but it does make some noise. Not as bad as the old IBM model M or something though. It is loud enough that you notice it when you are typing, but not so bad it bothers someone elsewhere in the room watching TV."}
{"product_id": "B00A0EPNPI", "context": "Is it a mechanical keyboard?", "response": "No, it is the membrane keyboard"}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes, it will work perfectly."}
{"product_id": "B000GCJ6MK", "context": "Is this an expansion kit, or is the full FSX installation? This price on this way cheaper than the Gold and Standark packages I see for sale here on A", "response": "X-Plane 10 Regional North America - PC=== cheaper than the -8/64 version of MSFX and 1000x more realistic"}
{"product_id": "B0011E4J7O", "context": "Can I use this with a wireless controller for PC with a AA battery pack?", "response": "No. Pc controllers do not have a plug and play slot which is located  at the top center of the contoller. Just a usb connection."}
{"product_id": "B007TMFD7C", "context": "Obviously for adults but what age would you recommend in youth?", "response": "Youth could use this equally as much. There are many levels to it. You can still just add some power and fly around, just turn down some of the realism and crash options and go to town!"}
{"product_id": "B00005QEFD", "context": "Does your system come with all the cords and controller?", "response": "This system does not come with the cords or controllers; it is ONLY the cube. The cords can be purchased fairly inexpensively from eBay or Amazon - I purchased cords for $12, including shipping and handling from eBay."}
{"product_id": "B00074TQFO", "context": "Do the pieces lay in the position that they fit together, so you don't have to rotate them. Does it have a back ground picture so you can tell if things are fitting together right.", "response": "yes to both.  no need to rotate.  If I recall they even click together and stay put together.  You can have a shadow like photo in the puzzle field to help place your pieces or you can have a small box/window up of the photo being worked on."}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "you can moved them where you like, were its comfortable to you. the g27 are 3 separated pieces. pedal, wheel and shifter. so either left or right side will work."}
{"product_id": "B00AJILG1K", "context": "This is labeled as a 901 but does not have the US key layout pictured. If I order it will I receive the proper keyboard?", "response": "As long as the model number is ROC-12-901, it is the US Layout. You can verify model #'s and foreign layouts here: http://www.roccat.org/Products/Gaming-Keyboards/ROCCAT-Isku-FX/#crb_4. Btw, it's an awesome keyboard, very pleased with it, but I do wish the control keys top center were also back-lit. Good luck."}
{"product_id": "B008KH7NZA", "context": "Stream quality? Is the mic sound quality good enough to stream with? Im considering these or blue yeti/snowball but id prefer no stand on my desk", "response": "The mic is decent however unreliable, the headset is not great quality. I've had two randomly stop working. On materials being poor quality. Invest in Astro's."}
{"product_id": "B0050SVHZO", "context": "Does it come with the gamepad?", "response": "Yes it comes with a pad with controls and a screen but it does not come with motion controllers for the sports games that are part of WiiU Sports Club."}
{"product_id": "B00C7103DO", "context": "Any word coming down the pipes of a special edition that will include all DLC and such, like the last two?", "response": "Not sure, it's up to Warner Bros. Games Montréal"}
{"product_id": "B009RXUOD4", "context": "Can I use this by connecting it directly into my ps4 controller", "response": "Yes that's what I do"}
{"product_id": "B00006HYLN", "context": "Is the shifter manual or automatic? Thx", "response": "Push forward for up, back for down (and it has paddles behind the wheel too)SO 'Semi Automatic' ...ie there is no clutch....and its just back and forward...it doesnt have 'gates' like a manual stick in a real car..."}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "It is just the DLC's."}
{"product_id": "B00BCEK2LA", "context": "how does its size compare to the G502 Proteus Core which I've seen at Best Buy? My grandson is 14 and wants a little bit smaller mouse than some.", "response": "Hi.  From the Amazon & Logitech pages it would seem that the G400s is larger but I've not seen or used the core mouse, so I'm not an expert.  Good luck!StephenG400s Dimensions:  5.3 x 2.2 x 7.6 inches ; 10.2 ounces http://gaming.logitech.com/en-us/product/g400s-optical-gaming-mouseLogitech G502 Proteus Core Product Dimensions:  1.6 x 3 x 5.4 inches; 5.9 ounceshttp://gaming.logitech.com/en-us/product/g502-proteus-core-tunable-gaming-mouse"}
{"product_id": "B008SBZF4Y", "context": "can this figure be played with other skylander games or just the skylander giants game only?", "response": "Giants and newer, which include swap force and trap team"}
{"product_id": "B00GOOSORM", "context": "Does this time card add \"Crysta\" points, since Ultimate Game Card is already voided. Just wondering because I plan to world transfer.", "response": "This game card only adds game time, it doesn't add crysta."}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "Yes i use it on my macbookpro you just can't use the cord extender that splits it into a microphone jack and a headphone jack u just have to plug in the one original cord"}
{"product_id": "B003Y5AHPG", "context": "Do I need to buy any additional controllers to play any particular gaming system of the three", "response": "You shouldn't have to it comes with controllers that work. I have the old school controllers from my original consoles."}
{"product_id": "B000FRU1UM", "context": "THIS IS THE FULL GAME OR IS A DEMO ???", "response": "full game i ordered this game didn't like it all that much lots of swearing in it. Just warning you"}
{"product_id": "B009M72E5Q", "context": "Could someone tell me hat is the difference between wii sport and Wii Sports Resort? Can i buy wireless controller separately to play the cubegame?", "response": "Wii Sports Resort is kind of a sequel to Wii Sports, has a ton of new and great games in. You can not play gamecube games on this version of the system, no matter what."}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "I have win 7. But with the software it should support Win 8. The box says Vista and Win 7."}
{"product_id": "B004L6C6BK", "context": "Is this the 2013 version because the review pictures show it as a 2011 version?", "response": "Its the 2013 version"}
{"product_id": "B00KAI3KW2", "context": "If I get this without the Kinect, can I buy a Kinect and add it on later or am I stuck with the Kinectless version?", "response": "Yeah. They are supposed to release it separately. That way you can add it later. Maybe they'll bundle it with a game like the first one."}
{"product_id": "B00IYWV852", "context": "Will I be able to redeem the code for the deluxe version after June 3, 2015? Not going to be able to download the game, or register, for 5+ months.", "response": "Considering Amazon keeps your game codes attached to your account, I don't see why you would not be able to download at a later date. I bought the digital version of FF14 from Amazon and was able to download it to my new PC about 6 months later. Also, did you mean 2014?"}
{"product_id": "B002LMX5ZW", "context": "will this game work with windows 7", "response": "I am afraid not. I have windows 7 home edition 64 bit, and this operating system does not recognize the program. It did not load in my machine. It might possibly load in a 32 bit environment, but someone with this OS will have to comment."}
{"product_id": "B001EYU1WS", "context": "Does it work with X-Plane 10?", "response": "Well I had the hardest time, it seems that the automatic instalation plugins don't really link it to the sim if they offered a cd or sd card install I'm sure it would work but try it and please let me know maybe there is something missing in my computer."}
{"product_id": "B00AR1LX9O", "context": "what is the battery life for this product?", "response": "I use this at work, every day, for 8 or more hours a day without recharging. I have no idea how long it exactly lasts but it has never been a problem so far."}
{"product_id": "B00GG4BBUM", "context": "How do you get the controller skin?", "response": "If you preordered the game Amazon emails you a code to go on skinit.com to get it."}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "Yes it will play on win7 64 bit that is my operating system. You may have to tweak the setting in the game itself a little but it doesn't affect the game. Runs great on my pc."}
{"product_id": "B0041G5SD8", "context": "Why did you guys make it so hard to do ANYTHING with this game OR steam?", "response": "What specifically are you having trouble with?   I have found the game to be very playable and steam to be a good resource."}
{"product_id": "B00CD1FC6G", "context": "Is the wrist-rest removeable?", "response": "The wrist rest is easily removable. It's held on by four small plastic tabs attached to the wrist rest. Be aware these tabs are weak and can easily break off."}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "No.  It is great on a regular tv."}
{"product_id": "B000266786", "context": "will this run ok on windows 8?", "response": "I couldnt get it to run on my windows 7...kept freezing and locking up the computer.  Don't know if I had a defective disc or what but I ended up sending mine back."}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "They connect directly to the system and your television. I use PlayStation. Hope this helps!"}
{"product_id": "B00BS520SG", "context": "I cannot get the turbo light to stop blinking. This device is useless in Wii U mode. Tried tapping the button twice to erase settings but it wont?", "response": "You need to use an original wiimote with the mayflash adapter. If you are using the wii motion plus wiimote the light will continually blink and the controller will not work."}
{"product_id": "B003V4AK8E", "context": "are the triggers switched on this controller like how the 360 cont is, that is the only reason I'm looking to get one?", "response": "Triggers are the same, a bit bigger overall but the same layout"}
{"product_id": "B00IIHU44E", "context": "Does XBox One absolutely need internet? Or can it be used offline because my internet isn't the best.", "response": "It needs the internet to download and install the initial update that allows offline functionality, but after that, it doesn't require an internet connection. I tried searching, but found nothing to suggest that any consoles are yet shipping with this update already pre-installed."}
{"product_id": "B00EZPCWWA", "context": "Can the 2DS take a beating? How durable is it exactly?", "response": "I have 2 children that have 2DS 12year and 10years old. They take them every were.  The game cards and the styles are hard to keep track of. But they seem to keep going."}
{"product_id": "B0050SZ0SY", "context": "Do family settings exist for the PC version to eliminate the bad language?", "response": "Not that I'm aware of.  The other consideration is the violence.  There isn't tons of gore, but the nature in which you eliminate enemies can be pretty graphic and intense depending on the maturity level/age of the player."}
{"product_id": "B009AGXH64", "context": "Can I use the original Wii controllers (The ones that are NOT \"plus controllers\") with the Wii U?", "response": "Yes you can use all wii controllers im not sure you can use the old pro controller at the moment because its a gamecube plug but when the adapter comes out you can use it if you have it of course. but yes you can use any wii controller you have :)"}
{"product_id": "B00CMQTVUA", "context": "Does the xbox one only support hdmi?", "response": "No do not do this I did it and the adapter did not work even if it did convert it over"}
{"product_id": "B009LGO88E", "context": "does it work for the american 3ds xl", "response": "Yup. I use it on my Zelda collector's Edition 3DSXL when I play Monster Hunter."}
{"product_id": "B001AH8YSW", "context": "will this work with windows 7", "response": "yes it will. But on my pc it would not run until I got the updates for the game, then everything was good."}
{"product_id": "B007OVHW90", "context": "what size is the input 2.5MM?", "response": "I'm not sure of the exact measurement but it fits into my Xbox controller just like the one i replaced"}
{"product_id": "B00J128FPA", "context": "Do you have to be logged into PSN and what about the game patches issued every two months or so?  Will you get those?", "response": "Yes you must be logged in to PSN to play. Yesterday, during the Destiny beta, PSN went down and I could not launch the game. Patches are pushed along side the PC version."}
{"product_id": "B0017KIBAI", "context": "Is this the type of plastic that will turn yellow after a long time of use?", "response": "I don't know mine is pretty new.  I hope it doesn't"}
{"product_id": "B004H7P0B6", "context": "Is this just one piece or is there a rubber attached to each piece that is removable?", "response": "well, the rubber DOES come off, and unfortunately relatively quickly. I've used these replacements and the suck moderate dick. Best case, cannibalize old broken controllers with good sticks. all you need is the tiny screwdriver"}
{"product_id": "B00F2ENJY8", "context": "HD Possible?  Or at least widescreen?  or does it lock you into 480i?", "response": "Yes it is possible but just with component cables, wii is not hdmi compatible"}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "There are so many different breeds of dogs that you can train is insane! I use some of the tricks that I learned from this game with my dogs"}
{"product_id": "B00DE2W33I", "context": "Hello!! Can I use this PS4 in Italy?", "response": "Sure, just remember u need high speed Internet for updates."}
{"product_id": "B005FMLZQQ", "context": "When playing Recorded TV, how do you stop playing? The old remote had a \"Stop\" button it seems to be MIA.", "response": "Press the play/pause-symbols button to stop (pause) the recording playback; press the back button to return to the Recorded TV screen, and back again to return to the main media center screen."}
{"product_id": "B00AJXEYOG", "context": "Do you have a list of games", "response": "hi...all you have to do is go to masquepublishing.com and click on the game scroll down the discription and it list all the games....good luck"}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes, its a fighting game."}
{"product_id": "B00AXI9WFS", "context": "what is the difference between xbox 360 and xbox one infinity starter packs", "response": "Xbox360 and Xbox one are different gaming systems so the software to run it would be different."}
{"product_id": "B008KH7NZA", "context": "Does this work with the Xbox One? I bought the Chat adapter and I get game audio but no chat. I also updated the controller.", "response": "No it only works with PS3,4 and Xbox360"}
{"product_id": "B00GPH7Y8S", "context": "Does this game require online subscription?", "response": "No, online subscription isn't required or to my knowledge even available."}
{"product_id": "B00DC9T2J6", "context": "My son really wants this game but M rating isn't going to fly with Mom. Is there a way to turn off blood / gore for PC version?", "response": "In the video options turn \"rag dolls\" to low. This will put a lower strain on your CPU and make the bodies less graphic. You still might not find it suitable but it's an option."}
{"product_id": "B00CMSCTA2", "context": "can i play on mac", "response": "There is a way, you can use wineskin and even play with friends on steam. Its not as smooth but totally playable."}
{"product_id": "B00965WK8K", "context": "How is the middle click (scroll wheel) on this mouse? Stiff? Light? Is it easy to click without accidentally scrolling at the same time?", "response": "The middle click is solid.  It's wont accidentally click while scrolling.  It's not stiff either.  It's feels really good.  I should tell you though that if you are using Ubuntu you will need to remap the buttons i.e. sudo gedit /etc/X11/xorg.conf as the Windows button mapping won't work out of the box for Linux."}
{"product_id": "B00009TW6R", "context": "Hi, can someone please type out the PC requirements for this game? I love Halo multiplayer, so I'm going to buy a PC just for this.", "response": "all computers will play this game its quite old,any computer 2000 and newer"}
{"product_id": "B00HGAWFJG", "context": "How high is the ps4 with stand attached (exact figure please)?", "response": "11 1/2\" from bottom to top"}
{"product_id": "B004UJNN5G", "context": "do you need to buy the sims 3 before this?", "response": "Yes, you must have the base game before installing this expansion pack."}
{"product_id": "B00AR1LX9O", "context": "Can I use these on a plane to listen to my iPad music or the free TV they have on the plane?", "response": "In fact, no.  They require a transmitter to your computer or pod with USB power from a wall socket to it.  The headphones are great at home only, or with power and a laptop on a Wifi hotspot."}
{"product_id": "B000LQ4HTS", "context": "How easy are the Profiles on the X52 Pro to program in the software?", "response": "It's pretty intuitive, and there are tutorials on line. Be sure to use the software from the website though, and not the CD version that comes with the stick."}
{"product_id": "B003NVMEVQ", "context": "Does this have good grip when your hand sweats? Or should I go for the original Razer Abyssus?", "response": "I haven't had any issues with my hand sweating with this mouse. Has the hard plastic shell instead of the rubbery feel of other Razers."}
{"product_id": "B0009WPZOA", "context": "Does this game have offline multiplayer (splitscreen)?", "response": "Yes. Its fun and you can use your cars from your career to race your friends in"}
{"product_id": "B00005NIMA", "context": "This joystick is more \"precise\" than thrustmaster T16000 ? need to calibrate when connect ?", "response": "Im have never tried the trustmaster t1600 but in windows xp you do not have to calibrate this for it to work good."}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "Yes. It came in the original Microsoft box and everything."}
{"product_id": "B0049B2FP4", "context": "Why doesnt the LA mod work?", "response": "It does, read the manual it comes with on installing the mod. They have a PDF on how to"}
{"product_id": "B0050SVHZO", "context": "Is the Wii U backwards compatible with Gamecube Games and the Wavebird Wireless Gamecube controller?", "response": "It's not.....only the original Wii was compatible"}
{"product_id": "B00CRL9TU2", "context": "I recently had to give my GT5 disc back to my friend and was wondering if GT6 was worth the extra 20 bucks. And is it more realistic then GT5?", "response": "if you want to race online against other racers (not the computer which is really easy to beat) then that is the only way to go. Is it worth it?  yes, Your driving skills will improve as long as you learn and apply the basics."}
{"product_id": "B00B15EXJC", "context": "can I use in mac?", "response": "I don't know, I don't have a mac."}
{"product_id": "B00D6PTMB4", "context": "Is this a single player only game, or can two people plug in and play together?", "response": "Two players as long as you have two cables and two electric guitars"}
{"product_id": "B002I098JE", "context": "is it split screen", "response": "Yes the multiplayer is 2 player split screen and you can also play online multiplayer on one TV with 2 people split screen."}
{"product_id": "B00CH923NE", "context": "Is this game better than Mario and Luigi 'Bowser's Inside Story'?", "response": "It's a lot of fun. Equal to Mario and Luigi browsers inside story"}
{"product_id": "B00CPS59CE", "context": "I have a feeling its a really dumb question to ask, but does it come in the original box of the headset or another box? Im just kinda curious", "response": "I bought mine clearly marked as \"manufacturer refurbished\" and they came in a white box (non descriptive). All of the instructions, cables, and parts were included and each were in plastic bags, but there was nothing that was branded, as far as the packaging goes."}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Yes, it does. And I would like to add that whenever I turn on the mouse, it is detected almost instantaneously. Very impressive. Battery life is very good as well. And I am using 1000Hz polling rate."}
{"product_id": "B0000695GX", "context": "What version would work best on win 7?", "response": "Windows 98/2000/Me/XP will all work with a windows 7 computer"}
{"product_id": "B0017KIBAI", "context": "Does this controller have more of a glossy feel like the original gamecube controllers, or is it more matte like the Smash Bros edition controllers?", "response": "Glossy like original. I've got all three plugged in to my Wii U, and just compared them. It is pretty hard to tell the difference, but finish on this controller looks/feels most like the original game cube controller."}
{"product_id": "B003NVMEVQ", "context": "does it change colors", "response": "No sorry it stays the same color."}
{"product_id": "B005EOOT90", "context": "Is this also compatible with PC?", "response": "No, 360 only. Go for razer"}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "The games were designed with XP in mind. Maybe try running in XP compatibility mode. It seems a stretch, but also make sure you laptop is graphically powerful enough to run it, although my ancient 5 year old Win 7 box runs it perfectly fine."}
{"product_id": "B00D6PTMSW", "context": "I have an xbox360 with only 4gb of hard drive. Can this game be played directly from the Disc without requiring game installation in the hard drive?", "response": "Yes it can. At least I never installed it. You will need memory to save of course."}
{"product_id": "B009AFLXJS", "context": "how does this connect to the gamepad?", "response": "It doesn't.  They're both just controllers."}
{"product_id": "B00BI9MDSO", "context": "Will this case get re-developed for the slim model?", "response": "Yes it will. The slimmer model may fit will a little space because the original fits too snug. But they will redesign."}
{"product_id": "B00DJYTGYU", "context": "Does this controller have sixaxis support? Thanks", "response": "Unfortunately, no.  As far as controllers go, it has no advantages over the original PS3 other than comfort but even that is dashed because the tiny shoulder buttons sometimes pinch fingers."}
{"product_id": "B00FYMTUQY", "context": "My TV is curved and is mounted about 8' off of the ground.  Are you able to adjust the direction the Kinect points while on the stand?", "response": "Curve shouldn't be a problem.  The kinect can be tilted up and down there is a hinge"}
{"product_id": "B0032MO77U", "context": "will these work on windows 8?", "response": "I am not quite sure. That is all I know."}
{"product_id": "B00DCBDNW6", "context": "Can the PS4 version play cross-platform with PC?", "response": "Yep, and with the PS3 version too! Just make sure you're on the same server (known as \"Worlds\")."}
{"product_id": "B0038PBF1W", "context": "is this just a simulator or does it have arcade play options", "response": "Would not play on my XP. I was sadly disappointed as I have been looking for a mouse only controlled WWII flight game a long time and several dollars. The only one I have found, some time ago, is air conflicts by 3-D People developed in Slovakia I can't find them again."}
{"product_id": "B008XHCLFO", "context": "Is everything properly aligned and easy to access like buttons and holes for the charging port and stylus holder ?", "response": "Yes, it fits everything well. No other case can be under it. The stylus can be hard to reach since a hole has to be cut through the hand grip. It has been great; my only beef is the bottom half - the top edge along the back doesn't stay in place but it doesn't really affect anything."}
{"product_id": "B00H7KDNBO", "context": "Can I play when I'm offline.", "response": "Nothing to do offline :("}
{"product_id": "B001NT9TK4", "context": "has anybody tried this in ps4/? does it work", "response": "With an additional hardware (converts input to XBOX and PS4 to work ) , YES! Here is the link of the product you need to buy. CronusMAX New VersionAnd also here is the video which shows how to do that. https://www.youtube.com/watch?v=j4wpEGLMp0sGood luck!"}
{"product_id": "B00HK74G2E", "context": "Blue 250gb PS3 font is 120/240v?", "response": "Both 120&240V is OK"}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Mario Kart 8? And Bayonetta?", "response": "Yes it is. I used it to play through Bayonetta."}
{"product_id": "B00562O78S", "context": "normal tv functions? for example, can i also have my xbox360/wii hooked up to this?", "response": "so i can hook up an xbox 360/blu ray player/dvd etc....but no tv tuner obviously.how many hdmi hookups?"}
{"product_id": "B00DC7G0GG", "context": "Do you have to use the gamepad if you are playing single player?", "response": "Some areas of the game require the gamepad. When you encounter those areas, the game will tell you how to switch controllers."}
{"product_id": "B000YMQGWU", "context": "can this work on a ps2 logitech wireless controller?", "response": "if you can hook up any ps2 or 1 controller in it, it should work."}
{"product_id": "B000ND3XXA", "context": "I know this is meant for a computer, but would it also work with the Wii U possibly?", "response": "I highly doubt it. But if you're looking to use a GC controller with the Wii U, you're in luck as Nintendo announced they'd be producing an adapter of their own in the near future."}
{"product_id": "B00B98HF1O", "context": "Is this the Avengers?", "response": "Not really its just all marvel super heros pretty awesome game tho!"}
{"product_id": "B00DNGQQUQ", "context": "is this in english?", "response": "It has both the English and Japanese dub as options. English being the default, so yes. Yes it is."}
{"product_id": "B001B5U80K", "context": "I have a Netbook without internal DVD player. Do you need to have the DVD on the system (external) to play it?", "response": "on my desktop, once installed I did not need the disc to play the game."}
{"product_id": "B00C710AT6", "context": "Does this game allow split screen mode?", "response": "don't know I've had it for 2 months and have not been able to play yet Via Pc. iPod NBA Live 2015 on PlayStation 4 so I'm good now"}
{"product_id": "B00166N6SA", "context": "Can it work with Windows 8.1?", "response": "Yes. If it doesn't, you can always use the Windows Backwards Compatibility feature."}
{"product_id": "B003EUPCZG", "context": "Hello, Anybody have the actual dimensions of the mouse itself? I have larger hands/need larger mouse. Currently, have Logitech G500. Thx!", "response": "Yes, I had an Abyssus before and must say Deathadder Chroma is much larger, it is a big mouse, aprox. 12cm length and 7,5cm width.Cheers"}
{"product_id": "B00EOUL7T0", "context": "Will this work with Tritton Triggers?", "response": "I'm not sure what triton triggers are, but I have a pair of high end triton headphones that I use with my Xbox 360. I purchased this cable to replace the oem one that broke! Hope this helps some!"}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "If you mean US layout then yes."}
{"product_id": "B0032MM2P4", "context": "I want this to work on my laptop. Will it?", "response": "yes  it will work fine"}
{"product_id": "B00FENJVOE", "context": "Can you use characters developed from D3, or do you have to start fresh from lvl 1?", "response": "Yup, you can use characters developed from D3, so you don't have to start from scratch unless you're starting a new class of course.."}
{"product_id": "B001DNGCN2", "context": "I'm Not a Big Wiz-Kid on This Stuff, but My PS3 is a CECH-2001B Model. Will This Cooling Fan Fit My PS3, Properly? Will It Run Any Different?", "response": "If that model number belongs to a ps3 that matches the one pictured for the fan , then yes it should fit. No the playstation will not run any different. Just a small fan running."}
{"product_id": "B0053B5RGI", "context": "If I were to only get one, Would you recommend X or Y?  I'm new to pokemon and have only played the Yellow Game on the Original Gameboy with Pikachu", "response": "They are both good. They are basically the same game, but with different Pokémon. It's basically just personal preference of which pokemon you like more."}
{"product_id": "B005G4CXPK", "context": "Will this work on Windows 8 and 8.1?", "response": "I play it on Windows 8, and it works great."}
{"product_id": "B007SRM5U6", "context": "Thist game have spanish sub?", "response": "Unfortunately it does not. This version is English only audio and subtitles."}
{"product_id": "B002I0K6X6", "context": "does this connect wirelessly or does it come with the cable to connect to the ps3 just cause i just purchased a ps3 and have no idea what i need.", "response": "All my controllers are wireless and it is wise to buy the set to the move controllers. The numb chuck is also a must have because you need it to use with bow and arrows, and some guns or riffles"}
{"product_id": "B002B9XB0E", "context": "Has anybody tried this with an emulator on Android?", "response": "No but i have used it on a pc emulator works well"}
{"product_id": "B00CD1FC6G", "context": "The only thought that I have for this keyboard is how are the LEDs?", "response": "I haven't had any problems with red LEDs I keep them on low but they all seem to be consistently lit. I've had the keyboard for more then 6 mo."}
{"product_id": "B004QRKWKQ", "context": "Does this work with emulators like ZSNES, ePSXe, and such?", "response": "I can confirm SNES, N64, GameCube, and PS2 emulators work with it. I used PCSX2 and Dolphin were some I used, can't remember the others' names."}
{"product_id": "B00ANHBJBY", "context": "So does this controller register as a Pro Controller or Classic Controller? Is it wireless?", "response": "It registers as a pro controller,and yes it is wireless."}
{"product_id": "B001EYU1WS", "context": "Is this product compatable with windows 8", "response": "Yes there are drivers available for Win7 and Win8 for both 32bit and 64bit systems."}
{"product_id": "B00DFB99UI", "context": "can you use this on ps4", "response": "I don't know. I just have used it on my PS3 and my laptop. I can tell you that it works pretty good!"}
{"product_id": "B003ZSN600", "context": "Can I plug a head set, in this case turtle beaches, in the controller itself?", "response": "Yes there is a headset jack in the middle back of the controller.  Just make sure its make for Xbox 360.  Some jacks might not fit the slot.  I am just using the headset that came with my Xbox."}
{"product_id": "B00AJZNUUI", "context": "Can you play wii fit with this?", "response": "I bought it for my little niece.  I think you should be able to but I am not 100% sure."}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "It's programmable power button"}
{"product_id": "B008BT2FWI", "context": "Will it work with Windows 8.1", "response": "I found out that I have Windows 7 and it work for me. So it should work for Windows 8.1"}
{"product_id": "B001GIOGBY", "context": "Do the mixture and prop controls work properly?", "response": "Yes, they work properly in X Plane"}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "It is worth it.  I never played the multiplayer one bit. I only played the campaign and it was amazing.  I have recently been thinking of getting it again to play thru again.  but if your looking for an amazing campaign this game has it.  I highly recommend it."}
{"product_id": "B00GBCLG0E", "context": "Does it play 3D games? Does it read movies in 3D?", "response": "Yes it does. It plays them perfectly"}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "You'd have to put it on, first.  The wrist rest ships underneath the keyboard in the factory box."}
{"product_id": "B0017KIBAI", "context": "Is this an official Nintendo Product and does it work with US Wii consoles even though it says \"Use in Japan only\"?", "response": "yes it plays on the wii console and It is an official product, it has serial numbers and the authentic Nintendo trademark symbol on the back on the controller. I play super smash bros brawl on the wii and it works perfectly and I play super smash bros melee on the gamecube and it works perfectly."}
{"product_id": "B003EUPCZG", "context": "Does this left handed mouse click on the right side so I can rest my whole hand on the mouse and click with my index finger like righties do?", "response": "I have this mouse and it is actually hard wired left handed! (Although you can change anything with the configuration software.) So, the answer is YES!"}
{"product_id": "B001GIUWX0", "context": "If you have more than one player, do you need to have more than one steering wheel for them to play at the same time?", "response": "You don't need the steering wheel to play. You can play with just a regular wii remote. The steering wheel just makes it a little more like driving."}
{"product_id": "B003ZSN600", "context": "Does this work with Windows 8.1 computers?", "response": "Yes it does. Simply plug and play"}
{"product_id": "B00HGAWFJG", "context": "How high is the ps4 with stand attached (exact figure please)?", "response": "11 and one half inches...."}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "I think it can arrive on release day depending on where you live. Otherwise the soonest it will arrive is the 7th, depending on the shipping method you selected.EDIT: Alright all our e-mails came in today and the estimated is on the 8th, even though I chose 1-day shipping. Hopefully it shows up tomorrow or the 7th."}
{"product_id": "B00IRHE892", "context": "Can the Back and Forward buttons be customized to do in-game actions like throwing a grenade?", "response": "yes they can. i hav set my forward button for melee. nothin in the back button yet"}
{"product_id": "B008VQ68C4", "context": "Is it Xbox One compatible?", "response": "Yes, but you need to have the Xbox One Stereo Headset Adapter for your controller. That's what I use (since I got the headset before the One was out) and it works just as it would with the 360."}
{"product_id": "B00C2B2Y9A", "context": "So far ive read it works on the PS4, Xbox1, PS3, and 360? Is it wireless for all systems? just plug them in the controller for sound and chat?", "response": "It is good for all systems it is powered through usb to a base then the base transmits signal to your headphones sound via optical cable that plugs into your system and to the base"}
{"product_id": "B00AFYAUYW", "context": "can you play wii u games on this???", "response": "This  was actually a gift. My first thought is no. I did not see it in the ad."}
{"product_id": "B0085VIILY", "context": "How is the Flight Stick connected  to Xbox 360?", "response": "Right into the back of the module.  There's only one jack that it will fit.  Have fun."}
{"product_id": "B00DC7O3K6", "context": "will this game work with a normal wii, or only wii u?", "response": "It only works on Wii U. You can use Wii games on Wii U console, but you cannot use Wii U games on a Wii console. I hope this helps!"}
{"product_id": "B007XVTR3K", "context": "does it have offline multiplayer", "response": "This game has Online Multiplayer 2-18.  Do not see anything about Offline Multiplayer.  Hope this helps you.  Thank you for shopping our site, and have a wonderful day."}
{"product_id": "B006YDPU48", "context": "Can you dodge, block, and counter? Do you get health regain rings and necklace, and do you get health steal per hit armor?", "response": "you can, you can get health regain rings, the problem with the game I found not to my liking is that if you die, you start with less health compared to other games that you start with full health, the game is really difficult for me even at normal mode"}
{"product_id": "B00HEX8TA4", "context": "Can you change to any color without the dpi changing? Or is each color locked into a dpi preset? Thanks!", "response": "Each color has its own DPI setting which you can change, so basically you can have any color you want with the sensitivity you want."}
{"product_id": "B002DUCF8A", "context": "I have a Saitek Pro Flight Multi Panel but recently the knob to select alt, vs, etc is stuck, how can I do in order to fix it??", "response": "Saitek has a 2 year warranty providing you have proof of purchase. You must pay for return shipping, which I have done 3 times already for this item. At the last lockup, I used a wrench for a day or two, and it got past the sticking part."}
{"product_id": "B00BDS415I", "context": "How long is the cable, is there any way to lengthen it?", "response": "The cable is very long. I'd guess about almost 10ft. I honestly thought it was too long for me"}
{"product_id": "B001KMRN0M", "context": "Can u play PS VITA games on this because I don't See any other games that come with this HELP", "response": "No, you can NOT play PS VITA games on a PSP 3000 (Vita is the newest platform)"}
{"product_id": "B00FQPQO4A", "context": "i had to reload this farming simulator 2013  game on my computer because it crashed where is the product key located", "response": "Go to your purshase history on amozon it should be on your invoice"}
{"product_id": "B00ECOAX34", "context": "Does it have an explorable world?  Can you be Wyldstyle?", "response": "My grandson says yes & yes to your questions."}
{"product_id": "B007W8S2MG", "context": "is this in English speaking when played? or English subtitles?", "response": "Is both a lot of audio in English and the subtitles are English too the voice acting is top-notch!"}
{"product_id": "B00F27JN8Q", "context": "Does Conception 2 work with PS Vita TV?", "response": "im not sure. im trying to  find out where i can get americanized games as well, but where are you from?. im in new  york !"}
{"product_id": "B005M0KSIM", "context": "I am thinking of buying the physical copy (since the pc download feature seems unavailable.) If i get the physical copy can i use it on steam?", "response": "the physical copy comes with a steam download so you can play it on the desktop or on steam i play mine off of steam and my desktop version remains untouched"}
{"product_id": "B0057S9SYY", "context": "Will these support chat via the xbox one headset adapter?", "response": "You will be able to get audio from the xbox one to the headset but chat will not work"}
{"product_id": "B002BRZ79E", "context": "Looks like a good game, just not into monthly subscriptions. Is that the only way to play this?", "response": "Yes, I think it's around $12/month."}
{"product_id": "B0050SZBP6", "context": "does this come with the lvl 90 boost?", "response": "No, it only grants you the agility to level up to 90. You still have to do the work. I will say that the kevels breeze by and give you a good feel for the expansion. The 90 boost can be bought, but does not come with the expansion."}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "I'm not sure about that one.  I was referring to being prompted for paying for various things such as characters and skins.  I didn't have xbox live for both accounts I was using."}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "The only way to play 360 games on the Xbox One is to have a 360 and connect it via HDMI to the Xbox input.  It still requires a 360 though."}
{"product_id": "B004YC4NN0", "context": "Will this work on phones, for emulators? Is it wireless?", "response": "Only if you have an OTG cable, as it uses a standard USB 2.0. Even then I'm not sure it would be compatible. It is not wireless."}
{"product_id": "B0076HD2W8", "context": "It only blinks once or twice when I hit the button on the receiver is that normal? I can't sync it to my controller.", "response": "did you pick the right drivers when installing? also, you have to hit the button on your Xbox 360 controller while hitting the button on your receiver."}
{"product_id": "B00DC7O77A", "context": "Is this a Gamepad only game or can a Wiimote be used with it?", "response": "I'm not sure I bpught it for my son"}
{"product_id": "B00030GSJY", "context": "What are the base dimensions for the two parts?  I need to fit in 6.5\" space.", "response": "Both are 6 and 5/8 by 6 and 5/8.  If your space is really that exact measurement with no leeway, they won't quite fit."}
{"product_id": "B0015PHMFU", "context": "Does this work out of the box for PC or do I need to buy the \"Universal Adapter\"?", "response": "Tested and works with both PC and PS3 AS IS without issues. No adapter needed."}
