{"product_id": "B00EFFVZP0", "context": "does the ps3 version comes with free dlc?", "response": "The limited edition yes, but de standart edition not."}
{"product_id": "B0050SXKU4", "context": "How long does it take to install do you need wifi", "response": "The one I purchased is for the Playstation 3.  You just insert in the DVD slot and no WiFi is needed."}
{"product_id": "B00EVWZHLK", "context": "Must I install the games or can I directly play them from disc?", "response": "you can play directly from the disc"}
{"product_id": "B006IOAHPK", "context": "I have a PS4, How can I play this game?", "response": "Put the disc in."}
{"product_id": "B00F27JGVA", "context": "I have one 8GB card and one 4GB card, with same PSN login. How do I copy all contents to this card?", "response": "Content Manager app will help to coy Connect to a computer where you can access again once you pick this memory card up"}
{"product_id": "B00656HLGO", "context": "Will It work with the Xbox360 Elite Console", "response": "Yes that's what I have mine in"}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "You do not charge it, it is powered by usb connection to what ever device your plugging it into. That's why it's called wired headset"}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Mario Kart 8? And Bayonetta?", "response": "Yes with both games"}
{"product_id": "B00F27JDY0", "context": "Can it Play North American game cartridges?", "response": "Yes, sony products are not region locked. So it can play any american game / Japanese games!"}
{"product_id": "B00AJZNUUI", "context": "will this wii work with my older games?", "response": "works with mine. Hope this help"}
{"product_id": "B00FRESQYG", "context": "does it let you level boost a character automatically or do you have to grind to 90", "response": "you boost from 1 to 90 instantly, but professions aren't level to max unless you have your character over lvl 60."}
{"product_id": "B00GU8W5AE", "context": "Redragon Perdition VS the Razor Naga 2014 edition, if you have used both which do you prefer?", "response": "The perdition, it has more options and overall is a better mouse imo."}
{"product_id": "B0091A3AHA", "context": "is a tv or what ever that screen is included", "response": "Yes.  It comes with a tv screen built in.  Also comes with a short HDMI cable"}
{"product_id": "B00EFFVZP0", "context": "Greetings, I bought this game with you, but I want to know if it brings the Spanish language?", "response": "No it's in English...."}
{"product_id": "B00F2ENJY8", "context": "Can you use wii sports with this?", "response": "I personally don't have Wii sports, but I got a lot of other physical Wii games and they work on the Wii mini.."}
{"product_id": "B003BKWEHS", "context": "doesn't work on windows 8 for me...just goes to a few countries and that's it", "response": "I downloaded it on windows XP and Windows 7 was able to go 100%. It didnot show that it would work on windows 8."}
{"product_id": "B00A878J5I", "context": "will this charger work with the original Wii Remotes?", "response": "yes. it even comes with rechargeable batteries for them"}
{"product_id": "B00005B8G3", "context": "Hi,  is their is a batteries charge include or only use a batteries.", "response": "You cannot charge the Game Boy Advance.  You just put in new batteries.  There is the Game Boy Advance SP which is rechargeable (and has a light)."}
{"product_id": "B000GCJ6MK", "context": "Does this game comes as a CD or DVD ? Are there any  other  appliances  that must be used i.e  joystick?", "response": "The sim comes on DVD's. A joystick is suggested, but the sim can be run by keyboard controls."}
{"product_id": "B00JM3R6M6", "context": "appropriate for 10 yr old girl?", "response": "yes it would be appropriate for a 10 year old the only \"bad word \" in it is darn there is violence but it is \"G\" rated"}
{"product_id": "B00GOOSTFE", "context": "How likely is this game to be sold out/out of stock if I want to pre-order it later since I still want to be able to get the pre-order bonus?", "response": "Pre-order it now. Regardless of when you pre-order you won't be charged until it ships so you can always change your mind and not be charged if you decide to cancel it before it ships."}
{"product_id": "B00EOUL7T0", "context": "Will this work with the Tritton TRIGGER headset?", "response": "Brother this won't work with ANY headset....save your money.  Five bucks wasted is not a savings."}
{"product_id": "B000OLXX86", "context": "Does this game come with the DLC?", "response": "According to Wikipedia, \"The Platinum Hits edition was released in North America on February 10, 2009, which included the features of the Bring Down the Sky expansion and additional developer documentaries, videos, and music.\""}
{"product_id": "B003O6CB6S", "context": "Do you have to install steam?", "response": "Yes, you need steam to play this game, and Amazon will send you a code to download the game through steam via email. YOU DO NOT NEED TO DOWNLOAD THE AMAZON GAME DOWNLOADER. Hope this helps"}
{"product_id": "B00919RM1Q", "context": "can this version be loaded on both my lap top and desk top?", "response": "Yes, I put it on my computer and laptop also...."}
{"product_id": "B00JM3R6M6", "context": "will this work on 2ds?", "response": "yes, on a 2DS it should work fine; it won't work on any DS, DSi, or any DS colsole before the original 3DS."}
{"product_id": "B00BDS415I", "context": "How durable is this headset? I want one that can last me a few years.", "response": "Mine broke and I am extremely careful when taking off or on.  The stress point needs to be stronger than plastic."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "About 8 hours. I love playstation and I play it a lot. I usually would just charge it over night."}
{"product_id": "B003JETPHS", "context": "Did you get Logitech or a knock off brand?", "response": "Is a konami brand"}
{"product_id": "B00ECOAX34", "context": "is this a 2 players simultaneous game?", "response": "I couldnt get a second player to join. Apparently I need to purchase a nunchuck and connect to my rectangular old school wii remote. WTF?"}
{"product_id": "B007TFOO6K", "context": "Per answer 3, description says blue switches & fully LED back lit. Are the keys back lit  BLUE?  THE DESCRIPTION SAYS YES", "response": "The \"color\" of the switches mean the model of them, see an article about this here: http://tinyurl.com/73s9xfxBacklight is red on my keyboard."}
{"product_id": "B00IAVDPSA", "context": "I'll be hooking up the Tivo through the HDMI pass through. Can this remote be programmed to control the Tivo Box as well?", "response": "Does the Xbox One control your TiVo? If so, the play, rewind, etc will work but it's not a true universal remote. I still have to use my cable remote to play DVR content and use the guide, I'm not a fan of the One Guide."}
{"product_id": "B004SJFJUA", "context": "Does this work with the 3DS XL or just the 3DS?", "response": "no it wont work with the 3DS XL my mom has 1 and the 3DS XL is way too big."}
{"product_id": "B00FAN4LRA", "context": "How sturdy are these headsets?", "response": "These headset. Is not as durable as I would like, shot range"}
{"product_id": "B0085VIILY", "context": "does this flight stick work with all other flying games on xbox 360?", "response": "yes they will gives list of flying games works w and m"}
{"product_id": "B009O8HH3M", "context": "What are the headphone cushion material made of? Some photos make it look like it's made of a cheap foam and the others make it look like fabric.", "response": "foam not the cheap stuff it is pretty nice I have had mine for more than 6 months"}
{"product_id": "B000IBELZG", "context": "does this camera work on psp e1004", "response": "Compatible models are \"PSP-1000 Series / PSP-2000 Series / PSP-3000 series\".this is written in SONY's official website."}
{"product_id": "B000H683YC", "context": "Dose this work for other game systems? Dose this work for other game systems?", "response": "If your system has an optical cable, such as the PS 3, all you have to do is unplug the optical cord from the subwoofer and plug that into the same port on your other system."}
{"product_id": "B00HWMP0TU", "context": "Does the complete edition have all expansion packs included?", "response": "Yeah, all expansion packs are included, I believe this includes the special maps and civs."}
{"product_id": "B000B6MLSM", "context": "Will this control the DVR functions in WMC?  I have one of the new remotes and it lacks many of the functions that you would expect it to have.", "response": "Works great with wmc extender. It's what I use it for."}
{"product_id": "B0051UMYLW", "context": "DRM-Free? Are the games in this compilation DRM-Free?", "response": "Good Question something I'd like to know as well. However you can buy all these on GOG.com DRM Free and you can burn them to a cd/dvd. They come with installer and everything.  just go here to check it out--> http://www.gog.com/catalogue/strategy"}
{"product_id": "B002YVD3KM", "context": "Does it work for all PC games or just NES Simulators?", "response": "It registers in Windows as a USB Gamepad - so it can be used for any PC game... you may just need to open the game's options and create custom mappings for the game controls to whatever gamepad input you want."}
{"product_id": "B001O3066U", "context": "Does this game work on windows 8.1", "response": "While Windows 8 is not listed, it should work with Windows 8.1 I briefly tested it and it required the disk in the drive to work."}
{"product_id": "B0053B5RGI", "context": "Can you enjoy this game by yourself, or do you have to be in connectivity mode and do multiplayer?", "response": "My daughter she is 10, she maybe doesn't understand.  But her answer was yes."}
{"product_id": "B00DLDEKOK", "context": "Can you hear the game sounds rather than using tv volume? I am new to this and hope gran kids can play quietly", "response": "These headphones are a step above the xbox headphones...but they only give you voice chat, game sounds still come from t.v. You would have to invest in higher end ones like turtle beach."}
{"product_id": "B0058FAEAS", "context": "What is the purpose of the mode switch?  Is it simply to assign functions to/for different games?", "response": "I use it for switching view modes in FSX (virtual cockpit / 2-d panel / outside)"}
{"product_id": "B006JKARP8", "context": "why does it say that maintains the charge for up yo 1 year?  it wont work after 1 year?", "response": "Probably because all batteries lose charge over time. That means you can fully charge the battery and if DO NOT plug something into it, it will stay \"full\" up to a year."}
{"product_id": "B00BBUCCKO", "context": "How big is it? Some of the gaming keyboards seem to be made for huge hands and mine are probably pretty average woman hands.", "response": "I have shook a lot of hands all over the world and I feel my hands are average size. This keyboard is very comfortable for me."}
{"product_id": "B00DC9T2J6", "context": "My son really wants this game but M rating isn't going to fly with Mom. Is there a way to turn off blood / gore for PC version?", "response": "I think so, and there isn't that much blood in the first place. It only shows when your titan kills a pilot, but its not gory at all."}
{"product_id": "B0050SXLQC", "context": "Thinking of buying this used, but what is the Downloadable Content needed to play this game? Is it worth buying without dl content?", "response": "Yes. All DLCs are just extra maps and game modes for multiplayer and has no effect on the gameplay itself"}
{"product_id": "B0096L2SJ0", "context": "Will it work on emulated games?", "response": "Yes, using the 'moga universal controller' app, it will work with most emulators."}
{"product_id": "B00DCDZM2I", "context": "Does this include the actual disk to play the game, or just the characters?", "response": "Yes, this bundle includes the actual game disc, along with the required portal and characters."}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "Yes it is the same basic mouse, this one just has the \"Call of Duty' graphic on the mouse grip and comes with a mouse pad."}
{"product_id": "B00DVEJA7G", "context": "how are these for running on treadmill? want something thats secure and wont fall off when im running", "response": "The headphones are pretty tightly bound to your head for comfortable fit while running."}
{"product_id": "B002AQNT96", "context": "will this game operate on windows 8, also does the pc version support LAN?", "response": "Game works on  W8, but it isn't a very good game. Have to use the keyboard to steer. Don't know about LAN though."}
{"product_id": "B0098EVZZ8", "context": "will these work with the Wii game", "response": "They will work with any system. But the games they can be played on are the skylanders version they are released on and any newer versions. The \"Series\" characters are backwards compatible which allow them to be played on the previous versions of the game. Currently there are 3 games. Spyros adventure, giants, and swap force."}
{"product_id": "B005J37I4Y", "context": "This doesnt work on xbox one right?", "response": "No it has the Xbox 360 plugs. I think that they might actually sell a Xbox one adapter but I'm not too sure"}
{"product_id": "B00I14395A", "context": "Do the rechargeable batteries 'really' only last 48-hours? (if so, then it's not 'really' wireless)", "response": "i have had my set  for 3 months and it is still up and going and i use it daily and i  have never recharged the batteries"}
{"product_id": "B00GS6A6V8", "context": "are there any patches that will change the original skyrim disc game?", "response": "The DLCs don't add any patches to the game themselves at all. The DLCs will change the disc game, but only in the form of dialogue options that were previously unavailable."}
{"product_id": "B00FXOP1JI", "context": "does it include a download code for pokemon X or Y as the second picture shows?", "response": "That picture was misleading, I was expecting a download code too but didn't get one."}
{"product_id": "B004RMK4BC", "context": "I am trying to ender a psn card to my account but it is saying that it is  no longer valid but i just bought the card 20 mins ago what could be prob?", "response": "Oh, if you bought it at a store they probably didn't activate it. PSN cards work like gift cards, they have to be activated at the time of purchase. Take it back to the store with your recept and tell them what's going on."}
{"product_id": "B00GPH7Y8S", "context": "This item includes Spanish language?", "response": "It has a spanish setup language, but im not sure about the in-game, i would think it would."}
{"product_id": "B00DCBDNW6", "context": "I've never played FF before it looks really good Is this the type of game i can just buy the newest 1 n jump right in or do i need to start with 1?", "response": "I don't quit get what you mean by buying the newest 1. Did you mean the if there were expansions you need to get along with the base game or did you mean if you have to start from lvl 1 ??"}
{"product_id": "B00ATF5YYI", "context": "if I buy the PC Download, (I just want to make sure so I get my money's worth), I can download this on steam, im still a bit confused", "response": "When I downloaded mine it was on Steam."}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "I've been using it since I purchased it with windows 8 and I have had no issues whatsoever. The software and keyboard itself work completely fine as far as I can tell! Hope this helps :)"}
{"product_id": "B003O6C0V4", "context": "does this include the total body tracking system?", "response": "Yes it does. Works pretty well, in my opinion. It's not perfect, but you can still do the exercise."}
{"product_id": "B007A7UJ4S", "context": "Does anyone who has previously bought this game thru amazon,does it come with the box or just the downloadable disk?", "response": "It does come in a brand new and sealed box as pictured it will be red and not clear. Assuming you are buying it new like I did."}
{"product_id": "B00J6DLPLK", "context": "For a big fan of Nier, who deeply love the narrative and characters. Would you recommend this game? (Really don't mind the gameplay)", "response": "If you loved the characters, narrative, and overall story of nier you will love drakengard 3. Drakengards story isn't as good as nier, but it's still quite interesting with great character personalities and story progression."}
{"product_id": "B003EUPCZG", "context": "do the mouse wheel and logo light up?", "response": "Don't buy Razer. product failed in 3 months. Worst customer service in the industry. Deathadder 2013 lights up but who cares."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "it work fine on windows 8I have a i5 cpu with 16gb ram and 780 gtx graphic card.  The graphics of the game are not great.....I'm sure the game will run smoothly with alot less.  hope it help"}
{"product_id": "B001444IN6", "context": "I have a HP - 19.5\" All-In-One Computer - 4GB Memory - 500GB Hard Drive could it run fine with some expansion packs?", "response": "Yes this game should run fine but you probably won't be able to run  all expansion packs"}
{"product_id": "B003VANOFY", "context": "Some headset will press my ears against the glasses, this makes my ears hurt after wearing for awhile. Is it comfortable to wear it with glasses?", "response": "I've been wearing these with glasses for years (not consistently, usually only at night) and haven't noticed any discomfort.  The padding is quite thick and comfortable."}
{"product_id": "B006IR6NH8", "context": "How does this thing steer? does it attach to something or does it use an accelerometer? and will it work with most racing games?", "response": "It uses an accelerometer.  It works with most PC games I have tried.  It is possible to be as fast with this as it is with other more 'conventional' wheels."}
{"product_id": "B000GP8448", "context": "Is it compatible with Windows 7 ?", "response": "Yes it is i love this wheel best thing ive paid for for my racing needs"}
{"product_id": "B0094X28J0", "context": "Does it come with the wrist strap?", "response": "Yes! I bought two Wii Remote's Plus(one of Luigi and another one of Mario) and both came with the wrist strap :)"}
{"product_id": "B00FATRKWM", "context": "I will be purchasing the US x-box, will it work in Europe?", "response": "According to the retail box this console is NTSC which means this only works for the US and Canada"}
{"product_id": "B001O3066U", "context": "Will this game work with Windows 8?", "response": "Frankly I am not sure.  My tech guy steered me away from W8 for many reasons.  good luck."}
{"product_id": "B00AWEMODK", "context": "Is this game downloadable content or would I actually be buying disks to download.", "response": "You can download everything, no need for physical disks."}
{"product_id": "B000RA778G", "context": "does it work with windows 7", "response": "Yes t does I use it all the time and I have Windows 7"}
{"product_id": "B000ZBZK7C", "context": "which video poker games this Cd has?", "response": "This Video Poker game is WinPoker by Zamzow Software Solutions. The game is a Video Poker Trainer.for Windows 95/08/2000/ME/XP/Vista/and 7. This game works great, it tells you your mistakes and helps you learn to play Video Poker the correct way. I recommend it HIGHLY."}
{"product_id": "B00F2ENJY8", "context": "does wii mini use regular memory cards or hard drive or both?", "response": "It only uses hard drive. It has no memory card slot."}
{"product_id": "B00BI4VVGY", "context": "Are the blue LED's brighter than the picture, or are they really that dull blue?", "response": "it isnt blue its white and its realy good"}
{"product_id": "B0029LJIFG", "context": "I received this and it has English and Chinese written on package. Is this product in English???", "response": "All it is is a card with a code on it for 12 months of x-box live. It did have Chinese writing on it, as well as English, but the code worked just fine for my son!"}
{"product_id": "B00BDS415I", "context": "How long is the cable, is there any way to lengthen it?", "response": "It's already pretty long, no need to legethen it"}
{"product_id": "B00B70WKUK", "context": "can you play this game on windows 8", "response": "I don't know, sorry.  I have windows 7"}
{"product_id": "B00GU8W5AE", "context": "Redragon Perdition VS the Razor Naga 2014 edition, if you have used both which do you prefer?", "response": "They are both excelent, the Redragon is just a bit too large for my hand."}
{"product_id": "B0053B66KE", "context": "is it playable on ds or dsi", "response": "Pokemon Y is only 3DS this game does not work on DS OR DSi."}
{"product_id": "B007VTVRFA", "context": "Isn't this game now allowed to be offline (which was the main criticism)?", "response": "Yes, the online feature has been added into the game. Once installed in your computer, the internet is not necessary anymore! Multiplayer still works too."}
{"product_id": "B00H7KDNBO", "context": "Can I play when I'm offline.", "response": "No. There is no single player."}
{"product_id": "B00CBQO930", "context": "How do you pick a color when you order it?", "response": "No need to choose, the mouse is able to to do pink, green, blue, and red (ordered from highest dpi to lowest)."}
{"product_id": "B004J6KRD6", "context": "is it better than t300rs ?", "response": "Much better than the T300"}
{"product_id": "B009CEM332", "context": "Is this game compatible with an Xbox 360 controller? Many PC games are.", "response": "Works very fine !!! =) I use one too."}
{"product_id": "B00E4MQODC", "context": "i have M.S.and my fingers are weak, The 2 buttons on top left,are they easy to push,like the left click button,and do they push from side or top.", "response": "They seem easy to push and can be pushed from the top. I hope this helps."}
{"product_id": "B00CJ7IUI6", "context": "I want to buy this for a friend who wants to play Skyrim with DLC's but cant access PSN will he be able to use the DLCs? without internet??", "response": "You need internet. There are updates Skyrim needs for the DLCs to be functional. This is what they can do. Get access to the internet with PS3, update Skyrim, download the DLCs, and they'll be set to play offline after that."}
{"product_id": "B001ELWMHI", "context": "does it come with controllers?", "response": "No unfortunately it only comes with the console"}
{"product_id": "B00HGLLRV2", "context": "is the difference between the limited edition and the standard edition significant?", "response": "The limited edition comes with an exclusive outfit, the game soundtrack and the Paper Trail and Cole's Legacy missions. Personally, I think it's worth the buy."}
{"product_id": "B000HZFCT2", "context": "Does this work on Windows 8?", "response": "Yes. In fact, only wireless Xbox 360 controllers will work with Windows 8. Windows 8 does not support wired Xbox 360 controllers."}
{"product_id": "B00DB9JYFY", "context": "It states rated for M -- my son is 10 and loves that his friends play this game online with classmates -- how concerned should I be about the content?", "response": "No idea, I don't remember any vulgar language but I couldn't hear the in game dialogue over the background noise. The violence is pretty tame too really."}
{"product_id": "B009XZ1CTQ", "context": "Some reviews say you need steam installed on computer to play---What is STEAM ?", "response": "Yes, you need Steam to install Farming Simulator 2013 whether you download it from the Internet or from a disk.  But you don't need Steam to play Farming Simulator 2013.   Steam is the name of a website."}
{"product_id": "B002I0GF72", "context": "Does this game come with the gold foil cover or was that only upon release or preorder?", "response": "i ordered one and it looks shiny gold-ish and i got it last week i hope that helps"}
{"product_id": "B004UJNN5G", "context": "is it a cd?", "response": "Yes it's a disk"}
{"product_id": "B00G21VQ2M", "context": "Will this work on a US vita? Or does it have to be a Japan vita?", "response": "It works on a us vita as well. Otherwise, wouldn't be playing it lol."}
{"product_id": "B00GV0LR64", "context": "will it work with ps4", "response": "Or you could get a red piece of tape to mark the center of your crosshair..."}
{"product_id": "B00GOOSORM", "context": "What exactly is this item and how does one use it?  btw: I have the ps/3 trial installed but expired", "response": "It's what you need to continue to play xiv.basically you redeem the code on the back of card through mog station."}
{"product_id": "B002I0GF72", "context": "How many players is it? Just one? Or multi? Thanks!", "response": "it's only 1 player"}
{"product_id": "B00CJ7IUGS", "context": "do i need internet connection to download dlc content onto my xbox?", "response": "With the legendary edition comes two disks. The first disc is the base game. The second disk contains all the DLC and its own installer, so you will not need an Internet connection. Just the second disk :)"}
{"product_id": "B00B0QONB0", "context": "My Xbox 360 4GB will not recognize it. What do I do??", "response": "If it doesn't recognize it I would return it for a different one. It is probably the programing. Or try dumping ur system cache.  But save all ur data to a memory stick first."}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "\"loose\" means that it is out of it's orginal package.  I recieved mine in a plastic baggie.  No damage, just not in original package."}
{"product_id": "B00GZ1GUSY", "context": "Excuse me Does this game include Chinese language？thanks！", "response": "I don't think so"}
{"product_id": "B001AH8YSW", "context": "does this have a control option to adapt to a 'windows' xbox controller?", "response": "Dont bother with game unless you got powerful computer with either Win Xp or Maybe 7. And I doubt it works with a controller. Dont know. Try a digital copy either way"}
{"product_id": "B0029LJIFG", "context": "I have two grandsons. Do I need to get a card for each of them or will one card for the Xbox 360 work for both of them?", "response": "One card will work for both."}
{"product_id": "B00CMQTUSS", "context": "if i connect this controller to my pc using a micro usb to usb cable, will it send data or just charge the controller?", "response": "I doubt it'd have any data to transfer.  There is no drive in the controller to store or transfer data.  It should charge it though (assuming you have this: http://www.amazon.com/Xbox-One-Play-Charge-Kit/dp/B00DBDPOZ4/ref=sr_1_1?ie=UTF8&qi;d=1403285738&sr;=8-1&keywords;=xbox+one+charger)"}
{"product_id": "B00CXCCB64", "context": "Is this 2 players or more?", "response": "Online yes, but not split screen"}
{"product_id": "B00EADTVL2", "context": "What happens if i leave the dualshock 4 on the charging station while it is plugged it even when the battery of the dualshock 4 is fully charged", "response": "it will keep the battery fully charged but can also hurt the batteries there are only so many charges a battery can take, also it will keep pulling power so when its fully charged I prefer to unplug the controller"}
{"product_id": "B00DGZDFLW", "context": "Is the PC pre-order version the Black Armor Edition? It says it's DRM Steam and Steam is providing digital: weapons, soundtrack, artbook, and comic.", "response": "It's basically the black armor edition only you don't get the exclusive metal case it's all digital."}
{"product_id": "B0050SXFKE", "context": "If I buy this, will the case come in a regular clear case or will it be those ugly greatest hits red cases?", "response": "The one l bought came in a Clear Case not that Greatest Hits."}
{"product_id": "B00G6IJ5QK", "context": "Does the scroll wheel click when you scroll it or is it smooth?", "response": "No, unless you want to click it :DThe scroll is very smooth"}
{"product_id": "B004L6C6BK", "context": "Will this work with my astros A-50??", "response": "Yes. This amp will even work with non-Astro headphones."}
{"product_id": "B00BMFIXKQ", "context": "My son is 12 years old and really wants to get this game. Is this game appropriate for his age? Should I wait a year or two? What say you???", "response": "I dont think so since this game have violence (guns, swords) and you have/can to murder people...I will not considered for a 12 years old kid."}
{"product_id": "B007TFOO6K", "context": "Can you change the cherry mx keys out? I'd rather have brown D:", "response": "Maybe, but I would rather sell my old keyboard then buy cherry brown keyboard"}
{"product_id": "B00CJD4HD2", "context": "Does this mouse have the same clicking issue as the G500. i.e Sometimes it doesn't register a click, sometimes it double or triple clicks.", "response": "yes the G500s has corrected that issue, as well as made it more sweat friendly"}
{"product_id": "B00GG4BBUM", "context": "what means canadian cover?", "response": "I think they please Canadian customers putting the picture of a Canadian player (or a Canadian team, for istance Toronto) on the cover. the game is exactly the same."}
{"product_id": "B00005QEFD", "context": "does it comes in with the original box", "response": "The one I bought did - read the description carefully - if nothing listed there contact the seller (email) and let them know that is a very important selling point for you - if they want to make a sale, they will get the original box."}
{"product_id": "B00886XQNQ", "context": "does it work for xbox360", "response": "Yes, it is designed to wok with the Xbox 360 out of the box."}
{"product_id": "B007JDMPOK", "context": "If I already have Tera on my laptop, can I use the code to get the goodies, and use the disk to install on another PC?", "response": "you can install it on how ever many computers you want...but the goodies are account bound. (P.S) I would highly recommend using the online downloader, the disks are SERIOUSLY outdated at this point."}
{"product_id": "B00BMFIXZG", "context": "is this a steam activation code or uplay?", "response": "Mine activated thru Steam"}
{"product_id": "B0038PBF1W", "context": "will this work on windows 7", "response": "absolutely James, I am playing it on windows 7 and it works great. windows 7 allows most older win XP games to work. I did run across a game that wouldn't work at all and that was Jane`s combat simulations USAF although all the other Jane`s games worked perfect."}
{"product_id": "B003ESDQW4", "context": "is this a single player game or can two kids play?", "response": "This is a Single Player experience only."}
{"product_id": "B0056JPS84", "context": "I see some customers got the wrong drive. How do I make sure I get the correct drive for my 360?", "response": "open your 360 and read the label on the drive to see which Manufacturer and model # you need before you order the drive"}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "It's more because it's imported from japan. The blue and red aren't available in the states yet. Sony just announced the blue would be coming to the states this fall, no word on the red though. So if you can wait it would save you some $$$"}
{"product_id": "B004GINKNQ", "context": "Can I use this model to play Destiny on my xbox 360 slim?", "response": "Yes, that is exactly what I use mine for"}
{"product_id": "B00BV72X1U", "context": "Would this work with a chromebook?", "response": "Sorry this device will only work with Microsoft Windows, requires Microsoft common control drivers for windows."}
{"product_id": "B000OPOCFU", "context": "is this compatible with windows 7 64 bit", "response": "Not sure.  Sorry"}
{"product_id": "B008M4BNQ6", "context": "does it come with every thing", "response": "Yes it does. I needed an audio adapter though so I could still keep playing in HD. It depends on your television."}
{"product_id": "B00BMFIXT2", "context": "Will it work on European xbox 360?", "response": "Not sure if PAL and NTCS formats are crucial I this. Maybe ask Xbox support."}
{"product_id": "B003981JQ4", "context": "does it come with pen and stilisis ?", "response": "No, it does not."}
{"product_id": "B0058FAEAS", "context": "Can you trim the plane with this product or do you need the trim wheel and can you use a rutter function without buying the peddles", "response": "You do not need the trim wheel, just assign one of the toggle switches on the yoke to act as and eclectic trim. There are plenty of them so you will still have lots of other options open to you with the rest of the switches."}
{"product_id": "B00DBRM3G8", "context": "According to what iam reading you can't create a new team and create players and put them on it,is that correct?can someone answer this queation for me.", "response": "Oh I thought you were talking about 2k15, I have 2k14 for ps4 and I couldn't create a player and add it to a team"}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "From playstation store. Namco download"}
{"product_id": "B005QUQP80", "context": "Does this keyboard response with Windows 8.1?", "response": "I have Win 8.1, and it seems to work fine.  I do currently have a problem with incorrect keystrokes registering from the keyboard, as discussed in my review of this keyboard.  I don't think this is an incompatibility with Win 8.1, otherwise I would imagine all the keystrokes would be acting up, and not just a few."}
{"product_id": "B000B9RI00", "context": "works for xbox one?", "response": "Yes, it is just a subscription to Microsoft's \"Live\" on-line access."}
{"product_id": "B008O510Y8", "context": "wich is better this or the pc 360", "response": "I would suggest the 363D for surround sound, otherwise I would stick with the 350 (I really like these headsets)."}
{"product_id": "B000R0SRNU", "context": "Is this all three previous Lego Star Wars games repackaged, or a whole new Star Wars game?", "response": "A whole new game"}
{"product_id": "B005VA5D24", "context": "Is this hard drive compatible with the Xbox 360 Original Console?", "response": "No it is not compatible with the 1st model xbox 360s not does the xbox 360 elite. Because the hard drive for that console attaches to the top and doesn't have an internal hard drive slot. But the 2nd and 3rd model 360s do because they have internal hard drive slots."}
{"product_id": "B00CHSY0R2", "context": "Do i need to buy a USB to use these?", "response": "I'm....not sure what you are asking. This is a corded usb headset,  which means,  you can use them on anything that has a USB port."}
{"product_id": "B00A8HIGSS", "context": "is this a physical copy or is a box with the code inside, i hope its physical?", "response": "This is indeed a physical copy but you do have to download the 3 giga of the game into your ps3 sistem hope you enjoy it pal(;"}
{"product_id": "B00I9UVY30", "context": "Is there coop online? meaning from the same PS3 system can 2 people play against someone online?", "response": "Yes Online (only 2 Network players) I suppose could be coop or against (don't know), but yes ONLINE NETWORK PLAYERS (2)"}
{"product_id": "B004L5SJ4Y", "context": "what are system requirements?", "response": "Your video card will be most important. I had to upgrade from rhatheon 6480. Went to R9 270. You will need at least duo core and 8 gb memory"}
{"product_id": "B00DPJBTM6", "context": "Are these wireless? I read somewhere that there is something to make the A40's wireless", "response": "No these are wired."}
{"product_id": "B00CMQTVUA", "context": "Does this come with a controller?", "response": "Yes, you will get one wireless controller and Kinect system with the Xbox one."}
{"product_id": "B006NU6F28", "context": "Does this include Multiplayer gameplay?", "response": "It's a single player only.  But a lot of fun!"}
{"product_id": "B0015PHMFU", "context": "Does this work out of the box for PC or do I need to buy the \"Universal Adapter\"?", "response": "I use Win7 and mine worked straight out of the box."}
{"product_id": "B008CP6MA2", "context": "Is this really only 3 games now? Or will they renew the vouchers for Origins?", "response": "Is the game region free ?"}
{"product_id": "B00BMFIXT2", "context": "Just out of curiosity, did Edward ever become an Bonafide(real) assassin or is he just wearing the hood?", "response": "Yes he did. He had to earn it after he stole the uniform."}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "The trigger is single stage."}
{"product_id": "B00CPKUV7K", "context": "Is there a single player mode that doesn't require an internet connection?", "response": "A day one update is rumored but I am not sure what it does. Aside from that the game is single play only so internet should not be required for anything sans leader boards or something like that."}
{"product_id": "B00EZKNT5O", "context": "Is  this controller compatible  with 8.1 window deskttop pc", "response": "I'd bought this controller for my old laptop which had Vista, used it on the desktop which has 7, and finally, my current Acer ultrabook which has 8.1.  It worked great on all three."}
{"product_id": "B004NRN5EO", "context": "This version includes Korean subtitles?", "response": "I don't think so"}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "My son didn't have any problems. According to the product description, you \"can plug any real guitar with a standard quarter-inch input jack into an Xbox 360 or PlayStation 3\". I think it'll work for you just fine."}
{"product_id": "B00DNHLFQA", "context": "can you play this offline?", "response": "I never got it to download from EA. DON'T BUY IT. Amazon will NOT REFUND YOU"}
{"product_id": "B009DYCTY4", "context": "Does it come with controllers?", "response": "It comes with one control"}
{"product_id": "B0094H8H7I", "context": "Does it play Sega MegaDrive carts?", "response": "Not sure what those are. This will play the original sega games as well as the bigger ones that were made that look like a square."}
{"product_id": "B00G6IJ5QK", "context": "Does anyone have any opinions on the lift off distance of the Rival vs some other competitors (g500, DA, etc.)?", "response": "i dont have a g500 but I do have g400s and DA,rival has the same LOD as g400s which is pretty low."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "Yes, Windows 7 immediately identified it and installed the software for it."}
{"product_id": "B00BXE4W4C", "context": "How do I get the pic axe in the shed....it won't open...is there a patch for this game?  Someone else has the same problem!", "response": "Elsie, I haven't played that for so long, I can't remember. I can tell you I finished the game & had to problems. Sorry, I couldn't be of more service."}
{"product_id": "B00FC1UH82", "context": "Is this a smaller version of the other Mad Catz arcade sticks? The dimensions state 9.1 inches in length. Most other sticks are 17 - 19 inches.", "response": "It is kind of smaller but actually, it is very comfortable for its size!"}
{"product_id": "B00BI9MDSO", "context": "How many game cards can this case hold?", "response": "It can only hold three game and one memory card."}
{"product_id": "B0000A2TPE", "context": "Is this game still available to be bought? I know you had it on the market a few years ago but I lost my version of the game when I moved", "response": "Yes, it's still available!  I have a copy up for sale right now for $9.42 plus shipping.  Best of luck!"}
{"product_id": "B00GV0LR64", "context": "will it work with ps4", "response": "Get this instead...  http://www.amazon.com/PlaySation-Xbox-One-Wii-PlayStation-360/dp/B00JK0LWO4/ref=aag_m_pw_dp?ie=UTF8&m;=A19VHI2FAT9ZVY"}
{"product_id": "B00GJ2HZ7E", "context": "Do you need wifi to play?  I know you need it to download... But is it needed to actually play the games?", "response": "No, wifi or cable connection to internet is not needed to play. All steam games work offline once installed over internet, except the MMO games which are only online multiplayer."}
{"product_id": "B00HN9LS48", "context": "Does the Kinect actually clip on and become secured to the unit or does this item just act as a wide table for it to sit on?", "response": "It does actually clip on to kinect. Very simple but very affective product. Well worth the price"}
{"product_id": "B00FE8WKPQ", "context": "Is this ready to play out of box or is another console required? Do I need to buy a regular Wii U first?", "response": "Yes you would need to buy the wiiu and I advise to purchase two motion plus controllers............."}
{"product_id": "B000SOYG8U", "context": "support for Saitek JOYSTICK?", "response": "i don't believe so, the game-play doesn't involve you directly controlling one unit, you have to command them to do things..."}
{"product_id": "B007LQG9A6", "context": "Does This Work With Windows 8 and I would like to know how this product preforms from a actual owner of this product thank you!", "response": "It works perfectly on windows 8 :). And how it performs? It works for what it is, if agame supports an xbox 360 controller it will work. There might even be some mods or workaround a for games that don't support 360. As for the controller itself, hardware, it's great! Everything feels like it should on a 360 controller."}
{"product_id": "B00E6OLJ88", "context": "Can i have a list of all the mods in the order of when you press the button on the back", "response": "Austin just look in the product description."}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "Keyboard is qwerty with number pad yes"}
{"product_id": "B006QRMR4S", "context": "Is this a US based product?   Last DS I bought from Amazon came from China and I had lots of problems with it", "response": "All 3ds systems are assembled in China. You can buy a new one from a U.S. store, but it will still come from China."}
{"product_id": "B00ANHBJBY", "context": "So does this controller register as a Pro Controller or Classic Controller? Is it wireless?", "response": "It show's (on the games that display it) as the pro controller."}
{"product_id": "B0089OBLDO", "context": "Can you use this to connect a wired guitar for xbox 360 to a ps3 to play rockband?", "response": "yes, well done, thank you so much !!!"}
{"product_id": "B00CMQTVUA", "context": "Does the xbox one only support hdmi?", "response": "Yes, so you need a flat screen TV."}
{"product_id": "B001444IN6", "context": "How will I be sure that this game will come with the codes necessary to install it?", "response": "Hi, thanks for asking. The factory code is printed on the back of the manual. there is only one install code.Aaron"}
{"product_id": "B009AP23NI", "context": "Is this compatible with Wii games played on WiiU?", "response": "Yes, totally. Is the same controller because i have other. Thank you."}
{"product_id": "B006W41W3M", "context": "Is this just the headset or does it include the transmitter, cables, etc.?", "response": "Yes, it comes with the headphones, transmitter, & the cables. It should have everything you need! If you are getting them for games like Call of Duty you will love them! It's like hearing online for the first time!"}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "Taiwan and use it comes with both in an unopened box."}
{"product_id": "B0016897GS", "context": "the router to connect 30 ft. away .http://www.amazon.com/gp/product/B00NR2VMNC/ref=ox_sc_act_title_1?ie=UTF8&psc=1&smid=ATVPDKIKX0DER", "response": "Yes, that'll work just fine."}
{"product_id": "B00ATHFLZS", "context": "does it work for minecraft", "response": "Yep! I use this mouse for minecraft, planetside 2, swtor, and plenty of other games. It works well and I really like it."}
{"product_id": "B00DE2W4PK", "context": "I did not come in the box PS PLUS membership. As I do in this case?", "response": "No, the PS PLUS one year membership does not come in the box. Instead, the code for one year is sent to your email address registered with http://amazon.com. Hope this helps"}
{"product_id": "B00G6CLZPA", "context": "Is this any different from the psp demon fleeting game? or the same?", "response": "The main game is the same but they added the extra scenes and stories from the 3DS game and they have extras and a lot of dlc content. Must have for any hakuoki fan!"}
