{"product_id": "B00AAQRNQ8", "context": "Does the scroll wheel have left,right and middle click on the scroll wheel ? I really like this feature", "response": "It does not, no."}
{"product_id": "B005M0KSIM", "context": "Does this come with a online game code?", "response": "It does come with a code for the game. And it installs a program where you can play against other people. So I would say yes, the code allows you to play other people online, if that is what you are asking."}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "Hey EmanueleThe games all come together in one foldable holder, however it is not a steelbox. Hope this helps."}
{"product_id": "B00GZ1GUSY", "context": "Do you have to have internet to play this?", "response": "No, you don't need internet to play the campaign."}
{"product_id": "B001CXYMFS", "context": "Does this have yaw control? As in, can you twist the stick clockwise/counterclockwise?", "response": "In short, yes.  Long answer:  There are two options for yaw control.  The stick has twist functionality for yaw.  For a second option, there is a two way rocker/lever bar behind the throttle assembly (where the tips of your fingers rest)."}
{"product_id": "B001Q24UAM", "context": "Does Play! have the actual games or just one-hr. trial versions with the opportunity to buy the real games?", "response": "It is a full time game."}
{"product_id": "B000OPOCFU", "context": "is this compatible with windows 7 64 bit", "response": "yes it is compatible."}
{"product_id": "B001AATQ0Y", "context": "Does this item work with 64bit system like Win7-64bit or Win8-64bit?", "response": "Yes it does. Im using windows 8 and it works perfect but i had to download scp-ds3 package driver for it to work with emulators"}
{"product_id": "B008HPAXZ2", "context": "It's only one screed protector filter?", "response": "It's one set (two screen protectors), one for each of the screens in the Nintendo 3ds xl"}
{"product_id": "B00562O8U0", "context": "I have a Sony BRAVIA XBRHX929 TV and wondering if I need a 3d Synch xmitter along w/ these glasses or will it synch/work directly with the TV ?", "response": "I bought those & had to send them back cause they have to work with a Sony TV. Now which one is a good question. Good Luck. I know I have a PS3 and a view sonic projector & it didn't work at all."}
{"product_id": "B00FNKMVUO", "context": "How easy is it to switch profiles?  (And how quickly?)  I sometimes have to switch strategies quickly, meaning a whole new set of macros.  Thanks!", "response": "as long as it takes your PC to open the program and how fast you can click 2 places, its 3 clicks open, select profile, apply. so like 3 seconds"}
{"product_id": "B006W41X36", "context": "does it work with ps3", "response": "Works amazing. Used it for call of duty and you can hear feet movement very well and be able to tell which direction the opponent is coming from"}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "Can I have it"}
{"product_id": "B00DE2W4PK", "context": "Includes AC power cord?", "response": "Yes, as I mentioned it comes with all accessories. Are you planing to purchase this console?"}
{"product_id": "B00DE2W4PK", "context": "DOES THE PS4 PLAY THE PS3 GAMES?", "response": "You can not play ps3 games on ps4, BUT! some ps3 games will play on ps4 by paying a upgrade fee. This is done thur the ps4 store. mostly just the popular games.  Good luck.  tom k"}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "I have windows 7, this is the latest version so I would think so"}
{"product_id": "B002JVX5V4", "context": "will it work on laptop windows 8", "response": "I have no clue I have Windows 7"}
{"product_id": "B0094H8H78", "context": "can it be plugged to tv?", "response": "Yes, although some AV cables will only show video, if you plug the RED end into the Videp (yellow) slot. Due to a unique configuration. This should help. Feel free to contact me if you need information about games."}
{"product_id": "B007A7UJ4S", "context": "Does anyone who has previously bought this game thru amazon,does it come with the box or just the downloadable disk?", "response": "It comes as the disc in the box"}
{"product_id": "B00BGHUS58", "context": "can i choose chinese in language setting?", "response": "I'm sorry but Chinese does not appear to be one of the options. I had my son check."}
{"product_id": "B00562O8U0", "context": "where can i get a charger for these glasses?????", "response": "Any wall charger for usb devicee power supply will work. I use a double usb wall plug so I can charge 2 @ a time."}
{"product_id": "B0042J7I3C", "context": "How long is the cord?", "response": "I'm not sure of the exact measurement but it's pretty long, the controller can be in my lap & there's still quite a lot of cord that isn't being stretched.. ( if that makes sense?)"}
{"product_id": "B007XVTR12", "context": "Are there any other FPS out right now that you might recommend after having played this game? Also, does this work with the XBOX PC controller?", "response": "Yes it will work with the Xbox wired controller. I highly recommend Titanfall. That is a great game."}
{"product_id": "B008GEH8LQ", "context": "can it play japanese inported games", "response": "Sorry man, this is a USA model and so far all 3DS consoles are still regional-blocked which means you can only play games that belong to the console version you've purchased. So you can't play Japanese games on a USA vesion 3DS."}
{"product_id": "B0057WDBHA", "context": "Will this work with the Disney Infinity games? I bought a different one specifically to use with those and for some reason it won't work.", "response": "I mostly use it on PC, but sometimes PS3 and I've never run into a game it doesn't \"work\" on. That being said, the L1 and L2 buttons are not very conveniently placed. If those buttons are used much for Disney Infinity, you might consider an arcade stick with an 8-button layout instead."}
{"product_id": "B00EI4V3X2", "context": "just got this headset and so far I love it but I can't turn chat volume down. As soon as I go into the party the voices are really loud", "response": "Just go to preferences => voice and then just lower it."}
{"product_id": "B00GOOSORM", "context": "if i baught this for friend in Canada(BC) would it work? i tried a psn points card once didnt work cuz of currency issues", "response": "Yes it will work . It's not a PSN card. It's a code that has to be used on the Mog Station on the FF14 members website. So he won't have a problem.  This code is not entered on the PSN."}
{"product_id": "B000IZAQD8", "context": "can it play ps1 games", "response": "As I did my research yes you can play ps1 on ps2!"}
{"product_id": "B002RYLG4Q", "context": "I heard if you played the original NES this system has a slight delay compared to it, have you noticed this delay (if any) and if so is it noticeable?", "response": "everything great just cheep plastic so have to be careful not to break it."}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "I do not believe that internet or phone registration is required.  The registration key is included in the package."}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "Not yet. Xbox is currently working on a program that would allow 360 games to play on the One, but it is easier said than done because the architecture and language are both completely different."}
{"product_id": "B003O6CB6S", "context": "Will this work on windows 7??", "response": "Yes it'll work on windows 7 but it depends on the bit your on like 64 bit would work perfectly 32 bit will not work"}
{"product_id": "B000B6MLTG", "context": "Will this work for a Mac?", "response": "If you have an adapter for a VGA input yes. Mac uses other inputs depending on what year your mac is."}
{"product_id": "B00E6OLJ88", "context": "Can i have a list of all the mods in the order of when you press the button on the back", "response": "It comes with a sheet that has all the mods listed in order."}
{"product_id": "B0050SZE2G", "context": "i still have to download with the disk right ?", "response": "The game is on the disc.  You install it from there, but it will need to download and install whatever patches came out after the disc was made."}
{"product_id": "B00F27JDY0", "context": "can you change language to english and have everything like us version and can you use your us psn account?", "response": "Yes, I imported the vita to the uk and had no problem with changing the language. The only problem I have encountered is with some games the x and o buttons swap functionality."}
{"product_id": "B00EZKNT18", "context": "How long is the cord?", "response": "6-8 feet.  Pretty long"}
{"product_id": "B001KMRN0M", "context": "Does this come with a memory stick?", "response": "it  dose not come with a memory stick  but  you  can  get one on amazon  for  a  good   price I love my psp"}
{"product_id": "B00FKV8AK6", "context": "does it have fotus armor included???", "response": "I don't recall that name in the list of codes and maps included with this title. It does come with quite a lot."}
{"product_id": "B00JFCA6V2", "context": "dose it come with the charger", "response": "Yes...battery life on mine is super legit too!...no memory card though have to buy separately...When it arrived battery was completely dead so I thought it was broken. ..can't beat the price anywhere!!!!"}
{"product_id": "B0000512IE", "context": "Does anyone use these for Elite Dangerous? If so, how are they?", "response": "i actually do use these for Elite Dangerous and i have them set as yaw.. they work perfectly and needed no additional help or deadzone. they are spot on right out of the box."}
{"product_id": "B007JM8ULS", "context": "Will I be able to play my original xbox games on my 360 slim with kinect with this hard drive plugged in?", "response": "No its a huge ripoff it's a non connectable with 'x360' PRINTED on the side. Go to gamestop"}
{"product_id": "B001NT9TK4", "context": "Will this wheel work with windows 7 ultimate 64 bit os?", "response": "Yes it does - works great"}
{"product_id": "B00B3PDH5G", "context": "My headset keep turning off while in the middle of a game, does anyone else experience this? Happens in the middle of gameplay.", "response": "I don't have that problem.  It is easy to hit any of the buttons every time you touch them though."}
{"product_id": "B005BLAJ68", "context": "Does this game have Bridge? I can't find a list of games. Also, if so, will it work on Windows 7. Some reviews say there is a problem with different games and Win 7.", "response": "Yes,  it has bridge.  The box says it will run with Windows but I have not tried it,  runs fine on Windows 8,  although it can take a while to start up."}
{"product_id": "B007W8S2MG", "context": "In terms of the story line, will everything still make sense if I haven't played Persona 1, 2, or 3?", "response": "The previous Persona games are not associated with this one as far as story and characters. Just standard gameplay mechanics and some systems are the same. Just like if your familiar with Final Fantasy games, they are all individual as far as story and plot"}
{"product_id": "B00CTKHXFO", "context": "If I buy this game today, will I be able to download the content or did the codes expire?", "response": "I got this on April 22, 2015 and my code worked.  There's no indication of an expiration date on the card."}
{"product_id": "B004C4U1VI", "context": "Are new cables supposed to come in a box or just in a plastic bag? I just got them in a plastic bag and wanted to make sure they aren't used.", "response": "Mine were in a bag too."}
{"product_id": "B004RMK5QG", "context": "I am located in Egypt. I tried to purchase the membership on the PS4 but Egypt isn't listed in the country list. Is it gonna work if I purchase this?", "response": "The only way it is going to work is if you create a new PSN account with the country listed as: USA (United States of America)."}
{"product_id": "B0099OZR9W", "context": "Stupid question but i need to know if there are directions for the install?  I'm not tech savvy at all  lol", "response": "It comes with directions but it's pretty much straight forward."}
{"product_id": "B0076HD2W8", "context": "It only blinks once or twice when I hit the button on the receiver is that normal? I can't sync it to my controller.", "response": "http://www.microsoft.com/hardware/en-us/d/xbox-360-controller-for-windows here to update Drivers and then   this how you sync your pc to your controller https://www.youtube.com/watch?v=AaqFQkSrikA"}
{"product_id": "B006JKARP8", "context": "where is the other cable for the portable charger", "response": "It didn't come with a cable"}
{"product_id": "B00FQFFPZO", "context": "is it 4 player multiplayer ?", "response": "I believe it is but the screens are extremely small... Very difficult game to play at first but extremely realistic!"}
{"product_id": "B0054JGGGY", "context": "Want to be sure I'm getting the latest product. Can someone confirm this has 6400dpi?", "response": "Yes, it's the latest product, got mine a few days ago."}
{"product_id": "B0083H4NG4", "context": "My window 8 laptop does not have a cd drive, would still be able to install all the necessary drivers and software", "response": "My Alienware has a cd drive but the mouse comes with one of those little cds...I went to google and searched for Perixx MX-2000IIB software and found it and downloaded it and it works perfect."}
{"product_id": "B0050SYR74", "context": "Does it interfere with wi-fi?", "response": "I've never had a problem with internet while using them but sometimes when my phone updates over wifi the sound is kind of scratchy. I fixed that by moving the receiver to a line of sight position"}
{"product_id": "B00D6PTMB4", "context": "rocksmith 2012 or 2014, $40 price difference.  Is it worth the cash to get the newer version?", "response": "Honestly yes it is worth it. You get ALOT more content on the new one and the second one is more of an upgrade to the Rocksmith product rather than just a sequel. Definitely get the new one you won't regret it"}
{"product_id": "B00FM5IY4W", "context": "Can two players play this game at one time?", "response": "Yes but you need to play other player online"}
{"product_id": "B00AXI9WFS", "context": "Which system is the best to play infinity on ?", "response": "We hear some people say the Wii version doesn't not include some of the online extras that the PS3 and X360 version have but, otherwise it's just a matter of preference. -IWD"}
{"product_id": "B001FBHT34", "context": "Does it work with a ps3? Does this work with a ps3? I know I'd have to get the adapter for the usb and mic so I'm just wondering if it'd work then.", "response": "I've used mine with my PS3 via a USB adapter.  Works fine, but the cord is a bit short."}
{"product_id": "B0036VO4XO", "context": "Macbook pro has only output and no input. I need device to allow me to direct mike output to laptop input via usb port. Will Amigo ii do this?", "response": "MacBook Pro uses a connector that combines output and input. You can use a set of iPhone headphones to verify this for yourself.You can split the output and input using a device like this: StarTech.com Headset adapter for headsets with separate headphone / microphone plugs - 3.5mm 4 position to 2x 3 position 3.5mm M/F"}
{"product_id": "B00D3TRMD8", "context": "Can you download it on Amazon tablet", "response": "I would guess that would depend on the tablet and if it met the min requirements of the game. Game play would def be affected if not using a mouse and keyboard"}
{"product_id": "B00B98HF1O", "context": "Hi.  I have a US Xbox 360.  Will this play or it is locked to some other Zone", "response": "Yes you are able to play on any xbox 360 device"}
{"product_id": "B0050SZBP6", "context": "is this the physical game?  or just the serial... Standar Version", "response": "yes it is, you missed it for $5.00 @ world of warcraft.com, for the digital edition last week.Good luck.... Ray B"}
{"product_id": "B00H1FCUBE", "context": "Can they connect wireless with PS4", "response": "No. This is why I ordered them, and they would show a connection, but then had no audio."}
{"product_id": "B00GOOSORM", "context": "If I use a 60 Day Time Card, does it countdown based on my time played or just 60 consecutive calendar days?", "response": "60 consecutive calendar days"}
{"product_id": "B00FJWNSU8", "context": "Does this version come with all the DLC's?", "response": "Yes it does everything is unlocked from characters to modes and etc."}
{"product_id": "B0095P5K8I", "context": "How long is the cord on the mouse?", "response": "more than a foot and a half but not 2 ft."}
{"product_id": "B00DWXUYN0", "context": "Will a regular 3ds fit well in this case? Would it have too much room and slide around?", "response": "A regular 3DS will, in fact, fit in this case.  While it is designed with the XL in mind, it holds pretty firm so you shouldn't have to worry about too much sliding around.  There are smaller cases for the standard size 3DS too."}
{"product_id": "B0071NH8B8", "context": "Does Vita have a GPS for the car?", "response": "If you have 3G on your psvita, then yes. ."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 8.1 64 bit", "response": "It works flawlessly, not considering some bugs in game itself.If dx9 problem occurs, refer to http://steamcommunity.com/app/47810/discussions/0/558751812749741621/I didn't have such problem but some does.Enjoy!"}
{"product_id": "B00G6YJ60E", "context": "Can I play this game Offline?", "response": "Yes, once you already downloaded it, the game as well as your saves, are saved onto your hard drive. So you can definitely play it offline."}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "I would say that it should as I have Vista on my laptop and it installed with no problems. HTH"}
{"product_id": "B000VRCNLG", "context": "Will it work on windows 7", "response": "No, it doesn't.  I bought for use with Win7 and No Go. And can't return. I searched under Win7 games and this one came up. Some users said that it would work with 7.  Read the product information carefully."}
{"product_id": "B00H3VJYD8", "context": "Will this controller work on windows 8.1? I am wanting a controller for Watch Dogs.", "response": "Yes, I've used it on a number of games on 8.1 with no problems."}
{"product_id": "B00DGZDFO4", "context": "Can this game can be run Locally on my Pc? I dont like to play online, I prefer play against myself.", "response": "I was able to run and play the game with no online connection. Most of the game is played as a single player."}
{"product_id": "B0083H4NG4", "context": "Does this mouse have a \"Sniper\" Function?  IE..can you lower the DPI by pressing a button, then release it and go back to your normal DPI?", "response": "I don't think so. There's the switch in the middle that adjusts it up and down, but it probably wouldn't be good enough for actual sniping."}
{"product_id": "B0029M6VKA", "context": "Can the device be fitted to the side of the monitor? Or does it have to be the top?", "response": "There is actually two pieces.  One that goes on the top of the monitor or some other structure that is in front of you and there is another piece that attaches to a hat. Neither wouldn't attach to the side of the monitor and I wouldn't recommend it even if you can tape it."}
{"product_id": "B001CXYMFS", "context": "Can you detach the throttle but still use it?  Say if I wanted to mount the throttle on the left arm of my chair, and the flight stick on the right?", "response": "Yes it comes with the tool as well to disengage the lock. U can put it as u like."}
{"product_id": "B004FS8LYK", "context": "How much hard drive space is needed for the ps3 version. It should say at the back of the case.", "response": "5.2mb from the case."}
{"product_id": "B001E93IWI", "context": "How do you use the headset part, it doesn't work i can't hear anything", "response": "I didn't get mine working so I returned them"}
{"product_id": "B0012DPHKW", "context": "Hi, we have a computer with Windows 7.  Will it work on our computer?", "response": "Yes, that is what is on my computer. So, it definitely works. :)"}
{"product_id": "B00005NIMB", "context": "Will this work on windows XP?", "response": "Yes, mine works with WinXP and Win 7."}
{"product_id": "B002BRZ79E", "context": "When you buy the PS3 version on Amazon, do you get a code when it ships? or do you have to wait for your physical copy to ship through mail?", "response": "I get a code when it's shipped"}
{"product_id": "B00005B8G3", "context": "On a scale from 1 to 10, how bright is the screen?", "response": "Scale of 1 to 10 doesn't work, you need a well lit room, the system doesn't have a lighted screen.... At all... Bright=0"}
{"product_id": "B002DUCF7Q", "context": "What Does This Do?", "response": "It simulates the radios in a real airplane, and does it very well"}
{"product_id": "B00292OW1U", "context": "Is is compatible with Macs?", "response": "The device itself is. But the software is not. And some of the macroed buttons are not. And the function buttons don't work. But the side pad and stuff still do."}
{"product_id": "B00CX8VY4S", "context": "So you can just play straight campaign even if you have an Xbox live membership? Or are you forced to play online?", "response": "You can play the campaign straight through, sometimes people try to hack you while in campaign but no big deal."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "No this controller is for emulators only"}
{"product_id": "B005J37I4Y", "context": "I HAVE XP400 IS THIS COMPATIBLE", "response": "Yes. If it came with a Bluetooth button"}
{"product_id": "B00GZ1GUSY", "context": "Is it normal to see this annoying white flash between screens a camp fire?  Not sure if mine is defective because it's irritating/annoying. TYIA.", "response": "Yes that is normal."}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "In the north American version yes"}
{"product_id": "B0072HYRNK", "context": "Does it work with PS4?", "response": "I have not done the test, I have not a ps4"}
{"product_id": "B00DHUUTEM", "context": "how do you turn the keyboard lights on", "response": "Hold the \"FN\"  button and press Esc to desired lighting level"}
{"product_id": "B000VLNXRU", "context": "Can you ONLY use the 12 Saitek provided instrument modes, or can you customize them, or develop your own.", "response": "You can customize them if you are a bit handy.  There is a full set of instructions provided on the web for such undertakings."}
{"product_id": "B00B0QONB0", "context": "This hardrive can be used on the xbox 360 slim console in black.", "response": "Yes it can. My daughter has the slim touch and it worked great"}
{"product_id": "B00EOI2MRS", "context": "Does it work with steam on pc?", "response": "Mostly yes, that's more game-specific, you'll probly want an external remapping app such as joy2key or Xpadder for some games."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "I live in Hawai'i and can confirm that pre-ordered games will not arrive on release day. They will get to you at least 2 days later."}
{"product_id": "B0017TFLBQ", "context": "Is HOMM3 compatible with Windows 7 ????", "response": "Yes it is. That's what I have on my laptop, and it runs perfectly fine."}
{"product_id": "B00E8RVP0U", "context": "Does this also play on a wii mini?", "response": "I really don't know, but I'm guessing yes.  Call best buy and ask or email the wii people directly."}
{"product_id": "B004IK24MU", "context": "What color indicates that the remotes are fully charged?", "response": "blue, but these remotes... at not good. They are from 3rd party designer. Save your money and get really Wii remotes from Nintendo."}
{"product_id": "B0080CE2WC", "context": "does this come with the rechargable batteris?", "response": "No.  It's just a charging stand.   You'll have to get the batteries separately."}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "yes it is a type of driver must be installed.u can google it ok.u will hav to map ea button to which ever game your playing tho....."}
{"product_id": "B00CTKHXFO", "context": "Do you need to download patches for both of the included discs?", "response": "yeah, it will want to dl the update right away"}
{"product_id": "B0018YXM3Y", "context": "Does this game run on windows 7 ?", "response": "Not very well. There are some issues that windows 7 has in running Empire that I have yet to see resolved. It usually opens normally but then only shows the desktop with the game music."}
{"product_id": "B0016897GS", "context": "do you need clips", "response": "Not sure what you mean by clips?If you mean to plug into the box or the PC then the answer is NO. It can plug right into the box and PC nothing else needed."}
{"product_id": "B0083H4NG4", "context": "My window 8 laptop does not have a cd drive, would still be able to install all the necessary drivers and software", "response": "I never used the cd and my mouse is working fine."}
{"product_id": "B003O6N64Y", "context": "Will they Play 7.1 through Smart TV?", "response": "They should because there 7.1 them selfs"}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "Yes, you can play offline."}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "it works fine for me so i'd say so."}
{"product_id": "B00DCBDNW6", "context": "Do you have to buy a subscription to play this game?", "response": "Yes.  It's online only.  I believe is $12.99/month."}
{"product_id": "B00H8NS1K8", "context": "is the cable from the headset detachable, thats the only thing stopping me from buying this", "response": "No, it's not detachable."}
{"product_id": "B00KGGJPYA", "context": "will this charge samsung galaxy tablet?", "response": "According to the write up it does - you can check the main page in Amazon"}
{"product_id": "B00G6YJ60E", "context": "Is Whistleblower included in this or do you have to buy that seperately?", "response": "No. You HAVE to buy it separately."}
{"product_id": "B0000C7GHG", "context": "How long is the controller cord? Also, doesn't the PS2 make noise?", "response": "A new Ps2 should make very little to little noise from the disk revving up to the fan softly blowing. However a used one might make more electronic/more exaggerated noises noises as the hardware fights against dust build up. Ps2 controller is normally 2 Meters, and you can buy extension cords for them."}
{"product_id": "B0038PBF1W", "context": "is this just a simulator or does it have arcade play options", "response": "There are many options for types and levels of play."}
{"product_id": "B008M4BNQ6", "context": "does anyone know if these can be plugged into a gaming chair and used thru the chairs plugs?", "response": "Yeah but they are powered via usb, so you could even use one from a phone charger or something if your chair doesnt have a usb port."}
{"product_id": "B00FE8WKMO", "context": "Do you NEED a balance board in order to use the Wii Fit U?", "response": "With the exception of the FREE RUN, and a few of the STRENGTH and YOGA games, otherwise yes, many of the activities require the Balance Board. However, you can use the Wii Fit Pedometer in everyday activities and download them on to the game. Hope this helps."}
{"product_id": "B0097CUREG", "context": "Does anyone notice that the Kaboom slot is missing the button with a \"$\" that is used to load in more credits during game play? Or is it just mine?", "response": "Mine seems to work fine.  Do not have all games unlocked.  I will double check."}
{"product_id": "B00FYMTUQY", "context": "Is the angle of the camera adjustable? Can I adjust it took look lower or higher as I desire? (Use Xbox fitness a lot and need it to see floor level.", "response": "responderei em português: é totalmente ajustável, fixa nas TV mais finas. Não gostei, porém, da qualidade do material plástico."}
{"product_id": "B00BMFIXKQ", "context": "I played the first assassins creed and stopped because it was so repetitious. Are the later assassins creed games the same way?", "response": "This one is sometimes repetitious in free roam. But in the campaign, its always different"}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "Yes it was designed by Ensemble, and was produced by Microsoft studios, whether or not the actual CDs are created in the US- I have no idea."}
{"product_id": "B00178630A", "context": "What i get if i buy this product? The game or the key?", "response": "If you buy new directly from Amazon then you get the game CDs and the key and you can play it online."}
{"product_id": "B00HFZ5KCG", "context": "are the O and X buttons swapped?", "response": "No they are normal."}
{"product_id": "B00E8JZILA", "context": "there's no cross-PLAY on this right? Saving the game on PS3 and continiuing on Vita... i already have this on PS3.", "response": "I'm already have it on PSvita"}
{"product_id": "B00D9FQAM0", "context": "does this come with any cords", "response": "Yes this system comes with cords a controller and a 250 gigabyte hard drive well worth the buy"}
{"product_id": "B002VBWIP6", "context": "People, I am from URUGUAY and i was wondering if ONLINE GAME CODE (GOLD MEMBERSHIP) would work properly in my country.  Thanks", "response": "I do not believe that Uruguay is a supported country. You could have an account in a supported region however and use the code. Hope that helps!"}
{"product_id": "B00GD962OA", "context": "Do you need to buy a controller in addition to this bundle in order to play games?", "response": "So far no unless you want to play regular Wii games all wiiu games so far are compatible with the wiiu game pad that comes with it."}
{"product_id": "B00BCEK2LA", "context": "Does this have adjustable weights? If not does it feel too heavy or too light in your opinion. Does this come with a warranty in case it breaks?", "response": "One year Logitech warranty included,  no weights, simply put it just feels good for my hand size, not heavy or sluggish yet not light as in cheapo construction or materials and it extremely responsive to cursor movements."}
{"product_id": "B00D78Q4UM", "context": "Does this keyboard require you to plug it into two USB ports, or just one?", "response": "The K50 Has two I believe. I would recommend to look at unboxings"}
{"product_id": "B00I4BGNVM", "context": "can I only use the code on steam or can I enter it on the ESO website? How big is the download size for this game?", "response": "ESO website only, it's not on steam.Expect 40-60 gigs with the updates"}
{"product_id": "B00GGUMV46", "context": "Can I play maps if I redeem the code from a US account and play it with a EU account?", "response": "No you cannot. Codes only work to particular to regions. Example: US codes only work with US PSN accounts that are setup for US."}
{"product_id": "B006YDPU48", "context": "I really want to play this game but I'm sort of leery of the difficulty level I keep hearing about. Is it so hard it's frustrating?", "response": "No it's not. You have to be keep your cool though...the whole strategy is not to be impatient, greedy or hasty. If you learn that, you'll learn how to get through even the most difficult parts"}
{"product_id": "B00F2ENJY8", "context": "Can you do 2 players on this console? And How?", "response": "Sure you can. It actually depends on the game you want to play that allows 2 players. This particular item comes with only one controller, so you will have to buy the wiimote and nunchuck (if needed). That was my case."}
{"product_id": "B009ZDPYKO", "context": "is this the RED Tree Rex?  Not The BLUE one.", "response": "Yes. The bottom is orange (red). It still works though."}
{"product_id": "B00D96BORK", "context": "I have a Mac Air, and wondering what the connector/cable options are... is it USB, classic speaker/mic?", "response": "USB and mic plug in. Very good headset!"}
{"product_id": "B000K9Q5NW", "context": "I'm 5'3 with short legs, will this be a problem?", "response": "No it won't be. The frame is adjustable and can fit someone much shorter than you. I am 5'7\" and it fits me great. Buy it, it's a great package."}
{"product_id": "B007JM8ULS", "context": "Can i play Titanfall with this hardrive", "response": "no titanfall is an xbox one game therefore a 360 hardrive will not work for you"}
{"product_id": "B003RS1A7Y", "context": "Is it compatible with Guitar Hero: Metallica and GH 5?", "response": "As far as i Know, I don't believe that it is. You cant quote me on that, but when i was researching this guitar, it said that it was only for Rock Band 3."}
{"product_id": "B00002SANH", "context": "I have Windows 8 on my computer. will this work?", "response": "Yes, you just have to run it in compatibility mode for windows xp (or 98, I forget how I did it)"}
{"product_id": "B0087ZMAUS", "context": "Sorry not to ask again, but, I want to get a good idea before making a purchase. Do these feel sturdy or more flimsy?", "response": "They are light weight. Which could be misconstrued as flimsey. Compared to the g35 they are nuch lighter but my g35 broke from falling from my desk chair to the ground. But these have been dropped from my desk twice and are still fine. Hope this helps"}
{"product_id": "B009AFLXJS", "context": "Does it works in wii games at the Wii u's wii mode?", "response": "i can pretty much guarantee that it WILL NOT - they're completely different technically and there's been no update/patch for using WiiU Pro Controller in Wii Mode."}
{"product_id": "B003VAM392", "context": "How long is the USB cord?", "response": "About to 2 meters."}
{"product_id": "B002B9XB0E", "context": "Does it come with a CD to configure controls or does it have plug and play compatibility?", "response": "It's plug and play, however there are some games that won't register it [typically games that are built for an Xbox 360 controller]. In which case, a handy program called \"Joy2Key\" fills the gaps for me. :)"}
{"product_id": "B00D9FQAM0", "context": "Can you add the purchased hard drive on the side like the arcade model? My son had the arcade model and the hard drive on the side?", "response": "This unit uses a hardrive configuration that goes in a slot. The hard drive is not on the side like the white xbox 360 models. The harddrive for this model is different than the sidemounted ones"}
{"product_id": "B00FBV6V56", "context": "Do all the wires you need to use this headset come with with product?", "response": "All of the wires necessary for PC, Xbox and PS3 usage come with the product."}
{"product_id": "B008GEH9HO", "context": "What games does it come with?", "response": "0. but some have it where it comes with 1 game but you pay more and it may not be the game that you want. my grandkids love theres."}
{"product_id": "B000H1V56U", "context": "Does it work with the xbox 360E", "response": "no fan is in a diff spot and it is smaller on 360E...srry"}
{"product_id": "B002B9FIUU", "context": "Can you use two of these for 4 player games; IE Mario Party?", "response": "I have not tried two controllers yet, my brother is dying to get into some goldeneye though.  Im sorry."}
{"product_id": "B0006PJAZU", "context": "How many computers will I be able to install WordPerfect 8?  Would like to load on both of my computers.", "response": "as long as you don't have windows 8 it should work fine.   I hate it that I can't get it to work on mine with Windows 8  so solutions so far..."}
{"product_id": "B00BMFIXZG", "context": "Can I buy the DLC later and have it work with this version?", "response": "I think Ubi$oft would be more than happy to sell you the DLC. Yes, your game is registered with Uplay, and any purchases made with the same account will apply to registered hard copies."}
{"product_id": "B00F27JGVA", "context": "Does this card works correctly with USA's PS Vita systems?", "response": "Im in canada and it works very well. I dont think there is a difference between the systems sold in canada and US."}
{"product_id": "B0018YXM3Y", "context": "Does this game run on windows 7 ?", "response": "Yes, I've played it on my previous laptop which is a Windows 7."}
{"product_id": "B00DLDEKOK", "context": "Can this be used with the Xbox 360 wireless controller?", "response": "That is what it is for"}
{"product_id": "B00D4WTO1M", "context": "is the dlc packs multiplayer only or is  onslaught and devestation packs a new game within the game single player mode?", "response": "season pass gives you all the map packs, (DLC)."}
{"product_id": "B00GHTP7SS", "context": "Does the audio work?", "response": "YEP as long as your normal audio works This should work As always get the latest drivers for your audio card Check settings in game"}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "Yes your rightI thought it was just me"}
{"product_id": "B00AK4QB22", "context": "where is the manuel?", "response": "Well I think that was FromSoftware's attempt.. or maybe Bandai's to force you to buy the strategy guide. But the start of the game is basically the manual.. you play through, die horribly.. and then finally make it where your supposed to go to."}
{"product_id": "B00D96BJSO", "context": "Does this headset have mic monitoring?", "response": "I don't know what mic monitoring is. let me know what it is and I will be able to answer you"}
{"product_id": "B0076HD2W8", "context": "Will this work with Fire TV ?", "response": "You can use a USB wired Xbox Controller and it'll work, however, you cannot simply just \"use\" xbox controller because fire TV runs Android games.  May be Minecraft pocket edition might work okay."}
{"product_id": "B00DE2W5XG", "context": "Does everything like ps plus membership etc works in India?  Please answer. Thanks....", "response": "Yes it looks like it's in India. A quick Google search:http://en.wikipedia.org/wiki/List_of_Instant_Game_Collection_games_(PAL_region)http://www.gamechup.com/ps-plus-indian-subscription-details-one-month-sampler-sub-added/http://gamingbolt.com/sony-touts-playstation-plus-numbers-in-india"}
{"product_id": "B00GJSUUC0", "context": "please can anyone tell me if this is a blue ray CD or PSN code?", "response": "blu-ray disc, dude! :)"}
{"product_id": "B001DNGCN2", "context": "I'm Not a Big Wiz-Kid on This Stuff, but My PS3 is a CECH-2001B Model. Will This Cooling Fan Fit My PS3, Properly? Will It Run Any Different?", "response": "This Fan Will Only Work On All FAT PS3 Models NOT The PS3 Slims Or The PS3 Super Slims."}
{"product_id": "B008BGXYBM", "context": "Does this Razer Taipan have Dual Sensor (two holes, one optical, one laser in the bottom)?", "response": "One hole but looks like 2 lenses."}
{"product_id": "B003VUNWG0", "context": "it wont download on my windows 7", "response": "You will have to check if the software is compatible with windows 7.  I had use the software on an older version of MS Windows XP or 98."}
{"product_id": "B00D84DRNC", "context": "Does this fit New 3ds xl?", "response": "It fits in it pretty snug. That's what I have and I use this case. It's pretty nice!"}
{"product_id": "B000HZFCT2", "context": "Is this compatable with windows 7 ?", "response": "It absolutely is that's what I'm running and I've not had an issue with it whatsoever.  It came with a cd to install drivers but honestly once I plugged it in the plug and play took care of it naturally (though I did still install the cd, better safe than sorry)."}
{"product_id": "B0053B5RGI", "context": "Hi. We're new to Pokemon. Just bought my daughter a 3DS. Would Pokemon X be a good game to learn about the game for a beginner? Any recommendations?", "response": "Every Pokemon game starts in a new region the mechanics and plot of the game are always re introduced at the beginning of every game as long as she can read she will be able to understand the Pokemon world so yes Pokemon X is good for beginners as its a new region and the 6th generation of pokemon"}
{"product_id": "B004G5TUJM", "context": "Does This Steering Wheel work with \"Gran Turismo 6\"", "response": "This wheel will not play NASCAR 14 unless someone can tell me how to make it work."}
{"product_id": "B005LUUWL6", "context": "Does this work for 3DS games, or is it just a ARDS that works on the 3DS?", "response": "I didn't work on my son's 3DS, so we returned it."}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac os Yosemite?", "response": "sorry. I don't have a Mac. I think it will work.I used the windows but, I had bought for Mac by mistake.however, this works well on Windows."}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "One, and it is a great play"}
{"product_id": "B00D96BMV8", "context": "can i use with iphone", "response": "Yes, works perfectly with my iPhone 6"}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "This device is cumbersome to operate compared to it's Razer Naga competitor. G-Shift (second right click) occasionally gets stuck and the mouse has to be unplugged manually and plugged back in to reboot."}
{"product_id": "B0002XJBGE", "context": "I tried to play Call of Duty 4 on my MacBook Pro with this controller.  Plugged it into my USB & it doesn't seem to control anything.  Any suggestion?", "response": "Where can I get that software?"}
{"product_id": "B00CJ7IUGS", "context": "What is the difference between the Legendary Edition and the other one?", "response": "The Legendary edition has all of the DLC content that was ever released for Skyrim. I would definitely go with this version of the game."}
{"product_id": "B002I0J51U", "context": "does move work with all ps3 models ? I have model # CECHH01", "response": "As long as you have a PS3 move camera it will work for any PS3 system."}
{"product_id": "B009IR1SR0", "context": "If I download this game on my current computer and eventually upgrade to a new pc, will I be able to transfer the game ?", "response": "You end having to make a Origin account , which has all the games you buy online. I only downloaded it to my laptop. Unsure if they have limited download to just one computer. They give you a product code just like a CD copy .. I would just buy the CD though looking back.."}
{"product_id": "B007OVHW90", "context": "Does it work with the turtle beach X32s?", "response": "As far as I understand yes this product will work for the x32 I worked perfectly for my x42 and there is little difference between the two. go to YouTube to double check a review"}
{"product_id": "B001IYR53W", "context": "does it have canfiedl and hearts", "response": "It has Hearts and Canasta."}
{"product_id": "B0089OBLDO", "context": "I can't connect the 360-control (wired) and PS3-control (wired) to Xbox 360 simultaneously, any idea of why? after recognizing the PS3 control, the wired-360 is not recognized back.", "response": "This totally screwed me at Evo. i was lucky enough to have someone loan me a different brand. I will say though someone else with the exact same adapter had no problem what so ever. I really have no clue why. I will be avoiding this brand from now on."}
{"product_id": "B001444IN6", "context": "I got the game today and when i opened it had no booklet in it so i cant get the product code. What do i do?", "response": "call or email the company who made the sims games.  I had to contact them some years ago, (cannot remember why) they did reply back to me."}
{"product_id": "B00AIALGZK", "context": "do u have to buy it and download it at the same time", "response": "No, you can buy it here and click download later. Then, you can go to \"Your Games and Software Library\" and the key should be there. You can redeem that key through Steam."}
{"product_id": "B00GJXMRX0", "context": "can i download it again if i erase it", "response": "As long as you have the key they sent you, you can download it again with no issues... I just don't know if you can download to another computer or not."}
{"product_id": "B005OSFUZI", "context": "This may be a dumb question but is this is like a legitimate cable for recording guitar on a laptop? Not just for the game but fo recording software?", "response": "I am sure it would work fine for that if you were able to get a software that was able to pick up the guitar and give it a driver that would make it record-able."}
{"product_id": "B002I0K3CK", "context": "Can this game be played on the original wii system", "response": "No, only works on the WiiU."}
{"product_id": "B007XVTR3K", "context": "can you play this on xbox one? or do you have to play it on xbox 360 only?", "response": "No. This game is for Xbox 360. The Xbox one is not backwards compatible. It will not play this game, or ANY Xbox 360 game for that matter."}
{"product_id": "B004TTNTYW", "context": "When you say it's good for travel does that mean it is a car charger? I don't need that.", "response": "This is not a car charger. Its for a normal home outlet."}
{"product_id": "B008HPAXZ2", "context": "How are they applied?", "response": "There are instructions inside that tell you how to apply it without putting your fingers on the backs of the adhesive.  Each tab is numbered in an order to apply it.  I am sure there are videos on youtube you can consult.  Hope this helps."}
