{"product_id": "B00FYAQUPU", "context": "Is Skylanders Dark Force game the same game as regular Swap Force?  Is the game itself the same swap force game or is the dark force game different?", "response": "Same exact game. Different characters."}
{"product_id": "B0061PAZUS", "context": "Is the game in Spanish?", "response": "No...but many Spanish style beat & dance moves!"}
{"product_id": "B00I9UVY7G", "context": "My grandson sent me a text which said, here is a gift idea for Xmas for him, 2014 FIFA World Cup for xbox 360. Is this the game EA Sports 2014 FIFA?", "response": "Yes it is. It is a fun game. Here is another one FIFA 14 which is different. Look it up if you want."}
{"product_id": "B007YLUCME", "context": "The controller won't turn on itself if I unplug the usb cord.  Is there a possibility of having a battery problem?", "response": "I assume that tried charging it for extended periods of time with no success?  I can only assume that you have a faulty product, since I haven't run into that issue yet and it can play for several before needing to charge it."}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "The clip opens up pretty far, Im sure it would"}
{"product_id": "B005BLAJ68", "context": "what 20 games does it have?", "response": "Blackjack, Bridge, Canasta, Crazy Eights, Cribbage, Euchre, Gin, Go Fish, Hearts, Memory Match, Old Maid, Pinochle, Pitch, Poker, Rummy 500, Skat, Solitaire, Spades, Spite & Malice, Tuxedo, War. Hope this helps."}
{"product_id": "B009RHEBWA", "context": "How do I know that the Federal fom did get e-mailed? Didn't see anything in my \"sent\" e-mail box.", "response": "I can't answer the question. Because I don't file electronically. I print off the forms and send them via US Postal Service."}
{"product_id": "B0053B5RGI", "context": "Does it work on the 3DS XL?", "response": "Yes it works on the 3DS, 3DS XL, and 2DS."}
{"product_id": "B0009WPZOA", "context": "Is this the same as the other need for speed most wanted", "response": "I personally cannot answer this question because it was a gift for my grandson.  Sorry I was unable to help you."}
{"product_id": "B00EHBKUTE", "context": "Can you change the colors of the backlighting to red?", "response": "No. It is green only."}
{"product_id": "B00CD90R72", "context": "What is the difference between FIFA 14 and 2014 FIFA World Cup Brazil?", "response": "I'm not sure because my kids don't have the 2014 FIFA World Cup Brazil, but I think the later is a special edition issued little before the 2014 world cup started and updated to include players and teams which were about to participate in that specific tournament."}
{"product_id": "B0057WDE8Q", "context": "Is it wireless and would it be good for playing Mz PacMan", "response": "Not wireless. Much better for playing Ms PacMan than Xbox controller"}
{"product_id": "B00AXI9WFS", "context": "Do you need to have Kinect to play this?", "response": "No u don't...it does not require kinect to play"}
{"product_id": "B00DE2W4PK", "context": "What do you need the Plus subscription for? is it necessary to play online?", "response": "It's for online play. It's not needed for browsing the web, netflix, and free to play online games."}
{"product_id": "B005M2KSLC", "context": "Can I use this on a black wooden table without a mousepad? I despise mousepads very much", "response": "Its sensitive enough to do so, but it will probably mark the surface over time."}
{"product_id": "B00BGHUS58", "context": "Why was The Signature Shot Pack not included in my copy?", "response": "what copy did u get?"}
{"product_id": "B005CELN8W", "context": "Do you need an internet connection to play this game?", "response": "No, it loaded into my computer, the icon for the game is on my desktop so whenever I want to play the games, I just click the icon....really enjoy these games!!"}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "No, it didn't work on XP"}
{"product_id": "B00166N6SA", "context": "Will this work on a windows 8.1 computer?", "response": "Yes, I have windows 8.1 and it works fine on my computer."}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "Got my e-mail yesterday saying it will be delivered on the 8th so it looks like we have to wait. Not too happy about that."}
{"product_id": "B004W1IX1G", "context": "WHAT IF I DOESN'T WORK", "response": "But it does. It's a great game with many different activities. If it doesn't work send it back"}
{"product_id": "B000ND3XXA", "context": "I have a macbook and heard this would work on a mac...it has a mini disk. does not work. is there a driver i can install/donwload?", "response": "I use a Mac and it runs natively on Dolphin (and, oddly, Steam) with no drivers needing to be installed."}
{"product_id": "B00001LDBZ", "context": "Will this work on Windows 8.1?", "response": "I have no idea, but being that this is a microsoft product, it may well work. What I do understand is that Vista was notorious for not having older software be incompatible for it, and I think Win7, and 8, and 8.1 may have rectified this to some extent at least."}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "It's not too small. It may look like that in the picture but it's a standard guitar jack size"}
{"product_id": "B00IIHU44E", "context": "Do I need an HD tv for an Xbox One?", "response": "To me it's kind of a waste to use it on a non HD TV. The TV pass through is one of the best features and it works via HDMI cable. So an HD TV and HD Cable or satellite package is essential to get the full benefit."}
{"product_id": "B00GS6A6V8", "context": "so to use the codes you go to the playstation store?", "response": "Yes you do. There should be an option on your Playstation menu specifically for redeeming codes under the Playstation store column. It's actually a lot easier than you'd think it would be, and these expansions are entirely worth it :)"}
{"product_id": "B00F27JE1C", "context": "Does this model come with a memory card?", "response": "Afraid not. The 2000 series Vita does however have an internal gigabyte of storage as well as the expansion slot for a memory card. While the storage isn't very high, you can save your games without any issues without the purchase of an additional item,  a nice improvement over the original."}
{"product_id": "B00BCEK2LK", "context": "Does this work on Mac", "response": "Yes. It will work on Mac. However some users have reported some issues with Macs, though it should at least be usable."}
{"product_id": "B009WI7V9E", "context": "Is the game still worth getting?", "response": "YES YES YES VERY MUCH"}
{"product_id": "B0099OZR9W", "context": "can it be install on a xbox 360 model # 1439", "response": "Fits in all standard xboxs"}
{"product_id": "B00BRA9T5Y", "context": "How big is the USB dongle?", "response": "Very small. Fits USB."}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "I was wondering about this myself since I have seven weeks left on my current PS+ subscription.  If I renew my PS+ now will it void the seven weeks that I have left?  I read some report of cases where the renewals don't stack"}
{"product_id": "B0002FGFHU", "context": "does this game have  mutiplayer mode ?", "response": "Along time ago it did. But those servers were long shut down. If you are looking to race online on the PC you could play need for speed world. It's free."}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "jajaja if you want to see facebook, and play sega you need a nvidia shield, this is a nostagia system, like 1991. an Old dream of my generation"}
{"product_id": "B009GZX49Y", "context": "Do you need to download patches like the stand alone disc releases of the included games?", "response": "I did not have to download any patches besides install ac2 and ac brotherhood, i would have to say no"}
{"product_id": "B00IAVDPSA", "context": "Does the remote stay \"on\", or will it shut itself off like the controller?", "response": "It's like a regular TV remote (it's only \"on\" when it transmits a signal). The only difference is that if you move it the buttons light up."}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "I have not tried this but I think the answer is no. I don't think the headset can be in wireless mode and wired at the same time."}
{"product_id": "B00CMQTUSS", "context": "Does this come with rechargable batteries, and if not, which ones should I order?", "response": "No it doesn't, I recommend the Nyko brand ones. They're just as good as the Microsoft ones."}
{"product_id": "B00I4BGNVM", "context": "If i buy this do i get a gamecode for the tamiel unlimited edition on steam or should i buy a different version", "response": "Buy it from Steam or buy it separately, it works the same."}
{"product_id": "B00DBDPOZ4", "context": "how long is the cord", "response": "Roughly 8 feet. If that's not long enough try monoprice, but it wont have the fancy charging/charged light."}
{"product_id": "B00FC1UH82", "context": "Is it wireless? or you have to plug it via usb?", "response": "Plug it in via USB"}
{"product_id": "B00CORA9GC", "context": "F18 Carrier Landing:  I have a Mac Mini with only 4mb of RAM. Would this be a problem?", "response": "I think you are ok. Not a huge risk at the low cost."}
{"product_id": "B00FEDP968", "context": "Do you need a soundcard to let this headset work well?", "response": "No. The headset comes with a built in soundcard which works through usb."}
{"product_id": "B00CTKHXFO", "context": "I see it has MGS 3 HD. Is that snake eater or subsistence?", "response": "It is Subsistence as per other reviews with the fully controllable camera but does not come with Snake vs Monkey minigame. Plus you get the downloadable camos, MG 1 and 2 Solid Snake from the Famicom, and other extras."}
{"product_id": "B00A2WP4UC", "context": "Does it include the sensor bar?", "response": "Yes. The product is perfect. I love it"}
{"product_id": "B0042J7I3C", "context": "Can i hear the gaming sound and friends chat on the headset", "response": "HI, this headset is ONLY for chatting. You do NOT hear the sounds from the Game"}
{"product_id": "B001AATQ0Y", "context": "does this work with ps2 DDR pad?", "response": "It does not work, there is no DDR mode, meaning that you cannot press both left and right or both up and down simultaneously."}
{"product_id": "B00CD90R4K", "context": "If you buy this game, would you get to play an exhibiton, penalties, season, and career, or do you only get to play online matches?", "response": "Most of those game modes are available on the game, so yes."}
{"product_id": "B005THAX5Q", "context": "Why is this game is this game so horrible", "response": "I liked this game, decent graphics good first person shooter. There are more goods than bads about this game."}
{"product_id": "B008M4BNQ6", "context": "does it come with every thing", "response": "If by everything you mean everything you need to hook it up to your tv and xbox to make it work then yes, yes it does"}
{"product_id": "B0053B66KE", "context": "is it playable on ds or dsi", "response": "No you have to have a 2DS or a 3DS"}
{"product_id": "B00BU7WVG8", "context": "Does this game have cops in it that chase you?", "response": "Yes it does have cops that come after u as u are trying to complete the \"mission\""}
{"product_id": "B00IIHU44E", "context": "I want to know if NSA could spy inside my home thanks to the Kinnecht apparatus. Thanks.", "response": "No, but they can watch you through your television set, that is unless you are wearing all red or green...those colors interfere with their TRS relay systems."}
{"product_id": "B00FQFFPZO", "context": "do you need the steering wheel and foot controls to operate this game?", "response": "No it will wprk with the controller"}
{"product_id": "B00BV72X1U", "context": "Would this work with windows XP?thank you in advance", "response": "Yes is does :D"}
{"product_id": "B002AQNT96", "context": "Will this run on XP SP3????", "response": "I wouldn't advise it. Since Microsoft servers do not support a lot of XP systems anymore. I suggest upgrading to Windows seven.I have Windows 7 Ultimate and a great video card. If you do this, make sure your power supply in your pc can handle a better video card.Otherwise, you can damage your system."}
{"product_id": "B000LQ4HTS", "context": "Is the base heavy enough to play with it resting on a desk, or does it need to be bolted down?", "response": "Two words, museum wax. Forget the cups, they suck at sucking. Wooden desk, 4 pea size balls of museum was spaced across each base, push and stick. Leaves no mark, don't need a drill and unless your whacking your joystick around it isn't going to budge."}
{"product_id": "B00D2EGWDA", "context": "is nuketown on it", "response": "Yes nuke town is on it. Also come with a free map pack down loan that adds 4 more multiplayer levels and a zombie level. Its a great buy."}
{"product_id": "B000FQ9R4E", "context": "My son is 8 and wants this game for his birthday.  Is it inappropriate for an 8 year old?", "response": "If appropriate for a child of eight years since it has no bloody scenes or sex"}
{"product_id": "B0018YXM3Y", "context": "why do I have to use steam?", "response": "some how the game is tied to steam so you need to load steam to play it. Sometimes I use steam off line and still play the game. you just will not be able to play with other people on the net if played off line"}
{"product_id": "B000ZKA0J6", "context": "Is this the base game?", "response": "Yes, Heart of the Swarm is the expansion"}
{"product_id": "B009WI7V9E", "context": "Just asking, if the DLC's are on a disc, does this mean that if I get this used I can still get them?", "response": "According to my little brother (who I bought the game for), the DLC is on a separate disc and you need to install it to your hard drive before you can use it in game. Make sure the used copy has that disc in it."}
{"product_id": "B0011E4J7O", "context": "Are these cables originals?", "response": "No they are not they are cheap knock offs spend a couple more dollars and get the real deal unless you want a 3 foot cable that is the cheapest quality"}
{"product_id": "B00FZ12F34", "context": "Is buying this bundle just like buying them in store? Do each of characters and play sets come in boxes with power discs, and original packaging?", "response": "Yes, they were packaged exactly like in the store."}
{"product_id": "B00B15EXJC", "context": "how does it connect in the bluetooth setting or do i just plug it in with the usb wire and it automatically syncs?", "response": "The controller is a wireless USB controller"}
{"product_id": "B008D7F47Q", "context": "can you play it without wifi?", "response": "Of couse , if your pc connect internet you can play. I"}
{"product_id": "B0050SZBP6", "context": "Do you get 30 days access to the game with this expansion?", "response": "Invar been paying for my account for 6 years and hadn't noticed any break in my payments after I expanded. So I'll have to say no."}
{"product_id": "B0002FGFHU", "context": "Hi, I am from Germany. Is this the US Version? I have the German an UK version, but theres no Honda Civic. Is here on this the Honda?", "response": "This is the UK version! They should really put that in the description......."}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "It is made in China. It comes with charger and stylus."}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "Don't believe the picture. It does actually fit, unles you have a some kinf of a unique-jack guitar. :)"}
{"product_id": "B00DC9T2J6", "context": "Does this work on Win 8?", "response": "I use windows 7 but yea it says it will run on win 8 should be good to go"}
{"product_id": "B00EIM3BV6", "context": "will these work on the xbox one as well", "response": "youll need to get the microsoft xbox one adapter to use your mic"}
{"product_id": "B008MI7MWQ", "context": "I noticed the bad reviews on this game. I'd like to purchase it, but want to know if the problems still exist with it? Thanks.", "response": "I not only tried several times to load the game but even tried 2 other computers and no luck.  The company obviously either doesn't care or doesn't know how to fix it.  Either way, a huge dissapointment."}
{"product_id": "B0050SY4DG", "context": "This game comes with multi idioms included spanish?", "response": "I'm not quite sure what you are asking?"}
{"product_id": "B00B1MXGDO", "context": "can i use this for pc gaming?", "response": "Yeah you can, also, check out the sabrent controller. The blue one. It also comes in a 2-pack, can't go wrong with that. A lot cheaper too."}
{"product_id": "B00FC1UH82", "context": "How heavy is this fightstick? I'm confused, because the description said it was 14.1 oz.", "response": "I didn't find it heavy. 14.1 oz = less than a pound... it sure weights more than that though"}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "No the silver and black keyboard comes with blue leds,  the all black comes with red leds."}
{"product_id": "B00CD1FC6G", "context": "Are the keys raised? I'm asking because it looks like it's very easy to clean if the keys aren't inside something.", "response": "yes, the keys are raised. it's possible to get compressed air duster and blow most things out. and if you can't you can use the included keycap opener then spray it away."}
{"product_id": "B009GWLSFY", "context": "Does it have Galaga?", "response": "There should be a list of games in product info or on peoples' reviews. As far as I know it does NOT have Galaga."}
{"product_id": "B007VPZR5U", "context": "can you program the buttons to be used as any key? or just numbers?", "response": "This was answered before but yes. When using Synapse 2.0 you can program the keys to be anything on this list. \"http://gyazo.com/4f4db703e817bdd84172726bd7408b0b\""}
{"product_id": "B000B9RI00", "context": "Is it a physical card that needs to be mailed, or is it a code I can have e-mailed to my account?", "response": "I just got a code e-mailed to me...there was a card option i believe"}
{"product_id": "B00EZAWV6W", "context": "does this work for windows 8 as well as 7", "response": "Yes as long as it 64 bit not 32"}
{"product_id": "B008EZ3PBY", "context": "Will this work with the xbox 360 pro?", "response": "Not sure if this will fit the Pro. I have this on the xbox 360 elite, the first black xbox 360. I use this to get optical audio out and use it in conjunction with hdmi for video. It fits, but the head of my hdmi cable is a bit thick, so it's a very tight fit."}
{"product_id": "B00DBCAT3W", "context": "Is Fable Anniversary like the original Fable or is it more like Fable: The Lost Chapters?", "response": "Its almost fable tlc with better graphics, new menu  and a few more items"}
{"product_id": "B009Q5XGO2", "context": "How long does this last with the extended battery installed?", "response": "It gave it another three hours or so."}
{"product_id": "B00ERDGMT4", "context": "Is an internet connection required to play this, and is it an open non-linear playing field? I have Skyrim GOTY and FalloutIII GOTY, love them both.", "response": "This is different than something like Fallout but I also am a big Fallout series fan and enjoy this game.  It has better shooting than a story."}
{"product_id": "B00EOPT5ZS", "context": "Can you press 2 buttons at the same time?, for instance up + left?", "response": "Hello Alan, Yes, using the latest firmware you can use it for Diagonals Up + Left (Keys A and W) and same for Up and + Right (W and D keys). Steph"}
{"product_id": "B00BFOEY3Y", "context": "can this be used on a mac?", "response": "Not listed as supported unfortunately.  Not sure if that just means the gaming software is not MAC native though."}
{"product_id": "B00D9EPI38", "context": "So, DOES it have hdmi output? (The Xbod itself is not a monitor so I can't \"watch movies right on it.\" I still have to connect to a screen)", "response": "Yes, it has HDMI output."}
{"product_id": "B0038PBF1W", "context": "Can it be played witth mouse only control", "response": "Yes, Wings of Prey should be able to play with only a mouse. But why? Most people who bought this game love the flight simulation experience. You do not need a expensive flight stick, but without the flight stick you will be spending most of your time trying to work the plane instead of dogfighting."}
{"product_id": "B000056SPM", "context": "Does the control rod extend out of the back of the case, or is it completely enclosed? Thanks...", "response": "The control extends out the back of the case."}
{"product_id": "B0002EAA36", "context": "Is it usable in the left hsnd?", "response": "No, u could but it doesnt feel right at all"}
{"product_id": "B002AQNT96", "context": "will this game work on windows 7?", "response": "Yes. It's what I use."}
{"product_id": "B00EF1OGOG", "context": "How do you recharge", "response": "It plugs into a USB plug and you charge it just like your phone, or it says that you could use your laptop, but I'm sure that would take forever. It's a great product!"}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "Not sure.......  I have had  numerous problems with Blitzkrieg II.  I have windows 7 and no problems with it."}
{"product_id": "B00CQ9L1Z6", "context": "does this device allow you to use cheats in a traditional sense? as in like the kind that modifies the raw code and memory address and stuff?", "response": "No, this is only for modifying saves, and only what is available from the codejunkies website."}
{"product_id": "B0098W4ZD4", "context": "Is the Precision Aim Mode button programmable, or can it only be used to drop the DPI?", "response": "No it cant be programmed unless you get a rat 7 or higher"}
{"product_id": "B00EZPCX1A", "context": "This system does play the regulards and 3ds games right?", "response": "Yes to 3DS games and most of the regular games - as i was told by a Gamestop clerk."}
{"product_id": "B000VRCNLG", "context": "Will it work on windows 7", "response": "I pretty sure it operates on windows 7 but not windows 8."}
{"product_id": "B001EYU1WS", "context": "Is this compatible with a Macbook Pro?", "response": "Yes no problem. Go to www.saitek.com and go to driver downloads and software downloads for mac."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "I wasn't aware of a high pitch whine with the G9X. Mine works flawlessly thus far."}
{"product_id": "B00FM5IY38", "context": "does this game require the kinect", "response": "my son said:  \"it doesn't require it.  If you played without it, it wouldn't weaken gameplay.\""}
{"product_id": "B00009ECGK", "context": "Is Warcraft 3 and the expansion still alive and well online?", "response": "I play on it almost everyday as do thousands of others. It seems that most are playing custom maps, but you can still find a 3v3 random after a few minutes in the queue."}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "It has the original PS version of Metal Gear Solid but not the nicer remake that only came out for the GameCube, Metal Gear Solid: The Twin Snakes."}
{"product_id": "B009AFLXZM", "context": "I know that the box says \"no,\" but will this mic work with the wii (as in not the wii u)?", "response": "I don't think so, this microphone was made for the wii u. I don't have a regular wii but u can check to see if the wii has a port u can plug in before u purchase."}
{"product_id": "B004IK24MU", "context": "Does it work with control with silicon case??", "response": "Yes, It works very well. Better than others that I bought."}
{"product_id": "B000B6MLSM", "context": "This is the large remote control like the picture or the small version ?", "response": "Oh its definitely large. Its the same size or taller than the average remote control. I love it."}
{"product_id": "B0002XJBGE", "context": "Does this work on MacBook Pro?", "response": "I recommend you read the reviews with the word \"mac\"http://www.amazon.com/gp/community-content-search/results/ref=cm_srch_q_rtr/?query=mac&search-alias;=community-reviews&Go.x;=15&Go.y;=14&idx.asin;=B0002XJBGE"}
{"product_id": "B008CP6MA2", "context": "It is in Spanish or English ?", "response": "English but i think there is an option for Spanish subtitles as well as other languages"}
{"product_id": "B00F9RGFEY", "context": "Are these on-ear or over-ear headsets?", "response": "over-ear.....i dont really recommend buy it bcuz it have a buzzing sound, i mean like the really annoying kind when you connect it or turn it on, but im not sure other products they send to other people have buzzing-sounds or not(i heard that some people do have the same problem). Hope this helps."}
{"product_id": "B00005NIMB", "context": "Work fine in Win7 64bits ? to Il2 saga ... Thanks", "response": "Yes this works fine on Win 7 Pro 64 bits. It works fine with IL2 Cliffs Of Dover, Microsoft FSX and FS2004, Micro Prose Falcon 4.0 and Allied Force, UBiSoft Lock On Modern Air Combat."}
{"product_id": "B00E3667XQ", "context": "I have two question: is it able to play offline any game? does support steam application?", "response": "You can play some Android games offline that don't require an Internet connection. It does support the Android steam application, but I don't think you can launch games from the mobile steam application."}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine.", "response": "You should clean it off or buy a new one"}
{"product_id": "B00DC7G2W8", "context": "Can you use the Wii U gamepad? Or do you have to use a wheel?", "response": "It should also be noted that you can use a Gamecube controller as well with the Mayflash adapter (and of course Nintendo is releasing the official adapter with Smash Bros. later this year).edit: Mayflash Nintendo GameCube Controller Adapter for Wii/Wii U"}
{"product_id": "B00635N6YI", "context": "Led lighting on star wars gaming mouse?", "response": "Yes there is LED lighting on the wheel, which you can modify through synapseThere is also LED lighting on the Sith/Jedi emblem but its White only... (shows yellow due to the plastic cover), and also on the left side buttons (yellow as well)"}
{"product_id": "B0097CUREG", "context": "Does anyone notice that the Kaboom slot is missing the button with a \"$\" that is used to load in more credits during game play? Or is it just mine?", "response": "I only play for fun, but my dollar sign is there."}
{"product_id": "B00IAVDQCK", "context": "Can you hear your own voice when you speak ? (Like on Turtle Beaches, you can hear yourself through your own headset to allow voice moderation)", "response": "No, unless their is an echo coming from the other persons mic"}
{"product_id": "B002BS47JE", "context": "Is it in color?", "response": "If you have a color TV or monitor"}
{"product_id": "B000PD0HQE", "context": "does this come with the 120 gb harddrive?", "response": "Yes, along with the power box and video cable cord."}
{"product_id": "B007A7UJ4S", "context": "Do this game have English Voices?", "response": "Yes, full English audio and subtitles."}
{"product_id": "B005MQ3BSK", "context": "Does it work on Windows 64bit?", "response": "Yes for me on Win 7 - 64"}
{"product_id": "B00A878J5I", "context": "This charger is multivoltage 110-240?", "response": "Yes it is !"}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "I think so, I've purchased mine 2 month ago and it is perfectly ok..."}
{"product_id": "B009AFLXQQ", "context": "Can this controller be used to play Wii u virtual console games?", "response": "Yes it can, but for wii virtual console games, you'll need a classic controller. For Wii U though, it should work with any vc game."}
{"product_id": "B000OLXX86", "context": "Does this game come with the DLC?", "response": "Not when I bought it but it's so old now all that DLC is probably free. Wait long enough and they'll release it all."}
{"product_id": "B00F2ENJY8", "context": "So this is an actual video game console? Cause the price difference between the Wii Mini and U is about 200 bucks. Can someone specify ?", "response": "It's the game console without Internet so online features for the games don't work. I don't know too much about the Wii U, but the Wii mini uses the original Wii controllers and reads the original Wii games."}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "The one that works with the keyboard also works with the mouse. The other cable is an extender for the small usb stick. For example, if you only had a hard to reach USB port available, you could plug in the extender cable so that the usb stick could easily be retrieved."}
{"product_id": "B00FATRKLI", "context": "I want to purchase that Xbox from Republic of Georgia and Do i need something else to turn on that device? like converter or something? for Europe use", "response": "get an adaptor set for European plugs."}
{"product_id": "B005YR1VP2", "context": "Does the Xbox 360 250GB console come with cables? Do I need any adaptors for my old console?", "response": "I am not the seller."}
{"product_id": "B00BCEK2LK", "context": "Might be a stupid question, but is this mouse compatible with OS X software?", "response": "As of date, I believe that the Logitech G100s functions on OS X software. See confirmation here: http://blog.logitech.com/2013/04/19/logitech-g-products-now-support-mac-os/"}
{"product_id": "B005BLAJRC", "context": "what games are included on the cd?", "response": "Backgammon, Battling Ships, Checkers, Chinese Checkers, Chess, Dominoes, Tile Games, Master Match, Pachisi, Panic, Placer Racer, Reversi, Rummy Squares, Time Breaker, Word Games, Yacht, Zilch. Some of these have multiple variations."}
{"product_id": "B00CPKUV7K", "context": "Does this come with the Doom Beta? I thought that was only if you pre-ordered the game", "response": "Yes it does come w doom beta"}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "actually no, Iduno, Square and Sony don´t give us the game with crossbuy... you HAVE to choose which version you wanted.... Ps3 or PSVita... if you get both, you may use the same save file."}
{"product_id": "B006JKARP8", "context": "Can't charge this because I have a vita 2000 and had to buy a separate cable for it. Does anyone know a way to make it charge?", "response": "Are you sure you have a PSP 2000 or PS Vita? It won't work with the PSP though."}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "I use an xbox controller. You can use one as long as it can hook up to your pc."}
{"product_id": "B003VAM392", "context": "How long is the USB cord?", "response": "6ft but you can buy usb extension if you need more.awesome controller plays all my games."}
{"product_id": "B003VUO6LU", "context": "What CECH is the console and what year it is?", "response": "It's a 2009 model and Idk about the other part."}
{"product_id": "B00BM7NXMW", "context": "The scroll wheel won't scroll back, is there any way to fix that?", "response": "Mine stopped working about 2 weeks after I got it; so I had to return the mouse. :\\"}
{"product_id": "B009D3HSTG", "context": "I ordered two of these and they work great BUT the joysticks keeps coming off on BOTH. Any quick and easy solutions?", "response": "mine never worked, its such a bad quality controller"}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "Yes, I'm playing it on Windows 7 right now. No problem!"}
{"product_id": "B0076HD2W8", "context": "Will this work with Fire TV ?", "response": "No, it's built for PC.  Amazon have their own controller for Fire TV for gaming."}
{"product_id": "B001BZ2F56", "context": "Do you need Internet access to play this game?", "response": "Not that I'm aware of, no."}
{"product_id": "B002CJ8Z04", "context": "you can play this on the gameboy color right?", "response": "No it's a game boy advance title. Be sure to check out the game cartridge as well make sure it is not a fake"}
{"product_id": "B004XGN8W4", "context": "will the white xbox 360 fit?", "response": "Yes, I have the last generation of the 360 and It fits perfect."}
{"product_id": "B00HKCKA0G", "context": "Is this a wireless headset? Meaning, is the cord going from the PS4, across the floor to my controller? My cat thinks the cords are a toy.", "response": "No it has a cord"}
{"product_id": "B00CJ7IUGS", "context": "Do I need to have played Oblivion to understand Skyrim?", "response": "I Don't believe you do. You don't miss anything if you don't play oblivion first. It's is like a different layout and it doesn't mention anything from oblivion in skyrim. Not that I know of anyway. It's a different layout and is about 200 years in in the elder scrolls timeline. So yeah"}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "The product page says: Release-day delivery option available at checkout for most continental U.S. addresses"}
{"product_id": "B0071NH8B8", "context": "can i use it with a different provider besides AT&T?", "response": "If you live in another country other than the US, there are other service providers that can support the Vita. However, you should probably contact the service providers directly for more information."}
{"product_id": "B00I4C2EKA", "context": "What is steam client?", "response": "It's the steam app for your computer. It's basically like a psn or xbox network for pc. You can download the app here from their website https://store.steampowered.com"}
{"product_id": "B00F4GSAYI", "context": "i now know that there is a separate disc for the dlcs, but do i need xbox live to download and play them?", "response": "No you do not need Xbox Live to install the DLC. You install it directly from the disc."}
{"product_id": "B00D96BJSO", "context": "i can use it for listening for music in iphone 5 ?", "response": "Yes u sure can"}
{"product_id": "B000096L71", "context": "can I run on windows 7", "response": "Yes you can. I run mine on win 8 no prob."}
{"product_id": "B0050SZBP6", "context": "Is this still available in stores? Or is it out of stock and has been replaced by Warlords of Draenor?", "response": "Do not buy this. It comes with the World of Warcraft Standard Edition now:World of Warcraft - PC/Mac\"Includes Expansion Packs: The Burnings Crusade, Wrath of the Lich King, Cataclysm, and Mists of Pandaria\""}
{"product_id": "B00DC7FWRE", "context": "Is this just the game or does this come with the stand, and a remote?", "response": "It's a game come with remote , but I don't recommended for this game . Good luck"}
{"product_id": "B00FM5IY4W", "context": "Do you need a steering wheel to play this or can you use the standard controller?", "response": "You can use the standard controller but it would be awesome to have the steering wheel! �"}
{"product_id": "B0040UAYI4", "context": "Can i use this and play MW3 on the ps3 with the Eagle Eye?", "response": "I think so, you'll get have to map the controls how you want"}
{"product_id": "B00D6PTMB4", "context": "Could someone suggest a good guitar to use this with? Something cheap yet not horrible and sold on Amazon? Thanks!", "response": "Any guitar that plugs in will do.  An acoustic/electric will work, low end epiphone or squire.  I do recommend humbucker pick ups to reduce buzzing."}
{"product_id": "B00B1MXGDO", "context": "i have a wireless adapter for my pc. would this controller sync to it so i can play wirelessly on my pc??", "response": "Unfortunately it won't as the Sabertooth has no wireless capabilities."}
{"product_id": "B0050SXKU4", "context": "Is this US version? like will it work on a ps3 from usa?", "response": "Yes this is US version"}
{"product_id": "B000VLNXRU", "context": "Can it work with a mac and x-plane 10?", "response": "Not unless you boot camp into windows"}
{"product_id": "B0006PJAZU", "context": "Will Suite 8 work on a XP computer?", "response": "Yes very well.   That is assuming that you are talking about 32 bit XP, as it was written for 32 bit operating systems.  I could be wrong about the 64 bit being a problem, as I have no experience with 64 bit systems."}
{"product_id": "B00CBNV7UQ", "context": "what type of language does this game have???", "response": "The standard is English, but I believe there are Japanese voices if you download them."}
{"product_id": "B007TYC8MI", "context": "this game is in spanish?", "response": "The game audio is in English. There is an option to change the game text to Spanish, but I don't think it affects the audio. I would imagine if you turned on the Spanish text and enabled subtitles, you would be ok."}
{"product_id": "B00B77OKNI", "context": "is it for kindle", "response": "Yes it is for apps that you can get on kindle"}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3", "response": "No it does not work with the ps3. But will work with xbox and PC."}
{"product_id": "B00AKIPBNS", "context": "My son purchased 3ds in usa but found that the 3ds games purchased here in Australia are not compatible . What 3ds  does this game work on?", "response": "This game is for the US version of the 3DS"}
{"product_id": "B008CXTW5G", "context": "If you put the Numpad on the left side, could someone measure the gap between the \"Enter\" key and the A/B Macro keys?", "response": "Hello Kyle! It will be measuring from the center of the keys, 6 cm = 2.36 inches."}
{"product_id": "B007MJSZDQ", "context": "is it good and last along time", "response": "It depends how long you use it.  I've played for hours and it seems to last for a few days. I usually play a couple of hours a day."}
{"product_id": "B00EWEHI5K", "context": "How well does the Ouroboros perform on non-traditional surfaces, such as cloth?", "response": "It seems to work well for me.. You do need to recalibrate in Synapse 2.0 though"}
{"product_id": "B002L93F0A", "context": "can i use this with the wii u adapter", "response": "I don't know.  It does say it is compatible with Nintendo Wii though"}
{"product_id": "B000GCJ6MK", "context": "Is this an expansion kit, or is the full FSX installation? This price on this way cheaper than the Gold and Standark packages I see for sale here on A", "response": "Mine is Microsoft Flight Simulator X GOLD EDITION includes Flight Simulator X DELUXE & ACCECLERATION EXPANSION PACK.  (Disc 1 & 2 DVDs Installation and DVD Rom MFS X Acceleration Expansion Pack).  That's all I know, hope it helps !"}
{"product_id": "B00HHUSNPU", "context": "Will it affect the movement of the thumb sticks?", "response": "In my experience, the silicone grips did not effect the movement of the controllers thumb sticks at all. They are molded very well to the actual ps4's controllers. I noticed no difference in the thumbs movement after putting them on three of my controllers. I play FPS with these on and they are nothing but a plus."}
{"product_id": "B00EHBKUTE", "context": "Can you change the colors of the backlighting to red?", "response": "Sorry - green only"}
{"product_id": "B004H7P0B6", "context": "Are these easy to install? I would be worried that I do something wrong. I never assembled any controllers before.", "response": "The  GameCube controller is fairly easy to take apart, just take your time and pay attention to what your doing, pull off the old analogs, and put on the new one's."}
{"product_id": "B000LQ4HTS", "context": "Can I twist the stick to control yaw in a helicopter  or use it as rudder in a plane?", "response": "Yes. There is also a \"rudder lock\" switch but it only cuts off half of the twist axis range of motion. So with the \"rudder lock\" engaged, you can still easily twist the stick halfway to one side. Better than nothing (I guess) but definitely should do what it actually says."}
{"product_id": "B001BYMZ5W", "context": "is there a better gaming headphone than this? or this is top of the line?", "response": "I've owned about 5 headsets in the last 2 years. This has been the best headset I've found on the market when it comes to sound and mic quality. It does lack features like mic mute when boom is up and on can volume controls."}
{"product_id": "B000035Y6D", "context": "I WOULD LIKE TO KNOW THIS NITENDO COME WITH 2 Controllers ??", "response": "I bought this about a year ago but they sent me a PS2 instead. I'd still like to get a SNES."}
{"product_id": "B002I0J51U", "context": "Is this the controller needed for Heavy Rain?", "response": "You can use this as well as a standard controller for Heavy Rain. It is totally up to you, they're compatible."}
{"product_id": "B0050SZBP6", "context": "Do you get 30 days access to the game with this expansion?", "response": "No, only with starter pack"}
{"product_id": "B00E1L78N6", "context": "Did the controller update with little to no improvement for my mic. Did you guys have the same issue?", "response": "Honestly,   I didn't see any difference"}
{"product_id": "B00E4MQODC", "context": "Is there a slot in the battery compartment to store the USB nano-receiver when on the road, as with other Logitech gaming mice?", "response": "On the right side of the batteries there is a slot)"}
{"product_id": "B0032MO77U", "context": "will it work on 64 bit cpu systems with windows 7?", "response": "I have purchased this pc game from your company and I own windows 7 and I have no problems enjoying these games.....but I am not a computer savvy person."}
{"product_id": "B00BMFIXT2", "context": "What languages are available with this game?  Is there French or Spanish audio (audio, NOT subtitles) available? Thanks!", "response": "Yes there are  i played it  (and many other too) and yes  audio"}
{"product_id": "B00DE2W5XG", "context": "If this is a launch day bundle, is the ps4 a first day ps4 which has problems?", "response": "actually I received this and it did have the blue ring of death!!! but Amazon worked with me and resent me new unit ASAP with no other complaints I love my ps4"}
{"product_id": "B00HEX8TA4", "context": "Does your scroll wheel wobble? Mine wobbles significantly. Makes a jittering noise if I shake the mouse.", "response": "Thanks for your question.. no, my Mouse scroll Wheel doesn't have any wobble. But it does make a slight noise once in awhile, when scrolling. Other than that it is fine and works very well."}
{"product_id": "B0040UAYI4", "context": "How is it compared to keymander?", "response": "I did not use keymander. But both specification looks similar to each other compared with eagle eye. So i think the price may compared to each other comparison"}
{"product_id": "B009O8HH3M", "context": "Hello, I am using a Mac (which will work with this, I know) but I only have 1 good usb port, which I use for my mouse. Will I still be able to use?", "response": "Unless they changed the connection from when i bought one, yes. the connections on mine are a 3.5mm into an adapter that splits the mic and the headphones into their own 3.5mm jacks."}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "yes it does, as long as you guys have a gamecube controller adaptor (sold separately from the wii u, I think)"}
