{"product_id": "B00KAI3KW2", "context": "Can you play classic xbox (1st console) and xbox 360(2nd console) games on xbox one?", "response": "No, you couldn't many of the engines used to create those are unsupported or you have to buy a new version of it."}
{"product_id": "B00E1L786S", "context": "Anyone know if there's any issues using this with a PS4? I'm guessing probably not. It's just audio inputs, etc.", "response": "Sorry, I meant No. Connections are easy. Especially w/ the optical line. I've had no problems w/any of my systems...Enjoy!!!"}
{"product_id": "B009IR1SR0", "context": "Only English version or full language version?", "response": "Only English I suppose."}
{"product_id": "B00FYAQUPU", "context": "Is Skylanders Dark Force game the same game as regular Swap Force?  Is the game itself the same swap force game or is the dark force game different?", "response": "Same game - just dark figures."}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "@fairlane32 No batteries or charging are required for the headset to work, as it draws its power from the controller/device. It's wired to controller/device comes with 2 different jacks one for each."}
{"product_id": "B00F68LBE0", "context": "Is this a Dualshock or just a Sixaxis controller?", "response": "This controller is just a Dualshock controller.  It does not have Sixaxis support"}
{"product_id": "B00BGA9X9W", "context": "Can i play on my pc with this controller? Need a software?", "response": "You can do that by using this tool http://dsdcs.com/portfolio/software-development/4-ds4windows"}
{"product_id": "B000J18SR2", "context": "Does it also runs on windows 7 ?", "response": "Not very well, go for the new HD release on Steam."}
{"product_id": "B00ACMM9BO", "context": "does anyone have the paper that came with it?", "response": "Yes send me number and I'll send u a screen shot of it"}
{"product_id": "B005OSFUZI", "context": "Can I use this cable with Xbox One?", "response": "Yes.  It is a USB cable so it is compatible with a wide range of systems including PC too"}
{"product_id": "B005J37I4Y", "context": "Is there a mute button on this or do I have to use the one on my headphones?", "response": "Yes it does I believe u have to press the button twice to mute. It comes with instructions. I have use mine in so long because I have got a xbox 1."}
{"product_id": "B00CBNV7UQ", "context": "Is there a \"customizable officer\" feature?", "response": "There is not. There's no mechanic to create your own character (like in Dynasty Warriors 4). I still consider Dynasty Warriors 4 the best game in the series, with 8 being the second best. This is one reason for that."}
{"product_id": "B0007TJ7TE", "context": "Lighted keyboards won't work with KVM switch ??? A previous posting suggested same (i.e., 6V to produce lighting not available through KVM switch).", "response": "Not sure if anybody figured this out but this Saitek lighted keyboard does not work with the iomega USB KVM switch. Is anyone else having that issue?"}
{"product_id": "B00DUARBTA", "context": "is there city free play", "response": "Yes. My kids love this game."}
{"product_id": "B000FRU1UM", "context": "Has any one had problems playing/installing GTA or is it just me?", "response": "I didn't have any problems"}
{"product_id": "B003ESDQW4", "context": "I'm wondering about the T rating... what about this game makes it worth a \"T\"- considering it for an 8 yr old", "response": "This should cover your questions: http://www.esrb.org/ratings/synopsis.jsp?Certificate=29480"}
{"product_id": "B007VH2WPQ", "context": "Will it work with an old wired controller?", "response": "The shell won't but the buttons and some trimming will. The wired and wireless shells are very different.Edit: actually the faceplate of the shell may fit but I am not certain as I don't own a wired but the back plat definitely won't"}
{"product_id": "B00F27JN8Q", "context": "Does Conception 2 work with PS Vita TV?", "response": "Check out this link: http://wololo.net/talk/viewtopic.php?f=50&t;=35419You'll likely have to test yourself to figure out if it works or not. Complete shot in the dark, but better than nothing."}
{"product_id": "B00H45K6KS", "context": "Is the language uesd in the game Japnese or English? I am looking for the Japanese version.", "response": "It is the western release with dual audio, so you can pick between the two languages, but the text is not in japanese."}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3?", "response": "No just ps4 ps vita and also works with xbox1"}
{"product_id": "B0018YXM3Y", "context": "does this this game run on windows 8?", "response": "Worked on my windows for like a week then stopped doesn't work now"}
{"product_id": "B003ZSHN0O", "context": "I have avg antivirus, does anyone else get the warning that gov of poker 2 contains the win32 heur virus?", "response": "I have had this game for quite awhile and never got a virus. Hope this helps"}
{"product_id": "B005THAX5Q", "context": "Why is this game is this game so horrible", "response": "The game is not horrible. It's not what Randy Pitchford said it was going to be, but it is in no way horrible. Stop exaggerating and jump off the, \"dump on Colonial Marines band wagon\"."}
{"product_id": "B00F2ENJY8", "context": "Does it come with everything you need to hook it up?", "response": "yes it is all in the box just plug n the red yellow and white leads you are ready to go"}
{"product_id": "B000PD0HQE", "context": "does this come with the 120 gb harddrive?", "response": "yes, and I will include three games total"}
{"product_id": "B0050SZBP6", "context": "Other than activation do I have to have internet?  I mean I don't want to go on line to play.  I prefer to just sit here and take my time doing a solo", "response": "Additionally, if you just buy the combo pack I think this expansion is included now."}
{"product_id": "B00FYIXMHQ", "context": "Does the game used $ 83 brings beanie of Delsin?", "response": "I'm not selling my game so Idk man. I would just buy a new one from Amazon for 80 bucks the next time the restock because otherwise you'll have to buy a collector's edition off of a third party seller for 130ish bucks."}
{"product_id": "B002DUCF8A", "context": "Does this require a driver download for Windows 8.1?", "response": "I have MULTI-SWITCH-RADIO Panels All were working perfectly under windos7 but since I switched to Windows 8.1 none of them work correctly. Saitek will have to issue new drivers for Windows 8.1. Hoping it will not take too long!!!"}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "Try \"http://www.game-debate.com/games/index.php?g_id=509&game;=Singularity\"  where if you input your PC specs it will give you the information. Singularity does require significant resources."}
{"product_id": "B001CXYMFS", "context": "Does the stick have twist motion for yaw?", "response": "yes, and the yaw can use with the button infront the throttle."}
{"product_id": "B00D6PTMB4", "context": "Is this a single player only game, or can two people plug in and play together?", "response": "You need two Ubisoft Rocksmith Real Tone Cable by Ubisoft for 2players"}
{"product_id": "B00EZPCX1A", "context": "Does it come with any games?", "response": "It does not come with any games, however, Nintendo does have a few free-to-play titles on the eShop that are definitely worth checking out."}
{"product_id": "B00ARD5410", "context": "how long is the mouse cord?", "response": "I want to say ~6 ft. but I'm not sure.  It's pretty long."}
{"product_id": "B002I0JZIS", "context": "does it say call of duty in thw back of the vita", "response": "No, it doesn't. You'll get the original one."}
{"product_id": "B009LGO88E", "context": "Will it works on the new 3ds xl?", "response": "No. You won't need it for the new 3ds because it will have a nub and both zr and zl buttons.Also, the new 3ds will be a bit wider so it won't fit anyway."}
{"product_id": "B00I5LMSE2", "context": "Is this kirby in Chinese or in English", "response": "The game we have is in english"}
{"product_id": "B00DHUUTEM", "context": "what type of mechanical keyboard is it? black cherry, blue, brown, etc", "response": "It is NOT a mechanical keyboard, I don't know why people answer without knowing this. It is a digital nub sensor keyboard."}
{"product_id": "B00DLRLDBO", "context": "does this work for the ps4?", "response": "Yes but I recommend you get something stress bend kinda sucks"}
{"product_id": "B001CXYMFS", "context": "How long is the USB cord?", "response": "The cord from the controller to the computer, is about 6 feet and the one in between the two pieces of the controller because you are able to split the controller is about 2 feet, good to put the computer in the middle."}
{"product_id": "B002I0GF72", "context": "How bad is the violence and \"Blood\"? I have a 6 yr old dying to get this game, but I want to make sure it's appropriate. Please help.", "response": "This game has absolutely no blood and very little violence (cartoon sword slashing and fighting of the sort) and it's full of puzzles in which you could cooperate with your child to solve. It's good to develop those puzzle-solving skills and strengthen your bonds at the same time."}
{"product_id": "B00DC7FWRE", "context": "Can this game be used with the original wii if you don't care or want the u game pad", "response": "No.  Wii-U games, as a rule, don't work on original Wii hardware."}
{"product_id": "B002I090AG", "context": "Does it work with ds games?", "response": "yes, it should work with most DS games as far as i can tell"}
{"product_id": "B00DLDEKOK", "context": "How is the voice quality to others?", "response": "I have had this headset for about 3 weeks now.. I play gta V online practically all day long.. I have never had any complaints on voice quality. The sound quality from others is amazing as well. Again, for the price this cant be beaten"}
{"product_id": "B0029M6VKA", "context": "I wear a really thin pair of headphones when I game, is it a wise idea to get the clip pro over this or will this be fine and comfortable?", "response": "Sorry, I do not use the headset clip on. I just use the visor clip."}
{"product_id": "B000H67DDY", "context": "where can I find list of supported games? and does it support Elite: Dangerous?", "response": "We don't know of any list but he uses this specifically for Elite Dangerous. He says the rudder pedals can be programmed to any game just like a joystick."}
{"product_id": "B00EI4V3X2", "context": "When you connect the Headset to your PS4 controller in order for chat to work, is the in-game sound still 5.1 Surround Sound or not anymore?", "response": "Yes. It definitely depends on the settings on the transmitter, but whenever I play a game, I always have the 5.1"}
{"product_id": "B009M72E5Q", "context": "Will this particular Wii play the GameCube games?  Does it have the ports to connect GameCube controlers?", "response": "I have this exact same bundle, the black Wii packaged with Wii Sports and Wii Sports Resort, and mine DOES have the GameCube ports, so you should probably ask the seller which one they are shipping."}
{"product_id": "B005L38QK2", "context": "Is it fully rubberized? or is it a slippery plastic?", "response": "I don't remember, but I do remember sending it back asap. It was really cheap looking and built cheap. I purchased the Anker 8200 dpi, 9 button mouse with 3 adjustments for gaming to just searching. I really enjoy it. I would pass on the steel series-a name doesn't make it good."}
{"product_id": "B0058FAEAS", "context": "Is  this compatible with windows 8?", "response": "I do not use Windows 8. The yoke works well with Windows 7."}
{"product_id": "B00DJYTGYU", "context": "Does it work with GTAV?", "response": "Yea it worked perfect for all my other games as well hope it does the same for you"}
{"product_id": "B00IIHU44E", "context": "is the xbox works on 110 or 220 volts?", "response": "can the xbox one work in the uk ?considering their current"}
{"product_id": "B004L5SJ4Y", "context": "il2 cod-has force feedback? steam activation required with dvd version?", "response": "But it is difficult today to find a DVD copy of the game. You can buy it in Steam directly through direct dowload."}
{"product_id": "B0098EVZZ8", "context": "My grandson asked for these figures and I'm really confused. Do you have to have a game system to play with these?", "response": "Yes they go with the skylanders game on wii xbox playstation etc."}
{"product_id": "B00JC9SWSC", "context": "Does the console include a way to charge the controllers or do you need to buy that seperately?", "response": "it comes with one cable that can charge a controller through the usb port. the charges last longer than i thought they would. charger would be nice but not necessary."}
{"product_id": "B00HKCKA0G", "context": "My laptop has a joint audio/mic 3.5mm jack, so theoretically, even the mic should work for my laptop, correct?", "response": "This headset WILL absolutely work on a PC/Laptop. Because of the short 3.5mm audio cable, you may need to get an 3.5mm audio extension cable, but this headset WILL work on a PC/Laptop."}
{"product_id": "B00AYBKQRW", "context": "work with LG Model  6711A20111L?", "response": "I am not sure on that one."}
{"product_id": "B00CMC6HCY", "context": "in the storymode do you HAVE TO DO THINGS  to move on in the story line", "response": "I think so maybe on 2k16 also they should put new entrance a lot of music that fits the wrestler entrance like the maniac  Scorpion  the butcher and creative wrestlers."}
{"product_id": "B002I0K3PM", "context": "Is the story line or jobs any different compared to the version that is out for the Nintendo DS 3D?", "response": "I bought this as a gift for my nephew so unfortunately I am not able to answer your question - he has only played it on the Wii. Sorry - good luck!"}
{"product_id": "B0050SVMYA", "context": "Does this one come with a memory card included?", "response": "I don't think it will, the one I purchased didn't at least, and nowhere in this ad does it mention coming with an SD card. Luckily they are cheap, only like five bucks. You can order it and wait to see I suppose, and if it needs one just order online or buy one at any electronics place:)"}
{"product_id": "B003VUO6LU", "context": "Is it possible (w/o getting any special software) to use an Xbox 360 controller for the PS3? If so how?", "response": "go to your local Walmart or Target. They might have a 360 style controller for the ps3 might cost you a bit though. maybe 30 or 40 bucks."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 7 64 bit", "response": "Of course, go perfect"}
{"product_id": "B00CPKUV9I", "context": "What are system requirements?", "response": "http://www.vg247.com/2014/05/01/wolfenstein-the-new-order-pc-system-and-console-space-requirements-announced/PC System Requirements:- 64-bit Windows 7/Windows 8- Intel Core i7 or equivalent AMD- 4 GB System RAM- 50 GB free HDD space- GeForce 460, ATI Radeon HD 6850- High Speed Internet Connection- Steam account and activation required"}
{"product_id": "B002B9FIUU", "context": "can I use the controller for any PC games, not just N64 emulation?", "response": "Yes, it will make the computer detect the controller as an input device that can be set up for anything. I have played Skyrim with an n64 controller so you can do a lot with this."}
{"product_id": "B00CERXJNW", "context": "Is the wrist rest removable?", "response": "Yes it can be removed, its attached by two screws and is not attached when you first buy it."}
{"product_id": "B009ZDPYKO", "context": "Does he work with swap force?", "response": "Yes! So do the Spyros Adventure Skylanders as well."}
{"product_id": "B003ZSHN0O", "context": "will it work for windows 7?", "response": "Yes I sure ot does I use windows seven and play it"}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "Yes- I'm using it with a Lenovo G-series laptop running Windows 8."}
{"product_id": "B00012YI14", "context": "does it work for the pressure-sensitive gamecube shoulder buttons? like for pressing part-way down as well as all the way down?", "response": "Hello, unfortunately I do not have GameCube, I use it with Xbox Classic and I worked really well, I keep pressing the buttons and the action is performed without problem, in my opinion, worth you run the risk of buying it and try it on your GameCube, greetings."}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "Loose means not in the packaging."}
{"product_id": "B003VH5Z2C", "context": "Does this work with Famicom (Japanese) carts?", "response": "No, you will need a converter"}
{"product_id": "B00D6NPFDK", "context": "How many people can play", "response": "We found that 2 at a time was the limit.  You will need the additional comtroler and nunckuck."}
{"product_id": "B00CX8VY4S", "context": "Is this watch dogs a disk or download", "response": "A disk.  The game is fantastic.  I've been playing it every night and I'm not normally an avid gamer.  Lots of fun"}
{"product_id": "B008GEH8LQ", "context": "Is this like a store bought 3DS XL?", "response": "Yes. It came brand new in the box."}
{"product_id": "B00I9UVY7G", "context": "My grandson sent me a text which said, here is a gift idea for Xmas for him, 2014 FIFA World Cup for xbox 360. Is this the game EA Sports 2014 FIFA?", "response": "Yep this is it"}
{"product_id": "B001AATQ0Y", "context": "Does it use 2.0 USB or 3.0 USB ports?", "response": "It works great with wired gamepads on my USB 2.0 systems."}
{"product_id": "B002HH9TUG", "context": "Has anyone ever tried to remap the R1 and R2, L1 and L2 buttons on the PS3 and get that to work? (do not use CAN in your answer; only DID)", "response": "The controller lets you swap any two buttons on the fly.  You press a button, then press the two you want to swap."}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "Yes! It does :)"}
{"product_id": "B002BRZ79E", "context": "game did not come with registration code", "response": "Mine did. Was it freshly sealed?"}
{"product_id": "B00ATF5YZM", "context": "Can this be bought/installed/played on a UK Steam account, want to know before purchace?", "response": "I'm not sure. One way is to enter your Steam account and see if it is available for purchase. If it's available, then you should be able to install. You might, as well, contact Steam and ask them."}
{"product_id": "B008NMPSEU", "context": "Can you please tell me all the games in this slot. Thank you.", "response": "I cannot answer, as I never could get game to load.  Sorry."}
{"product_id": "B005OSFUZI", "context": "So, one end is USB and the other end looks too small to plug into my guitar jack. How does this work?", "response": "The guitar side is the standard 1/4\" plug used by electric guitars, amps, and other musical electronics.  I hadn't noticed before, the photo on the box looks a little odd."}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "I'm sure it's manufactured in China along with everything else in the world!  It does come with a charger and one stylus.  I should have purchased extra though because they get lost easily."}
{"product_id": "B00D5WDI3G", "context": "Can I install the software in several computers ?", "response": "They allow you to install it on at least three maybe four computers. I have it on two at the present time."}
{"product_id": "B000SOYG8U", "context": "Can you download a mod to change it to the clone wars?", "response": "Yes! I have done this myself, as I do prefer the modded clone wars version. It is incredibly easy, however you will have to sacrifice your ability to acccess forces of corruption. It essentially \"copies over\" the game until you get rid of the mod. Happy Hunting!"}
{"product_id": "B00EIM3BV6", "context": "Will these work on the Playstation 4 console?", "response": "Yes all ASTRO products will work with the next generation PS4. It uses the same technology that the PS3 used so there are no additional products you need. Sony will be releasing a firmware update though after release that will be required for the chat to work. No details have yet been released about this update.Regards,ASTRO Gaming"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "On Windows 7, it plays fine."}
{"product_id": "B00HWMP0OU", "context": "This game is for girls or you can also create a boy protagonist?", "response": "You can have a boy or a girl and the adventures are not gender specific. The clothing items have both boys and girls clothing, although it might be a little bit more female orientated. That said, I think it is a great game for either gender."}
{"product_id": "B006JKARP8", "context": "Can I charge the charger itself using iPad adapter (any other USB power supply) or Vita adapter only?", "response": "One side only charges the Vita, the other side has a USB port in which you can plug other devices using a USB port charger, to charge your unit."}
{"product_id": "B00D6PTMHI", "context": "When you use Rocksmith, is the guitar plugged into the amp at all, or just the computere?", "response": "The game comes with a cord and it plugs into the computer."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "It is not linked to amazon. They email You the code and then you can give that code to anyone you want"}
{"product_id": "B009GZX49Y", "context": "good morning I wanted to know if this trilogy are video games or play 3 games .... if they would make the purchase ... excuse my English I am from Ven", "response": "This is 3 games. I think brotherhood plays from the disc. . The rest all require install. . Check HD storage requirements."}
{"product_id": "B00BCEK2LU", "context": "Is this keyboard mechanical?", "response": "Nope, it's not, the mechanical one is Logitech G710+ Mechanical Gaming Keyboard with Tactile High-Speed Keys - Cherry MX Brown"}
{"product_id": "B001MGNWDI", "context": "Is this stick durable? Can it tolerate stressful actions  like, trigger pulls under duress or a high anxiety turn?", "response": "The thumb trigger wore out rather quickly."}
{"product_id": "B00I4C2EKA", "context": "It says it uses steam for DRM so I cannot play this on the MAC? even though I have steam on my mac?", "response": "You can play it on Mac since it has SteamPlay as stated at http://store.steampowered.com/app/8930/."}
{"product_id": "B00B98HDNO", "context": "Does this work with windows 8.1?", "response": "Absolutely, that's what I use and it works great!"}
{"product_id": "B0009PRCNO", "context": "is it cracked or it takes only original games? like does it take copied games?", "response": "No what I meant was that it was broken due to how it was treated by the owner. It plays ps3, ps2, and ps1 games just fine. No it does not play copied games."}
{"product_id": "B00EH5V1IO", "context": "I Realize it only says pc and mac, but has anyone tried these who has linux?", "response": "Its standard 3.5mm connections. Shouldn't be a problem (no drivers)"}
{"product_id": "B002B9XB0E", "context": "Does this Buffalo Game controller have R and L buttons?  Pic doesn't show it.", "response": "Yes this controller does have both trigger buttons"}
{"product_id": "B000O5DY0E", "context": "does this work on windows 8.1", "response": "It worked on my windows 8 laptop, so it may work on windows 8.1"}
{"product_id": "B007VH2WPQ", "context": "Does it come with the triggers?", "response": "Yes, it comes with everything but the electronics."}
{"product_id": "B00GD962OA", "context": "how many GB IT HAS??", "response": "This is the 8 GB model."}
{"product_id": "B002XLR0JI", "context": "Is this product a mirror version?", "response": "This mouse is the same on both sides (left and right are identical), so it can be comfortably used with either hand."}
{"product_id": "B004S5PBM0", "context": "Does this include the real tone cable?", "response": "Not sure!  I gave it to my son for a christmas gift.  He was able to use it right away without having to go purchase cables or anything.  They love it."}
{"product_id": "B006IR6NH8", "context": "Does the thing register with games as xbox360 as my logitech f310 gamepad does? Because msot new games need that to work ingame", "response": "not all games this control is more used for simulator race games as iraceing and simraceway."}
{"product_id": "B00BDS415I", "context": "Will these work for the Xbox ONE?", "response": "Yes, they do work"}
{"product_id": "B00KAI3KW2", "context": "how many gig on the hard drive", "response": "How many months of warranty? how to claim a warranty?"}
{"product_id": "B00292OW1U", "context": "Is this keyboard wireless.", "response": "No, But I love it. I use it to play World of Warcraft, and other games."}
{"product_id": "B003VUO6LU", "context": "which version of software or Firmware has? 3.55? native software?", "response": "You won't get a 3.55 firmware from here, you have to buy one on ebay most likely"}
{"product_id": "B000BAVN14", "context": "Will this work for Windows 8?", "response": "I see no reason why It shouldn't. It runs perfectly on my Alienware 14 which I believe has Windows 8."}
{"product_id": "B00GANWVJE", "context": "does thiws game work for the 3ds xl model?", "response": "Yes it does; I have the XL myself. Works great =)"}
{"product_id": "B007JDMPOK", "context": "If I already have Tera on my laptop, can I use the code to get the goodies, and use the disk to install on another PC?", "response": "Yes, that's what I did. The goodies shall apply to whomever applies the code to their account in Enmasse. The CD is just a convenient way to install TERA. (Of course it means a way to avoid the hassles of downloading the main program from the internet.) Patches will still be applied however."}
{"product_id": "B00E88G054", "context": "Does anyone know if this will work with Windows 8?", "response": "Yes it even works on Windows 8.1"}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "The same cable that charges the keyboard also charges the mouse.  There is a port on the front of the mouse where the micro-usb cable can be inserted.  The mouse can be used while it is being charged."}
{"product_id": "B00CPKUV7K", "context": "Why is it rated M?", "response": "Lot's of violence and spoken words throughout the game. You have to be the judge of this. If foul language doesn't offend you, go for it. The game itself is great.........................."}
{"product_id": "B004FS8LYK", "context": "Hey guys! So I was thinking of buying Tomb Raider but I hear there's multiple games in the series. Is this the first one? What's the order?", "response": "No there is a lot of older versions of this game"}
{"product_id": "B001ELWMHI", "context": "Hi! i'm in Ireland but I'm going back to Brazil soon. Can you tell me whether this console is 110v or 220v?", "response": "it says 100V-127V~2.1A 50/60HZ on it. if that helps. not sure what your asking"}
{"product_id": "B009D3HSTG", "context": "Is it possible to use two of these at a time and play multiplayer games?", "response": "Yes, though it really depends on what emulator you use. I use project 64 and it goes up to four. What emulator do you use?"}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "I installed it on a Win 7 SP1 32 bit desktop system and I don't remember any problems. I do think I had to install each game by itself but I'm not sure. It seemed me me it installed and played OK. Not sure about any other OS however....."}
{"product_id": "B000H683YC", "context": "Dose this work for other game systems? Dose this work for other game systems?", "response": "This is compatible with any device with a separate audio output. In the case of optical cables, I would suggest using separate optical cables rather than switching back and forth every time you decide to switch systems. Especially since optical cables are sensitive to dirt and wear and tear."}
{"product_id": "B000R0SRNU", "context": "Does this work on an xbox kinect?", "response": "No it dosnt it's from 2007 the kinect came out in 2011"}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "Two player is available"}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "Hi beretta, Yes it would work perfectly on a mac,  I actually use it on my macbook pro retina every day"}
{"product_id": "B008CP6MA2", "context": "Is this really only 3 games now? Or will they renew the vouchers for Origins?", "response": "I haven't heard anything about the vouchers being renewed. I assume at this point that its basically a three game set."}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "I play on 7 pro and 32 bit, so I really don't knoe for sure. But yeah should."}
{"product_id": "B008FHL56S", "context": "does this work with E 360 slim?", "response": "Yes, that is the system we have and bought the hard drive for"}
{"product_id": "B00BZOBE78", "context": "do you need the original Civ V to play this?", "response": "Yes you need Civ 5 first, b/c Brave New World is just an expansion pack"}
{"product_id": "B002I098JE", "context": "can you turn of blood", "response": "I don't understand your question."}
{"product_id": "B00886XQO0", "context": "For PC Users do i need to buy a bluetooth adapter? or can this connect into plain USB? I have evga x58 3-way classified board (which is a usb 2.0)", "response": "Yes you will need a Bluetooth adapter for your PC."}
{"product_id": "B0016897GS", "context": "the router to connect 30 ft. away .http://www.amazon.com/gp/product/B00NR2VMNC/ref=ox_sc_act_title_1?ie=UTF8&psc=1&smid=ATVPDKIKX0DER", "response": "Yeap it will work with no problems I really did not need 50 ft but it was whole lot cheaper than boxstore brand at $30 plus ouch :("}
{"product_id": "B0029M6VKA", "context": "Does it work with Windows 7 and Windows 8?", "response": "It should but I was using Windows Vista when I had a Track Ir"}
{"product_id": "B00H8NS1K8", "context": "is the cable from the headset detachable, thats the only thing stopping me from buying this", "response": "It's not detachable directly from the headset, no. The cable mounted on the headset is around one metre in length with a 3.5mm jack that can be attached to an extention cable with splitted microphone and audio jacks, or the USB unit."}
{"product_id": "B0076DO5A0", "context": "If I load from disc will I still have to use Steam?", "response": "I did not know I did not get the disc"}
{"product_id": "B0000C7GHG", "context": "does it come with memory card?", "response": "Yes,ours did plus a new controller and a couple of games.My husband is very pleased!"}
{"product_id": "B003EUPCZG", "context": "Hello, Anybody have the actual dimensions of the mouse itself? I have larger hands/need larger mouse. Currently, have Logitech G500. Thx!", "response": "It is 6\" long & 4\" across.  I have small hands and it works get for me."}
{"product_id": "B0050SWBAE", "context": "Can you use the GameCube controller with this game?", "response": "unlikely. Originally Nintendo said that Gamecube controller would be supported by anything that uses a pro controller, but they updated later that it would only be supported with Smash. They might change their mind again, but currently the answer is no."}
{"product_id": "B00F27JE1C", "context": "can it play american games?", "response": "yes , the psv is region free  so you can play american games, japanese etc ,"}
{"product_id": "B004AM5RAM", "context": "Do you notice any latency between clicking and games responding? I have had terrible wireless gaming mouse experience.", "response": "This mouse is on the the best i have used however a little bit from time to time is normal when you have a wireless phones internet and other wireless item in or near you home"}
{"product_id": "B00HWMP0TU", "context": "So it looks like there are actually 2 versions of this game. One of them is complete in box and the other requires Steam. Correct?", "response": "actually both require steam"}
{"product_id": "B00I9UVY7G", "context": "Is this game going to be in Spanish?", "response": "This game should be in three different languages, English, Spanish, and French."}
{"product_id": "B007VFHIHA", "context": "I have a desktop windows 7 thats been upgraded from XP will this game work on it?", "response": "I was able to run it on Win7 Pro 64bit. Didn't require any compatibility changes or the Administrator option. Though I don't know the specs of your system, when I was playing it I had a 3.4 ghz AMD quad core, Nvidia GTX 560 Ti, and 8 gbs of 1600mhz DDR3 ram.Best answer for you: it is diffinently possible.Cheers,Matthew"}
{"product_id": "B00FKV8AK6", "context": "is the dlc in the disc or u have to put the code into the xbox to get the dlc", "response": "You have to put in codes to get the DLC so it is not recommended that you buy it used."}
{"product_id": "B00BMFIXOW", "context": "is this game fun? how long is the campaign? is the multiplayer cool?", "response": "Its amazing. However the campaign is short compared to some of the other games and. The ending kind of sneaks up on you so for that reason I don't like the story arc as much as the other games but overall it's a great game. the multiplayer hasn't changed much and as always it's worth playing."}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "The download did not work for me.  I would not buy it.  Customer service for the gaming studio does not support this title anymore, you have to contact microsoft if you have any problems."}
{"product_id": "B008SBZD9G", "context": "So I heard spam bots and farming bots rip this game to shreds, not a very wise purchase wouldn't you agree?", "response": "what should I do？ I forget the key"}
{"product_id": "B005FMLZQQ", "context": "Using for Netflix and Hulu, can thus be used to navigate from the dashboard to the apps and control the apps as well?", "response": "Yes; the center button is the select button, and the too-integrated ring around it is the directional control to navigate quickly to any part of your dashboard. I don't like the design, but it works."}
{"product_id": "B003S9WJ9A", "context": "I was told that you need a utility disk to make the transfer happen.  Does the cable come with the utility disk?", "response": "Bought mine 5 months ago and it came with one."}
{"product_id": "B004L6C6BK", "context": "do i need any other cords to hook this up with my a40s to use on 360?", "response": "No it comes with all nessecary cables"}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "Top or side of wii unit has panel that flips up to reveal four game cube plug in stations to allow 4 wired remotes. For us we played smash bros on the original wii."}
{"product_id": "B006JSY3MI", "context": "Can I add PC version to Steam?", "response": "If you're buying it from Amazon? It will be a Steam key you buy."}
{"product_id": "B007WPM9GO", "context": "Does this fit the DS XL?", "response": "It comes in different sizes, but they do make it for the XL. Just check the description so you know you're  ordering  tge correct one."}
{"product_id": "B003O6C0V4", "context": "does this include the total body tracking system?", "response": "It includes everything in the picture... heart rate monitor, leg monitor thing, usb for the back of the wii, and the resistance band."}
{"product_id": "B001DNGCN2", "context": "does this work with the ps3 fat boyalso does actually works there are so many mix reviews about this product", "response": "It does fit ps3 fat however it found it useless. My system was overheating and it didn't help to stop it.  The product is cheaply made and cord had exposed wires after just three days of use."}
{"product_id": "B0088MVQIM", "context": "Could one plug in an electric cello or violin and learn them or is it just strictly for the bass and guitar?", "response": "just Guitar and bass"}
{"product_id": "B0029LJIFG", "context": "What is the difference between this gold card and the newer version - besides price - wouldn't this one still provide 12 months of xbox live?  thanks!", "response": "When does the 12 months start?  I would like to get this for my boys for Christmas..."}
{"product_id": "B004XGN8W4", "context": "Do I need the Dual Split power cord that is says in buy all three?", "response": "no not if you dont need to"}
{"product_id": "B00009TW6R", "context": "Does this game require the use of the CD drive beyond installation?", "response": "I'm afraid it does. The game will not launch unless the CD is inserted."}
{"product_id": "B0032MM2P4", "context": "is there a shuffle feature during the game?", "response": "I am not aware of a shuffle feature in this game.  I would say \"No\" there is not."}
{"product_id": "B000VRCNLG", "context": "Will it work on windows 7", "response": "Yes, it works perfect on my Windows 7. I am very happy with it."}
{"product_id": "B00CMC6HZ6", "context": "Should I buy WWE 2K14 or WWE 2K15 for the Xbox 360?", "response": "Yes if you are a collector and love WWE then by all means it is a must have. I preordered for my son and the confusion was I was not billed till it shipped on the 28 my mistake so we will re order this item on the 1st."}
{"product_id": "B00DNGQQUQ", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "No it must be online"}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "No it's not but sound is if u connect 2 tv. Mic isn't"}
{"product_id": "B008KH7NZA", "context": "Does this require a wire to the ps4 controller for chat to work?", "response": "You don't need to plug anything into the controller itself. The conversion box plugs into the digital audio port in the back of the PS4 and also into one of the PS4's USB slots. The only wire to the headset is the one from the conversion box."}
{"product_id": "B00BI9MDSO", "context": "Will this case get re-developed for the slim model?", "response": "I love the case best one ever :-)"}
{"product_id": "B00FM5IY38", "context": "Can this game be played entirely with Kinect? I saw a trailer advertising it as a Kinect game but all gameplay video show the player using a remote.", "response": "No it isn't played entirely from kinect.  There are support commands, ie archers or front line, that you can give voice commands to."}
{"product_id": "B0012DPHKW", "context": "Does the CD have to be in the computer for the game to run?", "response": "It wont play at all"}
{"product_id": "B005M2KSLC", "context": "Is this version 1 or version 2?", "response": "not sure but i love it"}
{"product_id": "B00B3PDH5G", "context": "Just To be clear it can be used with a pc and how would I connect it to my pc?", "response": "you have  to buy a USB Bluetooth device if your PC doesn't have bluetooth"}
{"product_id": "B002RRLQIO", "context": "Is this made in China?", "response": "Yes it is. What isn't made in China lol."}
{"product_id": "B00CBQO930", "context": "The mouse information says 5 user profiles bound to specific games but i don't see the list of games. Will this mouse work with World of Warcraft?", "response": "I've used this mouse to play WoW for three months now. It is perfect for me.  In fact, it has thus far out-performed my old Deathadder.  Specifically, I've played all facets of PvE with it with great results."}
{"product_id": "B0053B5RGI", "context": "Can you enjoy this game by yourself, or do you have to be in connectivity mode and do multiplayer?", "response": "Absolutely. The game can be enjoyed either way. You don't have to be connected if you'd rather enjoy single player."}
{"product_id": "B00B98HBTA", "context": "What is the diffeence between the game for $19.99 and the one for $39.99? Is it becuase the rating is pending on the $19.99 one?", "response": "I think that one might be the \"new\" version and the other could be a \"used\" version."}
{"product_id": "B00HNJ4DTA", "context": "Who manufactures this thing?  Where can I find warranty information?", "response": "don't waste your money they don't last get the call of duty xbox one controller at game stop or on here I like that one a lot"}
{"product_id": "B00FEDP968", "context": "Can I listen to music on my phone without it being plugged into the USB port?", "response": "The headsets get their power from the USB cable, so no you can't listen to music on your phone without it being plugged into a computer."}
{"product_id": "B008M4BNQ6", "context": "?How do I get my head set to be able to heat the tv threw the headset?", "response": "Plug wire to TV sound output may need rca adapter or other adapter. My xla headphones worked for a week then lost the right stereo channel . they are junk . I purchased wireless ones much better not worth the 125 paid though. Good luck"}
{"product_id": "B00D96BMV8", "context": "Is this headset wireless?", "response": "There's a cord from the headset to the controller because of the adapter. But it's wireless from the controller to the console and tv. Pretty awesome headset."}
{"product_id": "B003ZSN600", "context": "Is the end cable USB or do i need a USB dongle for PC use?", "response": "The controller connects through a USB. PC ready!"}
{"product_id": "B00DBDPOZ4", "context": "Can the cable connect to -and the battery be charged by- a usb wall charging unit instead of connecting it to the box?", "response": "I know that others have tried this without issues but I do not have personal experience with plugging it in to the wall."}
{"product_id": "B006YDPU48", "context": "IS THIS GAME ONLINE ONLY?", "response": "No. You can play off line or online"}
{"product_id": "B000H1V56U", "context": "do you need to solder anything?", "response": "Not at all, plug and play. You will need some special tools to open up your Xbox. I recommend a kit. I can't remember the particular one that I bought, but make sure it's for your model of 360."}
{"product_id": "B0098W4ZD4", "context": "Is the Precision Aim Mode button programmable, or can it only be used to drop the DPI?", "response": "Sorry, I don't use it for game playing.  I have large hands and bought it for business use."}
{"product_id": "B009LGO88E", "context": "Does this work with Smash 4 as a c-stick?", "response": "No it will not unfortunately because it's just another analog stick . As for the new 3ds coming out soon . It will have a c-stick that will be compatible for \"smash bros\" and many more games coming soon to the 3ds. Keep in mind that this pro pad is not a c-stick"}
{"product_id": "B0029M6VKA", "context": "please tell me what is in this 149.99 item,only trackir 5? or with clip pro in it?thank you .", "response": "Does not have TrackClip Pro in it."}
{"product_id": "B00GG4BBUM", "context": "I received this for the PS4 on Tuesday via pre-order, but there is no book in the game case.  Is this normal, or was my game just missing it?", "response": "You have to view the manual in the PS4 Web Browser as you open the game in the cross media bar @Dustin G."}
{"product_id": "B00CPKUV98", "context": "is this 1 or 2 player", "response": "I believe it is only one player fun game and if you play it on the Uber setting it is very hard."}
{"product_id": "B002XLR0JI", "context": "is this a quiet mouse? it's really important that is it cause i game at night mostly and i got roommates", "response": "No, it's not... It no louder than most mice, giving off a light crisp \"click\" with the click of a button, but I would not say it's quiet. Sounds like this is a very important feature to you, therefore I would NOT recommend this particular item."}
{"product_id": "B002I096AA", "context": "Can this system download movies from a PC?", "response": "Yes,  it can connect to a wireless internet access. to play games, watch movies, etc."}
{"product_id": "B00J6DLPLK", "context": "What is required to get Branch A in Drakengard 3?", "response": "Nothing. Just by playing the game regularly you will automatically beat Branch A. Branch B and C are the same way and unlock immediately after you beat branch A. Branch D is the only one that requires any prerequisite and that is for you acquire all weapons in the game."}
{"product_id": "B005EQE0YM", "context": "Would this be a useful headset for other PC applications, specifically Skype?", "response": "You CAN use it on PC, but I have noticed a lot of white noise when I use it on any of the PC's in my home"}
