{"product_id": "B00FQFFQ2Q", "context": "can you make you own cars in this game?", "response": "Yes you can make your own car"}
{"product_id": "B002DOC93C", "context": "will this work for the ds lite", "response": "Yes it will.  That is what I have and it works fine."}
{"product_id": "B00F9RGFEY", "context": "My roommate got this and I thought it was incredibly cool and high quality.  If I were to get my own pair, would the 2 wireless broadcasts interfere?", "response": "No sir. Ours never have.  We use them for 2 totally different features but they can be used on the same game ad well! Just perfect for us!"}
{"product_id": "B004RMK57U", "context": "i want to buy playstation plus digital code but am in nigeria can it work", "response": "Yes it can work if you are using the US PSN account. You just need a US address. The key/ code will be email to you straight, and you can redeem it online or through the PSN store. I'm staying in Asia and using the US PSN account."}
{"product_id": "B00EHBKUTE", "context": "Will this work on my Alienware alpha? can I use it for elder scrolls online? Will I need a separate mouse? I hear it crashes, is it a easy fix?", "response": "I'm not sure if it is good for the game in question but I love this thing. Never crashed one time on me."}
{"product_id": "B0018XWLKA", "context": "Will GTR EV. run on Windows 7, with a MOMO wheel? i have been burned before, buying games , then finding out they will not run on  windows 7... please help!", "response": "How did you get it work I have Windows 7 and can't get it to run"}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "Correct...it comes with Captain Scarlett and her Pirate Booty, Mr. Torgue's Campaign of Carnage, Sir Hammerlock's Big Game Hunt, Tiny Tina's Assault on Dragon Keep, and some skin packs and the Creature Slaughter Dome."}
{"product_id": "B00EFFVZP0", "context": "what exactly is the difference between a campaign and a regular video game?", "response": "Campaign is \"single player\" mode playing set missions against the computer. You can get online and play a campaign with other people on your team as well. Most people get online and play multi-player matches where everyone is a real person on both teams."}
{"product_id": "B00EOPT5ZS", "context": "How quick is the reaction time?", "response": "It behaves exactly like a keyboard. With a USB polling rate of 125Hz the response time is 8ms max 4ms typical."}
{"product_id": "B00FOHP8XI", "context": "Does the controller which come with the console have a bluetooth technology? or do I have to connect it using the USB cable? is the USB cable included", "response": "The controller uses built-in batteries that are charged via a USB-type chord to the machine.  It blinks when the battery is low.  I prefer it to the xbox controller and I have both."}
{"product_id": "B00HGLLRV2", "context": "Are there super attacks like in infamous", "response": "Yes there are. With different varieties"}
{"product_id": "B0076HD2W8", "context": "does this work with SteamOS?", "response": "Yes use it everyday"}
{"product_id": "B00G0OYHCW", "context": "in the wii u can i play with that games of the wii and gamecube like in the wii?", "response": "you can play Wii Games, it is posible that this year we can play Game Cube Games too."}
{"product_id": "B0080CE2WC", "context": "what kind of batteries do I need for this charging base?", "response": "It came with rechargeable batteries."}
{"product_id": "B00FJWNSWQ", "context": "Are the new characters on a disc or as a digital code? TY.", "response": "They are on the actual game disc. There's no installation disc or digital code."}
{"product_id": "B005EQE0YM", "context": "Do these plug into the 360 controller or into the xbox 360 itself?", "response": "They  plug into the controller"}
{"product_id": "B00004XRBB", "context": "Can u fly the Junkers JU 87-B STUKA", "response": "No, the German planes available are the M109, FW190, and 262 jet."}
{"product_id": "B00A878J5I", "context": "when the indicators turn green, does the unit stop charging the controllers?", "response": "I'm not sure. I do know when the indicator light turns green it is fully charged"}
{"product_id": "B004SJFJUA", "context": "Does it come with just the base or the Base+Battery? , Battery by itself  is 20$ here Nyko Power Pak+ for 3DS", "response": "It came with the base, a mini screwdriver, extra screws, and double size battery. No charging cable though."}
{"product_id": "B003VAM392", "context": "Will this work on a PS3 and Mac version 10.8.5?", "response": "I don't have a PS3 but as far as I can tell it does not work on the PS3 console. Yes it does work on the Mac system, just plug it in and it should see your device and install the necessary drivers."}
{"product_id": "B00H8NS1K8", "context": "What systems do these work with? or just PC?", "response": "Ps4 compatible and I use it on my xbox one. I bought some triton headphones and I use the adapter that came with the tritons. Very nice.  Scary awesome with advanced warfare."}
{"product_id": "B00I5LMSE2", "context": "can you play this on a 3 DS XL", "response": "Yes, the only difference with the XL is that its... XL. There's no change in games."}
{"product_id": "B00004XRBB", "context": "How many missions and planes are there?", "response": "The simulator includes a good variety of WWII fighter planes including the P-51D Mustang, P-47D Thunderbolt, P-38J Lightning, Supermarine Spitfire Mk.IX, Bf1096G-6, Fw190A-8, and Me262A1. Missions: There are 35 single missions, a full campaign (which may be played as the Axis or Allies), and the mission editor to create your own mission."}
{"product_id": "B00D6PTMB4", "context": "Is this a single player only game, or can two people plug in and play together?", "response": "From what I understand two people can plug in and play on the same system. Two cables are required to do so and you cannot play online with someone."}
{"product_id": "B00BGAA0SU", "context": "if i bought a used copy of this game would i still be able to get all the limited editions features? or is it only redeemable once?", "response": "Is only redeemable once. To get the features, you'll need to buy a new sealed copy or wait for the Game of the Year edition which will be cheaper and would have every DLC for the game. Hope this helps."}
{"product_id": "B005UI8V6C", "context": "can i play this game solo", "response": "Yes,  you pick your own person, pet ect., then you go from place to place on your own."}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "had the same issue bad copy's?"}
{"product_id": "B0086UK7I6", "context": "Are the buttons fully programmable for things besides games? ie copy/paste ctrl+w etc", "response": "Yes, fully programmable through Logitech's software."}
{"product_id": "B0009VXBAQ", "context": "Does this Wii console have the ports to insert the Dance Revolution (DDR) mats like the original Wii console?", "response": "this is the original wii console. The only issues is the servers for  the old wii are no longer online. If online play is important for you this is not the system for you."}
{"product_id": "B00D96BMV8", "context": "How good is the headset adapter? Is it the official xbox headset adapter or Turtle Beach's version?", "response": "It is the official xbox adapter."}
{"product_id": "B00H7KDNBO", "context": "What is the difference between instant access and PC?", "response": "Instant access is amaZon emailing you an origin code, and PC they send you a box with a disk and an origin code inside."}
{"product_id": "B0088MVQIM", "context": "Does it work fine with Bass or is focused only in guitar with some Add-on for Bass, I'm a bass player but I want it to practice and have fun.", "response": "Out of the box, this game is solely focused on guitar. You must purchase a digital add on for bass guitar. At the time I purchased the add on it was USD $9.99. That said, the bass feature works great and is a ton of fun. Just be aware that this feature costs extra."}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "it blocks the kinect camera."}
{"product_id": "B00AWEMODK", "context": "Is this game downloadable content or would I actually be buying disks to download.", "response": "Hi Kyle. This is downloadable content (DLC). No tangible disks are provided."}
{"product_id": "B002DUCF8A", "context": "do the pro flight panels work on mac`s?", "response": "Yes.  However, there can be issues with mac USB ports management of them.  If you have issue try to use an external USB port, powered hub, etc of some type to help."}
{"product_id": "B008GEH8LQ", "context": "good afternoon .. have to change it to Spanish mode", "response": "It comes in english. You will havê to switch the system language."}
{"product_id": "B001DNGCN2", "context": "does this work with the ps3 fat boyalso does actually works there are so many mix reviews about this product", "response": "The problem I had with the product is that my ps3 has angled fins where this is supposed to go. It's designed to clip onto those fins but it can't with them being angled. I just took some velcro and fixed it in place and it does keep my ps3 much cooler now."}
{"product_id": "B002I096AA", "context": "can i play older gameboy games on this such as pokemon yellow?", "response": "The 3DS will play DS games but not old gameboy games."}
{"product_id": "B00EV7AYAO", "context": "can this be connected to a laptop?", "response": "Yes. Just let it install the driver automatically."}
{"product_id": "B00656HLGO", "context": "Will It work with the Xbox360 Elite Console", "response": "The Elite just added the HDMI port, and came with a bigger HDD. So this drive will fit all of the original style 360s.  The ones It won't work for are the smaller style 360 systems that have been on shelves for a few years."}
{"product_id": "B001H4NMNA", "context": "is there a plug to plug into an outlit", "response": "Yes, there is a plug-in, that comes with this product."}
{"product_id": "B00IAVDPSA", "context": "I'll be hooking up the Tivo through the HDMI pass through. Can this remote be programmed to control the Tivo Box as well?", "response": "Nope it's not universal.   It can control the smart guide which is the cable listing through yhe Xbox.   But it wont control any features on the TiVo."}
{"product_id": "B002I098JE", "context": "Is good for 9 year old", "response": "probably theres nothing to bad in the killing at all it all really matters the mature ness of the child and your prefrence"}
{"product_id": "B0086V5V8G", "context": "The game has subtitles  in Spanish", "response": "From what I've seen it doesn't have Spanish subtitles. Perhaps in a future update Spanish subtitles will be provided in the game. Your best bet is to enable Spanish from the PS3 crossbar menu."}
{"product_id": "B008CP6MA2", "context": "I'm from Italy. Can i use every game without a US PSN account? (don't answer with just 'no' in case please)", "response": "No you'll have to you psn for chains of Olympus and ghost of apart but be carful those two games are like dlc full games but some cases they have already been used so basically you might only get 3 games GOD 1,2,3"}
{"product_id": "B005EOOT90", "context": "there seems to be a static sound when using this, does anyone else have this issue?", "response": "This was a gift and the recipient has reported to me that he loves them and there is no static to be heard on his set"}
{"product_id": "B008UQWX0Q", "context": "what is the age group of this?", "response": "My boy is 11 years old.  He is always playing games on his Entendo...... for me it is a great source to entertain him while we are shopping, etc. Highly recommend one for any age child.  Sonja G."}
{"product_id": "B00CXI0BPG", "context": "Can you remap the DPI buttons to something else?  I don't have a need for DPI switching.", "response": "You can! You have to install the Corsair M40 Mouse configuration program (available on their website) but you can remap it to another prebuilt command or to emulate a keystroke."}
{"product_id": "B0096L2SJ0", "context": "Does this fit with the phone, when it has a case on?", "response": "But don't buy it, it absorbs the battery like a starving monster."}
{"product_id": "B0073J8BYS", "context": "Does this work for the playstation 4 as well?", "response": "no, it does not. The controller will work with the new PS4 Eye, but the Playstation Eye included in this pack is only designed for the PS3."}
{"product_id": "B00E4MQODC", "context": "Does the scroll wheel have an indented clicky feel when you spin it?  I want it to be able to precisely switch fps weapons.", "response": "it does have a clicky feel but not as pronounced as some I have used."}
{"product_id": "B004L5SJ4Y", "context": "compatable with windows 7? 8.1? 10", "response": "Definitely compatible with Win7.  Don't know about other OS's"}
{"product_id": "B00HWMP0TU", "context": "So if you don't want to use the disk to play you can play via steam right?", "response": "I am forced to keep the disk in the drive. There may be a way to play without the disk, but I'm not aware of it."}
{"product_id": "B001MGNWDI", "context": "Does it have a Yaw capability?", "response": "Yes, just twist the stick."}
{"product_id": "B004RMK5QG", "context": "How do I receive the code? Will be via email or snail mail to my billing address? Cos the address belongs to my friend not mine.", "response": "You will receive an email with the link for the code and once you get it give it to the person you want and that's all to it. Very simple painless process. Great gift for a gamer as well."}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "Yes, it does work with MSw7. i am set up on MSw7pro and no problems."}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "voucher is still active as of 3-7-15. voucher is good into the year of 2017. don't know the exact month. I don't have the game with me."}
{"product_id": "B001DNGCN2", "context": "it can help ps3 prevent to get YLOD on 60 GB?", "response": "If installed and used properly, yes it can."}
{"product_id": "B002672Z80", "context": "Does this come with two remote controllers?", "response": "Hello, no just one controller and a nunchuck."}
{"product_id": "B0065NP6NC", "context": "Are the missions like Call of Duty (mission 1 must be completed before mission 2) or like Far Cry (you can complete missions in different order)?", "response": "There are four different main story lines you can follow depending on which faction you want to align with.  Those must be in order.  However, there are a bunch of side quests that you can undertake and do those any way you please.  Some are vital to get certain factions to favor you."}
{"product_id": "B00C2B355W", "context": "why is mine all crackly? do i need a new audio cord? 2.5mm to 3.5mm? Where do i get it?", "response": "Go to Skull Candy see if they can Replace it ok"}
{"product_id": "B000J18SR2", "context": "Is this compatible with windows 8?!", "response": "yes it is, i have windows 8"}
{"product_id": "B0050SZE2G", "context": "Do you need steam to play?", "response": "You don't need Steam.  You will need UPlay.  I believe even if you download it via Steam, you still need UPlay."}
{"product_id": "B009GZX49Y", "context": "does revelations come with the 3 DLC's???? and does brotherhood come with da vinci disapperance??", "response": "As far as I know, no. There wasn't any extras thrown in there other than the 3 original games."}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "Joystick initially feels stiff. I was also used to playing with a rumble pack so my controller was heavier. But overall it's decent."}
{"product_id": "B00CJ7IUI6", "context": "I want to buy this for a friend who wants to play Skyrim with DLC's but cant access PSN will he be able to use the DLCs? without internet??", "response": "Yeah, you download it off the disk. But the dlcs only work for the legendary edition."}
{"product_id": "B000TT2D2A", "context": "is it compatible with band hero games", "response": "Yes it is. I have Band Hero, Rockband 1&2, Beatles, and Guitar Hero Metallica, and the set works with all of them."}
{"product_id": "B009GZX49Y", "context": "is this a 3 games full disc set??  or  the games are for download?", "response": "This is the full trilogy on one disc"}
{"product_id": "B004AM5RAW", "context": "Does it get hot? With the way it's shaped it seems like it would get a little hot...", "response": "Even during intense raiding (4 hours no break) it would never get hot. Very well built. There is a reason every top gamer uses razer."}
{"product_id": "B00JC9SWSC", "context": "Can you download movies and save them on the PS3?", "response": "I cannot but it is possible I know this! Where I am keeps me from doing it unless I create a new account, which I do not want to do!"}
{"product_id": "B00001LDBZ", "context": "Will this work on Windows 8.1?", "response": "8.1?  I do not know.  It *just about* works on Vista - meaning that some of the tables appear stretched.  It came out before wide screen monitors, so it's video driver might have issues with proper scaling/aspect ratio.Plays fine on Vista though."}
{"product_id": "B004TTNTYW", "context": "When you say it's good for travel does that mean it is a car charger? I don't need that.", "response": "no it is a wall charger only they must mean how light n compact it is"}
{"product_id": "B008SBZD9G", "context": "Is it a Steam version or can I directly punch in activation code in FF14 client? I would prefer a direct activation code that can be used in 14 client", "response": "Ffxiv client for activation code"}
{"product_id": "B00GJSUUC0", "context": "Is this entire game just one level?!!!!!", "response": "Yes but its just lime a preview to MGS5 Phantom pain .... This game will take you days to get 100% on  its stealth game and yeah JTS one island you on there a lot to do .. Just.got to look for and be a fan of  MGS"}
{"product_id": "B00DC7G0GG", "context": "Do you have to use the gamepad if you are playing single player?", "response": "I purchased this for my son.  I have no idea about the in and outs of these games.  He is the expert.  Sorry I couldn't be of more help."}
{"product_id": "B00G237L7Y", "context": "this game is multilanguage??", "response": "TBH I DON'T KNOW BUD I haven't played it yet"}
{"product_id": "B003ZSN600", "context": "Does this work on a xbox 360", "response": "im sorry, this product only works for the ps1"}
{"product_id": "B00BMFIXZG", "context": "is this a steam activation code or uplay?", "response": "Assassin's Creed Black Flag activates through Steam!!..At least, my copy did!!..Enjoy!!..It's a great adventure!!..."}
{"product_id": "B00GZ1H07Y", "context": "How good is the flipper action w/ PS4 controller? Does anyone have experience using on other platforms & if so would you say PS4 has the best feel?", "response": "Update: This game was terrible due to lag on the flippers but then turned on game mode on my TV (vizio) as one of the main reviews suggested.  I went from hating the game to loving it in seconds!  Buy this!"}
{"product_id": "B0002DKTY2", "context": "will this work with windows 7?", "response": "I'm using it with Window's 7.  No problem."}
{"product_id": "B00005NIMB", "context": "Does it work with mac?", "response": "The Sidewinder was made by microsoft; draw your own conclusion."}
{"product_id": "B008M4BNQG", "context": "Does this headset just hook up to your USB slot or does this have to hook up to the audio/video jacks also (red,white,yelliow) in back of your tv?", "response": "You can just plug it into your ps3/ps4 in USB slot but yo wont hear game audio only chat but if u hook up both u will hear game and chat sound"}
{"product_id": "B00J6DLPLK", "context": "Does the game have dual Audio and Subs? As in English and Japanese.", "response": "The game is in English by default, but the Japanese audio can be downloaded through the Playstation Network.As Joey Balmert mentioned, the DLC missions will not be in Japanese."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "sure does. Compatible with Vista/7/8, probably XP too if you download the utility but it's plug-n-play on the newer OSes."}
{"product_id": "B00E8RVP0U", "context": "does wii products play on Wii U too?", "response": "Sorry.  Can't help you.  They only have regular Wii."}
{"product_id": "B002P35JMO", "context": "Is this a special 360 HDMI connector or would this work with other devices that have HDMI?", "response": "No, its connector is special and for x360 only !"}
{"product_id": "B004QRKWLA", "context": "Hi, those any one know if it will work with Mac computer?", "response": "It should, its a normal Xbox 360 controller, but wired. All you need is the drivers and/or button mapping software. Look on youtube for assistance as one of those videos will have a link to this software."}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "Yes it will, my girlfriend has one and it fits!"}
{"product_id": "B00EZKNSTQ", "context": "does it work with pc?", "response": "On windows 7 its plug and play on windows 8 and up you have to download the driver http://www.microsoft.com/hardware/en-us/d/xbox-360-controller-for-windows then you have to download the windows 7 drivers and install it on your windows 8 pc be sure to grab the right version 64 bit (x64) or 32 bit (x86)."}
{"product_id": "B0050SX7BQ", "context": "How is this compared to The Last of Us, can you give me a short description of what I can expect from the gameplay?  Guns? 1st or 3rd person shooting?", "response": "Unfortunately I can't answer your question to tha T but what I can say is playing this game you're garunteed to have an expirence like none other"}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac OS Mavericks? If so, how smoothly?", "response": "I bought this version because of mistake. I have only PC. But It was running properly on My PC(win7)"}
{"product_id": "B00CX9L30W", "context": "Is the collectors edition worth the extra $20?  Does the helm exp bonus work whenever you want to create a new job or is it only good for a 1-time use?", "response": "The helm is level related I believe, so it works with any jobs under the level cap listed on the helmet description. Aside from that, the extra $20 is mainly cosmetic."}
{"product_id": "B003Q55Y5C", "context": "what are system req, ments for this game. will my hd 7870ghz do it justise? and is the gameplay good?", "response": "If you have at least 4 gig of Ram, and that processor should provide you ample power to run this. I run this on a Quad AMD processor with 4 Gigs and it did decently well. That game play is excellent. For me, it was as decent a scenario FPS as I have seen with some fairly decent realism."}
{"product_id": "B009RXUNZI", "context": "are these compatible with the wii u?", "response": "To be honest, I'm not sure how the chat side works for the Wii U, but my assumption is that any headphone with a standard 3.5mm jack will plug in direct to the Wii U controller. You won't get surround sound or anything, but as a stereo headphone, it should work normally."}
{"product_id": "B0088MVQIM", "context": "is it a two player game", "response": "Yes it is :D"}
{"product_id": "B00F2ENJY8", "context": "can 2 or more people play simultaneously, or do they take turns (e.g., mario kart)", "response": "Two can play at the same time. My son and I both play together."}
{"product_id": "B00DHUUTEM", "context": "how do you turn the keyboard lights on", "response": "They should turn on automatically when you plug the keyboard into the computer. Also make sure you install the Driver Disk that it came with."}
{"product_id": "B00DBCAT3W", "context": "A question - is gameplay for Fable Anniversary similar to games like Oblivion, with first-person perspective and all?", "response": "no this game is third person"}
{"product_id": "B00D96BO7K", "context": "can this be used wirelessly to watch movies from my xbox 360? thanks", "response": "No. The xbox 360 2.5 mm jack for the controller is strictly for chat volume, unlike the PS4 which can channel both chat and game audio from the 3.5mm controller jack."}
{"product_id": "B005L38QK2", "context": "My mouse stopped working. How can I return this product and replace it with another ?", "response": "If your mouse stops working you should go directly to the steelseries website and request service with them. Normally you would request an RMA (Return merchandise authorization) and you would ship the mouse out for inspection. Once the problem is identified typically steelseries will send you another mouse in return for your broken one."}
{"product_id": "B003VANOFY", "context": "does it work with mac?", "response": "On mac I'm sure you can use Razer synapse to get the surround effect"}
{"product_id": "B00FM5IY4W", "context": "What cars do you start with?  Can you get a Mustang?", "response": "There are different class races you can choose from. In the beginning there's not too much to choose from. There is a Modern Muscle class series you can race the Mustang in. There are different model Mustangs as well. :)"}
{"product_id": "B002B9XB0E", "context": "If I buy two of them and plug each one into a usb port, I should be able to play 2 player games like this, correct?", "response": "Yes but this isn't based on the controller, its based on whether or not the software you're using to play the game allows two players. If it does (and usually it should) there should be minimal issues."}
{"product_id": "B001E93IWI", "context": "How do you use the headset part, it doesn't work i can't hear anything", "response": "There is a volume scroll .scroll to the right and it should get louder if not then you might have a defective pair"}
{"product_id": "B00H7KDNBO", "context": "Is it possible to buy a copy of the Instant Access version for someone else's account?", "response": "it is possible you get a code and input the code in origin, whomever puts in the code first gets the game so you could buy an instant access code and then give it away."}
{"product_id": "B008KH7NZA", "context": "Does this work with the Xbox One? I bought the Chat adapter and I get game audio but no chat. I also updated the controller.", "response": "Other customers have reported that after buying the chat adapter it worked on the Xbox One. This is not a guarantee that it will work only that it has worked for others. This item does not come with the chat adapter,therefore, it is only advertised as working for the 360."}
{"product_id": "B002DOC93C", "context": "i have bought my first Nintendo, it is DSi XL. This classic games work in DSi XL??", "response": "All regular Nintendo DS games work Nintendo DSXL. With the newer 3DDS console it can use both all the older DS games and the 3D games."}
{"product_id": "B008GEH8LQ", "context": "What firmware version does this red/black model ship with?", "response": "I would like to know the same thing. I am assuming below 4.5, but I'm not sure..."}
{"product_id": "B00562O78S", "context": "Which should we buy Playstation 3D Display or HMZ-T1? Playstation 3d display is $499 and available on Nov.HMZ-T1 is $799 and available on Oct 26th.Which sould we buy?", "response": "Just FYI if you play multiplayer online the hmz does not have a mic so how r we gonna converse with other players...if they fix this I'd get it."}
{"product_id": "B009RHEBWA", "context": "Does it handle Trad IRA to Roth conversion in TY 2012?  I know it did for TY 2010.  TurboTax 2012 does not handle Roth conversion", "response": "Sorry, I do not know if it does.  That is a feature I have not used."}
{"product_id": "B00CJ7IUI6", "context": "Is the DLC in the disc or is it a download code?", "response": "When I loaded the disc into my PS3, I was also given the option of downloading the DLC."}
{"product_id": "B00GS6A6V8", "context": "How would this work if buying as a gift?", "response": "you would purchase the DLC's and give the codes to the person who has the console"}
{"product_id": "B008CP6Q6M", "context": "Does this come in a plastic case or cardboard sleeve", "response": "I got it in a cardboard sleeve"}
{"product_id": "B00E1L786S", "context": "will this work on a lg smart tv? thanks", "response": "It should. I have one and I connect it via optical audio."}
{"product_id": "B00J128FPA", "context": "I own the standard edition, but a friend of mine is ordering the collector's edition. Is there a way for him to give me the extra content?", "response": "He might be able to trade them to you if tradable. ... sorry im not so sure myself."}
{"product_id": "B00BMFIXT2", "context": "Is there a 2 player co-op? I want to play split screen, is that possible? thanks", "response": "I never been playing this game as 2 player. You will ask it to ubi soft. Sorry for not help."}
{"product_id": "B00GS6A6V8", "context": "How would this work if buying as a gift?", "response": "Once you purchase the package amazon will send you an email containing the three playstation network codes. Once this happens you can simply put the codes onto a card and the player can download the add ons at their convenience."}
{"product_id": "B00EZKNT5O", "context": "If I were to use this on my PC (Windows 7) would it still light up and vibrate? Or is that just an Xbox thing?", "response": "Yes it still will light up and vibrate."}
{"product_id": "B009S4JZKK", "context": "can you create your own layout? or world? and is their a website for downloading other yards, engines, and or cars? and can you also upload your world so other can play? what you have created?", "response": "I believe you can, but not with the basic software.  This product is part of Steam, which is an umbrella for this and many other PC games.  I think the cost to do what you want is high.  Check out Steam on the web, and contact them."}
{"product_id": "B00CMQTVK0", "context": "does it come with warranty? and can you play minecraft the reason im asking is because i saw  a message somewhere , someone said that you cannot", "response": "The factory warranty is, per Microsoft's page: \"Warranty Period\" for Xbox One, means 1 year from the date You purchased it; and for Accessories, means 90 days from the date You purchased it. Minecraft for the Xbox One was released on September 5th, 2014."}
{"product_id": "B00HK74G2E", "context": "Can you play PS2 games w/ this PS3?", "response": "because i like this best most PS3 games"}
{"product_id": "B001AH8YSW", "context": "at launch game.    box pops saying I must be administrator to play first time. I am the administrator. Any help would be appreciated I am running windows 8", "response": "I had the same problem and I tried clicking as admin, no luck. I found the 1.5 patch for this game and it works now with the patch."}
{"product_id": "B000RT2868", "context": "And this cable plugs into the xbox original right, with a female usb port?", "response": "I have not used this device in years, I am not sure. I think you are suppose to plug the memory card into the big end then the usb into your pc and transfer the game save to your computer. I did not have much success with it."}
{"product_id": "B00027CXEM", "context": "Does it work on a windos 7", "response": "It can. Just be prepared for a faster run time."}
{"product_id": "B005VO5ZVY", "context": "Will this fit XL size?", "response": "No. I brought it and it was too small"}
{"product_id": "B00IRHE892", "context": "why does it say \"Batteries 2 AA batteries required.\"? never seen a wired mouse that needs batteries, could that be a mistake?", "response": "Must be. Mine has no batteries. No place to put them in."}
{"product_id": "B00EZPCX1A", "context": "This system does play the regulards and 3ds games right?", "response": "I do believe it does.  These were gifts for my two grandsons, so not really sure what it all does, but they were very happy & pleased.  Hope this helps."}
{"product_id": "B00BT9B2LC", "context": "Can you tell me what is the installed system version?", "response": "I checked in settings and on the bottom right it says Ver. 7.2.0-17J"}
{"product_id": "B00G6CLZPA", "context": "Is this the same basic story as the other Hakuoki games?", "response": "It is basically the same as the PSP game Hakuoki:Demon of the Fleeting Blossom, but it has other features and a bonus game that you can unlock."}
{"product_id": "B00E1DMWBM", "context": "Can you Get sega CD games on this Device or only the 16bit ? and how hard is it to down load games ?", "response": "Only 16 bit games on this one!! You have to buy SD card separately(it don't come with one. You can download more games at imuga.com :) hope this helps you. PS this system is neat if you are into 16 bit games."}
{"product_id": "B004QRKWKQ", "context": "how does it recharge?", "response": "It does not come standard with a rechargeable battery.  You need either 2xAA batteries (which can be rechargeables if you want-I use eneloops myself) or the Microsoft rechargeable battery pack and the play/charge cable."}
{"product_id": "B00B1OK3TC", "context": "does it work on xbox", "response": "Yes it most certainly does. I've been using it to record tons of videos on my Xbox 360."}
{"product_id": "B00HGAWFJG", "context": "Can you turn the light off? Or, does it turn off while in stand-by mode?", "response": "Light stays on when the ps4 is on standby and on mode, only turns off is ps4 is off or if you unplug the usb."}
{"product_id": "B00D96BO7K", "context": "as soon as you get it, is it ready to go and use on the xbox 360?", "response": "Yes....you can use it with your phone ...or with xbox 360 or xbox one..."}
{"product_id": "B00D6NPFDK", "context": "Does the portal & the usb connection cable come with the starter pack?", "response": "Yeah but make sure NOT to get the portal owner starter pack because then it wont"}
{"product_id": "B00FB4BUMW", "context": "I see the WASD comes highlighted by default. Can I change that default to ESDF instead?", "response": "You can *completely* customize which keys are lit at any given time, and have multiple saved profiles."}
{"product_id": "B00FM5IY0Q", "context": "I havent played the prior Dead Rising's. Should I play them for any story knowledge or can I jump right into this game?", "response": "It is not needed to play prior games. The stories are not connected other than the zombie apocalypse. You can jump right in and enjoy."}
{"product_id": "B0041RR0TW", "context": "Has anyone used the 710 Gamepad on a windows 8.1 system?", "response": "Yes. I've played several modern games using the X-mode and older emulators in D-mode. Both work without any issues."}
{"product_id": "B00BCEK2LU", "context": "My kb sets on s slide out tray so over all length is a factor. What's the side to side length of the G510S?", "response": "It's in the product description - Product Dimensions:  20.9 x 9.1 x 2.3 inches ; 3.3 pounds"}
{"product_id": "B001B5U80K", "context": "Will the disc copy be able to activate through steam with a product code or by other means?", "response": "I totally agree with GIGs answer. I bought the disk, popped it in and it was done. I too had played the demo version first. And I found that when the disk was fully integrated into the system it picked up where I had left off. Pretty cool, I thought."}
{"product_id": "B00HLT0YT0", "context": "It sucks having to wait until the 8th, but it releases tomorrow, and i paid for 1 day shipping.  So I shouldn't have to wait until Thursday.  Right???", "response": "Is there a possibility I will receive it this week?"}
{"product_id": "B008M4BNQG", "context": "Does this headset just hook up to your USB slot or does this have to hook up to the audio/video jacks also (red,white,yelliow) in back of your tv?", "response": "yes u can hook it up with  just the usb but u well get no sound from the speakers they can here u but u can only here them with the tv speakers if u buy one buy with the Jacks"}
{"product_id": "B009AFLXQQ", "context": "i am buying the deluxe set wiiu do i need a pro controller", "response": "Definitely not !!. The Wii U Pro controller is an ADDITIONAL controller to play with a friend or family toghether or to play shooter games in a more comfortable way. It is lighter and smaller than gamepad. The only negative thing....: no sound output, you have to hear it directly from gamepad."}
{"product_id": "B00A8HIGSS", "context": "Does this also have english subtitles like the Japanese version?", "response": "Yes when I played it I remember having subtitles"}
{"product_id": "B0095D1CM8", "context": "folks where do i get replacement batteries for this amazing mouse?", "response": "go back to the company you got it from they should tell you where you can get one"}
{"product_id": "B00CTKHXFO", "context": "which to buy, Legacy or HD Collection? do I need both? differences? thanks in advance ~ from: a noob.", "response": "Legacy has the HD Collection in it. The HD Collection is Metal Gear Solid 2, 3 and Peace Walker. Legacy also has 1 and 4, extra content and a neat art book thing. Legacy is a lot harder to find too, so it might be extra valuable in a few years, who knows."}
{"product_id": "B001CC8UBG", "context": "will game play on window 7 64bit", "response": "i play it on a windows 7 64bit machine with no problems."}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "I've used it on Pokémon X and Y US cartridges with no issue."}
{"product_id": "B00D4WTO1M", "context": "How long is the campaign?", "response": "About 15 hours Long."}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "Yes, there is a mute, turn up volume, and turn down volume key, all activated by the function key."}
{"product_id": "B00AAS88K6", "context": "will this mouse work with a new Mac Power book?", "response": "Yes it works great with my current Mac book pro and Mac Pro both new this year."}
{"product_id": "B00EZPCWWA", "context": "Can the 2DS take a beating? How durable is it exactly?", "response": "Since Christmas 2014, so far so good. 10 year old plays daily."}
{"product_id": "B00EVWZHLK", "context": "Are they all on one disc or 3 separate discs?", "response": "Three separate disks yahahahahahah lol have a good one"}
{"product_id": "B002JVX5V4", "context": "Does this have a bigger board? An older person wants this and said that she's tried a couple Scrabble games and the board is really tiny.", "response": "Board is large, but the squares are small compared to older version."}
{"product_id": "B002J9GDXI", "context": "Anyone used this with a KVM switch?  Logitech's web site doesn't commit either way; it says \"KVM switches may affect the functionality of your G500.\"", "response": "nope, ive used it directly to the motherboard"}
{"product_id": "B0040QCPYY", "context": "what is the battery life and how far can you be away from the ps3 before losing service?", "response": "the headset lasts about 4 to 5 hours of play and I think it has a range of 10 feet or so you say but it works for me very well and listening to great"}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "ITS THE GOVERNMENT MANNNNN!!!!!!!!!!!Now sold with \"Add On\" item- Tin Foil hat"}
{"product_id": "B000A2R54M", "context": "Does this game work with the dsi XML?", "response": "It works with my DSi standard size, so I think so, yes."}
{"product_id": "B0065NP6NC", "context": "Which one is better fallout 3 or new Vegas", "response": "Fallout 3 is overall a better game than Fallout New Vegas, however if u want a longer story, more equipment, more siquests and overall \"more stuff\" and a more refined game then cinsidere Fallout New Vegas."}
{"product_id": "B002I0GF72", "context": "Is this the same game as Majaras Mask with better graphics or something. Its hard to tell looking online everywhere", "response": "No, this game actually came out after Majora. And it was got the GameCube."}
{"product_id": "B000IZAQD8", "context": "Is this the latest version? The 90001?", "response": "I really don't know - I just know this version is working for me"}
{"product_id": "B009AGXH64", "context": "how many people can play at once?", "response": "It depends on the game and 1 on game pad and 4 on the Wii controllers  some games 4 to 5"}
{"product_id": "B00009OY9U", "context": "Will this work to fly helicopters in BF4?", "response": "Yes. I use it in BF4.  It is a pain in the butt to set up though. That is the case with all joysticks and BF4.  Just make sure to clear out all the default joystick settings and then procede to assign keybindings."}
{"product_id": "B00CBQO930", "context": "Weight and Size. Is it light and cheap or does it have a nice weight? Is the size big enough to be comfortable for people with large hands?", "response": "I have large hands and it works great. It's also heavy compared to standard default mice, like Patrick K. said. I love this thing for the price, although I haven't used any other gaming mice, so I don't have anything to compare it to. It does change colors, which is awesome."}
{"product_id": "B003VAHYQY", "context": "DOES IT WORKS WITH A MAC???", "response": "mine does not work with anything its trash"}
{"product_id": "B001GIUWX0", "context": "If you have more than one player, do you need to have more than one steering wheel for them to play at the same time?", "response": "The steering wheel is not a necessity for any player. Most people I know prefer to play without it."}
{"product_id": "B00JFCA6V2", "context": "Does this item come with the charger and USB cable?", "response": "yes i get it thank you"}
{"product_id": "B00BI9MDSO", "context": "soooo, my new Vita Slim PCH-2001 won't fit in this case? Thanks.", "response": "It will fit but snug. So if you have the extra silicone grip cover it wont. A grip cover is like a phone case.Without the silicone cover on the case fits perfect. Please note: i have a slim as well.I found that i needed the silicone cover for extra grip on the vita."}
{"product_id": "B00002SANH", "context": "This game will not install because I have a 64 bit processor and this game is for a 32 bit processor only. How can I install this game on my computer?", "response": "Hi. I had the same problem. A solution is posted here. Note that although windows 7 is used in the example it works in windows 8 as well. The solution works fabulously."}
{"product_id": "B00562O8U0", "context": "what does sony ps3 games mean when they say 3d compatable", "response": "It means that if you have a 3d compatible tv you can play the game in 3d wearing 3d glasses"}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "Yes the headphones require Microsoft's adapter.The adapter is included though."}
{"product_id": "B00CD1FC6G", "context": "Does mac support this keyboard???", "response": "Per the specifications:System requirementsPC with high power USB 2.0 port (+500mA)Windows® 7, Windows® 8,  Windows Vista®,  or Windows® XPAt least 35MB of hard disk spaceTwo USB connectors are required for USB pass-through"}
{"product_id": "B00I9GARIM", "context": "Does this headset work with consoles and does the mic work in game with consoles like, ps3/4, xbox ?", "response": "It does work on ps4 for sure. I'm not sure about the ps3 or xbox. Keep in mind the volume control doesn't seem to work on PS4, but the mic mute button does."}
{"product_id": "B002L6HJCI", "context": "Can I play AOE III without an internet connection?", "response": "absolutely - you don't need an Internet connection"}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "yes, I have windows 8 & it works great."}
{"product_id": "B00EOI2MRS", "context": "does this controller work on pc?", "response": "Yes, any wired PS3 or 360 will work on PC"}
{"product_id": "B004XGN8W4", "context": "Is this compatible with PS4?", "response": "Sorry I don't have a PS4, but I can't see why it would not work.  The only downside is that it will probably run 720p @ 60fps."}
{"product_id": "B002I0HJG8", "context": "Is this the Veteran code which can make me have 8characters?", "response": "And if you input the code backwards you get a lioness mount that you can sell if you want"}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "Sorry about the late reply man and yes it will work on PC and PS3. But I don't think it works with Xbox"}
{"product_id": "B0053BCO00", "context": "Could a 5 yo play this?", "response": "I'm not too experienced with children of that age, but I think they would have fun with it. It may be a bit tough, but I played video games at age 6."}
{"product_id": "B001MGNWDI", "context": "Is this stick durable? Can it tolerate stressful actions  like, trigger pulls under duress or a high anxiety turn?", "response": "Yes just might slide around on you if your really being violent with your moments"}
{"product_id": "B00DHUUTEM", "context": "how do you turn the keyboard lights on", "response": "Mine are always on, I don't believe there is a button to turn them on but I could be wrong"}
{"product_id": "B00INUME3K", "context": "Whats the difference between MX GP and MX GP 14?", "response": "I thing mxgp 14 is the US version. Mxgp originally released in Europe."}
{"product_id": "B00J6DLPLK", "context": "Does the game have dual Audio and Subs? As in English and Japanese.", "response": "As for audio, you can purchase the Japanese voice tracks for the whole main game (not the DLC missions), but the subs are English only as far as I know."}
{"product_id": "B007W8S2MG", "context": "does this game have a setting where i can have japanese dialogue but english subtitles?", "response": "No. But the dub is of high quality and very natural. Also, like in good anime subs, many Japanese terms are kept. The people who did the localization definitely knew what they were doing."}
{"product_id": "B00009W5WB", "context": "Judging by the picture the connector is the same connector for the wired Xbox 360 controller, so can I use my 360 controller for the OG Xbox?", "response": "Sorry. I dont know.  I have the original x box"}
{"product_id": "B00BGA9X9W", "context": "Are the sticks confortable to play with? Meaning it won't slide my thumbs by mistake like with the DS3?", "response": "I know what you mean with the DS3, that was so annoying. On the ps4 they did a great job fixing that. I've played for hours some days and the thumb sticks stay durable and also they are a lot more comfortable than the ps3. The whole remote is a step up."}
{"product_id": "B005CELN8W", "context": "Will this run on Windows 8. This was asked before but never really answered.", "response": "yes, but you must be connected to internet. It will not load on a computer not connected.  A little hard to install but if you follow the instructions carefully it will install."}
