{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "yes the game is not region locked so it works on any ps vita system"}
{"product_id": "B000B6MLPU", "context": "the cable does not seem to fit into the x box anywhere.  Do I have the wrong cable? Or is there somewhere it should connect?", "response": "Unplug the factory a/v plug and the new cable look the same and fit in the same location. The plug connector is in the back, middle section of the xbox. Connects next to an hdmi connection. To me the connection resembles a very large hdmi plug. Goodluck"}
{"product_id": "B00475AYUA", "context": "Can you play this on Microsoft 8.1?", "response": "Yes I'm playing it right now with 8.1"}
{"product_id": "B000GP8448", "context": "Is it compatible with Windows 7 ?", "response": "Absolutely. Been using this wheel through the last 3 versions of Windows. No problems."}
{"product_id": "B005BLAJ68", "context": "DOES IT HAVE BID WHIST CARD GAME?", "response": "No, it doesn't.  The closest is Pitch."}
{"product_id": "B005J37I4Y", "context": "Can this work on px4", "response": "Yes, it works with the Turtle Beach PX4 and PX5. It's just a Bluetooth receiver."}
{"product_id": "B005YR308S", "context": "There is a big price difference between the directors cut (Being cheaper) then the greatest hits version.  Any reason for that?", "response": "I don't know the reason but it is worth it! Every penny :D"}
{"product_id": "B00GQTZ8TM", "context": "I bought one a while ago for my brother and it didn't come with a charger. I'm assuming that this one does, correct?", "response": "Yeah it should. Mine did."}
{"product_id": "B0041RY3W4", "context": "Can this be used to charge a single Sixaxis controller?", "response": "You can charge one or two at a time. I often charge only one ps3 controller on it."}
{"product_id": "B00AEX81SG", "context": "This new design still plays Blu Ray movies right?", "response": "Not sure...im overseas, so havent used it for that purpose yet.  Instruction book says yes to your question."}
{"product_id": "B004RMK4BC", "context": "How do I get my code", "response": "You will get an email with a voucher code, that will bee the code you need to enter on the playstation network. Or you can go to your games library and see the code from the amazon page."}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "It comes in one package in a cover. You slip the package out of the cover, and you unfold it to show all the disks."}
{"product_id": "B0050SWBAE", "context": "My 5 year old loves the Pikmin mini game in Nintendoland do you think Pikmin 3 would be too advanced for her?", "response": "Honestly for a 5 year old I think it would be. Maybe around 8. I am not a parent myself but there is some problem solving and time management issues that may be too advanced for a 5 year old. The controls are also not very intuitive for Pikmin 3 so they may get frustrated with that."}
{"product_id": "B002BRZ9G0", "context": "can you play this on a wii u? also can u play this off screen on the wii u gamepad?", "response": "You can play all Wii games on the Wii U as long as you have the wii remote. You cannot play Wii games on the Wii U gamepad, though."}
{"product_id": "B00E1L786S", "context": "will this work on a lg smart tv? thanks", "response": "As long as your tv has a optical audio jack."}
{"product_id": "B00JM3R6M6", "context": "How are nicknames used in the game?", "response": "They will always be referred to as their nickname. Even though you give them full names, whatever goes in the nickname box is what they called."}
{"product_id": "B009DYCTY4", "context": "does the product come with a controler", "response": "Yes it comes with a controller and a charge cord it also comes with a free month of ps+ along with the games and some great dlc it makes for a perfect starter pack into PS3."}
{"product_id": "B00F27JDUY", "context": "If you play a game where there is multiplier, would you be able to play with someone who is on an Xbox?", "response": "No you cannot. Playstation and Xbox are on two completely different networks. However, if your friend another Vita, you can play there."}
{"product_id": "B00BGHUS58", "context": "I havnt got this game for my son yet and he wants to know if it's worth it", "response": "The game is cool, worth every penny"}
{"product_id": "B004G5TUJM", "context": "How big is it?", "response": "The pedals are rather small about five inches across total. The wheel is a comfortable size though. The shifters tend to break easily beware."}
{"product_id": "B00BTOAFXS", "context": "in the halo games you cant charge your weapon. Do you know how to fix it?", "response": "take the metal screw on the one or both of the triggers"}
{"product_id": "B00A7VK16A", "context": "work with xbox 360 e console?", "response": "If you are referring to the elite? Yes it works. That's what I have in mine."}
{"product_id": "B00DB9JYFY", "context": "do titanfall has a competitive/ranked gametype  ?? like halo arenas, csgo competitive mode or CoD ranked games ? or is it just normal games like BF4 ?", "response": "I have not played those games in the multiplayer mode; however, the players are competing in teams against each other.  Players do yet frequent promotions in ranking and with promotions comes better capabilities. Hope this answers your question."}
{"product_id": "B00DB9JYFY", "context": "do titanfall has a competitive/ranked gametype  ?? like halo arenas, csgo competitive mode or CoD ranked games ? or is it just normal games like BF4 ?", "response": "No ranked matches are available at this time. However, there are updates made to the game all the time (they just recently added private matches) and I expect that to be a gamerype added at a future time."}
{"product_id": "B004RMK57U", "context": "i'm from Portugal , and i have a portuguese psn account , if i buy it ,will it work for me?", "response": "I'm not sure about it. But i think it only work for Usa psn account."}
{"product_id": "B0053B66KE", "context": "what is the difference between X and Y?", "response": "No big difference between X and Y, some different variety in wild Pokemon is really it"}
{"product_id": "B00BGA9X9W", "context": "DOES DUAL SHOCK 4 WORK ON PS3 AND ON GTA 5", "response": "No, and yes. But only on the ps4. Dualshock 3 only works on the ps3, and the dualshock 4 only works on the ps4."}
{"product_id": "B003981JQ4", "context": "It will fit on 3DS??", "response": "Yes, unless it is a xl 3DS"}
{"product_id": "B0017TFLBQ", "context": "Is HOMM3 compatible with Windows 7 ????", "response": "Yes. The game can be installed and played on Windows 7. However, it may crash often. So save regularly if you want to put up with that."}
{"product_id": "B00GS6A6V8", "context": "How would this work if buying as a gift?", "response": "You receive codes and those are put in the system. That's all I know. I'm sorry. My boys do all that!"}
{"product_id": "B003JVF728", "context": "It may be a stupid question, but if I buy the disc version does it still use Steam?", "response": "Yes, if you want to play with others on internet"}
{"product_id": "B00292OW1U", "context": "What are the overall dimensions ?", "response": "22.3 x 9.2 x 1.9 inches"}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "You can use the same cable for the mouse.  I have an extra cable plugged into my computer just in case I need to recharge both the mouse and keyboard at the same time.  For as inexpensive as they are, it is worth buying an extra cable."}
{"product_id": "B000AOJ7FK", "context": "Can this game do Single Player?", "response": "Yesyou can play with bots"}
{"product_id": "B00HKCKA0G", "context": "can you use this as a pc headset?", "response": "no you can't only for PS 4"}
{"product_id": "B007WPM9GO", "context": "If the hinge on the DS is already broken, will the nerf hold it in place?", "response": "it did for us for a year or more"}
{"product_id": "B00FB5R3XQ", "context": "Now, I've had many people say that PS3 sticks don't work as well as Xbox 360 sticks for PC, can anyone confirm or deny this?", "response": "This 1 works fine for PC. I use it for usfiv and kof xiii."}
{"product_id": "B007MM9E42", "context": "Does this game require two players?", "response": "no , you can also play as a single player !"}
{"product_id": "B002MRUROI", "context": "Does this work on xbox 360 slim", "response": "no, it does not.. only the arcade and elite models. the slim has a different body so this does not fit.. but amazon carries the cooler stand for the slim"}
{"product_id": "B0017KIBAI", "context": "Is this an official Nintendo Product and does it work with US Wii consoles even though it says \"Use in Japan only\"?", "response": "Yea, it works perfectly with wii's from anywhere, i recommend it a lot!"}
{"product_id": "B005EOOT90", "context": "can i use this om ps3", "response": "No, they usually have headsets specific to xbox/ps3 I can't guarantee this works with ps"}
{"product_id": "B0036VO4XO", "context": "does it work on ps4?", "response": "Yes it does, I use it on my PS4 and my PC"}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "Yes, I guess so."}
{"product_id": "B004L6C6BK", "context": "Is this the 2013 version because the review pictures show it as a 2011 version?", "response": "it is the 2013 version"}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "it is a separate piece, and can be oriented any which way you want."}
{"product_id": "B00001LDCK", "context": "does it work on Windows 7?", "response": "Yes, i play it on win 7"}
{"product_id": "B00E3667XQ", "context": "Is it true Android emulators have 1000 ms of audio lag?", "response": "I use GSNES and have never noticed any audio lag."}
{"product_id": "B00BGD6LMG", "context": "Does this game come with two disc?", "response": "Yes there were 2 discs"}
{"product_id": "B00HN9LS48", "context": "Does it work for Samsung curved TVs?", "response": "I'd be surprised if it did. I bought this for my flat 42\" LG and it wouldn't lock tight up top and sat flimsily on top of my television. Spend the extra few bucks for the PDP mount."}
{"product_id": "B002DUCF8A", "context": "Is the flap control a 3-way rotating lever, or an up/middle/down switch? I currently use one of the levers from a throttle quadrant as a flap control.", "response": "It is an up/ middle/ down switch, works real well."}
{"product_id": "B00BI4VVGY", "context": "are you able to switch fans off with this and is it possible to run 2 of these in the same build?", "response": "It is possible to switch individual fans off and on with this.  And I don't see why you couldn't use 2 at once.  You can hook up a maximum of 5 fans per unit."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "Hi.  http://www.youtube.com/watch?v=7NUX2rG_u8w it differs on opinion.  you can check this video.  and other comparison videos. hope it helps.  i would say if you have a PS3 version no need to buy the PS4 version."}
{"product_id": "B00ECOBFA4", "context": "What is the age range on this? Would it be appropriate for a 6 yr old?", "response": "yes my youngest was 6 when he played the game actually a lot of fun and your child can be any c he wants to be ."}
{"product_id": "B002L93F0A", "context": "Do these controllers directly plug in to the Wii?", "response": "Yes, they plug into any of the four Gamecube slots on the top of the Wii."}
{"product_id": "B006IR6NH8", "context": "Does it work with any driving or racing game, even simulators?", "response": "It didn't work for me for any other game but Simraceway. When I contacted tech support, they told me that it was designed exclusively for Simraceway and no other game (despite claims to the contrary in the sales specs)."}
{"product_id": "B00FXOP1MU", "context": "can you play regular ds games on this unit?", "response": "Yes, this unit can play 3DS and DS games (but not game boy advance cartridges)."}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "No no it does not. The joystick is terrible- very insensitive with minor movements, then overly sensitive with large ones. I ended up getting another from thinkgeek.com which is better, but not the same as OEM. I would suggest getting an original n64 controller and an adapter to USB."}
{"product_id": "B00BGA9X9W", "context": "Can this be charged with a microUSB phone charger (wall charger) or does it have to be plugged in through a usb?", "response": "yeap it does and keeps the controller from going dead so quickly and the new update to dim the light does no good either if you ask me I still get the same amount of playtime"}
{"product_id": "B002BSA298", "context": "Q: Does this work with xbox 360 ELITE 120 GB?", "response": "Says on box it works with any Xbox 360 console. I can not tell you about the ELITE 120 GB. minimum 190MB storage required hope this helps some"}
{"product_id": "B00C710AQO", "context": "does anyone has this problem: when i play it and then turn off the ps3... and then i try to play it again it doesnt work! it gets stuck. Any help?", "response": "My work great  and I don't know anything about your since u have problem with ps3"}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "I purchased this product for my nephews 7th birthday ...yeah its pretty small old but pretty cool."}
{"product_id": "B0089OBLDO", "context": "Will this also work to convert a plain xbox controller to work on a ps3?", "response": "Yes it will but you need to have a wired XBOX controller."}
{"product_id": "B00JFPO7JG", "context": "Does this game work with XP?", "response": "It will not work with windows xp because this game requires directx11 which xp does not support."}
{"product_id": "B00CPKUV9I", "context": "Will this game work with a joystick?", "response": "Thank you for the inquiry. The game was found in an estate sale and from what we read some say yes it will work but some say no. So I will have to say no it will not work with a joystick."}
{"product_id": "B000GP8448", "context": "what games does this product work with", "response": "This wheel is incredible.  I've used it with Test Drive Unlimeted 1 & 2, Grid, Sim Racing, and other games.   It should work with most other games.  Not all of them support the six speed H shifter and Clutch of course so research individual games if there's one you're interested in."}
{"product_id": "B001EYU1WS", "context": "Is it as complex as the picture?", "response": "Yes all buttoms work"}
{"product_id": "B001COU9I6", "context": "Does it play PS2 games?", "response": "the one i received from Amazons Warehouse deals was not backward compatible. the serial number on the console should be \"CECHE01\", mine is CECHL01"}
{"product_id": "B00CJD4HD2", "context": "I ordered this G500 mouse and it is making a high pitched tone that is giving me a headache after 4 hours of use.   Return or try to replace?", "response": "but im not headache"}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "It might be your controller, have you tried any other controllers cause i had no problems out of the game except deciphering Japanese characters."}
{"product_id": "B002I0J4VQ", "context": "I just received an item called : PlayStation 3 System Slim 120GB & Controller (Black). I there is no controller included. So where is the controller?", "response": "Look at the description of the item you bought. If it includes the remote then it's a problem with the seller and you would contact them or Amazon. If it doesn't include a remote then you need to buy a remote."}
{"product_id": "B003O6EE4U", "context": "Once I bought Xbox 4GB option, could it be somehow upgraded to 250 GB option?", "response": "Yes, with a external hard drive."}
{"product_id": "B008CXTW5G", "context": "Do the A1 and D1 series keys just not have any default values? I press them and nothing happens.", "response": "Correct. If you want something to happen u have to assign it at the azio app"}
{"product_id": "B00009WAUO", "context": "How many levels are in the game?", "response": "There are 8 world's with about 88 levels between them if you count fortress and castles 8 mini boss fights and 8 boss fights"}
{"product_id": "B003VAM392", "context": "does it work on steam? and is there the deadzone problem?", "response": "I don't use steam so I don't really know. But it doesn't have any dead zone problem"}
{"product_id": "B005EQE0YM", "context": "would I need to by an audio adapter for this headset or just plug in and its ready to go out of the box?", "response": "It is ready to go out of the box.  No adapter is needed."}
{"product_id": "B008KH7NZA", "context": "Does this require a wire to the ps4 controller for chat to work?", "response": "There is a usp end for power and a cable that goes into the back of the ps4 for better sound."}
{"product_id": "B002I090AG", "context": "would the charger and pen be included with the console/", "response": "In what condition is this ds in?"}
{"product_id": "B00HG0B8NA", "context": "I get the following error while updating the game: \"The application cannot be installed due to a certificate problem...\"", "response": "I have not had the problem so I really can't offer any suggestions."}
{"product_id": "B003ZJ1VD8", "context": "what color is the switches?", "response": "they are blue. and annoying get something with brown switches or black switches."}
{"product_id": "B002L93F0A", "context": "Am I right when I see that there are two (2) controlers for $12.50 price?", "response": "YES, there are TWO controllers. Such a good deal!"}
{"product_id": "B00DTWES6I", "context": "does this code work on steam   or will splinter cell be stored in a separate game library on amazon.", "response": "Its been a while since I played it so I don't remember exactly what it was, but I believe it was through Uplay."}
{"product_id": "B00009W5WB", "context": "What is that cable used for?", "response": "It is a replacement break-away cable for original xbox controllers."}
{"product_id": "B0094H8H78", "context": "is the screen backlit? In other words will I be able to play the games in a dark room?", "response": "Yes, the screen lights up, but not real bright."}
{"product_id": "B00009W5WB", "context": "Do they offer this product for XBOX 360?Thanks,John.", "response": "No but, amazon sells this \"HDE Xbox 360 USB Breakaway Cable\""}
{"product_id": "B002RRLQIO", "context": "Does the keyboard come in the original box sealed, with everything in it like the software?", "response": "yes it comes in original box sealed but like most hardware now you must download the software from the internet ."}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "it'll be available dec. 31st, 2015.  until then either plugin xbox one controller to pc or use xbox 360 controller with xbox 360 receiver plugged into pc.  Microsoft Xbox Wireless Adapter for Windows"}
{"product_id": "B00111SFEU", "context": "does it work on a computer", "response": "I'll tell you when I get my new laptop"}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "Yes, it is the Steam Version. Once you purchase it you will be given a redeem code to unlock it in Steam."}
{"product_id": "B0057WDE8Q", "context": "Is it wireless and would it be good for playing Mz PacMan", "response": "Its working great and that's what my Granddaughter plays with it, she likes it so it must be good!!"}
{"product_id": "B00I9UVY7G", "context": "My grandson sent me a text which said, here is a gift idea for Xmas for him, 2014 FIFA World Cup for xbox 360. Is this the game EA Sports 2014 FIFA?", "response": "As some one told you already, this is the one that sim world cup. Nice Gámez. My kid and i have a lot f fun with it."}
{"product_id": "B00BMFIXZG", "context": "do you have to have internet", "response": "to play the game you don't have to have any internet"}
{"product_id": "B006IOAHPK", "context": "Can kids play this game or not ?", "response": "I wouldn't recommend it.  They certainly CAN play the game but the crude behavior and constant cursing would cause me to say not for children."}
{"product_id": "B000KA5T6A", "context": "Does this product include wireless receiver? I think yes. but then why amazon suggests to buy this controller with wireless receiver altogether in 'Frequently Bought Together' section?", "response": "Yes. The documentation indicates that it supports up to 4 controllers, and I have used it for 2 controllers at the same time."}
{"product_id": "B00CJ7IUI6", "context": "What is the biggest difference between this legendary edition and the greatest hits version? if I just want to play the game, which version is best?", "response": "Legendary comes with all the downloadable content, greatest hits is just the original game!"}
{"product_id": "B0071NH8B8", "context": "Can you use this with regular WiFi, or do you have to buy the AT&T thing?", "response": "yeah you can use the regular wifi  the at&t; is just option"}
{"product_id": "B002I0H79C", "context": "iS iT 3 pLAYER", "response": "Multi-player online, but 2 players can play story line co-op."}
{"product_id": "B006W41W3M", "context": "can they be used with x-box one", "response": "No it cannot be used with Xbox One. I had to buy a different headset. Still got a Turtle Beach, the X7."}
{"product_id": "B00IVJ1M7M", "context": "will this product work for me in australia?", "response": "Hi. depends on your 3DS. Mine is American not handle other regions because the lock region."}
{"product_id": "B001PO2BJI", "context": "will these work for wii u?", "response": "Hello yes they do in fact work with the nintendo wii u. I currently am using them combined with a wii mote controller. Very fun."}
{"product_id": "B008U5ZNIG", "context": "I have a razer black widow (mx blue) and some keys feel different. They make a weaker click sound and tactile feel when pressed. Is this normal?", "response": "Yes. The space bar, backspace, enter, any key that isn't the size of a letter key will sound different because they use a leveling bar. Still a MX blue underneath, but the leveling bar make a different sound"}
{"product_id": "B00HG0B8NA", "context": "Help - Which of these solitaire games is the good old fashioned basic solitaire ???", "response": "Got it for my husband, but he wanted a more basic game. This wasn't what he wanted, only tried it once."}
{"product_id": "B00HPU96FI", "context": "My VGA cable doesn't show anything. I can't hear it or see it.", "response": "I had the same problem, ended up returning it.  I couldn't get anything to display at all, not even the menu, so it wasn't a game compatibility issue."}
{"product_id": "B00B1OK3TC", "context": "does it work on xbox", "response": "Yes, and very well.  I use it on Xbox 360."}
{"product_id": "B006LVZEN0", "context": "Are the measurements listed for the mouse or mouse package?", "response": "Neither--I'm not really sure where those came from--I don't have the mouse in front of me, but it's probably about 3\" wide x 5\" long x ~1.75\" tall"}
{"product_id": "B00BI9MDSO", "context": "How far back does the case open? Can it only open to the degrees shown in the picture or does it extends further?", "response": "It opens 180 degrees such that the top covers touches a flat surface"}
{"product_id": "B00ARD5410", "context": "Is it compatible with windows 8?", "response": "Yes.http://www.corsair.com/us/gaming-peripherals/gaming-mice/vengeance-m65-fps-laser-gaming-mouse-gunmetal-black.htmlScroll all the way down and you'll find the answer."}
{"product_id": "B0027AP5S8", "context": "is this just a case or is it that actual console", "response": "Just the case. Nothing else."}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "The belt comes with the game.  I think you could still use the game by holding the controller but it probably wouldn't give you the right feedback on your moves that way."}
{"product_id": "B00BGAA29M", "context": "how are the graphics", "response": "pretty much the best way to describe it is it is kind of like a pixar movie.  I was impressed."}
{"product_id": "B003O6CB6S", "context": "Will this work on windows 7??", "response": "Yes, but you have to install steam preferably"}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "Yes I have Windows 8 also it works fine"}
{"product_id": "B0012DPHKW", "context": "Does this game work on a laptop that has window's 8", "response": "It worked on my sons windows 7. But I am not sure about windows 8.But if I get the chance to try it I will let you know if I can."}
{"product_id": "B00886XQNQ", "context": "Does this headset come with the warranty even though it is not purchased directly from TB?", "response": "Briana, yes the warranty is valid when bought from Amazon."}
{"product_id": "B00CORA9GC", "context": "F18 Carrier Landing:  I have a Mac Mini with only 4mb of RAM. Would this be a problem?", "response": "Sorry I really do not know"}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "The only reason it's called Super Mario 3D world is because most of the mario games have been 2D.  This is one of the exceptions.  It doesn't output a 3D signal to a 3D TV, though some TVs will be able to transform the image into 3D."}
{"product_id": "B002L93F0A", "context": "can i use this with the wii u adapter", "response": "Yes, but buyer beware, the left joy sick rubber WILL come off after useing for a while. I play ssbb and they only lasted a month."}
{"product_id": "B00DBDPOZ4", "context": "Can it charge when Xbox One is turned off?", "response": "Other posters are completely incorrect. It does charge with Xbox off (assuming Xbox is plugged in), just as it advertises."}
{"product_id": "B003O6EDSM", "context": "Does this article come with the steelbox containing all the discs or just with the separate games with separate boxes all togheter?", "response": "It comes in one box. It just folds out. :)"}
{"product_id": "B001L5TIR4", "context": "Can I download this to my ipad?", "response": "If you haven't downloaded it yet, check with customer service. I have downloaded games that should have worked but didn't. Nothing was noted in any description about game not working on certain devices. It has only been a few games but still that's your hard earned cash!"}
{"product_id": "B00DC9SWWE", "context": "My dad and I plan on playing this together, and it says 'XBLive Gold Required'. Do we need one or two for both of us?", "response": "Sorry i have no idea how the gold membership works only that it is paid.   I would think if you and your dad are playing this remotely from 2 different locations that both would need a membership but just a guess."}
{"product_id": "B00BXONG7G", "context": "Can you activate this via: Steam?", "response": "I think you can"}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "Sadly it isn't backwards compatible"}
{"product_id": "B00CHGYUE2", "context": "How many hours is the campaign ? Is this game worth it if I have no intention of playing online ?", "response": "Nope (about 6 hours)"}
{"product_id": "B000ND3XXA", "context": "I have a macbook and heard this would work on a mac...it has a mini disk. does not work. is there a driver i can install/donwload?", "response": "MacOS doesn't use Drivers, they use Kexts which are basically the same thing only coded a bit differently.Unlike Windows Drivers, MacOS Kexts aren't automatically downloaded when a new hardware is detected by the system."}
{"product_id": "B002I0GF72", "context": "Is this the same game as Majaras Mask with better graphics or something. Its hard to tell looking online everywhere", "response": "No it is a completely different game"}
{"product_id": "B008RA5DIY", "context": "If we purchase Quickbooks from Amazon, does Intuit still provide support?  They tell me that you may not get their actual product.  Is this true?", "response": "they gave us total support because we made sure Intuit was the vendor on Amazon which we bought the software from.  Hope that helps!"}
{"product_id": "B0095P5K8I", "context": "So i bought this mouse two months ago and now its completely not cooperative. The light turn on, but the cursor is stuck in the middle. i cant move it", "response": "Mine does not work well neither. I suspect the product's quality."}
{"product_id": "B003O6EE4U", "context": "Is it possible to watch DvD's with the Xbox 360?", "response": "Yes. As long as the previous owner doesn't have it coded."}
{"product_id": "B0016HG4H4", "context": "Does this drum set also work on the Xbox 360?", "response": "no it will not"}
{"product_id": "B000QJ1NS8", "context": "Is it just the battery or does it come with the screwdriver too? Whenever I add this product to my cart, it only shows a picture of the blue battery.", "response": "Yes, it did come with the little screw driver."}
{"product_id": "B008M4BNQG", "context": "do you have to be online to hear the game 0r cani hear it off line by my self playing my game", "response": "no you don't have to be online to use it it works for either game or chat and offline or online"}
{"product_id": "B008RA5DIY", "context": "We recently bought Quickbooks Pro 2013 3-user. Can we buy single user version and have all 4 people working in the same company file at the same time?", "response": "No. You can not. If you buy the 3 user version, you can have 3 people (not 4) use the QB at the same time."}
{"product_id": "B003NSLGW2", "context": "Will it fit a Gamecube controller?", "response": "I don't know, my grandson purchased it thru my computer. He has a ps4,   sorry.    I did cut out around the knobs for the knobs to move smoothly. He is satisfied with it"}
{"product_id": "B00F27JGVA", "context": "Is this PS Vita card in sealed original packaging?", "response": "Yes. All in Japanese, but that's not really an issue"}
{"product_id": "B00CD90R72", "context": "Is playing the game with the move controller as enjoyable as playing it with the dualshock?", "response": "I don't recommend playing with a move controller"}
{"product_id": "B001DNGCN2", "context": "does this work with the ps3 fat boyalso does actually works there are so many mix reviews about this product", "response": "Not sure about fat  boy but mine seems to work good"}
{"product_id": "B00BGA9V2Q", "context": "Does Diablo III on PS3 allow offline(Local) multiplay? In the other word, can 2 people play D3 on one PS3 at the same time?", "response": "yes, up to 4 ppl can play on one ps3 off line"}
{"product_id": "B00519C7CE", "context": "is this a digital download for xbox 360? i wanna play today, but i dont wanna wait for shipping.", "response": "Yes, majority of big titles, even old ones are available for dl.  It tends to change though.  Whenever it feels like it."}
{"product_id": "B00A7VK16A", "context": "What's the maximum dimensions for the console for it to fit? I want to use the case with an alienware x51, it's only a bit larger than an xbox/ps3, I need to make sure it fits.", "response": "I am still wondering if an alienware x51 will fit does anybody actually know"}
{"product_id": "B008VQ68C4", "context": "Would this headset be compatible with an Astro Mix Amp? Would it be suggested to buy an Amp with this headset?", "response": "If you want to take the astro mix amp + pc headset route, i'd recommend the Senn pc360. That seems to be agreed on as the best combo for quality surround sound. Pricey though. Honestly, save money and get the u320's. You'll be happy with the sound."}
{"product_id": "B001FBHT34", "context": "Can you make this compatible with a ps3?", "response": "Yes, it would work, pretty sure you need a contentment to make it usage thou."}
{"product_id": "B0053B5RGI", "context": "If I were to only get one, Would you recommend X or Y?  I'm new to pokemon and have only played the Yellow Game on the Original Gameboy with Pikachu", "response": "Purchased as a gift for my 11 year old daughter. She asked for X. She likes it very much. I've heard if one has x and another y you can play each other."}
{"product_id": "B0090ECASW", "context": "Every time I try to use the profile editor it keeps saying this \"Plug in the device you wish to configure and run the program again.\" what do I do?", "response": "Im sorry I no longer own the keyboard. I sold it because it we terrible!"}
{"product_id": "B008U5ZNIG", "context": "Can you set the macro keys (on the left of the keyboard) to media keys? (I.e: Mute, Volume up, Volume down?", "response": "Yes but F1 F2 and F3 already are.These are use by holding down the Function key at the same time as pressing the F key.F1= MuteF2= Volume UpF3= Volume Down"}
{"product_id": "B00GZ1GUSY", "context": "Is there a wireless headset I can use with the voice commands?", "response": "not sure about wireless headsets"}
{"product_id": "B0050SY77E", "context": "is crysis 3 a multiplayer game?", "response": "Not the regular game.  I am not sure if the XBox live version is.  I do not have XBox live."}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "It doesn't have a battery life.  It won't take a charge"}
{"product_id": "B00J6DLPLK", "context": "What is required to get Branch A in Drakengard 3?", "response": "Gamefaqs.com is where you'll get ALL your answers to any game"}
{"product_id": "B0086UK7IQ", "context": "Are all the buttons fully reprogrammable, particularly the ring finger button?", "response": "Yes, all buttons are fully reprogrammable (keystroke or macro) including the ring finger clicking button. Horizontal scroll wheel is also reprogrammable but vertical scrolling is not."}
{"product_id": "B008TP1OKI", "context": "I have the red ring of death now ever since inserting the hard drive. It fits perfectly and I hear the click it makes when I insert it.", "response": "I never heard a clicking noise went inserting the hard drive into my new xbox360 E style. I put it in as soon as I got it fit perfectly it didn't make a clicking noise for me it fit just like using a flash drive in and out no problem."}
{"product_id": "B002RYLG4Q", "context": "how well would it work on a samsung flat screen tv?", "response": "Not to sure.  U might  have to get a rca  to hdmi  converter if the picture is blurred or bounces."}
{"product_id": "B00DJYK8XS", "context": "Does it come with a Zumba fitness belt?", "response": "Yes, it does. I purchased Zumba Fitness Core and Zumba Party and each game has a belt plus an extra one."}
{"product_id": "B00FE8WKPQ", "context": "Does the balance board work well on carpet?", "response": "Yes, it includes \"feet\" that can be used on carpet and I have had no issues."}
{"product_id": "B000QJ1NS8", "context": "My GBA SP won't charge. Time to change the battery?", "response": "Most likely.  It could be something else but it's likely the battery.  Here's a guide I found: https://www.ifixit.com/Wiki/Nintendo_Game_Boy_Advance_SP_Troubleshooting"}
{"product_id": "B00CXI0BPG", "context": "Can you choose the DPI levels (I play at 750 and 1100 DPI) or are you locked into pre-set DPI levels (like 500, 1000, 2000, 4000)?", "response": "There's only 3 levels and they're preset, no granular control. The buttons right below the mouse wheel is what controls the DPI. I can't remember what the numbers were but the highest was over 1k."}
{"product_id": "B005BLAJ68", "context": "DOES IT HAVE BID WHIST CARD GAME?", "response": "sorry.  no  whist.  check with hoyle.com to find the game."}
{"product_id": "B006NU6HAS", "context": "can this be used on fs2004?", "response": "Not sure... I use FSX.   I know you would need Service Pack 2 (free down load for FSX) or FSX Accelerated.   I would suggest you get FSX."}
{"product_id": "B0050SVNP8", "context": "can this game work on 3ds XL UK version ?", "response": "The 3DS can play DS games with no issue."}
{"product_id": "B00DCBDNW6", "context": "Monthly Fee???!!! u mean besides the PlayStation Plus Subscription and the Game Disk's actual price (37.58$) there is still a monthly fee?", "response": "you don't need ps plus to play online you just have to pay the monthly subscription."}
{"product_id": "B00FE8WKPQ", "context": "Does the balance board work well on carpet?", "response": "Yes, it work well on carpet."}
{"product_id": "B005EQE0YM", "context": "can i use this on pc and does it have voice changing and if it does't can you tell me a download that i can use to use voice chanigng", "response": "You can use the x12 on a pc...it does not have voice changing capability."}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "I think you need to wait for their new game to come out. I don't think it has came out yet. It's called \"Don't Starve Together\". That should be multiplayer. I've seen YT videos of people playing it with multiple other people."}
{"product_id": "B009JZ04BC", "context": "Where do you install the application for the mouse? To change colors?", "response": "Oh! You can find the software on google by typing the model of your mouse. Google will give u the downloading link"}
{"product_id": "B00CBNV7UQ", "context": "Is it Chinese subtitle or English?", "response": "It is in english."}
{"product_id": "B00AEX81SG", "context": "Could someone tell me if this system is the original sony ps3 and  if it comes with full wifi,and netflix capability", "response": "Yes...everthing you expect in ps3 and i love it"}
{"product_id": "B004RMK4P8", "context": "What do I do if I'm buying the playstation card for someone do you give me a code to give them..I'm older and don't know anything about this.", "response": "This is just a code and you will get it sent in an email so just give someone the code and they can use it."}
{"product_id": "B00GG4BBUM", "context": "Can I play with to 2 players?", "response": "Yes of course! Go to https://theshownation.com/ for all the information on the game.  This game is amazing!!"}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "It is old enough to run on XP, been out for a while."}
{"product_id": "B003VAHYQY", "context": "using controller with steam games?", "response": "If its a game for windows live the software u can get from logitech free will use the same profile it would as if on an xbox. If not you can use the software to easily assign buttons and sticks to replace mouse movement."}
{"product_id": "B00DH1KRQQ", "context": "Would this controller work for my laptop that has Windows 8.1? If not do you have any suggestions on a controller that will?", "response": "I don't see why not. I have Windows 7 and it works fine. 7 and 8 are close enough."}
{"product_id": "B007SRM5U6", "context": "Is this an Internet game only or can you just play it on  PS3?", "response": "You dont need an internet connection for this game. It comes with everything already on the disk, including all of the downloadable content."}
{"product_id": "B005761IOY", "context": "i bought one of these controllers and like it doesn't turn on without being plugged in to the charger is there a way to fix that", "response": "Try unplugging the controller from ps3 and then wait 5 mins if that don't work you fried the charging hold you might need to get another one don't overcharge this controller 3 hours is enought time for this controller"}
{"product_id": "B008CP6MA2", "context": "Is this a multplayer game?", "response": "No, none of the God of war titles in this collection are multiplayer only God of war ascension."}
{"product_id": "B0091A3AHA", "context": "And what is the hook up. Is it the red,white,yellow thing or what?", "response": "It is hdmi, the smaller rectangle-ish cable."}
{"product_id": "B00BGD6LMG", "context": "As a mom I am asking... My son is 11. He has a couple of the call of duty games.  What do you think?  Can he avoid the sex stuff in \"free roam\"?", "response": "I did not know there was any sex related stuff in the free roam. My question to you is, you let him play a game where the point of the game is to \"kill\" the opponent but a little naked behind is not ok. Sounds a bit skewed doesn't it??"}
{"product_id": "B0094H8H7I", "context": "can you save your game", "response": "I dont believe so .......  Better off Getting a used Sega Genesis if you want to save games"}
{"product_id": "B003981JQ4", "context": "Will the 2DS FIT IN THIS CASE?", "response": "The 2DS is far too big to fit in any case made for a DS Lite, DSi, DSiXL, 3DS, or 3DSXL. You will need a case made specifically for the 2DS. Here's a start: http://www.amazon.com/s/ref=nb_sb_noss_1?url=search-alias%3Daps&field-keywords;=2ds+case"}
{"product_id": "B0016897GS", "context": "Can I use this to connect my smart tv to my computer modem? Is this the correct cable? Thanks", "response": "Yes, that's what I use mine for. I works great."}
{"product_id": "B0086V5V8G", "context": "Is this gameplay style similar to Deus Ex: Human Revolution?", "response": "I haven played Deux, but it is for sure that with splinter cell you are gonna have fun and it is challenging."}
{"product_id": "B002672Z80", "context": "Do these have the wii motion built into the remotes?", "response": "I can't speak to this but we are very happy with the controller.  We use it for Skylanders, Mario Kart, and Sports Resort.  It works just as effectively as the Nintendo brand one we also have, these are extras.  I don't know if this helps...."}
{"product_id": "B0079V29EI", "context": "Can I charge my vita with this grip on?", "response": "Yes you can, you can connect the Vita charge cable on the bottom of the grip."}
{"product_id": "B00CXCCB64", "context": "Is this 2 players or more?", "response": "My grandson said up to 64 people can play, like online. Not on the same screen."}
{"product_id": "B00AAS88K6", "context": "I'm guessing the mouse isn't 8.7 inches long, that's the box.   What is the actual size of this mouse?", "response": "the mouse is tiny, mine measures 2 5/8\" at the widest spot, 3 7/8\" long and 1 1/4\" tall... I was almost dissapointed how small this mouse is but it works"}
{"product_id": "B0053BCO00", "context": "will this work in the 3dsxl", "response": "Yep it will, it's what I have."}
{"product_id": "B003O6E986", "context": "would this be appropriate for younger kids too? Does it use trashy animation or bikini girls in the game? I am looking for a fun family friendly game", "response": "This would be perfect for your kids. I understand your concern and can assure you,  none of that material is found anywhere in this game"}
{"product_id": "B00DCBDNW6", "context": "I've never played FF before it looks really good Is this the type of game i can just buy the newest 1 n jump right in or do i need to start with 1?", "response": "No every story is different from plot and cast, it's a MMORPG if you every played one you will be ok"}
{"product_id": "B009DYOPK0", "context": "Does this mouse have an accurate scroller? Meaning that its not that sensitive and scrolls very easily", "response": "Well i dont really know what you mean but i can tell you the scroll doesnt roll so in like a gaming situation well changing weapon is easy.. Otherwise you can ajust the sensivity of the scroll .. I hope it ansers your question.. Sorry for my poor english"}
{"product_id": "B005F1ZUU4", "context": "Does this include a disc needed to be used?", "response": "It does but it's pointless if your running windows 8, because the drivers are already there. But for everything else you need to install the drivers from the enternet."}
{"product_id": "B003VAM392", "context": "How long is the USB cord?", "response": "Its exactly 6 feet long or 1.83 meters long."}
{"product_id": "B00BGA9X9W", "context": "CAN BE THE PS4 CONTROLLER USED FOR PS3?", "response": "Yes it can, but only if its plugged into the ps3 system using the charging cable"}
