{"product_id": "B002BS47JE", "context": "i would like to know the differencesbetween wii fit and wii fit plus? to me the activities and everything seem the same.", "response": "I liked it better a few of the games were more fun and it was easier to switch players.  But mine broke right after I bought it."}
{"product_id": "B007OVHW90", "context": "does this work for X1'S", "response": "I don't think so. The x41s have a detachable cord from the headset to the controller (headphone jack on both sides of the cord). This cord is a replacement for that.I think the headphone cord on the x1s are hardwired inside and don't detach like the 41s."}
{"product_id": "B009SJR28W", "context": "Can you toggle the backlighting? I think it's a feature that could come in handy, but I want to be able to turn it off.", "response": "Yes you can. You can turn it on or off and also adjust the brightness as well. Its pretty cool and convenient so you can get the best gaming experience."}
{"product_id": "B003VAHYQY", "context": "using controller with steam games?", "response": "Yup I use it with steam with no bmp problems."}
{"product_id": "B0044DJZ0A", "context": "IS THIS KEYBOARD COMPATIBLE WITH MAC", "response": "That, I do not know. Sorry."}
{"product_id": "B001MGNWDI", "context": "will this stick work on gta games..", "response": "Unsure as I dont play GTA. I use this stick for flight/combat games."}
{"product_id": "B00F27JDUY", "context": "Could i change the language", "response": "Yes you can, when you first boot up it will ask what language would you prefer"}
{"product_id": "B00FJWNSWQ", "context": "Do you need XBOX live to play the ultimate edition?", "response": "Great question, no you do not! All the game of the year stuff is included on the disk so no need to download anything or be hooked up to Xbox Live."}
{"product_id": "B00BV72X1U", "context": "how does this work i got this in mail and disc wont read i think its too small", "response": "The disc is of no importance... Go to youtube and search how to install the Promotion:wireless USB Gaming Receiver Compatible Xbox 360 /x360 Controller to Pc. You will find a few very detailed instructional videos.  Also make sure you enter in the search your operating system. (ie. windows 7,8,8.1)"}
{"product_id": "B00965WK8K", "context": "Is the scroll wheel smooth or regular (tiny or normal rotation for each scroll increment)?", "response": "The scroll wheel gives you a tactile bump per increment for each rotation."}
{"product_id": "B002I0GF72", "context": "This or Super Smash Bros?", "response": "Both.  But really, this is great, but only single player.  Smash is great as a party game, plus it has fun single player.  Either will make you very happy."}
{"product_id": "B0094H8H78", "context": "is the screen backlit? In other words will I be able to play the games in a dark room?", "response": "not really; it's very dim"}
{"product_id": "B003Y5AHPG", "context": "Do I need to buy any additional controllers to play any particular gaming system of the three", "response": "I would recommend it, the controllers are pretty useless..."}
{"product_id": "B003Q55Y5C", "context": "Will this run on Windows XP SP3?", "response": "Yes, Homefront only requires Steam and internet access."}
{"product_id": "B00DNGQTFI", "context": "Can this CD work in Playstation 4", "response": "No, the PlayStation 4 is not backwards compatible - Bummer :("}
{"product_id": "B00FEDP968", "context": "Can you use the headset and 5.1  speaker ports at the same time?", "response": "You can have them plugged in, but you will not be able to use them at the same time unless a program let's you select the output."}
{"product_id": "B00FWWY1V0", "context": "can it be used for ps3", "response": "i am not 100% sure but i think so. just to be sure id check there website. but if you are going to buy them buy them on amazon because you can find them for much cheaper."}
{"product_id": "B00475AYUA", "context": "Can you play this on Microsoft 8.1?", "response": "I use windows 8.1 on my desktop and I had no issues running civilization after installation. So yes, it should work."}
{"product_id": "B002YVD3KM", "context": "What kind of emulators does this controller work with?", "response": "On Windows, you can run JoyToKey program to convert button presses for other emulators that do not support the USB controller directly. We were able to use FCEUX emulator after we mapped as follows in JoyToKey : A-Button 2-F, B-Button 3-D, Start-Button 10-Enter, Select-Button 9-S."}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "no u will still b able to download it but as used it should already be downloaded."}
{"product_id": "B00ENFVJJO", "context": "Does this charging stand require that you attach some type of receiver to the actual controller?", "response": "Embedded in the charger where the controller sits is the port that inserts into the controller hopefully that answers your question."}
{"product_id": "B00HFZ5KCG", "context": "Does the product come with charger and usb cable? Along with the games in a separate package?", "response": "Yes it does it comes with everything a brand new one would"}
{"product_id": "B0002DQUH2", "context": "what type of plug????", "response": "It is a pin plug and not a USB.  If needed, you can purchase an adapter to convert a USB into a pin plug."}
{"product_id": "B008RA5AWS", "context": "Can I install it on my business computer and my home computer so that I can work at home if necessary?", "response": "Yes you can. I have them on both for the same reason. Both of mine are desktops."}
{"product_id": "B00DJYK9L4", "context": "Does this include the belt?", "response": "This did not come with a belt for me. There is nothing in the item description which says the belt is not included, but don't be fooled."}
{"product_id": "B00FYAQUPU", "context": "can you use other swap force figures on the black portal", "response": "Yes. The portal and the game is the same as the regular swapforce."}
{"product_id": "B0090WBXSM", "context": "Does this controller work with a Nexus 7?", "response": "Yes. I haven't had mine long but it definitely works with some games. I've played N64 emulators so far with with it but that's about it. I have the 2013 version N7."}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "Tomb Raider is as good if not better than Uncharted. There is less shooting but more puzzle solving and treasure hunting. I prefer a variety of challenges in an RPG game"}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "I also have the same problem! I bought this game at June 28, 2015. I applied the DLC code and this didn't work. I'm very upset about that."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "I have Window 8 and have no problem installing the game."}
{"product_id": "B00EZKNSTQ", "context": "Does this controller have the same in hand feeling as a normal Xbox 360 controller?", "response": "I would say yes but that's something you would have to personally determine. It does vibrate like the regular 360 controllers."}
{"product_id": "B00CMSCWGS", "context": "does this work for windows 8?", "response": "Yes it works in windows 8, i use it there and I've had no problems..."}
{"product_id": "B003O6N64Y", "context": "Will this work to listen to music and talk on an iPhone?", "response": "Yes, just  pair with your iPhone by Bluetooth and you're done"}
{"product_id": "B00EADTVL2", "context": "I wonder how long it takes to load this device is the most important for me  and it takes 2 hours to charge your control on playstation ps4  the idea", "response": "I bought this device in order to avoid let on mY PS4 more time than I expected. This charger for me is very usefull, becasue let you charge two controllers at the same time. However, if you have just one controller, maybe it is not a good idea.and about the time, for me is very fast."}
{"product_id": "B0053BCML6", "context": "can you play this game on the old Nintendo DSi", "response": "Nope, the game cartridge will not fit :)"}
{"product_id": "B00CPKUV9I", "context": "Does Wolfenstein:TNO have a single player mode?", "response": "Old question I know but I prefer SP and yes its SP only which I like. NOT a fan of MP never was."}
{"product_id": "B00KGGJPYA", "context": "will it charge a kidle fire?", "response": "Simply answered, yes. It comes with a 3-in-1 adapter. It is quite an amazing tool."}
{"product_id": "B003JETPHS", "context": "Does it work with PS2 Guitar Hero World Tour?", "response": "I have no clue.  I'm guessing since it is a standard USB microphone, that it would.  It works with all my x-box applications and with my PC as well.  I would still suggest spending a little more money and getting a better one though."}
{"product_id": "B004NRN5EO", "context": "Does this require an internet connection to play? (not update/install)", "response": "Nope doesn't need one but can be helpful if there is because other players can leave helpglful tips"}
{"product_id": "B001CC8UBG", "context": "Do you need Steam to play?", "response": "No. It's the last of the good games that were made."}
{"product_id": "B000RT2868", "context": "Will this work with the Street Fighter Anniversary Arcade Stick (Original Xbox) to PC?", "response": "Don't know for sure, might need a special driver to make it work. It is possible for someone to write that driver."}
{"product_id": "B003O6JKLC", "context": "Is everything here to start playing (other than a game)?  Would I have to purchase anything else?", "response": "Yes. The console, cords and one remote console was included. Hope this helps!!!"}
{"product_id": "B008TP1OKI", "context": "Battlefield 4 requires a 2gb hard drive space to install the game, but it needs a Microsoft offical hard drive. Will this HDD emulate microsoft HDD?", "response": "so will battlefield 4 and the 2gb required download right"}
{"product_id": "B006PP404Q", "context": "does this fit the ps vita 2001?", "response": "If you mean the origin Vita with the LCD screen, then yes, that's actually what I bought it for. And although I bought two just in case the first didn't work, I am still using the first one even now, almost a year later."}
{"product_id": "B002ZS6Y64", "context": "what can i do to make it work whith the xbox one ( i have the adapter too)", "response": "Shouldn't be any issue getting it to work with the 1...I use my version on ps3/4 and the Xbox 1...no special setups"}
{"product_id": "B00AJXEYOG", "context": "what games are included?", "response": "CougarLicious- WHale Song-Ladies -Wolf Run -Billy Goat-  Doublooms- Miss Reed -and more very funny ."}
{"product_id": "B00EHBKUTE", "context": "For those of you that have bigger hands, does this \"fit\" well? I have bigger hands and its hard to find peripherals that \"fit\" comfortably.", "response": "I'm 6'4\" (1.93 m) with fairly large hands and it fits great."}
{"product_id": "B00BCEK2LU", "context": "How long does the back light stay on? Can you customize it?", "response": "The backlight stays on until you turn off the computer or you turn it off with the keyboard button.  However, the lights are customisable with the included software,  so all you would have to do is use a script to turn it off after some time. But it's probably just easier to push the button."}
{"product_id": "B00EHBKUTE", "context": "Will this work on my Alienware alpha? can I use it for elder scrolls online? Will I need a separate mouse? I hear it crashes, is it a easy fix?", "response": "Yes, you will need a separate mouse because this is an alternative keyboard not an alternative mouse"}
{"product_id": "B00DJYK9L4", "context": "What controllers are supported?", "response": "You wear the belt and put wii controller in belt pocket can use either regular wii or wii plus remote"}
{"product_id": "B00FE8WKPQ", "context": "will this board work with my old wii disc", "response": "Yes, it will. That is the beauty of Wii/Nintendo;  they always retrofit their games and equipment to the older products, so you don't have to keep forking out cash for every upgrade. Unlike other game consoles."}
{"product_id": "B00AJILG1K", "context": "Is it possible to change the color of the profile LED indicator, thumbster keys, and LEDs in the upper right hand corner or are they always blue?", "response": "It's not possible to change the colors. They are separate from the configuration software."}
{"product_id": "B00D96BJSO", "context": "Will the headset work? Im using a monitor (HDMI-DVI) instead of a TV and I'm getting sound from pc speakers through S/PDIF rather than from a TV.", "response": "Yes they will the sound and power both come from the controller I use a benq monitor for competitive cod ull be fine"}
{"product_id": "B005F1ZUU4", "context": "Will it work with Fire TV?", "response": "That's like comparing apples to oranges.  This cannot be used be used to interface your 360 controller to the Fire TV.  It would be an interesting idea to pursue though."}
{"product_id": "B005VO5ZVY", "context": "Will this fit XL size?", "response": "no, they will say 3dsXL"}
{"product_id": "B001AWBYRA", "context": "i would like to know why i can*t play my games because i dont have cd-key code", "response": "The CD codes are to insure that you are the actual purchaser of the program and not someone who got the program through some other means, ie an illegal back market copy."}
{"product_id": "B00DC7O3K6", "context": "Does this game require the Wii Plus remote or can it be played without it?", "response": "Yes, for many of the events it will be required."}
{"product_id": "B00A1Y2STQ", "context": "does this keyboard work with windows xp", "response": "Should work fine; works perfectly on 7, and there are no fundamental operational differences in 7 and XP as far as peripherals like keyboards, mice, etc. Good luck."}
{"product_id": "B00CXI0BPG", "context": "does it work for windows 8?", "response": "The website system requirements state that it works in Windows 8. I plugged it into my surface tablet for a test, worked immediately."}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "My 5 year old plays it and hardly ever gets stuck. So I would say it is good"}
{"product_id": "B0058GMO0A", "context": "Need pc savy person that knows if Mahjong Deluxe runs on Windows8 ? Read tech note saying games released after Sep2013 should. TRUE/FALSE ?", "response": "I run this on Windows 7, cannot tell you about if it will run on Windows8"}
{"product_id": "B000B9RI00", "context": "Is it a physical card that needs to be mailed, or is it a code I can have e-mailed to my account?", "response": "Amazon should give you the option for a code that can be mailed to you OR a download code. I have never had any problem with a downloaded code and it is much faster!"}
{"product_id": "B006W3ZXEW", "context": "Has anyone else had the problem with the mouse not working at all after some time? Is there a way to fix it?", "response": "Have you tryed to update your windows or going to Razer and looking for and update of the mouse?"}
{"product_id": "B0094H8H7I", "context": "does any one know how this is compared to the hyperkin retcron 3? excluding the part of retcron 3 being compatible with nes and snes games", "response": "Not sure. It is fun, but made a bit cheaply."}
{"product_id": "B00BGA9X9W", "context": "Why doesn't this come with a USB cable to charge it?", "response": "You can buy docking stations so you can charge two controllers at once"}
{"product_id": "B00AJILG1K", "context": "This is labeled as a 901 but does not have the US key layout pictured. If I order it will I receive the proper keyboard?", "response": "I have one and it has the same layout as any other keyboard"}
{"product_id": "B00HWMP0TU", "context": "so this  version of the game has no physical manual or map or anything cool for my husband to be giddy over?", "response": "The expansion manual for the \"Civilization V, Brave New World\", (aka \"CIV-V BNW\"), is only available as an on-line, downloadable PDF file.Do a web search, (I used Google), for \"CIV_V_BNW_PC_ONLINE_MANUAL_ENG.PDF&quot;. I haven't found an updated Map Chart anywhere."}
{"product_id": "B0053BCML6", "context": "can you play this game on the old Nintendo DSi", "response": "More than likely you cannot given that it is meant for a Nintendo 3DS and the actual game card is differently shaped thus making it unable to be played on anything that is not a 3DS or a 2DS."}
{"product_id": "B004CFASL0", "context": "How does the billing work?  Is it monthly,every 3 months.  Please let me know?", "response": "There is no billing.  It's just a one time purchase of the three games all bundled together."}
{"product_id": "B00ECOBFA4", "context": "What is the age range on this? Would it be appropriate for a 6 yr old?", "response": "Depends on skill level of six year old but there isn't anything inappropriate about it.  My first grader finished the game in a few days.  He loves all the lego video games and has played them since he was 4-5."}
{"product_id": "B009SJR28W", "context": "Whats the difference between the expert version and the essential version?", "response": "like others have said difference between the two is only the green backlight, the essential does everything the expert edition does and for the range of $20-$30 cheaper the essential is the better buy"}
{"product_id": "B0040UAYI4", "context": "Can the firmware be upgraded with a 64bit OS yet? (For when 4.0 comes out) I have read reviews saying that it take a 32bit OS to upgrade firmware", "response": "It ran on my 64bit Windows 7 just fine."}
{"product_id": "B001GIUWX0", "context": "Can I use my Wii Classic Remote with this game?", "response": "I never have, but the case shows you can."}
{"product_id": "B00FA6YFTQ", "context": "Is the key for Metro: Last Light  the complete edition?", "response": "Yes, I have :)"}
{"product_id": "B00IP0H4GA", "context": "Does can I play this game against someone else? (In the same room-not online) Thanks.", "response": "You can, but 2 Players only vs and co op in story and in free mode. 4 players online only. I have to retract an answer i gave to someone else about it being 4 players offline. Only 2 players local vs and coopand up to 4 online."}
{"product_id": "B008RA5AWS", "context": "If we purchase 3 user licenses does that mean three people can use the system and on 6 different compurters 3 desktop and 3 portable", "response": "Sorry I don't know the answer 100%, we have 1 user, but it is on 2 computers we had to register the new computer to intuit, and had no problems. Sorry I couldn't help more, I would contact them using the install helpline's number."}
{"product_id": "B001CC8UBG", "context": "Does it include online playing?", "response": "It use to run thru GameSpy for online play but they went out of business but I just launched it and went to MP and there were several servers online so YES it does have MP capibility. One of my all time favorite games btw, especially SP."}
{"product_id": "B00GOOSORM", "context": "What exactly is this item and how does one use it?  btw: I have the ps/3 trial installed but expired", "response": "You use this game time card to renew your monthly subscription for 60 days"}
{"product_id": "B006W41W3M", "context": "Is this just the headset or does it include the transmitter, cables, etc.?", "response": "yes they do include the transmitter and cables it took me a while to figure out how to connect it but u just push the pairing button on the transmitter and headset and you'll hear a double beep on the headset"}
{"product_id": "B001ELWMHI", "context": "I need a new power brick for my original XBOX.  Does ANYONE know where I can buy one?  I've been looking for days.", "response": "Find a Game Exchange i.e. \"Game X-Change,\" They specialize in restoring retro systems and selling retro parts/games/consoles.  I'm sure you could even log on to a game x-change website and find what ya need man, believe me there's a huge market out there for retro systems and retro game play."}
{"product_id": "B0006PJAZU", "context": "Will Suite 8 work on a XP computer?", "response": "I've been using the Suite 8 applications on an XP-Pro (32-bit) system for the last 10 years.  It installed easily, just like any other program or suite of programs, and all the applications work as expected."}
{"product_id": "B00G42KO0Y", "context": "can you charge your phone with the controller?", "response": "No, it doesn't come with the charging function."}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "Im not sure exactly. Its long enough to tuck behind my desk and reach my pc on the floor with plenty of slack."}
{"product_id": "B000PD0HQE", "context": "will i need to buy a built in wifi device for this console?", "response": "There is no built in wifi with this console.  Only the new slims have built in wifi.  These units you will either need direct line with ethernet cord or need a wireless adapter for it to work."}
{"product_id": "B009S4JZKK", "context": "Is Steam required just to finalize the Install, or does one need to be connected by internet to Steam the entire time while playing Train Simulator?", "response": "You will need a steam account but after that you stay offline, but if you bought any download items on steam then you want to be online because if you stay offline those items that was download bought will not be in your collection."}
{"product_id": "B00EWEHI5K", "context": "Does this mouse come with Australia power plug", "response": "The mouse only comer with a usb cable. It charges from a PC, Laptop or a 5v charger. It's doesn't come with a power plug"}
{"product_id": "B003VUO6LU", "context": "Is it possible (w/o getting any special software) to use an Xbox 360 controller for the PS3? If so how?", "response": "Use the cronus max. I use it and its great :)"}
{"product_id": "B009DYOPK0", "context": "How big is this mouse? Full grip? I have big hands and don't like having to use claw grip when mice are too small.", "response": "Full grip, it's nice."}
{"product_id": "B0073J8BYS", "context": "Is it a big deal to have the Motion Controller without the Move Navigation Controller?", "response": "I've never used the Navigation Controller.  Never had to.  All the games and functions are accessible using the Move or the regular 6-way controllers."}
{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "No it does not. All multiplayer."}
{"product_id": "B0002L88HE", "context": "Can I play this on a new system with my sister windows 8?", "response": "Steam just released an extended edition which surely is compatible. I'm fairly certain this edition works on 8 but I can't say as I played it on 7"}
{"product_id": "B00005QEFD", "context": "The gamecube I bought has a broken disc reader and was very filthy when I took it out of the box. I.E. cobwebs and caked on dust.", "response": "This isn't a question"}
{"product_id": "B002L6HJCI", "context": "Will the software work on windows 8 ?", "response": "I would imagine it would but I have windows 7 you may want to check youtube or just regular google for more answers"}
{"product_id": "B00JB4WHWU", "context": "Can i try this code if i play on my Mac?", "response": "Yes. It is a global code."}
{"product_id": "B002JVX5V4", "context": "Does this work with Windows 8? We have a not-so powerful desktop running on Windows 8 and have concerns about it working. Any advice?", "response": "Yes it does, I just love this game and it is so much more than the older version I had, which would not work with Windows 8  I recommend it."}
{"product_id": "B00GV0LR64", "context": "Is there any way to use these and not cheat?", "response": "Is this \"cheating\" per se? Not really. However, I think it does take away from the spirit of the game. In hardcore modes you're not supposed to have cross hairs, so using this is taking away from that spirit. If you actually know how to play, you won't need this anyway."}
{"product_id": "B00BY0G0YU", "context": "i know this is a 2 game pack but when i had final fantasy x2 it had a music video intro which i liked a lot does the hd version of x-2 also have that", "response": "Yes. It does. Everything is the same. The only thing that changed is the quality."}
{"product_id": "B00HPU96FI", "context": "I have one question.  I get video from this cable, but no audio at all.  Is there any way to get sound from this cable when it's plugged in?", "response": "I had this same issue. I wound up having to buy extra audio cables. Was a pain in the ass."}
{"product_id": "B0002DKTY2", "context": "is it for windows 8?", "response": "I returned my copy because it did not."}
{"product_id": "B00EPZ8POY", "context": "will this work on ntsc ps3", "response": "Yeah it works! I bought it and it worked. However you need HDMI and also the DLC will not work because it is region restrict."}
{"product_id": "B001MGNWDI", "context": "This doubles as a generic usb gamepad for action games? Or it's intended exclusively for flight control?", "response": "It comes with programmable software installed on the joystick itself, so you can custom program each and every button to do whatever you want. So while it is geared towards flight control, I'm sure you can get it to do much more on other games."}
{"product_id": "B0050SVHZO", "context": "Can I use an SD card or another form of storage to make up for the 8GB?", "response": "I know this is an old question, but it's voted high, so for future reference, you can't use an SD card to store Wii U data, but you can easily use an external hard drive, or even a flash drive/memory stick for Wii U data storage."}
{"product_id": "B009O8HH3M", "context": "Is this compatible for xbox 360?", "response": "Yes it definitely is!"}
{"product_id": "B00001IVRD", "context": "Does this work on Windows 8 x64?", "response": "I think so, but I'm not positive.  I got it and it works on my windows 7 but the menu graphics are a little funky but actual game play it is fine."}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "I am 90% certain that it can not be played with a regular DS, as the way the game is programmed is specific for the things the 3DS does/can do. I'm unavailable to test this as of right now, though. :/"}
{"product_id": "B00BCEK2LA", "context": "Does this have adjustable weights? If not does it feel too heavy or too light in your opinion. Does this come with a warranty in case it breaks?", "response": "No it does not have weights.  It feels a bit light but the feel is good.  Can't remember the warranty, but I'm sure it has one."}
{"product_id": "B00CD1FC6G", "context": "The only thought that I have for this keyboard is how are the LEDs?", "response": "Inconsistent. They were strong on some keys, weaker on others. When I compared them to Razer and Logitech they were definitely not as consistent."}
{"product_id": "B0011E4J7O", "context": "can you use it on a black xbox 360", "response": "Yes, the color of the Xbox doesn't matter.  My Xbox is a Ryse (Black) and this cord still works just perfectly on it."}
{"product_id": "B00GZ1GUSY", "context": "Is Ps4 game region locked? Will i be able to play this game on Indian PS4 (PAL)?", "response": "You dont need to worry about NTSC or PAL either. These consoles use the HDMI standard, which is way better than those old analog ones."}
{"product_id": "B00286BZ4Y", "context": "Is this multiple choice?", "response": "yes and I enjoy the game as I can play it alone without computer guests.  I do not know a lot of the answers so as not to lose money, I wait until the real answer appears. I am glad I purchased it."}
{"product_id": "B005HN5LKY", "context": "Will this work for european plugs?", "response": "It fits my American plugs, but the voltage wasn't enough to sustain the device. I'm not sure if it would work for European, sorry hope this helps."}
{"product_id": "B00ARCWQOO", "context": "We live in the UK and have bought our x-box here, but this game isn't available in the UK.  Will it work on our UK X-box?", "response": "Unless Europe has a different format on the CD's, I don't see any reason why it wouldn't work."}
{"product_id": "B00CH923NE", "context": "does this game work on 2ds?", "response": "Yes, 3ds games can be played on 2ds just without the 3d features.http://www.nintendo.com/3ds/2ds"}
{"product_id": "B00HVBPRUO", "context": "Can I use 2 headset while on my playstation3?", "response": "You can use two headsets on PS3 but the second one is limited to audio only. PS3 only allows one person to chat as the primary."}
{"product_id": "B00FEDP968", "context": "Can you use the headset and 5.1  speaker ports at the same time?", "response": "the headset has a speaker toggle button that allows you to switch between the two.  the 5.1 plugs into the built in soundcard.  i have yet to have both speakers and headset going at the same time.  i hope this helps with your question"}
{"product_id": "B004C4U1VI", "context": "We have an xbox one and these cables do not work?", "response": "No it will not work. The connectors on the 360 and the One are not the same."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "It supports up to two players in local offline play and up to four players via online multiplayer."}
{"product_id": "B006JSY3MI", "context": "Are the controls for the PC version easy to use?", "response": "I have a new laptop and initially the controls were easy to use, now I'm having issues using the laptop \"mouse\" for something that is necessary to continue playing.  It's very aggravating!"}
{"product_id": "B00IVHQ0KI", "context": "is this can use for PC?", "response": "The device gets detected as an XBox peripheral device in Windows 10. But I tried playing NFS 2012 Most Wanted and the game was not detecting the device."}
{"product_id": "B000PD0HQE", "context": "does this come with the 120 gb harddrive?", "response": "Hi Tanya, yes it does."}
{"product_id": "B00AJZNUUI", "context": "will this wii work with my older games?", "response": "Yes, regular Wii games will work on this nice console. But Wii U games won't work."}
{"product_id": "B00A8HIGSS", "context": "Konnichiwa!! Is this copy of the game the first print, or is it the re-release version that has 'the BEST' on the box? Could you e-mail me a photo?", "response": "All our products are first original print version.We are selling this game to many customers who live in overseas.This game is very popular in the world.Domo arigatou!!"}
{"product_id": "B005HN5LKY", "context": "What if the adapter break.", "response": "Send it back and get a refund"}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "according to info on box it works on XP-sp3, vista and win 7. hopes it works on 8"}
{"product_id": "B00GZ1H07Y", "context": "How good is the flipper action w/ PS4 controller? Does anyone have experience using on other platforms & if so would you say PS4 has the best feel?", "response": "pinball arcade is a great game!  lots of tables and great graphics. I feel the flipper action could be a little tighter, ever though it's barely noticeable there is a slight lag"}
{"product_id": "B000B9RI00", "context": "So if you have an Xbox One AND an Xbox 360, you need two seperate cards?", "response": "You don't need two different cards. If you have the same account on both machines you only need one card."}
{"product_id": "B000VLNXRU", "context": "Are there any drivers to interface with FS 2004 COF?", "response": "The only drivers you need to make them come on(not necessarily work) are one their web site. I have 3 of them which are now holding down papers. I did not have any luck getting them to work correctly, and their support people were at a loss as to what is the problem. Good luck with yours."}
{"product_id": "B007W8S2MG", "context": "is it region free?", "response": "i have a game card that is region 1 usa"}
{"product_id": "B00G6MW5CC", "context": "can single person play game", "response": "Yes, a single person can play the game."}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "Yes. I use it currently and am finding it a good choice of controller."}
{"product_id": "B003ZSHN0O", "context": "can i play this gme on my laotop,with windows7", "response": "yes I have windows 7 I also play it on my tablet with android"}
{"product_id": "B0017Q4DGI", "context": "can you use this game on a mini Wii?", "response": "You could call Game Stop and ask."}
{"product_id": "B00BV72X1U", "context": "Will this work with Fire TV?", "response": "No. I dont think it would work on any version of android. Windows only."}
{"product_id": "B00BA9AWTO", "context": "how too install with windows 8 ?", "response": "I am sorry but I do not have windows 8."}
{"product_id": "B00FLLFJ68", "context": "Can this charger be mounted vertically (ex: on a wall) and still work without the controllers falling?", "response": "I don't believe so. I don't think there's mounting holes on the bottom, and there isn't a positive lock on the controllers themselves. They settle into a groove and fit well, but I think if you went vertical with it they'd just fall out."}
{"product_id": "B002Z7BE24", "context": "is any of the extra content on the disc or does it need to be downloaded?", "response": "You don't need to download anything, it's all there you just have to beat the game a few times to find the stuff, and Gold has way more stuff then the first released version of the game."}
{"product_id": "B009S4JZKK", "context": "Is Steam required just to finalize the Install, or does one need to be connected by internet to Steam the entire time while playing Train Simulator?", "response": "In my experience with Train Simulator 2015 I would have to say that steam is needed to finalize the install and paltry the game. However I do not know if you need to be connected to the internet to play the game after you install the game."}
{"product_id": "B0000512IE", "context": "Is there any adjustment in sensitivity of the toe and heel positions.  I have a model PPU995 which has no null position.", "response": "No mechanical adjustment, you can set sensitivity with the in game software!BillH"}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "It's A Christmas Gift Along With My Son's New Xbox One. Still Didn't Open Yet. But Recommend It 4 Sure. Will Update Comment Later On, When He Opens It & We Use It. Donnie R Longo"}
{"product_id": "B001444IN6", "context": "can you have kids in this", "response": "Yes, adult Sims can have babies; they progress from infancy through young adulthood."}
{"product_id": "B00D3TRMD8", "context": "Is this the actual game or some kind of cheat code?", "response": "Is actual game that activates on the steam platform"}
{"product_id": "B000R0SRNU", "context": "Does this work on an xbox kinect?", "response": "If you have an Xbox 360 with the Kinect you can play this game but it will not use the motion sensors because it was released prior to the Kinect. This game is played with a controller."}
{"product_id": "B00FEOR4MY", "context": "what comes with it is it just the case", "response": "Yes. Just the case and the small wrist carry strap."}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "Yes thats true it sucks it lags alot. Controller looks cool but that it"}
{"product_id": "B007JDMPOK", "context": "If i have an account on tera already can I use the stuff from the collectors edition on that account?", "response": "Yes. It just adds to what u have."}
{"product_id": "B009CL6LA6", "context": "is this rely worth the money to buy it, when i can get similar quality for cheaper?", "response": "I didn't pay quite this much and I don't know what you are comparing to. I'm pleased with their performance"}
{"product_id": "B00AWEMODK", "context": "I already have the game and part of the expansions on my computer, if I bought this just for the extra expansions, will it install on top ok?", "response": "Yes, it will add all expansions that you don't have to your account."}
{"product_id": "B002B9FIUU", "context": "Can you use two of these for 4 player games; IE Mario Party?", "response": "I think you can I'm not sure because I use the adapter and a USB nintendo controller to play two player. I think it can but I'm not 100% sure"}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes, it is, however the keyboard is quite tall, so I can't imagine it being comfortable to use that way."}
{"product_id": "B00I14395A", "context": "Can the angle of the keyboard be adjusted?", "response": "Somewhat. Flip the keyboard over, on the upper corners there are tabs, one tab on each side. When extended the tab will give you a slight angle. Try it for a while a see which you prefer."}
{"product_id": "B00E6OLJ88", "context": "Can i have a list of all the mods in the order of when you press the button on the back", "response": "We bought ours from Premium Controllerz. They send us a detailed email with all instructions. Sure they would you as well. Just ask through Amazon."}
{"product_id": "B000R0SRNU", "context": "why are you advertising this as an xbox 360 game when in reality its an original xbox game?", "response": "It's an XBOX 360 game. This is not a mistake."}
{"product_id": "B003O6N64Y", "context": "Will they Play 7.1 through Smart TV?", "response": "I do think so. If you mean play a console then yes. I use the HD audio for surround and if the base wasn't so damned cheap it would be decent."}
{"product_id": "B005BLAJ68", "context": "Can HOYLE Card Games 2007 be used on another pc in my home?", "response": "I wouldn't see why not.  I threw mine away I did not like it..."}
{"product_id": "B007SRM5MO", "context": "So why does the box say Internet connection required if the DLC is on the disc? Or is it only required for the Harley Quinn content?", "response": "DLC is already on the disc. You only connect to the internet if you want to play it online. Put the second disc in and download content.Play the game with the first disc. I dont have mt xbox connected to the internet and everything works great!"}
{"product_id": "B0050SYILE", "context": "Is it safe to order a used one or better to buy a new one?", "response": "reviews should definitely help here."}
{"product_id": "B006RJ373K", "context": "it didn't say about that how much Ram or vga  do I need on my pc", "response": "It only states that you will need 75gb for the entire scenery."}
{"product_id": "B00FLZ4FS2", "context": "Can I use this code on my Xbox one and on our xbox 360 in the home or is it an either or code?", "response": "You put the code into your xbox 360 and when you get an xbox one it will show up in your library of games or as free to download from the xbox one game store."}
{"product_id": "B00BGAA0SU", "context": "Is this game 3rd person only?", "response": "Yes, random things where you take pictures, and can zoom a bit do camera is tighter, but predominantly third person"}
{"product_id": "B00EV4O8VS", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "From my experience the battery does not last longer than 5 hours but it's a not a big deal for me because I don't play all day. You can buy 2 gamepads and always keep one charging if you wanna play all day."}
{"product_id": "B00E8JZILA", "context": "Any download codes included with this game or is the entire experience in the cartridge?", "response": "As far as I remember, there were no codecs."}
{"product_id": "B008KH7NZA", "context": "Does this work with the Xbox One? I bought the Chat adapter and I get game audio but no chat. I also updated the controller.", "response": "No just Xbox 360"}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "Yes.  As long as you have access to the top of the TV,  it will work.  You should note that the cable for the kinect has to be able to reach from the Xbox to the TV top,  so keep that in mind."}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "Xbox live is only required if you want to play Multi player."}
{"product_id": "B00F4GSAYI", "context": "I know there is a second disc for the dlc's. Do I need to install the second disc and play them with the first disc?", "response": "Yes. The install takes roughly 20 minutes depending on your Xbox, but once the DLC's are installed you only need the first disc to play them. The second disk is simply for the system to copy the data over to the hard drive. One time deal and I believe usable with friends."}
{"product_id": "B00D5WDI3G", "context": "will it work on windows 8?", "response": "I haven't tried it on Windows 8, but the information on the case says it will run on XP, Vista, 7, and 8."}
{"product_id": "B000SOYG8U", "context": "Lot of the reviews said it was just the original game, but you stated it was the Gold Pack .Is that true?", "response": "yes Zachary. it was the gold pack,   why do u ask? something i am missing.   have a super day Z.    sa-   n"}
{"product_id": "B009AFLXQQ", "context": "i am buying the deluxe set wiiu do i need a pro controller", "response": "it is not required for any game. however it is really comfortable, and really light. The battery also lasts about 80 hours between recharges. it really is a great controller, but i usually use the Gamepad."}
{"product_id": "B004H7P0B6", "context": "Does this include the grey cap?", "response": "Both yellow and grey thumbsticks are included."}
{"product_id": "B003XNU1JQ", "context": "Is there a way to save your progress when you get to different worlds?", "response": "I'm not sure i tried to firuge that out myself"}
{"product_id": "B00H72EMP8", "context": "Can I connect these to my PS4 so I can use the inline controller?  It is a must-have for me to have a quick mute for my headset.", "response": "Yea I'm pretty sure u can though I don't have a PS4 I have a PS3."}
{"product_id": "B00FE8WKPQ", "context": "Can you use this in a Wii?", "response": "The wii board works on the wii.The game disc included and the pedometer won't, as the disc is playable only on the wii u and the pedometer has to be synced with the wii u gamepads infrared scanner."}
{"product_id": "B004RMK5QG", "context": "I am located in Egypt. I tried to purchase the membership on the PS4 but Egypt isn't listed in the country list. Is it gonna work if I purchase this?", "response": "I Suggest you to create a new PSN account, but instead of creating the account in Egipt, create it as a US account. this way you can get the best free games and you wont have any problem. in my case, I'm from Argentina, and my PSN Account is from the US"}
{"product_id": "B00FM5IY0Q", "context": "I havent played the prior Dead Rising's. Should I play them for any story knowledge or can I jump right into this game?", "response": "There are a few instances, especially at the end, where prior knowledge of the Dead Rising universe lore would be helpful for understanding the plot twists. However, you could still play the game and have a great time without prior knowledge of characters or meta plot."}
{"product_id": "B007LQG9A6", "context": "will this controller work for games on steam", "response": "Yes, i use it for operating aircraft in all the Arma games"}
{"product_id": "B003OZOAKY", "context": "can you play this game solo?", "response": "My son plays it solo - he is 13."}
{"product_id": "B00FYMTUQY", "context": "I have a tv mounted above my fireplace. Is 7' off the ground too high for this sensor to be placed?", "response": "I highly doubt it. You can bend the kinect downward so that its looking down towards you.  If your that concerned about it have someone hold the kitchen on top of the TV and test it out before you buy it."}
{"product_id": "B005M0KSIM", "context": "Does the game download from the disk to my PC, or do I have to use Steam? I wont use Steam on my computer.", "response": "I had some difficulty doing it because of bandwidth, but was able to download to my PC and play without using Steam."}
{"product_id": "B007YLUCME", "context": "how can I make the gamepad vibrate, I do not get into settings", "response": "I just play fifa with it. Dont think it vibrates."}
{"product_id": "B00BMFIXT2", "context": "Just out of curiosity, did Edward ever become an Bonafide(real) assassin or is he just wearing the hood?", "response": "He does indeed become an Assassin throughout the game he was just a pirate but he grows up and ends up living by a creed instead of living by his own selfish desires"}
{"product_id": "B00GHJ6X8G", "context": "I have a sealed copy of MLB 13 sitting next to me. Is it worth upgrading to MLB 14? I can't afford a PS4 now, so the PS3 version is my only option.", "response": "Personally, after playing 14, I am going back to 13.  It seems to me that the physics are a bit off and I don't like the new interface at all.  It is also harder to read everything.  13 used nice big, bold lettering, 14 not so much."}
{"product_id": "B00GJ2HZ7E", "context": "Do you need wifi to play?  I know you need it to download... But is it needed to actually play the games?", "response": "no. Just to download."}
{"product_id": "B000OYMYZQ", "context": "Will this work with the wireless version for windows?", "response": "It sure will. If you already own an Xbox 360 and the 360 controller (as it should have come with) then the cord will act as a charger and you'll also have an extra battery pack."}
{"product_id": "B0015PHMFU", "context": "So this product will work on PS4? Will this console allow the character like batman on Arkum City to walk forward and run?", "response": "It only works with fighting games."}
{"product_id": "B00DC7FWRE", "context": "Is this just the game or does this come with the stand, and a remote?", "response": "It is the game and the remote, no stand."}
{"product_id": "B0036VO4XO", "context": "Hello, a straightforward question: I have a Win 8.1 laptop with no mic-in jack. Will the Amigo II enable me to record the audio from the mic?", "response": "Yes it will accomplish that for you."}
{"product_id": "B008CP6Q6M", "context": "Are the cases cardboard or plastic?", "response": "This release has a plastic case. The Card board case version you are referring to was part of a holiday Ps3 bundle."}
{"product_id": "B00DLRLDBO", "context": "does it work perfectly with xbox 360 controller do I have to do anything special and can I use it for a PS3 IPhone and PC??", "response": "It's perfect for 360, unfortunately I had to return it 13 days after I got it because it's very sensitive as far as the quality in the product itself. Ear piece broke off hinge. #MadeInChinaSmh. Otherwise I was thoroughly impressed with it."}
