{"product_id": "B00HEX8TA4", "context": "Does your scroll wheel wobble? Mine wobbles significantly. Makes a jittering noise if I shake the mouse.", "response": "Mine does not do either of these things."}
{"product_id": "B008GEH8LQ", "context": "what over the ear headphones are recommended for an 8 year old?", "response": "I would recommend the Sony MDR-222KD Children's Headphones"}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "No it does not. You will need to install the Saitek Multi Panel software and when flight simulator launches than the panel will light up. The installation will install both test software and also a manual driver launcher and both will light up the unit."}
{"product_id": "B00DTWES6I", "context": "Is this a digital key for uplay?", "response": "Yes it is, just download uplay and enter the key and boom you're in!"}
{"product_id": "B0038PBF1W", "context": "will this work on windows 7", "response": "It seems to work just fine on my computer using Windows 7."}
{"product_id": "B009DL2TBA", "context": "I was looking in my cellphone in the Amazon's app and in the feature and details is writing that this ps3 comes with 3 games. Is it true?", "response": "This one does not.  What sets this one apart from the one with two or three games is that this comes with 500 gigs of memory and the others come with much less."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "Of course rubber.... an electrical keyboard for 30 bucks? Come on now. But it still feels pretty good."}
{"product_id": "B003XNU1JQ", "context": "Once you download it do you have to have Internet to play it?", "response": "Once you download the game it is in your system and internet is no longer required"}
{"product_id": "B00D6PTMB4", "context": "Does it work in a PS4?", "response": "That, I'm not certain of. I only use it on the PS3."}
{"product_id": "B00C2B355W", "context": "Do I need the transmitter to use the headset? In other words, can I listen to music without the transmitter stand from my phone?", "response": "No you need the base"}
{"product_id": "B00DC7O3K6", "context": "Is this game 2 player?", "response": "This is a 1, 2, 3, 4 player game !!!!!!!!!!!!!"}
{"product_id": "B000056SPM", "context": "Not stable. how do you mount it? How do you mount this device? I have tried on tables and it is not stable, no matter how tight I get it the entire think wigles on the table.", "response": "Thats exactly what I do and it works like a charm!"}
{"product_id": "B004S5TDUQ", "context": "I just installed it today and it seems to be fully working, but says it is the demo. Did I get robbed or is this a developer oversight? Anyone else's PC version say it's the demo?", "response": "mine doesn't say demo. it might be promotional copy that was resold. if it works it is ok. it will try to get you to buy songs, instruments , and everytime you turn on your computer it will pop up steam and try to sell you other videogames. goodluck"}
{"product_id": "B003O6JKLC", "context": "is this the old version,or the slim new one? cause the picture on the box show the new one but the description on top says that it is the old version", "response": "Idk why it says old version thats what I was expecting but its the new slim version."}
{"product_id": "B00AWEMODK", "context": "Will this run on Windows 8.1?", "response": "Yes. You have to enable Direct Play or the game will not run."}
{"product_id": "B00CJD4HD2", "context": "I ordered this G500 mouse and it is making a high pitched tone that is giving me a headache after 4 hours of use.   Return or try to replace?", "response": "I have never heard any high pitched tones ever come from my mouse...I'd say try and get it replaced."}
{"product_id": "B0015PHMFU", "context": "does this work with mame?", "response": "I have not used it with Mame, but you should be able to configure it to Mame like any controller"}
{"product_id": "B009IR1SR0", "context": "is it included command and conquar zero hour ?", "response": "Yes sir it is."}
{"product_id": "B002I0K3CK", "context": "Can I use this game with the GamePad or i need another controller?", "response": "Yes only one person can play with just the Wii U gamepad.  If more than one person plays you would have to have a Wii U remotes for the other person(s).  Hope this answered your question"}
{"product_id": "B00EZKNT5O", "context": "How is the quality on these? I'm aware it's a licensed controller, but I'm still curious. PC gamer, have had Logitch F310 fail on me in under a year.", "response": "Far as quality goes so far so gud I had it for about 4months now an I ain't had any problemsyet. It does what its ssupposed to do and is durable. It would b a perfect controller to me if it was wireless..."}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "It is multiplayer only!!!"}
{"product_id": "B003VANOFY", "context": "does it work with mac?", "response": "It appears to work, but doesn't show up in the Logitech Gaming Software."}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "Yes it does. I have Windows 7 64-bit on my wife's computer, and it works fine on there. You might have to deal with driver issues now and then, and switching the switch at the top sometimes. Once it's all set up, it works great."}
{"product_id": "B0050SYK44", "context": "Is this game enjoyable to play as a single player game?", "response": "I've only played as a single player game.  Have a great time with it!"}
{"product_id": "B004JKZUJI", "context": "i have recently downloaded the classic game of mario golf on my wii. Do you know if this wii classic controller works with my wii mario golf 64?", "response": "I'm not completely sure, but I use it on the wii version of Mario 64 and star fox 64. I assume it's compatible with all of the downloadable games.  Hope this helps!"}
{"product_id": "B007A7UJ4S", "context": "Does it have spanish sub titles?", "response": "I cannot find an option after having set up the game. I am not sure if you can set it at the beginning."}
{"product_id": "B0050SWBAE", "context": "Why is this listed at $75?", "response": "I was going to ask the same thing. It's not just this game either, it's several WiiU games. We just bought the system for Christmas so I was bummed so many of the games seem to be out of regular stock."}
{"product_id": "B0050SVHZO", "context": "Is this an upgraded version of the Wii U that comes with Sylanders Swap Force Limited Edition or is it the same.", "response": "It's the wii only without the skylanders swap force bundle"}
{"product_id": "B00CMSCTA2", "context": "can you uninstall steam after you download the game? or is steam required to play it?", "response": "If u uninstall steam, u won't be able to play it...the game runs via steam site"}
{"product_id": "B00CD1FC6G", "context": "What dose the BIOS switch do on the top of the keyboard?", "response": "Yes, Bios recognized keyboard no problem. I'm using ASUS Sabretooth z77 with latest bios update. It may differ on other boards."}
{"product_id": "B00BI83EVU", "context": "If I buy a pre-owned version for PS4 do I need to also buy a pass to play? I'm attempting to avoid giving UPlaysoft any of my money.", "response": "There were no codes to enter, a used copy should work fine."}
{"product_id": "B000BTBMWA", "context": "Can you fit an HDMI cable under it? I have an A/V cable and when I try to plug an HDMI cord in it won't fit. So can you fit one under this cable?", "response": "HDMI cable will not fit under this monster cable"}
{"product_id": "B003O6CBIG", "context": "Does this game have the bonus map?", "response": "I would strongly suggest spending the extra and getting advanced warfare if you can"}
{"product_id": "B0098W4ZD4", "context": "Does this mouse have left,right and middle scroll buttons ?", "response": "Im not entirely sure on what your asking.  It has a wheel that scrolls left and right, as well as a traditional scroll wheel.  There is a middle button, however it only clicks down, not left and right."}
{"product_id": "B0000CNUUP", "context": "i want to buy a disk version of this game i need to know if i need know is if i have to buy it on steam too or if the disk will even function", "response": "I believe, once you buy the disc version, its as simple as installing it, along with steam. the pc edition I bought works just fine."}
{"product_id": "B003S9WJ9A", "context": "Can you use it to permanently connect an old 360 hdd for saving games and such?", "response": "No. It's for transfer from one hard drive to another only... The hardware in the cord does the transfer automatically."}
{"product_id": "B00DC7G0GG", "context": "Do you have to use the gamepad if you are playing single player?", "response": "No you don't. You can choice what controll use: the wii remote or the controll pro for a single player, anyway you can use the gamepad for a single player too."}
{"product_id": "B003NVMEVQ", "context": "Does this have good grip when your hand sweats? Or should I go for the original Razer Abyssus?", "response": "For some reason, the grip gets better when I sweat. If your hands sweat during every gaming session, I'd recommend cleaning the mouse every week or so with a dry glasses cleaning cloth. As long as you don't sweat out a gallon of water through your hands + keep the mouse clean, you will not lose any grip."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "If he has any other GTA games i think this would be appropriate"}
{"product_id": "B00GV0LR64", "context": "(Any Ideas?)This will be my Review: I cant fix ist on any screens. I tried with LG 42\", LG 50\", Samsung 21\", LG 23\" and some other screens in a store.", "response": "I've used it on my two televisions, Sharpe and Samsung, and it works great, stays attached all night and through the next day in some cases ;)"}
{"product_id": "B00EIM3BV6", "context": "I have plugged in the cord from the headset to the controller, and while the mic icon is on the mic is not working. Any hints?", "response": "Make sure the L connection is connected to the controller. Update the firmware as well."}
{"product_id": "B006NU6HAS", "context": "Does it come with any liveries other than the default shown on the package?", "response": "No only the default but you can go to PMDG.COM and clicl on liveries and  download all the Liveries you want and is easy and free enjoy it you will like PMDG 737 NGX"}
{"product_id": "B00F27JN8Q", "context": "Does Conception 2 work with PS Vita TV?", "response": "Yes - by the way you have bad taste in games.http://www.siliconera.com/2013/09/10/playstation-vita-tv-will-play-persona-4-golden-lumines-and-these-other-games/"}
{"product_id": "B00B1N07QM", "context": "[Solved] Does the Orbweaver store the active profile on the device like the n52te does? Does it have only the dpad for the thumb buttons?", "response": "No... All your settings are stored in  synapse 2.0 cloud Downloadable from  www.razerzone.Com/synapse2And for the thumb... It has 3 cumstomasable buttons. Hope i was helpful"}
{"product_id": "B007VTVRFA", "context": "Isn't this game now allowed to be offline (which was the main criticism)?", "response": "It was suppose to be a lot of things it is not, Kit.  I give it a thumbs down.  Sue"}
{"product_id": "B00E1L786S", "context": "which polk audio sound bar is best for movies?", "response": "This one is great for everything, in my opinion, I watch a lot of action movies, space battles, and it delivers."}
{"product_id": "B00E3667XQ", "context": "Is it true Android emulators have 1000 ms of audio lag?", "response": "No lag on any amulator or android game."}
{"product_id": "B00012YI14", "context": "Will this adapter allow the use of Gamecube and xBox controllers on the PS2?", "response": "No. It's only good for GameCube and Xbox to use PS2 controller."}
{"product_id": "B0053B66KE", "context": "Will this work on a DS? I ordered it before I realized my son does not have a 3DS", "response": "It will not, I'm afraid.  You must have some model of 3DS -OR- it will work on the 2DS if you happen to have that.  It will play 3DS games without the 3D."}
{"product_id": "B0090ECASW", "context": "I know nothing about gaming-Except that my 22yr-old son plays.I was looking for gaming mouse then saw keypads-but is this better? Any recommendations?", "response": "I had this keyboard for about a year. I can honestly say I loved it. The lights/colors were vibrant, the customization was amazing, just a great keyboard all around. Very durable. Touch screen is very responsive. I sold it for a different keyboard and it was one of my biggest regrets. I think he'd love this."}
{"product_id": "B00B1N07QM", "context": "[Solved] Does the Orbweaver store the active profile on the device like the n52te does? Does it have only the dpad for the thumb buttons?", "response": "it's saves on the cloud and I use the same profile on both my laptop and gaming machine, works great.As for the thumb stick, I find it much better than my n52te and a lot more responsive.  I use it for movement for my first person and mmo games and find it much more comfortable."}
{"product_id": "B0036WTVNG", "context": "Is this compatible with Android devices?", "response": "I know its for PC use but I doubt it would be for android items though."}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "it will work with Amazon Prime and Video App streaming from PC, so it should work with all Video Apps (Hulu and Netflix)."}
{"product_id": "B00CD1FCAC", "context": "Why is there two usb cords?", "response": "One powers the actual keyboard and the other powers the USB slot on the back of the keyboard."}
{"product_id": "B001AI7CF2", "context": "where do the gamecube controllers connect to the wii", "response": "Open the door on the top of the unit. They will plug in there and work great."}
{"product_id": "B009K7QB8O", "context": "progaman the lights to change color to red?", "response": "Only one led and it is blue"}
{"product_id": "B001V9PTVE", "context": "do these games work on windows 8?", "response": "Yes and no. Included with the games is a copy of dosbox, a dos emulator that will run the games on windows 8. However, Fallout Tactics is unplayable unless you can find a crack that will allow you to run the game without the disc."}
{"product_id": "B008O510Y8", "context": "Any difference between PC 350 and PC 350 Special Edition? Which one to buy?", "response": "best thing to do is compare the two of their specs...http://en-us.sennheiser.com/professional-gamer-headset-super-noise-cancellation-pc-350 and http://en-us.sennheiser.com/gaming-headset-pc-350-special-edition  When I returned my 350 they sent the se back.  biggest change is where the volume control is and type of cord ( braided vs non )"}
{"product_id": "B000B6MLTG", "context": "I got an xbox 360 elite and my monitor is a samsung syncmaster s22b310. Will it work with it?", "response": "Also you may not receive Audio."}
{"product_id": "B00HKCKA0G", "context": "What other headsets did you consider prior to buying these?", "response": "The gold edition wireless and I have them now they are more then worth the money"}
{"product_id": "B00EZPCX1A", "context": "Does it come with any games?", "response": "No. It is just new in box."}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "You don't have to. It has a wire that connects directly to your Playstation."}
{"product_id": "B006SVUQNQ", "context": "My current hard drive keeps saving corrupt data and slowing the xbox down, for some reason my xbox wont read any game that has the corrupt data on it. Will this happen with this hard drive?", "response": "It sounds like a hard drive issue, not an Xbox issue. It should be fine with this hard drive."}
{"product_id": "B000P46NMA", "context": "This game has subtitles in Spanish?", "response": "No. Sadly, the game has no subtitles at all. If you are hard of hearing, it's a definite struggle, as there is a lot of dialogue and it can be an issue if full attention isn't being paid."}
{"product_id": "B00HVYBWQO", "context": "Is this more useful than a Nintendo Power Glove?", "response": "if you want motion controlling for gaming i think you've only got the razer hydra for now."}
{"product_id": "B00AIALGZK", "context": "do u have to buy it and download it at the same time", "response": "No it's PC download so you pay then download however it's a wate of time and money I downloaded it and it did not work and I have a powerful. Computer I don't recommend this product"}
{"product_id": "B00FOHP8XI", "context": "One review here mentions internet browsing. I realize this PS3 is not a computer per se, but can you surf the internet on it?", "response": "Yes you can surf the internet. It a little difficult because there is no keyboard tho I would recommend to buy one"}
{"product_id": "B00B0QONB0", "context": "is this for titanfall", "response": "this is an internal hard drive.  you can install anything on it.  The main benefit is to take an Xbox 360 with a minimal 4 GB of storage and upgrading that capacity to hold tons of information."}
{"product_id": "B00CD1FC6G", "context": "Does this board still have the LED Issues? (Them dying off after a month or two)", "response": "Haven't had any problems with mine yet, still shining bright like the day I got it."}
{"product_id": "B002I0JJ2U", "context": "how good are the graphics? will it take full advantage of my HD 7870 ghz 2gb?", "response": "Wow if you purchase this you might not get your money back. This title moved to ffxiv arr, look for final fantasy xiv a realm reborn. Purchase that one."}
{"product_id": "B00A1AQJAO", "context": "I bought a used 3DS which did not come with any AR cards and the first thing the section would ask for is a \"?\" card; would this be included?", "response": "Lets not confuse AR Cards with this device they are both two different items but to answer your question that has nothing to do with this AR, those cards are not needed on used 3DS units you can go to http://en-americas-support.nintendo.com/app/answers/detail/a_id/618/~/how-to-download-replacement-ar-cards-and-booklet to download replacement AR Cards from Nintendo Inc."}
{"product_id": "B001GIOGBY", "context": "Hi, Can I used with my X-Plane 10 Global Flight Simulator in my Mac computer ??? the info is very confusing, please answer me before I buy it. Thanks", "response": "These people say: Yes -- http://xforcepc.com/store/index.php/catalog/product_compare/index/  I'm still searching for more info though, because I had a gamepad that worked fine when Mac was 32-bit but now OS 10.7.5 is 64-bit and that gamepad driver no work anymore. I'll see what I can find out from CH and maybe more from link provided."}
{"product_id": "B001DU25UO", "context": "Does this also support ps1/psx controlers?", "response": "Yeah , I have PS1 and 2 Controllers and it works!"}
{"product_id": "B0018YXM3Y", "context": "Does this game work on windows 7 ?", "response": "I use 7 and had no problems with either installation or play."}
{"product_id": "B00I9UVY30", "context": "can you play as the women's teams?", "response": "Thank you for contacting us. You are unable to play with the women's team from the game you are inquiring about."}
{"product_id": "B00FQFFPZO", "context": "do you need the steering wheel and foot controls to operate this game?", "response": "No. Just a controller"}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "Yep.  Qwerty.  And it's great."}
{"product_id": "B00DLDEKOK", "context": "Does the volume box move up so its not so close to where ya plug it ino the controller??", "response": "Bought four of these and they all broke within a month. The wiring is exposed. Too easy for little fingers to accidently tug on as you are taking them on oand off. Spend the money and get a better set."}
{"product_id": "B007SRM5U6", "context": "Thist game have spanish sub?", "response": "Yes it has spanish sub, I buy this version and use it in my ps3."}
{"product_id": "B00C2B2Y9A", "context": "What's the durability? I am very careful with my electronics. How long do these last?", "response": "I'm  very careful with mine as well, to me I feel like they will last longer  if your very careful like you said."}
{"product_id": "B00ARD5410", "context": "how long is the mouse cord?", "response": "1.8 metre or 6 feet."}
{"product_id": "B001E27DLM", "context": "Does this game have multiplayer mode?", "response": "No multiplayer. It wouldn't really make sense for this game"}
{"product_id": "B0097CUREG", "context": "do you have to leave the cd in while playing", "response": "Yes, you need to put the CD in to play"}
{"product_id": "B00005NIMB", "context": "Will this work on Win8 64bits?  I will play mostly the \"Battlefield\" games.", "response": "According to Microsoft this joystick is fully compatible with Windows 8 64-bit, though some folks have had issues where their systems wouldn't recognize the device as a game controller. Refer to the troubleshooting steps in this article if you have any issues, it should work just fine: http://answers.microsoft.com/en-us/windows/forum/windows_8-hardware/win-8-wont-detect-sidewinder-precision-2-joystick/6bf4625f-a302-45b1-9ecf-abb647946677?auth=1"}
{"product_id": "B00BFOEY3Y", "context": "USB 2.0 or 3.0?", "response": "The mouse will use any version of usb you have, it doesnt use enough bandwidth to saturate usb 2.0,or 3.0. It preforms the same on any usb version..its not version specific.I have my g700s plugged into my usb 3.o port without any issues at all."}
{"product_id": "B00F27JNGS", "context": "would this work with the version 2000?", "response": "Don't buy this yet it's region locked to Japanese psn aaccounts. Wait about 4 more months"}
{"product_id": "B0081GA50U", "context": "Does this Work with 2000 series?", "response": "I don't believe so, but I could be wrong."}
{"product_id": "B000J18SR2", "context": "Does it also runs on windows 7 ?", "response": "Yes, I use it on Windows 7, works great."}
{"product_id": "B00BQWTGIS", "context": "Is the goods use a cd-rom to install or download online?", "response": "I it's depend what you bought. ."}
{"product_id": "B00B98HF1O", "context": "Is this the Avengers?", "response": "No, it's all the Marvel superheroes. The Avengers are are in it though."}
{"product_id": "B009DYOPK0", "context": "How big is this mouse? Full grip? I have big hands and don't like having to use claw grip when mice are too small.", "response": "It's perfect for big hands. I have very big hands and it's very comfortable."}
{"product_id": "B003O3EFY2", "context": "i need some type of adaptor to connect this unit to my TV,  saw some on you tube but don't want to waste any more money, any solutions??????", "response": "Just get the red, white & yellow wires, unless you're trying to connect it to a digital tv, then you'd probably need the RF Adaptor"}
{"product_id": "B004TTNTYW", "context": "How long is the cord?", "response": "I bought this a while back its as long as the one that comes with the ds"}
{"product_id": "B0088MVODO", "context": "Do you need to buy this game new for the downloads to work?", "response": "The Download codes come with the game.   Which you download from either Xbox Live or PSN.  If you already own Resident Evil 1 through 5 from either of the networks, avoid this game.  As the game comes with codes to download the games from either of the online services"}
{"product_id": "B005CELN8W", "context": "Do you make this for Mac, or only PC?", "response": "I don't know, sorry. The version I have is for PC."}
{"product_id": "B00HGLLRV2", "context": "looking into getting  a ps4 for Christmas I played the first game and really liked it is this game on par or better then the first infamous?", "response": "Congrats...its far better in almost every way; its shorter than the 1st."}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "It's in English too."}
{"product_id": "B00562O8U0", "context": "would they work with the sony VPL-HW40ES", "response": "Yes! Confirmed. The PS3 glasses work with Sony front projectors. I'm using with the VPL HW40ES"}
{"product_id": "B006JKARN0", "context": "What's the difference between the GT 5 and this GT 5 XL? Why not buy the GT6? ( I would like to purchase for my husband, the one who plays)", "response": "Buy GT6. GT5 went offline this past may. GT6 will be good for years."}
{"product_id": "B009LGO88E", "context": "does it work for the american 3ds xl", "response": "yes it does, check your local gamestop though could they sld carry them now and cheaper."}
{"product_id": "B00CMQTVUA", "context": "Hi, Can I use this in India?", "response": "You can use this in India and please use a voltage converter as in India it is 220V . Else it will make the transformer burn"}
{"product_id": "B002I0H2AG", "context": "does this game really suck ballls", "response": "Yes it does. Trust me."}
{"product_id": "B00DGZDFLW", "context": "does it require a steam aqqount?", "response": "It registers with Steam. All the achievements and online functionality are handled through Steamworks. There might be a fix for it, but I'm not aware of anything."}
{"product_id": "B007C3E5WM", "context": "How many buttons/clickers does this one have? I need at least 3 for Elder Scrolls Online. Thanks in advance!", "response": "It has 2 on the left side, 1 left mouse button, 1 right mouse button, and the scroll wheel can be clicked in.  There is also a dpi changer behind the scroll wheel, Idk if you can change that to whatever you want though."}
{"product_id": "B00JM3R6M6", "context": "I have three children that all love Tomodachi Life demo and are now asking for the full version.  Do I have to buy 3 copies of the game for $30?", "response": "You will have to buy three copies. There is only one game save on it. One Mii per game."}
{"product_id": "B00FQFFQ2Q", "context": "Is this a multi player game?", "response": "You can  play this game online with others and you can play split screen."}
{"product_id": "B00CJ7IUI6", "context": "Is the DLC in the disc or is it a download code?", "response": "The DLC comes as an additional disc but is downloaded to your systems hard drive.  The end result is the same as having a download code but the delivery system is different and you have a hard copy if you want to frequently delete and re-install it."}
{"product_id": "B00D84DRNC", "context": "Does this fit New 3ds xl?", "response": "As far as I know it does."}
{"product_id": "B00GHTP7SS", "context": "This is only the code? Where do i download the game from after buying the code?", "response": "Install Steam and activate the game within steam. Download the steam client here: store.steampowered.com"}
{"product_id": "B002BSA20M", "context": "Why is it mature?", "response": "It is rated m for blood and violence."}
{"product_id": "B0006PJAZU", "context": "Will Suite 8 work on a XP computer?", "response": "Yes, it is an older version of the software, but will work on windows xp right out of the box."}
{"product_id": "B00F4GSAYI", "context": "is there a separate disc for the dlcs?", "response": "The dlcs are downloaded for x box 360. The original game came with 2 discs but the dlcs were offered on xbox site as down loads. Good luck, the game is a good one"}
{"product_id": "B00B1VJZO4", "context": "it says that i must download sims 3 do i have to?", "response": "Yes, you need the sims 3 base game to play any expansion packs."}
{"product_id": "B00GHTP7SS", "context": "This is only the code? Where do i download the game from after buying the code?", "response": "you will have to download it via steam."}
{"product_id": "B00CPKUV98", "context": "Is there any difference between the PS3 version and any other platform?", "response": "Overall there is no difference with the exception of graphics. However, there isn't much of a difference in graphics. Whatever version you decide to get it will be the same."}
{"product_id": "B009CL6LA6", "context": "how is this set chargered?", "response": "It comes with a fairly long cord that you plug into the headset and then plug into a USB port, and it charges like that. You can charge it while you use it."}
{"product_id": "B008XHCLFO", "context": "Will there be one for the New Nintendo 3DS XL?", "response": "Yes there will be a new one for the NEW 3DS XL that released in Feb 2015.I contacted the manufacturer and they responded saying sometime around April 2015. No exact date though."}
{"product_id": "B00C2B2Y9A", "context": "So far ive read it works on the PS4, Xbox1, PS3, and 360? Is it wireless for all systems? just plug them in the controller for sound and chat?", "response": "I have only used it on my xbox one and my computer. Yes it is wireless but you will have to plug a wire from the headset to the controller on the Xbox one."}
{"product_id": "B001IYR53W", "context": "does it have canfiedl and hearts", "response": "It also has Tarot (the oldest card game in the world). Later editions either do not have Tarot or the cards are to tiny to see. So if you want to learn how to play Tarot, this is the software to get. Works great Win 7, 8, 10 !http://trionfi.com/0/p/"}
{"product_id": "B004EJ0L8E", "context": "Is it usb plugged?", "response": "No. Unfortunately they use the traditional speaker/microphone plug-ins, but that is about the only negative thing I can say about this headset :)"}
{"product_id": "B00BCEK2LU", "context": "How long does the back light stay on? Can you customize it?", "response": "The back light stays on as long as the keyboard is plugged in... It doesn't turn off... And you can customize it"}
{"product_id": "B00006C2HA", "context": "what is difference doom 3 for 39.99 / doom 3 bfg edition for 15.99 ??????", "response": "I believe it's the same game! I bought this game a long time ago (February/2008), and the bfg edition is more actual.The 15.99 is game to download by Steam account. The 39.99, you buy the box of the game (like me)."}
{"product_id": "B0000512IE", "context": "Could this be adapted to be used in racing games also?", "response": "I googled the question and found many forums of users using both the CH yoke and pedals for racing games. So yes they can be use for racing. - Dave"}
{"product_id": "B00C2B355W", "context": "Can this be hooked up to my Xbox One and PS4 simultaneously?", "response": "you would need a splitter to allow for both to be hooked up.  It has only 1 input"}
{"product_id": "B003Q55Y5C", "context": "what are system req, ments for this game. will my hd 7870ghz do it justise? and is the gameplay good?", "response": "Not sure what your processor or memory capability is but I used an 8800GT video board and the game worked fine.  Game play is above average to good."}
{"product_id": "B001IYR53W", "context": "Does this game have gin rummy included?", "response": "It has gin and rummy500. I haven't used either of them on this program"}
{"product_id": "B00EZAWV6W", "context": "is it better on pc or xbox?", "response": "Have not played on xbox, and don't play it on pc any more... have gone back to original PvsZ on pc, which is a MUCH better and more fun game...."}
{"product_id": "B008OQTUKS", "context": "is this physical or can I just get the redeem code instantly? thanks", "response": "if you want it on dvd it will be deviled but if you buy it via digital edition then amazon will email you youre ea origin code so that you can activate youre copy of the game. i hope my answer helps you out Benny"}
{"product_id": "B00FZ12F34", "context": "Will this Infinity Bundle work with the Infinity 2.0 that comes w/ the super heros?", "response": "Yes it will.  All the characters will continue to work with the new platform."}
{"product_id": "B00ANHBJBY", "context": "Hey guys I'm having trouble with this controller in Wii Mode. Able to sync but the battery is always 0% in Wii Mode after charging. Can anyone help?", "response": "That doesn't quite make sense since this controller isn't even compatible in Wii mode. You should only be able to use it on Wii U games that are specified for it."}
{"product_id": "B00DLRLDBO", "context": "does it work perfectly with xbox 360 controller do I have to do anything special and can I use it for a PS3 IPhone and PC??", "response": "My daughter broke them within a week of receiving them as a birthday gift.  Going to try some superglue...."}
{"product_id": "B00A1Y2STQ", "context": "Is this a quiet keyboard or are the keys noisy when you strike them?   Thanks.", "response": "I would say its a bit noisy.  It sure isnt quiet."}
{"product_id": "B000ZKA0J6", "context": "Is this a physical copy or a digital copy? Does it matter?", "response": "we got a physical copy and then it downloads some huge lame update that takes a phd in computer science to make work"}
{"product_id": "B00GJSUUC0", "context": "Is this entire game just one level?!!!!!", "response": "Yes, as far as I can tell. It doesn't give you anything on the description to let you know. Very disappointed."}
{"product_id": "B00I5LMSBK", "context": "Will the game is in Spanish?", "response": "Yes it is (sí, lo está)"}
{"product_id": "B009JZ04BC", "context": "Can the LEDs be turned off?", "response": "it can. when u press the dpi change buttons to the lowest one the light turns off. i believe u can also turn the LEDS off with the cm storm program, i just haven't installed it :)"}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "Its not as bad as you think because we just have fun by driving cars and missions not do drugs in it just fun"}
{"product_id": "B00006C2HA", "context": "It won't install! (Macbook Pro) After dragging the .dmg to the HDD and double clicking it, the icon just bounces and then hangs. Help!", "response": "Try to run it on medium install. It could be that your MAC can't support the game on full install"}
{"product_id": "B00HS5FETM", "context": "can you adjust the game volume and chat audio indepently from each other", "response": "Chat volume is set, you have to adjust the game volume to your liking, you either turn it down to listen or turn it up but you will have a hard time listening."}
{"product_id": "B00BT71S4K", "context": "how does it work with ipod touch", "response": "it can pair with the ipod but some games gets updated then they dont work will"}
{"product_id": "B0087N222Q", "context": "can someone tell me if I connect this bluetooth to my ps4", "response": "Yes, my son did..."}
{"product_id": "B00GZ1GUSY", "context": "Is Ps4 game region locked? Will i be able to play this game on Indian PS4 (PAL)?", "response": "PS4 games aren't region locked, but however their downloadable contents are , since this game is complete with everything included in it, you don't need to worry about that either. You can easily play it on your indian ps4."}
{"product_id": "B00BT9B2LC", "context": "Is the Japanese 3DS compatible with an American 3DS charger?", "response": "I have been using my North American charger on it, and it has been working fine."}
{"product_id": "B00BDS415I", "context": "How long is the cable, is there any way to lengthen it?", "response": "The cable cannot be lengthened, but it is very long. I have to keep it wrapped, yet it still has 3ft left from my xbox to my head."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "Yes,  this game most definitely does play in Windows 7."}
{"product_id": "B00I14395A", "context": "This was ordered for me and came with two cables. One works with the keyboard, but the other one? I need to recharge my mouse, what do I need?", "response": "Both cables might be identical as cable fit both mouse and keyboard and is for charging either or when necessary. If they are the same keep it as a spare."}
{"product_id": "B00E1L78N6", "context": "Did any of you get an notification that your boom mic was on the way? I registered my product and never received an email from Polk.", "response": "I never got anything. I think they've stopped caring. It would help if they showed what it looked like. I even called them, spoke with someone who said I'd get an email with tracking but I never got anything."}
{"product_id": "B007TYC8MI", "context": "Is this a digital version? or a hard copy?", "response": "Is a original version, is not a digital, is the game in a disk."}
{"product_id": "B002I0IIPY", "context": "I have the Wii mini, can this game still be played on it with no wi-fi connectivity?", "response": "Yes you don't need wifi to play this game."}
{"product_id": "B00FZ12F34", "context": "Is buying this bundle just like buying them in store? Do each of characters and play sets come in boxes with power discs, and original packaging?", "response": "Yes they come in their own boxes and include playset items, disc's Original packaging :) Great deal!"}
{"product_id": "B001UWGDPS", "context": "Does this game have Steam activation?", "response": "you can buy it on steam for 29.99"}
{"product_id": "B00286BZ4Y", "context": "Can you play multiple live players at home or just computerized players?", "response": "Just the computer I think"}
{"product_id": "B00C7103DO", "context": "Have they patched out the bugs that a lot of people were experiencing?", "response": "Well not completely sure but I do kniw that some of the bugs people were experiencing was due to the fact that you had to complete certain obstacles a specific way"}
{"product_id": "B001DU25UO", "context": "Does this work on Windows 8?", "response": "Yes, have been using it on my laptop that is running windows 8.1 x64"}
{"product_id": "B0056JPS84", "context": "My model number is DG-16D2S but my MS P/N is X800474-008 and the P/N for this product is X899474-010. Are they interchangeable?", "response": "Yes, I have two different 360 Xbox's I changed over with the above unit. one had P/N X800474-010 the other unit X800474-008."}
{"product_id": "B00C710AT6", "context": "I can't even open the game. Each time I click on the shortcut on my desktop or try opening it through steam it just goes to a black window than closes", "response": "It happened to me a couple times, I just restarted my computer and it worked."}
{"product_id": "B00965WK8K", "context": "Is the scroll wheel smooth or regular (tiny or normal rotation for each scroll increment)?", "response": "regular, but very slight. it does \"click\" but not as bad as some normal mice."}
{"product_id": "B004NRN5EO", "context": "Does this require an internet connection to play? (not update/install)", "response": "no, it still gives the option to play offline."}
{"product_id": "B004FS8LYK", "context": "How much hard drive space is needed for the ps3 version. It should say at the back of the case.", "response": "I downloaded mine from playstation store, it was 8776mb."}
{"product_id": "B0041RR0TW", "context": "Has anyone used the 710 Gamepad on a windows 8.1 system?", "response": "Yes, and it works really well. On the off-chance it does not work right away, all you need to do is search for the Logitech Gamepad F710 driver and install it. It works even with emulators."}
{"product_id": "B00CX8VYM0", "context": "Should i buy this game? I honestly suck at games, I give up easily on timed stuff or too difficult, but this game looks interesting", "response": "If you ever played an Assassin's Creed game than this one will be no problem very easy."}
{"product_id": "B00D6PTMSW", "context": "I have an xbox360 with only 4gb of hard drive. Can this game be played directly from the Disc without requiring game installation in the hard drive?", "response": "Yes, thats how I play it. It is better to go directly from xbox to external speakers or sound bar to eliminate the delay caused by a tv trying to process the sound."}
{"product_id": "B002ST7AEU", "context": "How many batteries is included? 1 or 2?", "response": "one battery pack is included."}
{"product_id": "B003VANOFY", "context": "I've seen a lot of connectivity issues with this headset. Does it have the ability to function plugged in as if it is not wireless?", "response": "Yes it can and the cord length is pretty substantial"}
{"product_id": "B007JM8ULS", "context": "does it has to be a xbox slim or does it work with xbox360 e?", "response": "From what I understand, all \"Slim\" labeled hard drives work just as well on the E systems, since they didn't change anything about hard drives in between the two."}
{"product_id": "B00CMQTUY2", "context": "what size is the cable?", "response": "There is no cable just the controller."}
{"product_id": "B005764CWO", "context": "What kind of plug does this have? I'm looking for s USB controller.", "response": "It's a USB connector."}
{"product_id": "B0006PJAZU", "context": "Does this come with the activation code?", "response": "No. Install and go."}
{"product_id": "B00FZ12F34", "context": "this Exclusive Amazon DISNEY INFINITY Infinite Bundle, with Sorcerer's Apprentice Mickey Figure is for PS3?", "response": "Yes, this works with my PS3. I believe they are also interchangeable with PS4 and the X-box."}
{"product_id": "B00AIALGZK", "context": "is it working on windows 8?", "response": "Yes, it does work on Windows 8"}
{"product_id": "B009Q8M816", "context": "An instruction sheet did not come with the controller.  Is there a website or link that has full instructions?", "response": "Additional info. why you are waiting for instructions, Under search on your computer. write in :instructions for the 17 mode modded Xbox 360 controller. It will show a demo of that controller and the person explains the operation of your controller. You can also email other gamer's for help."}
{"product_id": "B0032MK90E", "context": "Why doesnt II download but III does and they are on the same disk?", "response": "I have this disk and I was able to download both.  I can't remember if I had to download one and then the other or if they downloaded together. but I have both downloaded.  I'm sorry but I don't have any solution at this time."}
{"product_id": "B007WPM9GO", "context": "does it fit the original ds", "response": "Yes, I have a ds lite and it fits."}
{"product_id": "B0032MM2P4", "context": "I want this to work on my laptop. Will it?", "response": "I have not put it on a laptop.  But it seems to work okay with Windows 7 on my PC.  Should work OK."}
{"product_id": "B003JVF728", "context": "does the disk version work?", "response": "Yes it installs it on steam"}
{"product_id": "B003OZOAKY", "context": "Serial key not working ,", "response": "Scotti; I was told that it would work on my 7/64, 'It did not' my key worked, then the program crashed.I regret the purchase. Hope this helped.JL."}
{"product_id": "B006W3ZXEW", "context": "Is that a 7th button in the middle of the 6 side buttons or is it just a nub for resting your thumb.", "response": "Nub comes with three different sizes"}
{"product_id": "B00DC7O77A", "context": "How do you play the game?  What's the objective/moves, etc?", "response": "It is a side-scrolling platformer in the traditions of most Nintendo platformers."}
{"product_id": "B00F27JNGS", "context": "Will the Japan model have an update where it will work with NA accounts once the PS TV releases in the west?", "response": "I would like to say yes 100%, BUT that's only if Sony continues to show support for firmware updates across all countries which they have so far."}
{"product_id": "B001DPZE84", "context": "will this program work on Windows 8.1?", "response": "yes, it works very well"}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "YES! i use it you just have to get the drivers for it"}
{"product_id": "B007XVTR3K", "context": "Is the Season Pass good for 3 months or 1 year?  If a year, 365 days or throughout the calendar year.", "response": "I'm sorry it actually lasts forever with all four map packs."}
{"product_id": "B0038PBF1W", "context": "Can I play this offline?", "response": "absolutely, but to achieve more you should be online."}
{"product_id": "B002VBWIP6", "context": "Does this work with xbox one?", "response": "Yes, I used it on mine."}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "Yes it runs very smoothly the first time you play it the game may seem slow but just keep playing and it will get better in a few minutes."}
{"product_id": "B009WI7V9E", "context": "i already have B1 on steam and beat it on hard, is being stuck with a controller worth buying this?", "response": "To be honest I have beat this game on and honestly this has a lot of new content on the 2nd disk for both games & it's all good entertainment"}
{"product_id": "B00B77OKNI", "context": "will this work on a 2nd generation kindle fire", "response": "Yes. Here is a link to this review. Thank you. http://www.theverge.com/2013/3/5/4064430/green-throttle-atlas-kindle-fire-hd-game-console"}
{"product_id": "B004FS8LYK", "context": "Hey guys! So I was thinking of buying Tomb Raider but I hear there's multiple games in the series. Is this the first one? What's the order?", "response": "Yeah there are previous entries but this Tomb Raider is a reboot of the series. So you can play this one without playing the others. And Merry Christmas!"}
