{"product_id": "B00FB4BUMW", "context": "Will the computer see this keyboard preboot so the bios can be accessed with the F2 or ESC key?", "response": "Yes, Worked fine for me before I installed the drivers."}
{"product_id": "B003Q55Y5C", "context": "Does the online still work in 2014?", "response": "Haven't played this in some time so I don't know - try a general Google search or maybe a Steam forum"}
{"product_id": "B003VANOFY", "context": "Can this headset be used while charging?", "response": "Yes it can! And the charging cable in plenty long enough too."}
{"product_id": "B004RMK4P8", "context": "my play station can not redem the code you sent me. i am currently in greece. what should i do now?", "response": "i think you cant use the card cause it is only for USA accounts. you can sell it and buy another card from your country. also you can create a psn USA account to use the card"}
{"product_id": "B00519C7CE", "context": "Does it come with the zombie pack?", "response": "Yes it is included when you buy the game."}
{"product_id": "B00FLLFJE0", "context": "How does the base recharge the batteries? Does it plug in? Or does it have to have batteries in it?", "response": "It plugs into the wall socket"}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "Hey,I don't know. If there's an adaptor similar to the Xbox One adaptor then the answer is yes. The XO Seven works with both Xbox One and PS4!Andrew A"}
{"product_id": "B000H683YC", "context": "Can I buy the remote off of you?", "response": "I actually still have the remote but not the system.  If you pay for the shipping you can just have it.  The front cover is missing and the battery cover needs a strip of tape to hold it in place, but it should still work.  I haven't used it in a couple years."}
{"product_id": "B007SO6USW", "context": "Does it come with a charger?", "response": "just use the one that came with your controller for the power thats it"}
{"product_id": "B0044DJZ0A", "context": "Is the Shift Gaming Keyboard  or Keyset gaming Keyboard?.  I have the Starcraft II keyset and need the SHIFT keyboard in order to it works. Thanks.", "response": "The keysets are separate from the Shift keyboard. The keyboard itself comes with a generic keyset that you can replace with one that's game-specific."}
{"product_id": "B004NRN5EO", "context": "Does this come with the DLC?", "response": "The one I have as depicted above is the non DLC issue. I am not sure if PS3 has a Prepare To Die edition, but on PSN Store, you can get the Artorias Of The Abyss DLC that was part of PTD for just $9.99."}
{"product_id": "B00B77OKNI", "context": "Can I use the controller on an nVidia Shield without the Arena app - say in a game like Asphalt or an emulator like n64oid?", "response": "No. It works only in the Arena games. We have to wait for future development of new games on Arena."}
{"product_id": "B000SOYG8U", "context": "Can you download a mod to change it to the clone wars?", "response": "Probably. They're are all sorts of mods for these games. Before you buy it, check out filefront. Type the name of the game into a search engine and then filefront and it should come up. There you'll find a whole bunch of mods for the game. Also you don't have to be a member of the website or anything."}
{"product_id": "B002I0KP4G", "context": "I'm buying this for my boyfriend and I'm clueless, is buying the collectors edition worth it? What weight does it hold?", "response": "From what I can see unless he is a hard-core Starcraft fan that loves all the artwork and everything related to it, the collectors edition is not worth the price."}
{"product_id": "B006JKARP8", "context": "Can I charge the charger itself using iPad adapter (any other USB power supply) or Vita adapter only?", "response": "That was my issue to...you have to use vita charger..the sony official...generics wont work for an extra 12$ I believe on amazon"}
{"product_id": "B008SBZF4Y", "context": "can this work with the WII?", "response": "Yes. I bought it for my son and he uses it on the Wii."}
{"product_id": "B000BD9PBQ", "context": "SPECTEC SDIO WiFi and BlackJack II Compatibility Anybody has tried the compatibility of SPECTEC SDIO Wifi Card in Samsung BlackJack II ?Any Input will appreciate .", "response": "Be aware that this card doesn't support WPA2 and Spectec seem to have disappeared."}
{"product_id": "B00B312UDU", "context": "Does anyone know is exist a software for this mouse???", "response": "There is no known software for this mouse. No CD came in the box. If you research it a lot you may find one in Chinese, since this originated from China somewhere (As per reviews I looked up before purchasing) works perfectly fine on Windows 7 64 bit."}
{"product_id": "B00BDX1M00", "context": "i just got mine and im not to sure that im happy with it. i don't think it is charging and the users manual isn't exactly to clear. PLEASE CONTACT ME", "response": "I just plug the charging cord directly into my regular USB hub.  seems to charge fine.  It takes a while to fully charge the first time."}
{"product_id": "B00FB45YFQ", "context": "Will these work with a PS4? I am tired of this stringy little black wire that came with it. I need an upgrade, will these work?", "response": "Man trust me dont but these headphone 80% of people i know we all have the same problem right earcup doesnt work i know you can be a little bit excited about it but trust me dont it will stop working within 3 month for sure"}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "Mine does not make any noise.  I have never had a mouse that makes a noise when it wasn't moving.  Your mouse was most likely a rare defect.  I would get the mouse again."}
{"product_id": "B00292OW1U", "context": "Does it have volume controls on it and a mute button? The picture does not zoom in so I can't see.", "response": "Yes it has a mute button and volume buttons"}
{"product_id": "B00HKCKA0G", "context": "can you use this as a pc headset?", "response": "Unfortunately no you can't this one doesn't use usb capability."}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "I've gotta agree, I thought the campaign for this game was fantastic. Several ways to complete some of the missions and very tense. It also doesn't hold your hand too much, making you decide how to approach situations, which I appreciated."}
{"product_id": "B006W41X1S", "context": "Can I just play my games offline and hear game sound on headphones or do I need to play online?", "response": "You can play offline. The headphones work with the TV, not necessarily the game console. I want to say I've listened to TV before through the headset."}
{"product_id": "B00EM5UFF4", "context": "What's the difference between physical disk and digital download? Why the physical disk one is more expensive?", "response": "The code is for the pc download \"instant access\" and of download are same thing don't know why they are listed separate if you are trying to get the game for a console one you need to buy a physical disk"}
{"product_id": "B007A7UJ4S", "context": "can it be set to Japanese voices and English sub at the same time?", "response": "Yes it can.  Japanese voice English dubbed is a option."}
{"product_id": "B003OZOAKY", "context": "will it play on windows 7/64 ?", "response": "im running it on windows 8/64"}
{"product_id": "B00IAVDPSA", "context": "Does this controller connect to a Windows PC (like the Xbox 360 media remote)?", "response": "good question I am not sure I doubt it by looking at it"}
{"product_id": "B000VBFWAG", "context": "what computer did you use for this game, brand and version.", "response": "I used a Windows 7 64 bit computer; Dell laptop. Nothing special, it's a computer I got back in 2011-2012 and it runs fine."}
{"product_id": "B002I0KP4G", "context": "I have a Mac Mini i5 2.3. It's ok to play it?", "response": "I cannot confirm but I think youll be fine. I used a macbook pro 13\" late 2012 model for this game. I have it updated to mavericks os. The game plays well for me! :) hope that helps you."}
{"product_id": "B00HN9LS48", "context": "I have a wall mount tv.  How far back does the mount extend?", "response": "It goes back far enough, but you have to be careful because if your tv is too high it will be hard for the kinet to see the floor."}
{"product_id": "B00I4BGNVM", "context": "If i buy this do i get a gamecode for the tamiel unlimited edition on steam or should i buy a different version", "response": "You get a game code for the game, I do not know about the editor. This is the basic game, no imperial, horse or other perks."}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "No I haVe not have you tried a new remote."}
{"product_id": "B00CPKUV9I", "context": "Does Wolfenstein:TNO have a single player mode?", "response": "Its single player only"}
{"product_id": "B007WWW2C8", "context": "dose this include all the seasons or just the first", "response": "That's just season one"}
{"product_id": "B00FLLFJE0", "context": "Is it worth it", "response": "Yes it's worth it.  I don't have to use a charge cord to charge up the battery's."}
{"product_id": "B000QJ1NS8", "context": "Just bought this battery, but does anybody know where I can find an LCD? My original GBA SP's backlight died.", "response": "You don't actually buy a new LCD. You can buy just the little light. Installing it is a monster pain though. There are several tutorials on youtube however."}
{"product_id": "B00BQZ5EWW", "context": "does this have the greek states as playable factions?", "response": "No it didn't. It gave me a virus so beware before u waste $60."}
{"product_id": "B00EZKNT18", "context": "Does it include a breakaway cord?", "response": "yep it does. first section is about 9\""}
{"product_id": "B007MJSZDQ", "context": "dose it come with the battery packs?", "response": "Comes with two batteries, but one of mine will not accept a charge."}
{"product_id": "B00IIHU44E", "context": "Does XBox One absolutely need internet? Or can it be used offline because my internet isn't the best.", "response": "Works best with Internet. Titanfall has to be downloaded online"}
{"product_id": "B00B1VJZO4", "context": "it says that i must download sims 3 do i have to?", "response": "yes you do !! haha but it's worth the money. the sims is actually a pretty chill cool game."}
{"product_id": "B003Q9RGRW", "context": "can you plug in both at the same time", "response": "Yes you sure can."}
{"product_id": "B0089NVTDM", "context": "Will it work on a Mac?", "response": "please tell if both entries work or only one like I saw somewhere else"}
{"product_id": "B000H67DDY", "context": "Does this work with Prepar3d 1.x?", "response": "sorry - I have no idea about compatability with Prepar3d 1.x"}
{"product_id": "B007W8S2MG", "context": "Is this a code for downloading or a game card?", "response": "This is a game card"}
{"product_id": "B002I0HJG8", "context": "If i get a brand new edition will it come with the founder's code?", "response": "Mine didnt, i had to email them for it. Did this happen to anyone else?"}
{"product_id": "B003N3HEU0", "context": "waht kinde of remote can you use for this game the classic controller pro?????????", "response": "yeah, you can use the pro controller and that was my choise too, but please consider that this CoD is responsible for many broken (older) wii disc drives (the game is too demanding for the console), take a look at the net..."}
{"product_id": "B00G0OYHCW", "context": "in the wii u can i play with that games of the wii and gamecube like in the wii?", "response": "I would like to see some remade Gamecube games for 1080p.  Playing original Gamecube games on the Wii U probably wouldn't look very good on today's LCD screens, so I doubt that will ever happen."}
{"product_id": "B0006PJAZU", "context": "Does Wordperfect 8 work well with Windows 8?", "response": "I have 8.1 and it works well."}
{"product_id": "B00BGAA29M", "context": "I have two dualshock 4 controllers. But I dont see an option in the game to play two player co-op. can you help me please?", "response": "Yes you can play 2 players on knack."}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "About 4 and a half ft maybe a little longer"}
{"product_id": "B003O6JKLC", "context": "Is everything here to start playing (other than a game)?  Would I have to purchase anything else?", "response": "Yes you have to purchase a cord that connects to a big tv and a power block for the xbox 360 console."}
{"product_id": "B00D96BMV8", "context": "How exactly does the headset connect to the console? What kind of connection is it?", "response": "The headset connects to the included Xbox One audio adapter, which is then plugged Into the bottom of the controller. The headset itself uses a common 'headphone' plug."}
{"product_id": "B0009PRCNO", "context": "How many wireless controller do it come with", "response": "1 & 2 wired but I sent it back"}
{"product_id": "B00DBRM3G8", "context": "Can I play this game with my cousin on the same screen on the same system? 2 players?", "response": "Yes only in quick match and blacktop"}
{"product_id": "B0007U2CX6", "context": "is this for psp series 2000?", "response": "Yes, it works with the psp series 2000"}
{"product_id": "B000NJBD90", "context": "Does it work for xbox 360 slim?", "response": "No this will not work on X-box"}
{"product_id": "B0029M6VKA", "context": "What is this thing? Is it a new type of monitor, is it something you wear or is it something like the Kinect for the PC? I don't really understand it.", "response": "Its a device that tracks your head. Mostly to control camera views. Search on YouTube for a demo."}
{"product_id": "B00FQPQO4A", "context": "what is the difference between titanium for 27.99 and the other one for 19.99? and can we download this on to our android tablet", "response": "You get extra content with the expansion, no its for pc,  unless you can transfer from tab to pc.  There is a farming simulator 2014 for tab"}
{"product_id": "B00FYMTUQY", "context": "Will this fit on a Seiki SE24FE01-W 24-Inch Tv heres the link for pics Seiki SE24FE01-W 24-Inch 1080p 60Hz LED TV (2014 Model)", "response": "Yes. I would buy it with the confidence that it will fit and be able to fit and support the Kinect 2.0.  Just remember to be careful while adjusting to your TV.  It seems like you will break the mount while adjusting it.  Just be gentle while adjusting it and you should be fine."}
{"product_id": "B00EWEHI5K", "context": "Is there basic support in linux?", "response": "Yes, there is. I personally do not use linux, but I have seen others make it work.Here is a link to a user who seems to have made it work.http://unix.stackexchange.com/questions/140634/razer-ouroboros-mouse-not-workinghope this helped."}
{"product_id": "B006PP404Q", "context": "does this fit the ps vita 2001?", "response": "Yes...  the screen on all the vita are same size... only difference between the newer one is it has a cheaper screen since it does not have oled."}
{"product_id": "B0090WBXSM", "context": "Does this work for iPad air and is it compatable with all games", "response": "This controller only works on the android and windows devices. There are apple controllers available,  however I cant vouch for any of them. Search youtube for \"ipad Bluetooth game controllers reviews\" should point you in the right direction."}
{"product_id": "B000PS1TG6", "context": "Does this work with a Dualshock 1?", "response": "I assume so because it works all my ps1 and ps2 controllers but I've never tried a dualshock 1"}
{"product_id": "B00AQ2BLI2", "context": "Does it contain the original game? I accidentally buy the part 2 but it does not contain the original game.I can't play it now.", "response": "Yeah the one I got came with original case and game with everything in it  like instructions and the product key."}
{"product_id": "B000OPOCFU", "context": "Since it's used can it be installed and play by someone else?", "response": "Yes i installed it on my comp before i sent it to amazon"}
{"product_id": "B004J6KRD6", "context": "How quickly does the wheel turn? Is there any resistance from the motors?", "response": "Minimal resistance honestly.  You can turn quick.  The power of the motors, however, is up to you, based on strength.  Nonetheless, don't let people fool into thinking it's not driftable, it will spin SUPER SUPER fast when it needs to."}
{"product_id": "B001PO2BJI", "context": "I'm getting a wii mini.Will these work?", "response": "I purchased them for my Grandson and they seem to work fine for him....he is only 6. :)"}
{"product_id": "B004RMK57U", "context": "i have redeem the code in my ps3 system,can i use it again in my ps4 system?", "response": "The Playstation plus membership is link to your account so if you oog in on the ps4 you are going to have the plus"}
{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "I am not sure as I am on WIN7. But I can't see why not."}
{"product_id": "B00ARD5410", "context": "How accurate is the scroll wheel? For ex. I play Garrys Mod and use scroll wheel to jump, is it accurate for jumping and doesnt glitch?", "response": "considering it has 3 settings that you can switch between on the fly and customize with the software and the sniper button, which is also customizable you shoulnt have ANY problems"}
{"product_id": "B0088MVODO", "context": "I would like to know if there is just 1 CD or if the quantity is different, just because I heard there is a version of 3 CD's", "response": "There is only one disk.  The rest of the games referred to are available by online download with the included codes.  I know of no 3-disk version."}
{"product_id": "B00BV72X1U", "context": "Will this work with windows 8.1?", "response": "Yes, I have windows 8.1 and it works just fine...but I did have to look on YouTube in order to learn how to install it correctly since it is a little different then the instructions it come with for older forms of windows, but still really really simple and it works great"}
{"product_id": "B00FM5IY38", "context": "How long did it take to install yours? Mine's going on 5 hours, and it isn't installed enough to actually start a game.", "response": "it varies console to console, the trick I found is to let it do it's thing and it works better cause it installs properly."}
{"product_id": "B0006PJAZU", "context": "Does Wordperfect 8 work well with Windows 8?", "response": "So far, I haven 't had any real problems.  A few things are a little different, but once you learn to navigate, it works well."}
{"product_id": "B002I0GF72", "context": "Is navigating through the sea as mind numbing and slow as it was for game cube?  because if so, its a deal breaker!", "response": "Nope it's actually way faster and you use the gamepad to navigate so way easier than the GameCube versionCx"}
{"product_id": "B000J18SR2", "context": "Can you play with other computers? We tried one w/ this version & another w/ the conquerers CD and it didn't work?", "response": "I will  not  try  yet, but that could  not be it, I think  so, you must  need it than both computers  have the same version  to could  play!"}
{"product_id": "B00BQWTGIS", "context": "cn you play this game with an xbox 360/pc controller", "response": "Yes you can, but I prefer using my keyboard."}
{"product_id": "B00IIHU44E", "context": "I want to know if NSA could spy inside my home thanks to the Kinnecht apparatus. Thanks.", "response": "Well I guess anything is possible in this day and age!  Just don't leave it on when not in use!!!"}
{"product_id": "B00C71034I", "context": "Is it free roam?", "response": "Yes but far less so than City was... There's a lot of play area, but due to faulty mechanics (very limited area you can grapple) and almost no street activity it gets dull quickly. You finish almost all of the additional \"quests\" and riddles during the game."}
{"product_id": "B003O6EDSM", "context": "For how many players is this game?", "response": "It's single player.  However the third game in the trilogy does have a multiplayer mode with different maps.  It's completely separate from the story.  But no, the Mass Effect series is a single player campaign that you play to progress the story."}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "I think the sound is really awesome, but the look is a little cheap"}
{"product_id": "B001DPZE84", "context": "will this program work on Windows 8.1?", "response": "Doubt it.  Does not work correctly with windows 7."}
{"product_id": "B000J18SR2", "context": "Is this compatible with windows 8?!", "response": "Yes. My friend played it on windows 8. If any problems arise, you can always right click the game and go to \"properties\" and find the ability to run the game as an ealier edition of windows. Also, check out aoe2 hd. You might prefer it. Good luck."}
{"product_id": "B00F27JGVA", "context": "Will this be recognized by Playstation TV? Sony says only 32.", "response": "It worked if you are still curious lol"}
{"product_id": "B003O6CBIG", "context": "Can you play multiplayer offline with another player like in COD black ops?", "response": "I m not sure, haven't played multiplayer online or offline team deathmatch that much.  But there  are customization option for you to play on or offline, there is an option for you to allow or not allow other online pkayers to enter your game"}
{"product_id": "B00FLZ4FS2", "context": "Will you ship the case or just email the code?", "response": "They ship the case"}
{"product_id": "B002MRUROI", "context": "Does this work on xbox 360 slim", "response": "no the slim has got a built in cooling fan in it.thank you."}
{"product_id": "B003VAHYQY", "context": "Is it compatible with windows 8?", "response": "Yes. Go to http://www.logitech.com/en-us/support/gamepad-f310?crid=411&osid;=14&bit;=64 for the controller, click downloads in blue, and underneath the controller image you will be able to choose windows 8 (32 or 64 bit) for the drivers. I'm sure they are on the cd provided too. If not, you can just get them off the site."}
{"product_id": "B009RXUOD4", "context": "Can I use this by connecting it directly into my ps4 controller", "response": "Yes, it will connect directly to a ps4 controller."}
{"product_id": "B00HHAIY72", "context": "It looks like the theres backlighting on the throttle controller. Is this device backlit?", "response": "Yes, the Throttle is backlit green, the Flight-stick not so obviously (only visible from certain angles)"}
{"product_id": "B00BGA9X9W", "context": "CAN BE THE PS4 CONTROLLER USED FOR PS3?", "response": "can the ps3 controller work for the ps4"}
{"product_id": "B006PP4136", "context": "Is this starter kit made for the Original PS Vita or the PS Vita 2000/Slim? If not, which accessories that come with it fit the PS Vita 2000/Slim?", "response": "It is for the Original PS Vita, I don't know about the accessories. Honestly it's not that great of a kit I only used the screen protector and the cleaning cloth. The case provides almost no protection the ear phones were uncomfortable and the memory card is too small to be of any actual use."}
{"product_id": "B009JZ04BC", "context": "As a right handed user, do the side buttons on the right side get in the way when playing games? Does your finger rest on them thus pressing them?", "response": "i am right handed and i actually am looking specifically for a mouse with right side buttons, i use the front one for the push to talk chat in games. you learn how to use it if you want or to not use it at all."}
{"product_id": "B008TP1OKI", "context": "Will this Hard Drive fit my \"Xbox 360 E\" not slim, but \"E\"? DO I need anything else or just the drive?", "response": "Hi I'm not sure because we have the slim. I only required the hard drive. No additional pieces."}
{"product_id": "B003EUPCZG", "context": "Does this left handed mouse click on the right side so I can rest my whole hand on the mouse and click with my index finger like righties do?", "response": "This is a right handed mouse, not a left handed."}
{"product_id": "B003VAM392", "context": "does it work on steam? and is there the deadzone problem?", "response": "It's worked with every Steam game I've played so far. I haven't noticed any dead zone problems with the games I've played, the response is adequately precise"}
{"product_id": "B00CERXJNW", "context": "This keyboard looks as if it sits in a try.  Can it be removed from this tray, sacrificing the media keys above the function keys?", "response": "The keyboards near is a solid piece of aluminum. It's not modular."}
{"product_id": "B004HYIAPM", "context": "Do you have to insert the CD into the computer every time you play (like Sims) or is it just used for downloading the game?", "response": "Its a downloaded game. It runs through Steam and is very easy to install! You can use Steam for most downloaded games. Its a Great copy"}
{"product_id": "B00A378L10", "context": "There have been people having problems with which cherry mx switch they ordered. Did the people that ordered brown cherry mx keys receive that?", "response": "Indeed, I received brown and ordered brown. I couldn't be happier with this keyboard."}
{"product_id": "B00FATRKOK", "context": "what features make it a holiday bundle package as opposed to a standard package?", "response": "It was supposed to come with Halo (which it did), a token for Tomb Raider (not there) and a free subdcription to Xbox Live (got that)."}
{"product_id": "B000BT4CF4", "context": "compatible with vista 64bit? Can someone tell me if this will work with vista 64bit?", "response": "does this work with windows 7 64bt? plz someone answer cause i dont want to have to look through more gamepads with bad calibration problems."}
{"product_id": "B00BQWTGIS", "context": "My husband really likes this game.  Can someone please suggest a couple of other games that are similar?  I'm Christmas shopping.", "response": "Yikes, you guys apparently don't know how to read. He said \"similar games\"Some similar titles would have to be -Grand Theft Auto V (similar gameplay) -Batman Arkham Series (batman has some hacking to it)"}
{"product_id": "B0050SYDEQ", "context": "Is this better than the second one on Xbox 360?", "response": "I think it is but that's just my opinion"}
{"product_id": "B001COU9I6", "context": "does it last long", "response": "I've had mine since 2008 and it still works fine."}
{"product_id": "B00GZ1GUSY", "context": "I did not receive a game booklet inside the case. Was it left out or did the game not come with it?", "response": "I got one with it."}
{"product_id": "B00CMC6HCY", "context": "Is this game easy enough to pick up and play? My son is 6, loves WWE, but I'm not sure if this is too advanced for him.", "response": "My 6 yr old son plays this game all the time with me. There is a learning curve with the game. It doesn't come with a manual, you have to download it from the games site"}
{"product_id": "B0073QM45I", "context": "If i plugged this into my 360 controller and then the usb into my pc could it be used as a wired controller for pc gaming", "response": "My son tried this. It does not work. There may be some usb drivers available that would make it work but we have never looked."}
{"product_id": "B00CPKUV7K", "context": "What is the area code for the game? Is there a PAL region code?", "response": "I have no idea of what you are referring to."}
{"product_id": "B000B6MLTG", "context": "would this fit a xbox 360 slim need help?", "response": "I am using it on a 360S"}
{"product_id": "B00F9RGFEY", "context": "I just want some clarification. Some customers are saying it works on Xbox One. The advertisement does not. So, is it compatible or not?", "response": "Yes it does, I bought mine after the Xbox1and ps4 release, it works for Xbox one and the ps4, also PS3, Xbox 36, android, iPhone, wirelessly and any headphone jack item."}
{"product_id": "B003Q55Y5C", "context": "Is Multiplayer still online ?", "response": "Yes, granted there aren't many game servers, but they are still there. An you can still host your own game server and let others log into yours."}
{"product_id": "B0044DJZ0A", "context": "Is the Shift Gaming Keyboard  or Keyset gaming Keyboard?.  I have the Starcraft II keyset and need the SHIFT keyboard in order to it works. Thanks.", "response": "The shift keyboard is a gaming keyboard. Each keyset is customized for its corresponding game. You do need the keyboard for the keyset to work. You remove the generic keyset that comes with the keyboard and replace the custom keyset for the game you've chosen. Hope this helps!"}
{"product_id": "B00CMQTVUA", "context": "Does this come with a controller?", "response": "yes but it doesnt come with a play and charge so i recommend getting one of them"}
{"product_id": "B000ZKA0J6", "context": "So this is like Warcraft you have to play on line.. I hate that", "response": "It does have a story mode."}
{"product_id": "B00GHTP4ZY", "context": "does this include the main game plus the expansion or just the expansion???", "response": "it is the main game plus the expansion"}
{"product_id": "B00AIALGZK", "context": "is this download the full game or a free trial", "response": "This is the full game,  a demo is available at their website WWW. Eurotrucksimulator. Com"}
{"product_id": "B00FBV6V56", "context": "Soooo does the xbox one have Dolby Digital 5.1 yet for thees to have surround sound ?", "response": "yah use just have to change the audio settings on your xbox one to dolby digital"}
{"product_id": "B004SJFJUA", "context": "Can this be used for a DSi?", "response": "nooopethey have different batteriessorry hun"}
{"product_id": "B004RMK4P8", "context": "hello, the code they send me to my mail? live outside the US, but my account is USA", "response": "So far as your account is USA, the code will work"}
{"product_id": "B0057SDCLY", "context": "how can i use this with the xbox 360 e if i am using hdmi", "response": "Hello, The Trigger headset comes equipped with an HDMI adapter that will allow for the RCA connection to be bypassed."}
{"product_id": "B00FEDP968", "context": "Can you use the headset and 5.1  speaker ports at the same time?", "response": "You can use only 1 at the time. There is a button on remote control to to switch between speakers and headsets."}
{"product_id": "B00DT55P94", "context": "Are all full games?", "response": "Yes, 4 discs and a code to download megaman10 from psn store."}
{"product_id": "B00BGAA3S2", "context": "Is this just an upgraded version of the Playstation Eye? I play the champions game, will this work better than the eye?", "response": "As on date Champions games does not work for PS4 nor PS4 camera.."}
{"product_id": "B002BSA20M", "context": "can this be played online with friends", "response": "yes if you have a gold membership"}
{"product_id": "B00DCDZM2I", "context": "Does this include the actual disk to play the game, or just the characters?", "response": "The game disk is also included"}
{"product_id": "B007OVHW90", "context": "Are the end connectors 2.5 mm or 3.5 mm?  My son's X31 uses 2.5 mm and a white talkback cable.  Newer X31 models appear to be 3.5mm.", "response": "It's 2.5mm, I too have an older set of X31s and this cable works great."}
{"product_id": "B002I08UGQ", "context": "How can I just get the stylus in the picture. thats all I need. not the normal got to target get a stylus, but that fat one in the picture.", "response": "I would suggest game stop or something like that."}
{"product_id": "B005BLAJRC", "context": "Do we need a \"joystick\" type device or will the games work with just a mouse?", "response": "The mouse works just fine. So does the touch pad. Enjoy the games."}
{"product_id": "B00BT9B2LC", "context": "is the LL have the same size of game cards as Xl?", "response": "yes. LL is essentially the same as XL - same dimensions, game cards are the same size etc. except you can only play Japanese 3DS games on LL"}
{"product_id": "B00CH923NE", "context": "is it  Japanese version or American version？", "response": "From what I've seen it is the American Version, however I don't really know how to tell them apart."}
{"product_id": "B002I0H2AG", "context": "I have a 4GB xbox 360e but I have a 36GB flash drive do I need a hard drive to play this game", "response": "No, is not required you can play this game even if you don't have a hard drive... I play on a 4 gb xbox too"}
{"product_id": "B0015PHMFU", "context": "Hello, do I need to buy a universal adapter as well... for this univeral controller to work with my PS3? Thank you!!! :)", "response": "It comes with a USB Plug and a PS2 Plug."}
{"product_id": "B00B15EXJC", "context": "Is this rechargeable or does it use batteries?  If batteries, what size and how many? Thanks!", "response": "Hello Bill, yes it is rechargeable I normally get about 7 to 10 days of play from mine. 2 hours a few days during the week and a good 7 to 8 on the weekends."}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "It will come out in November and will now be bundle with MotorStorm: Apocalypse instead of Resistance 3: see FAQ on this page http://us.playstation.com/ps3/accessories/sony-playstation-3d-display-ps3.html"}
{"product_id": "B002B9XB0E", "context": "If I buy two of them and plug each one into a usb port, I should be able to play 2 player games like this, correct?", "response": "I want to say yes, because on the emulator I use (BSNES), it gives you the option to use two controllers. BUT, I really don't know."}
{"product_id": "B00005QEFD", "context": "Does the system come with the game where the bunny chases carrots?", "response": "No it does  not"}
{"product_id": "B00D96BPL0", "context": "Anyone knows if it works on a wii u?", "response": "Yes it will work on a Wii U. Just unplug the headset from the inline amp and plug it directly into the Wii U's 3.5mm audio port. Easy Peasy. The Marvel Seven is a great headset, I actually use one at my desk every day for phone calls and video chat."}
{"product_id": "B00EM5UFF4", "context": "What's the difference between physical disk and digital download? Why the physical disk one is more expensive?", "response": "With the physical disk you can re-sale/trade-in. With the digital download you can't."}
{"product_id": "B00G0OYHCW", "context": "If I paid to download old games on my Wii, can I download them again on the WiiU for free?", "response": "So are you asking that if you do not transfer your Wii data to the Wii U console, can you go to the Nintendo eshop and download the games again? You can, but it is definitely not free, that's why they have you transfer all your data"}
{"product_id": "B004HYIAPM", "context": "Do you have to continue buying subscriptions if you buy the CD or does buying the CD give you unlimited time to play?", "response": "It gives you unlimited time. The only elder scrolls game that you have to pay a subscription for is The Elder Scrolls Online."}
{"product_id": "B0091WIOJ2", "context": "Can I use it for xbox one?", "response": "Audio yes but there is a catch for the mic to work. Unlike the PS4 and PC which work out of the box, you'll need to plug in the included audio cable from the headset to your Xbox One controller for chat to work. It's an xbox limitation and not an Astro limitation."}
{"product_id": "B0050SVHZO", "context": "Does it come with the gamepad?", "response": "Yes the game pad has a red case on it."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "Funny this came up.  The Classic Controller broke about 5 days ago.  A wire broke down next to the connector which is plugged into the regular controller.  Just threw it in the trash.  I think we had it about 3 or 4 months."}
{"product_id": "B00GHTP7SS", "context": "How do I get the game to recognize and allow the use of a xbox 360 game controller?", "response": "Is the controller wireless or wired? Or have u used the controller on other games before"}
{"product_id": "B002I0HJG8", "context": "Is this the Veteran code which can make me have 8characters?", "response": "It would allow you to have 8 characters on a single server, yes."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "I don't know. I do not have Windows 8. I hope it is as I'm sure I will have to move up to Win8 sometime."}
{"product_id": "B00ERDGMSA", "context": "will it run on this laptop http://www.conns.com/computers/laptops/asus-vivobook-v551la-dh51t-notebook-v551ladh51t.html", "response": "test it on this website :http://www.systemrequirementslab.com"}
{"product_id": "B00GS6A6V8", "context": "How would this work if buying as a gift?", "response": "What age group I'd say good for 11-17"}
{"product_id": "B00FEDP968", "context": "Does anyone know if this headset works with the ps4 either through Blutooth or by the cable?", "response": "The headset works by cable, I am not sure via bluetooth, however I do not see why it wouldn't work."}
{"product_id": "B00HVBPRUO", "context": "Can you use the wireless and 3.5mm simultaneously? For example plugging into your own music device while playing a game.", "response": "used to watch TV ?"}
{"product_id": "B00DC9SWWE", "context": "Can you turn off the blood? Also can you turn off the voices?", "response": "You cannot turn off the blood"}
{"product_id": "B009UCGVZC", "context": "Is this a Wii game", "response": "Yes and it is also for the wiiu and playstation 3"}
{"product_id": "B0058GMO0A", "context": "will this work on windows 7.1", "response": "I have played it on Win 7, and on Win 8.1, so I'm sure it will work for you.  Have fun."}
{"product_id": "B003Q9RGRW", "context": "Does it come with the headset", "response": "No. No it DOES NOT come with a headset. Whomever wrote \"Yes\" below is a jerk."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "This will not work as it is wired to a USB male end. N64 emulator, yes. Original N64 console, no."}
{"product_id": "B000HZFCT2", "context": "does it work for minecraft?", "response": "David H. seems to have more info, and probably played it on PC as well I'm guessing. But for it to not even have support is kinda weird/unheard of. Surely by now there is support for game pads seeing as this is one of the most popular games ever. Check the minecraft website to be sure."}
{"product_id": "B00ACMM9BO", "context": "can you send me instructions on how to program my controller i didnt get nothing with it", "response": "Can you give me the order ID or your email for me to send the instructions to you?"}
{"product_id": "B00GOOSORM", "context": "do u need it if u buy the ps3game", "response": "Yes, every version of Final Fantasy XIV : A Realm Reborn requires a subscription to play."}
{"product_id": "B00I14395A", "context": "This item as a combo is $157.99. They are separately (Mouse MX for $67.39 and K800 $64.99) $132.38. Why?", "response": "Have the same question.  Even Best Buy has them on the store shelves for 69.99 each.  And the combo should be significantly less since it probably only has 1 transceiver, and 1 extender cable."}
{"product_id": "B000VTQ3LU", "context": "Do you need a PSMove controller in order to operate the PSEye camera itself?", "response": "Technically, no, it will work on it's own, but in such a limited manner you are best off picking up a move controller."}
{"product_id": "B001CXYMFS", "context": "How long is the USB cord?", "response": "From using a tape measure, I came up with 102 inches or 8 ft. 5 inches."}
{"product_id": "B0050SYR74", "context": "is this for just the head set or dose everthing come with it", "response": "Everything you need to set up and use it comes with it."}
{"product_id": "B0029LJIFG", "context": "if i buy this product today can i use it next year? in other words my xbox member ship has about 6 months left, so can i buy this now and use it later", "response": "gold memberships do not expire. My iy can also redeem it now and it adds on to your membership."}
{"product_id": "B004RMK4P8", "context": "Is this going to work in Europe", "response": "It only works in US PSN accounts..."}
{"product_id": "B009IR1SR0", "context": "If I download this game on my current computer and eventually upgrade to a new pc, will I be able to transfer the game ?", "response": "Yes, you create a user name and password with ea games so on your new computer just log in and download."}
{"product_id": "B007C3E5WM", "context": "Does it work with windows 8?", "response": "Yes it works fine with windows 8"}
{"product_id": "B00CMQTVK0", "context": "If I was to buy the used like new day one edition will I still be able to get the day one achievement?", "response": "If it is factory refurbished I would say yes. Used in any way, probably not. You'd have to email the seller and ask. I doubt the piece of paper with the code is in the box of a used system."}
{"product_id": "B0089NVTDM", "context": "Will it work on a Mac?", "response": "I don't know...  Using it on a PC"}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "I just bought a Vita slim and this case, and the Vita fits absolutely perfect in the case. I'm not sure if some of the other reviewers got cases that were designed for the older Vitas or what. All I know is this case fits great and I couldn't be happier with the case for the price."}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "With the headset adapter it will"}
{"product_id": "B00FAN4LRA", "context": "The website says that this product includes a free hard case with it, is that the same for amazon?", "response": "I did not get a hard case."}
{"product_id": "B005G4CXPK", "context": "Can someone post the minimum and recommended system requirements? Can believe AMZ doesn't have that posted.", "response": "If you go here http://www.game-debate.com/games/index.php?g_id=18&game;=Assassins%20Creed you can find the information you need. There is also a calculator that allows you to enter your PC info into and the result is your custom answer."}
{"product_id": "B001IYR53W", "context": "Will it work on Windows 7?", "response": "Yes it does work with Windows 7 - that is what I have."}
{"product_id": "B005S0KH7I", "context": "What's the difference between this one and the standard G105 that goes for ~$55? Just a logo and green lighting?", "response": "Yes that is correct. Thanks."}
{"product_id": "B000IZAQD8", "context": "does this come with two controllers?", "response": "No, only the one."}
{"product_id": "B00FLLFJ68", "context": "Will this work if i have a silicone case on my controller", "response": "Not sure...the charger has a little plastic adapter piece that fits onto the controller.  It's fits pretty tight on the controller.  If your case is very thick...I don't think it will work."}
{"product_id": "B00FLZ4FS2", "context": "code for xbox because one does not work? I feel cheated", "response": "create a temporary xbox live account(trial) and then go and add the code for the game and use the xbox to download.  I felt the same way for months after buying this but stumbled upon a trial Xbox ONe live membership and started trying to download etc..."}
{"product_id": "B00111SFEU", "context": "does it work on a computer", "response": "Honestly don't know would not stay connected to my ps3"}
{"product_id": "B0096DMDXY", "context": "Is this product for lefthanders?", "response": "Pam, No it is not...However Logitech might make a lefty....Jay"}
{"product_id": "B008RA5DIY", "context": "If we purchase Quickbooks from Amazon, does Intuit still provide support?  They tell me that you may not get their actual product.  Is this true?", "response": "I purchased Quickbooks from Amazon and got exactly what they said it was, Quickbooks. The support comes with the product and not the sales vendor."}
{"product_id": "B00BMFIXEW", "context": "So, to clarify, this has online gaming with friends, right?", "response": "Yes it does. My daughter plays with her friends all the time online. As a matter of fact, that's how she found this game. Her online friends told her about it."}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "yes it will  it is for pc and ps3 its a great wheel and I also purchased the other two wheels which are add ons,have fun."}
{"product_id": "B00CPKUV98", "context": "is this the full game for this price seems to low of price?", "response": "It's the full price and game. It's not entirely terrible if you get for Xbox One or PS4. It's not bad on Xbox 360 or PS3, just the graphics have been severely dumbed down. The story and gameplay are what really matter."}
{"product_id": "B00EVWZHLK", "context": "Do the xbox 360 achievements still activate? Is this all three games in one place, or is it like they took each game disc and put it in one box?", "response": "The achievements do still activate, and it's just the discs for each individual game in one box."}
{"product_id": "B00B5QLS4A", "context": "can I set the side buttons as keyboard keys? e.g. side button 1 is \" R \" , so if I press that, I can reload in games", "response": "Yes, you can completely re-map all keys to key bindings and macros, 5 or 6 profiles too.  The other nice thing about this mouse is metal construction.  If your pads ever wear out for some un-godly reasy.  the bottom is smooth as well and will keep mapping"}
{"product_id": "B00GY4OAM0", "context": "Does this game require the use of nunchucks?  Or can I use a classic controller and Wii U gamepad?  Nunchucks never work long for us...", "response": "You use the Wii U gamepad for player one, however if it's two person you use the classic controller with a nunchuck for player two."}
{"product_id": "B00A878J5I", "context": "My son damaged the original charger cord for the Wii u pad , the one that comes with the system . Will i have to replace it now that Im buying this?", "response": "You no longer need the one that came with the system... the energizer will charge the pad."}
