{"product_id": "B006RJ373K", "context": "Can I use with \"Windows 8\" without any problems ???", "response": "Yep, it works perfectly on Windows XP, 7 and 8. I use it on my Windows 8 machine with no issues."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes there is not a problem playing any game from another country on your ps3. Just go on gamefaqs or youtube for translations and have fun, its a great game!!! I would also recomment Full Boost thats the latest gundam game and it is amazing"}
{"product_id": "B00GHJ6X8G", "context": "are the cooperstown all time greats included ?", "response": "I have not seen legends, or Cooperstown all time greats in the game."}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "its pre configured so you can just plug and go, it's only compatible with xbox 360 S and E models though"}
{"product_id": "B00A1Y2STQ", "context": "Does the keyboard light turn off when the computer goes to sleep?", "response": "I have the red version of this, its exactly the same except for the color of the lights, they stay on if your computer is on stand-by but should turn off if it is in sleep mode"}
{"product_id": "B004EJ0L8E", "context": "What do you put the headset into USB or audio jack?", "response": "Hi,Its a very nice headset in quality...  Sound is very good for the money...  Its not USB so just plug the jacks into your soundcard or motherboard into the headphone and mic jack...  Great product..."}
{"product_id": "B007JDMPOK", "context": "If I already have Tera on my laptop, can I use the code to get the goodies, and use the disk to install on another PC?", "response": "You can install Tera on as many PCs as you like. However, the code of goodies is tied to your online account with which you registered on Tera (eg. Mark@someemail.com). Hope this helps."}
{"product_id": "B00DC9T2J6", "context": "With Titanfall for PC ... are you playing against XBOX One, etc, players? Also, can you pull your game data from XBOX Live account (I take it not)?", "response": "To answer my own question (after the fact) ... With the PC version, you are playing against other PC players. You cannot pull from or use your XBox Live account information nor pull your game data from there. Two completely different universes, though the game plays the same exact way (sans controller v. keyboard/mouse thing)."}
{"product_id": "B0076HD2W8", "context": "Will this still work without a CD Drive?", "response": "Yes you can just go here http://www.microsoft.com/hardware/en-us/d/xbox-360-wireless-controller-for-windows download"}
{"product_id": "B003OZOAKY", "context": "do i need the original total rome before i buy the gold edition?", "response": "I have both copies,  the Gold has a lot better graphics and situations.   I have Win 7 OS.  I believe you can get into the game better with Gold.  But if you just want the less costly original that is ok as well.  Hope this helps. LD"}
{"product_id": "B004H7P0B6", "context": "If your joystick is worn out (i.e. stick is wobbly or loose) will this replacement piece fix that?", "response": "It will not. A wobbly stick is caused by the joystick box, the thing you plug the rubber piece into. To fix a wobbly stick you either have to get a new controller or solder a different box on."}
{"product_id": "B0050SY4DG", "context": "The game comes in several languages?", "response": "I can't answer that. You should go to their website to ask. However I think the game SuckeD!!!!"}
{"product_id": "B0057WDBHA", "context": "What is the shipping weight for this stick? Is it really 4 pounds?? I'm from Venezuela so the shipping weight is critical for my purchase!", "response": "yup.   fantastic stick too"}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "Because the Nintendo 3DS is region locked. 3DS units will only play games from the same region they were released in. I.E. North America, Japan, Europe."}
{"product_id": "B005764CWO", "context": "Does this count as a dual shock 3 controller?", "response": "not sure what you mean but it doesn't have SIXAXIS and the rumble function works nicely also I have made quite a few videos on YouTube with it its the controller I use the most on the ps3 I hope that answered your question"}
{"product_id": "B003O6E986", "context": "Does it have split screen so that 2 people can play at the same time on same screen?", "response": "As a matter of fact, it does =)"}
{"product_id": "B00GPH7Y8S", "context": "How does it compare with the old Panzer General?", "response": "Game wise.i didnt like the game at all..I play the game for 5 second and turn it off.more like a kids game..david.new Zealand."}
{"product_id": "B0098W4ZD4", "context": "Does this work with Linux?", "response": "I used it on Mint, and got it working, but it didn't perform as well as it did on windows. It broke and they wouldn't honor the warranty so I can't test on my current distro. I would say go with something else for Linux."}
{"product_id": "B0098W4ZD4", "context": "will this work with windows 8 ?", "response": "i guess so, i have 7 and works 100%"}
{"product_id": "B00BY0G0YU", "context": "i know this is a 2 game pack but when i had final fantasy x2 it had a music video intro which i liked a lot does the hd version of x-2 also have that", "response": "If you are talking about the opening that leads to the first fight with the yuna imposter then yes."}
{"product_id": "B0099OZR9W", "context": "Just bought an xbox 360, it says it is xbox 360 E console but is E the same as the slim model?? If so will this Hard Drive fit in that xbox 360?", "response": "Yes it will. it fits in slims models and 4gb models. I bought mine about 3 months ago and am very happy with it."}
{"product_id": "B006NU6HAS", "context": "is the aerosoft  pmdg 737 ngx the same as pmdg 737 ngx", "response": "Hi, Aerosoft GmbH and PMDG Simulations,LLC are Partner trademarks and brand names related to this software."}
{"product_id": "B000RT2868", "context": "Will this work with the Street Fighter Anniversary Arcade Stick (Original Xbox) to Xbox 360?", "response": "no i didn't get that product i don't know what the adapter is for that was sent to me. does not fit my xbox controllers."}
{"product_id": "B009Q8PP16", "context": "is it compatible with black ops 2 and how would you program it to the game if it is possible", "response": "Don't buy it, controller broke in less then 2 months. Sticks stopped working to move around. Couldn't get my money back."}
{"product_id": "B002LARYGA", "context": "Can you use it to change channels if you have time warner cable box?", "response": "Yes you can set it up for your cable box, works well."}
{"product_id": "B00DC7O3K6", "context": "will this game work with a normal wii, or only wii u?", "response": "Only Wii U and you must have the new motion senstive controlers, too.I was a tad ticked off when I bought the game only to find out I needed to shell out another $80 for motion plus controlers!"}
{"product_id": "B00726ARTE", "context": "is this 4 xbox 360 or ps", "response": "its more for your phone or tablet comes with an adapter cable for laptop for the built in microphone"}
{"product_id": "B001COU9I6", "context": "what it is the model ps3 cech-xxxx?", "response": "What do you mean by this \"Hello, The model is CECHE01. This thing only lasted 3 months after I got it. Thanks\""}
{"product_id": "B00A8HIGSS", "context": "Is Motion Control required to Play this?", "response": "Not on PS3, I don't know about any other versions."}
{"product_id": "B0090WBXSM", "context": "Does this controller work with a Nexus 7?", "response": "Yes it works good on my nexus 7."}
{"product_id": "B00C7103DO", "context": "i want to buy this game but i want to know if i buy this specific product does it come with the deathstroke dlc?", "response": "No bro, you need to buy the deathstroke dlc"}
{"product_id": "B00D6PTMSW", "context": "Is there a left mode? I'm left-handed and have been itching to learn guitar but don't know how to go about it.", "response": "yes, you just have to go to settings"}
{"product_id": "B000FP0K0U", "context": "Will this work with Windows 7?", "response": "yes I have 7 on the pc that I installed it on"}
{"product_id": "B004HYK8Y8", "context": "I see all reviews are from 2011. It's 2015 Have they fixed the bugs in this game yet? Considering purchasing but sounds risk.", "response": "Its still buggy but its still good and still works except for the occational crash"}
{"product_id": "B008L3UUPS", "context": "Does this work with other games? Not just the retro emulator games?", "response": "This controller is most likely a DirectInput device. It should work on any game that accepts DirectInput.Many developers have adopted Xinput since the release of the Xbox 360, so it will not work directly on a game that requires an Xbox controller, but there are programs like X360ce which can emulate an Xbox controller."}
{"product_id": "B0094H8H78", "context": "Where do I find games to download onto the SD card?", "response": "I have 1000+ games on my SD card. It's awesome! Feel free to contact me if you need help. Best of luck to you."}
{"product_id": "B009WGUYIG", "context": "Can this be used on the wii?", "response": "Yes. All skylanders figures are compatible with all platforms/consoles/game systems. We use this guy on our PS3 and Wii."}
{"product_id": "B0096L2SJ0", "context": "Has anyone tried this on the Galaxy S5??", "response": "Works perfectly on an S5"}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "Yes, it will work on Windows 8.1"}
{"product_id": "B00E8JZILA", "context": "Would any one recommend or strongly object to the idea of a 12.5 year old boy playing this game if he says he, \" I can handle it.\"", "response": "no its rated m this game freak me out and I am 35!"}
{"product_id": "B005QUQP94", "context": "Does it work with windows 8?", "response": "It does work with Windows 8 very well with no problems."}
{"product_id": "B00166N6SA", "context": "Will this work on a windows 8.1 computer?", "response": "It appears that it will but I am running a MacMaybe you can search around on Google... Top result was:Windows 8.1 compatibility for The Sims 3 version 1http://www.microsoft.com/en-us/windows/compatibility/CompatCenter/ProductDetailsViewer?Type=Software&Name;=The+Sims+3&ModelO;rVersion=1&Vendor;=EA&Locale;=1033&LastSear;chTerm=&BreadcrumbPath;=The+Sims+3&TempOsi;d=Windows+8.1"}
{"product_id": "B0054JGGGY", "context": "Does this come with a bluetooth doggle or does the charging stand act as the receiver?", "response": "The Razer Mamba is a hybrid design wireless mouse where the charging station acts as the receiver for the mouse signal. The USB connection on the charging unit is also the same cable you move to your Mamba to put it in wired mode."}
{"product_id": "B00ATF5YYI", "context": "Does this have the nazi zombies on it?", "response": "I eon't remember it in World at War. There's a White House standoff in Modern Warefare, tho."}
{"product_id": "B00HG0B8NA", "context": "does it run on Windows 8", "response": "Yes, I think so.  I just downloaded it onto 8.1, and it is running fine."}
{"product_id": "B00B3PDH5G", "context": "is this compatible with xbox one", "response": "Yes but you will need to buy a turtle beach headset audio controller for chat functionality"}
{"product_id": "B00D96BPL0", "context": "Is there an option that let's you change your voice?", "response": "I do not believe so, however, there is software available for that purpose."}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "Yes, the Vita isn't region locked."}
{"product_id": "B00886XQNQ", "context": "does it work for xbox360", "response": "I'm not sure, sorry."}
{"product_id": "B00DHF39KS", "context": "If i buy this now will it come with the doom beta?", "response": "It came with mine. I bought it last week."}
{"product_id": "B0072HYRNK", "context": "Does this come with a USB cable for charging?", "response": "Mine did NOT come with charging cables..."}
{"product_id": "B00G0OYHCW", "context": "in the wii u can i play with that games of the wii and gamecube like in the wii?", "response": "You can play Wii games on it but not Gamecube games!"}
{"product_id": "B009AGXH64", "context": "Can I use the original Wii controllers (The ones that are NOT \"plus controllers\") with the Wii U?", "response": "Yes you can. However certain games do require the motion plus, but a large majority of them do not."}
{"product_id": "B00FB4BXGA", "context": "Does it have media keys? Like Volume control, FFW?", "response": "Yes, it have, is really completely, the best mechanical gaming keyboard."}
{"product_id": "B00ATF5YYI", "context": "will this play on win8", "response": "I don't think so, I having problem now with windows 7 64 bit services pack 3, I have to stop playing the game . I doubt it.."}
{"product_id": "B00D96BMV8", "context": "Is the mic detachable?", "response": "Yes but leave it in a safe place so you dont lose it"}
{"product_id": "B002I0F5I2", "context": "When the DLC content codes game expired?", "response": "I'm not sure when it expires, but I would guess that it already has? All the DLC is for multiplayer, so if you're like me and are only interested in the single player campaigns, then no need to worry about."}
{"product_id": "B001CC8UBG", "context": "Works on windows 7?", "response": "Yes. Many people have it on windows 7"}
{"product_id": "B00DB9JYFY", "context": "Does this game offer two-person co-op?", "response": "The entire game is multiplayer. You play either on the side of the militia or the IMC. You can create a party with your friends and join a game to play against other players. That party can have up to 6 players in a game on one side."}
{"product_id": "B000FQ9R4E", "context": "After playing about 3 games, the game seizes up and won't let you play anymore and you must shut the whole Wii off. Anyone else have this problem?", "response": "No, my grandsons do not have that problem. They have been playing with this game for 2 months. Sorry you are having a problem."}
{"product_id": "B001V9PTVE", "context": "do these games work on windows 8?", "response": "Yes, but save your money get game from steam"}
{"product_id": "B00AR1LX9O", "context": "Will this work on mobile phone?", "response": "As far as I heard yes and if anyone was wondering no it's not Xbox One compatible only works for the ps3 xbox 360 and PlayStation 4 audio only"}
{"product_id": "B00EHBKUTE", "context": "Does the Tartarus gamepad have the glue issue horror stories on the palm rest that I've heard about the Orbweaver?", "response": "Not sure what the issue is about, but I've had no problems. Just checked mine, the wrist rest is working fine, the button to move it works and it slides freely between it's two positions. Works perfectly for my small hands."}
{"product_id": "B005LN5UOC", "context": "is it compatible with cellphones?", "response": "Yes it is compatible with smartphones, now it only works to talk during your phone call, you can not receive calls through it, but other than that, yea i have an lg smartphone and it works fine."}
{"product_id": "B00005B8G1", "context": "I have seen a device called the GBA Worm Light (Screen Light for Gameboy Advance) does that mean you need light on the screen to see the game?", "response": "I've not heard of the GBA Worm Light. It is not required to see the game. :)"}
{"product_id": "B001DNGCN2", "context": "does this fan fit the 60 gig ps3 or the 40 gig ?", "response": "The fan will fit any fat model ps3.  It will not fit on the ps3 slim or super slim."}
{"product_id": "B00B3FIXJQ", "context": "how do you know the mods are onwhen you press the sync buntton and what color is each mod", "response": "The blue on the center button will be on if the mod is on. And to see what mod you are using when you change it it will flash as many times for the mod.."}
{"product_id": "B003ZSN600", "context": "Is the end cable USB or do i need a USB dongle for PC use?", "response": "The controller comes with a USB adapter, so you do not need anything for PC use! I also use it for PC games only."}
{"product_id": "B00AWEMODK", "context": "Is this game downloadable content or would I actually be buying disks to download.", "response": "Its downloadable software, not discs.  It includes a key to register an FFXI/POL account."}
{"product_id": "B0050SVHZO", "context": "Can you play Super Smash Bros. Brawl?", "response": "Yes you can. My son ulocked all the character in his Wii. We did use the transfer tool to keep all our save files from the Wii to Wii U and it worked perfectly!"}
{"product_id": "B00G6CLZPA", "context": "Are the voices in japanese ?", "response": "Yes they are, although the text in the game and menus are all in english."}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "The first 2 did not work on my old Win7 laptop.That was 5 years ago."}
{"product_id": "B003O6EDSM", "context": "For how many players is this game?", "response": "It's a single player experience"}
{"product_id": "B00EEMLRTS", "context": "If I bought this and bought a xbox one later, can it be transferred later? I had read somewhere that it was possible.", "response": "Yup! You can transfer your account to another xbox!"}
{"product_id": "B003V4AK8E", "context": "I just bought this but it wont cut on does this need batteries?", "response": "No its wireless make sure the sensor is properly plugged in to the usb port, it may also just need to be charged"}
{"product_id": "B002XLR0JI", "context": "How many volts and Ma does it use? *Is noted on the back :)", "response": "5 v 250 mA"}
{"product_id": "B005DKZSVS", "context": "I bought one but the software can not run correctly. It doesnt work now. Where can I get help? I have visited the website of mad catz and ambx", "response": "I called cyborg and was told to send them back to amazon. I however found that deleting the software ALL the software and there is like 7 pieces and reinstalling works. Don't bother with madcatz software it's useless just install ambx."}
{"product_id": "B00EOPT5ZS", "context": "Can it completely replace a computer mouse and do accurate mouse arrow movements, right and left clicks?", "response": "No - it's very clicky in each of the four directions, and slightly sticky.  I've found that even just using it as arrow keys is difficult, w.r.t. getting precise motion."}
{"product_id": "B00FEDP968", "context": "Can you use the headset and 5.1  speaker ports at the same time?", "response": "You can only use one at a time. There is this button called \"SPEAKER\" that switches between the ehadset and speakers."}
{"product_id": "B00CD1FCAC", "context": "Is the USB on the back 2.0 or 3.0?", "response": "it works for both"}
{"product_id": "B00I9GARIM", "context": "Is this headset comfortable for wearer of glasses?", "response": "Not really but they are confortable"}
{"product_id": "B002TLTBN0", "context": "WIll these classic controllers when plugged into the wii remote, be compatible with Smash brothers?", "response": "Yes they will, and they work perfectly"}
{"product_id": "B006RJ373K", "context": "Do all switches and buttons work properly and do what they are supposed to?", "response": "First things first-- just download the free demo at x-plane.com. That will answer almost all your questions :)I've only tried about half the planes so far, but yes all the switches that'd you use in real life work. Even switches for 'little things' like turning on lights in the cabin, defrosting the windshield, switching fuel tanks, landing lights, etc."}
{"product_id": "B0095P5K8I", "context": "So i bought this mouse two months ago and now its completely not cooperative. The light turn on, but the cursor is stuck in the middle. i cant move it", "response": "Same thing happened here, i tried uninstalling the drivers and that did not work either. This is the second time i bought this mouse and it just died after 2 months. The crazy thing is that it still lights up! like they put more work into the lights compared to the functionality!"}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "Yes, I downloaded on my Windows 7 laptop."}
{"product_id": "B0011DCA6W", "context": "Will this run on Windows 7 (one of the answers seems to imply that it does but it's not explicit)?", "response": "Yes runs on windows 7 just fine.  Make sure to get updates from tillers website."}
{"product_id": "B00FE8WKPQ", "context": "Can I play this on my regular Wii?", "response": "The Balance board should work with your Wii, but nothing else."}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "When I ordered mine, it was the US version. Make sure you select the US version when you order. It's awesome, but little to no support from from PMDG, and it will take many hours to figure it out. it's not the FSX your used to."}
{"product_id": "B00BI9MDSO", "context": "why do half of the people say the vita 2000 fits, and the other half say it doesn't?", "response": "The new model does fit. It's very snug and you have to push the Vita down into the case a little. I have the new model and it works with this case. It can be a little difficult to pull it out of the case, but it's better to have it secure than flying all over."}
{"product_id": "B009AP23NI", "context": "Does this take AA batteries?", "response": "No it is rechargeable via USB."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "I don't know, I have win 7."}
{"product_id": "B00DOD0TZG", "context": "is this bundle a one key activation for all? or does it have 3 separate keys, just asking because i already have infinite", "response": "There are three keys."}
{"product_id": "B00EPZ8POY", "context": "does this game is in english version and the characters speak english too???", "response": "The options are in english caracters speak japanise but they are subtitles so no problem awesome game for usa fans just make sure the video is from uk region free or english subtitle on thr specs"}
{"product_id": "B000ND3XXA", "context": "does this work with Mac OS X too?", "response": "I got it to work."}
{"product_id": "B00BCEK2LA", "context": "how does its size compare to the G502 Proteus Core which I've seen at Best Buy? My grandson is 14 and wants a little bit smaller mouse than some.", "response": "It's a little bit larger than a standard mouse."}
{"product_id": "B00B5QLS4A", "context": "is it compatible with windows 8.1", "response": "I am on 8.1 Right now and it has not been a problem."}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "no，it comes out from both side，you need to mute TV. but you don't need to setup your headset except the first time you might need to update your controller with the adapter connected."}
{"product_id": "B00FYMTUQY", "context": "Will the mount scratch the front of your tv?", "response": "I have not removed the mount off of my television, but there is padding on the mount. I guess that should prevent any scratching on the front of the television."}
{"product_id": "B00J128FPA", "context": "What  is the size of the packing on this edition?", "response": "About 1.5\" thick and the size of a piece of normal printer paper."}
{"product_id": "B004RMK4BC", "context": "Do i have to have a real  US address to purchase this item ?  Thank you ..", "response": "No you do not."}
{"product_id": "B002I0IIPY", "context": "What controllers the sonic colors use", "response": "Wii-mote, Classic Controller, Gamecube, and Wii-mote nunchuk."}
{"product_id": "B00CWFUHT0", "context": "what does cech-4012 stand for.can u use it with any smart t.v-europe or America?", "response": "It means come eat chicken here"}
{"product_id": "B0088MVPFQ", "context": "what is the newest mario for the 3ds", "response": "The Most Newest Game with Mario for 3DS is Yoshi's New Island-based on the Super Nintendo Game Yoshi's Island."}
{"product_id": "B001IYR53W", "context": "I have the 2005 version but it does not have SPIDER,a  solitaire game..does this version have it.  Thanks", "response": "Spider and Spiderette are listed in solitaire games.  That is the only information that I found as I am not a solitaire player."}
{"product_id": "B00E1L78N6", "context": "Did the controller update with little to no improvement for my mic. Did you guys have the same issue?", "response": "I got these for my husband. He had issues with the mic and other players being about to hear him. I got the headphones replaced and the new one had the same issue. I ended up returning it for a refund."}
{"product_id": "B00FWWY1V0", "context": "do they stick without the regular cover", "response": "Yes they do. I am using a controller that came without covers. These things are awesome and compleatly worth it!"}
{"product_id": "B009UCGVZC", "context": "6yr old nephew only wants Skylanders for Xmas.  He tells me is Action Figures (Wii).  Is Legendary 3 pack a good choice for starters?", "response": "This 3 pack would be good for the Giants, Swap Force and Trap Team sets....it is NOT a starter unto itself"}
{"product_id": "B000B6MLSM", "context": "I have a receiver to use my 360 controller on my PC.  Will I be able to use this for my PC also?", "response": "I use my 360 controller for my TV only and haven't tried anything else. I'm sorry I can't be more help."}
{"product_id": "B00475AYUA", "context": "How come it says it has 4 games but when i download I only have 1?", "response": "When you download the \"Package\" it should install all four games with their corresponding shortcuts on your desktop!!! My guess is that your download was interrupted or corrupt. Remove the game from Windows ControlPanel/Programs/Programs and Features. Then, do a fresh download. Make sure your Amazon games and software downloader is up to date."}
{"product_id": "B00BQWTGIS", "context": "What are the bare minimum PC system requirements?", "response": "If you can't run it on recommended settings you should wait.  Pulling the bare minimum will really run the experience, and most likely, your PC if you are not equipped with a good way to ventilate heat."}
{"product_id": "B00BCEK2LU", "context": "How long does the back light stay on? Can you customize it?", "response": "The back light stays on as long as the computer is on. It's customizable for three different colors, one for M1 M2 & M3."}
{"product_id": "B009XZ1CTQ", "context": "my grandson is 5 - can he do this game?", "response": "They came out with farming simulator 2015 which is a lot better. I think once he knows the controls he's in good shape. For games like this, you would need a good processor and graphics cards so the game in simple terms is not choppy, blurry etc. Hope this helps,"}
{"product_id": "B00EOPT5ZS", "context": "Does this work for regular computer/office uses? In other words, not for gaming but for ergonomics when using computer keyboard heavily?", "response": "Sure.  The driver is always loaded.  You can bind the four switches to anything you like."}
{"product_id": "B000IBELZG", "context": "Do it work on the psgo system.", "response": "Yes it will work, but you will have to find a psgo camera adaptor"}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "there is only 1 color. if you buy the black version, the LEDs are red. if you buy the white version, the LEDs are blue."}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "This clip can hold a can of soda, and even my iPad mini.Not joking. However, be conscious of weight off-balancing your controller!"}
{"product_id": "B00GP0HQ3S", "context": "Does this come as shown in the picture without packaging or is it factory sealed?", "response": "It was factory sealed."}
{"product_id": "B0065NP6NC", "context": "Are you required to install disc 2 dlc before playing disc 1? I wanted to play the game without the dlc prior to installing it.", "response": "No, you can play it without installing it. You can also install it at any point in the game. Its just extra missions and gun parts and such. It doesn't change anything too major"}
{"product_id": "B006YDPU48", "context": "IS THIS GAME ONLINE ONLY?", "response": "No, online is built into it.  For the first time through, it's better to play it offline so other players don't invade your world and make your life a living hell.  But at the same time, it's worth being online because you can coop with other players. But as for your question, it's not online only."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "don´t use w8... too slow, but on w7 runs GREAAAT!!!"}
{"product_id": "B00JFCA6V2", "context": "Does this item come with the charger and USB cable?", "response": "Is this the slim model? It's hard to tell."}
{"product_id": "B00DC7G2W8", "context": "Do you need the wii motion plus or the regular wiimote  work with this game?", "response": "Regular Wii remote will work fine."}
{"product_id": "B008TP1OKI", "context": "do you need to have the transfer cable for this hard drive?", "response": "Hi, not at all. The HDD gets installed on a side of the console."}
{"product_id": "B005UI8V6C", "context": "Does it work on windows 8?", "response": "It sure does. The game creates an icon with the link to the game and as long as you save it, you should be fine."}
{"product_id": "B000A2R54M", "context": "Does this game work with the dsi XML?", "response": "Every DS (including the DSi XL) can run this game."}
{"product_id": "B00FOHP8XI", "context": "One review here mentions internet browsing. I realize this PS3 is not a computer per se, but can you surf the internet on it?", "response": "yes, just pull up internet browser in the menu"}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "Yep. I am currently using Windows 8 64bit and it works perfectly, but I looked for the driver and it is installed under the system32 folder, so even though it works without any problems, it is still 32bit."}
{"product_id": "B00004XRBB", "context": "does it work on Windows 7?", "response": "Not on windows 8 / 64 bit"}
{"product_id": "B003RS1A7Y", "context": "does this include the dongle", "response": "It includes what you need to connect it to the game console.  For the PS3 version, this includes the USB wireless receiver.  I believe the XBox and Wii versions don't use a dongle but connect via the console's built-in BlueTooth connectivity."}
{"product_id": "B00CJ7IUGS", "context": "If i buy a used version will i still get all the DLC?", "response": "If you get the disk for it then you should be able too... dont see why not"}
{"product_id": "B007OVHW90", "context": "Are the end connectors 2.5 mm or 3.5 mm?  My son's X31 uses 2.5 mm and a white talkback cable.  Newer X31 models appear to be 3.5mm.", "response": "This is 2.5mm to 2.5mm."}
{"product_id": "B009K7QB8O", "context": "WIll this increase my no scope abilities?", "response": "Honestly I had bad luck with this Keyboard. I ended up biting the bullet and getting a better mechanical keyboard and im glad I did."}
{"product_id": "B00BS520SG", "context": "Will this work while playing Project M?", "response": "Yes. Amazingly. It's like perfect in everyway."}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Hyrule Warriors?", "response": "Absolutely.  It makes playing easier overall."}
{"product_id": "B00B312UDU", "context": "Hey my mouse isn't working. Does anybody know where i can download a driver for it?", "response": "i didn't use any drive for mine and they sent the completely different mouse from the description to me, mine still works thou jus plug the usb to the pc"}
{"product_id": "B002DUCF8A", "context": "Can this panel work with X-Plane 10?", "response": "Hi Jackie, also have not tried it with X-Plane, you could ask SAITEK themselves, I do however believe it will work NO PROBLEM"}
{"product_id": "B0095D1CM8", "context": "Does this work with Linux?", "response": "I don't think so.  The software that comes with it is for Apple and Windows PC.  If you are going to use just the normal mouse buttons and not the software to customize the functions then I would think that you would be OK too."}
{"product_id": "B002I098JE", "context": "Does this game have multiplayer mode", "response": "Hellllllll yeahhhhhhh wooohooooooo. It's awesomeeeeeeee. I have I Panasonic 50\" flat screen and a logitech surround sound speaker system z906 it's like you in the game."}
{"product_id": "B004HYK8Y8", "context": "is this game a mmorpg", "response": "No.Just RPG.The MMO=Massive Multiplayer Online this is only singleplayer game soo yeah"}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "When it says 3D World, it not at all implies that its a 3D game.. it simply means the world in the game is 3 dimensional appose to the usual mario games being taken in a side view 2 dimension manner. .."}
{"product_id": "B008X73CE8", "context": "What is the difference between SH4 and SH4 gold edition?", "response": "You also get the U-boat missions with gold edition. Don't hesitate, great game. Good luck"}
{"product_id": "B00HWMP0TU", "context": "So if you don't want to use the disk to play you can play via steam right?", "response": "It is Right. After I installed the game on the steam plataform, I never needed to use the disc again. After installed the game on the steam plataform you can play offline or online, both without the disc."}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "Slim Ps3... so far it's a great machine! :)"}
{"product_id": "B00BT71S4K", "context": "I have a Moto G. It's compatible? Does it have to be rooted?", "response": "I have a moto x and it works, so it should work. My phone is not rooted"}
{"product_id": "B0098EVZZ8", "context": "will these work with the Wii game", "response": "Yes...each figure are compatible with all skylander giants gaming system. The portal is what differs...some skylanders giants figures are also compatible with skylanders spyro's adventure."}
{"product_id": "B008RA5AWS", "context": "Once i purchase the Quickbooks Pro 2013 with Enhanced Payroll, will i still need to purchase a year subscription ??", "response": "No, but if your setting cash, why not? It is easier when you pay someone for something."}
{"product_id": "B00886XQO0", "context": "Will these work with the new Xbox E console, since the \"E\" does not have an optical connection?", "response": "Yes, unfortunately the E does not have an optical port, so we made a special adapter to use our digital surround sound headsets with the Xbox 360 E. You can only purchase it at our website ... http://www.turtlebeach.com/product-detail/audio-converter-parts/ear-force-hd-audio-converter/421"}
{"product_id": "B002I098JE", "context": "Are all the weapons in multiplayer already unlocked or do you have to unlock them?", "response": "The player has to purchase weapons using  squad points, the player earns squad points while playing multiplayer matches. Hope this helps."}
{"product_id": "B005CELN8W", "context": "I'm Looking For Life Of Luxury made by WMS , is it available on PC or Mac ? Thanks you", "response": "Sorry, don't know about this particular game.  Some of their software packages are MAC compatible.  Suggest you check with customer support on their website: https://www.phantomefx.com/"}
{"product_id": "B0087OZ5FG", "context": "These headphones work with PS4", "response": "yep, since after the update"}
{"product_id": "B00GG4BBUM", "context": "what means canadian cover?", "response": "There is a different cover on the Canadian version. However this is the american cover. The Canadian version has Brett Lowrie on the cover."}
{"product_id": "B008GEH9HO", "context": "Does This Come With A Charger?", "response": "no charger for the XL!!"}
{"product_id": "B00CTKHXFO", "context": "Which region is this game in? R1?", "response": "Hey Daryl, Not sure I know what R1 is, but this collection spans MGS 2, 3, 4, peacewalker, and a few other titles. I think the only one that isn't included is MGS1."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "Nope, it will not. It has a USB plug in not the N64 plug in for the controller port"}
{"product_id": "B00BM7NXMW", "context": "Can you customize the +/- buttons for the right thumb? I want them to be customized for certain actions during games, is it possible?", "response": "Yes, you can even do macros.BE WARNED, the mousewheel on these die incredibly fast!I've had mine replaced once already, and the replacement mousewheel died again in just 4 months of moderate use."}
{"product_id": "B003OZOAKY", "context": "Serial key not working ,", "response": "Mine worked. Needed a magnifying glass and a flashlight to read it."}
{"product_id": "B0085VIILY", "context": "Does this come with a model plane? because the picture makes it look like that.", "response": "No it did not"}
{"product_id": "B000YMQGWU", "context": "my computer dont recognize my usb converter?", "response": "Bummer dude. It should always work. You gotta download a program like Joy2key or Xpadder so you can assign the buttons for each action. Hope that helps. Also Jzip.com for encrypted folders."}
{"product_id": "B001EYU1WS", "context": "Is this compatible with a Macbook Pro?", "response": "Yes but you have to visit saitek.com downloads for the mac drivers."}
{"product_id": "B0032MK90E", "context": "Why doesnt II download but III does and they are on the same disk?", "response": "I am  running Windows 7 64 bit and I had no problems installing II and III from the CD.  Maybe you received a bad CD.  Contact Amazon.  It only took me about 1 minute to install."}
{"product_id": "B002Z7BE24", "context": "Does this video game come with the manual booklet? and also is this the greatest hits version or the standard gold edition version packaging?", "response": "The original standard black label edition comes with the manual.  The Greatest Hits version does not include the manual.  The Greatest Hits is extremely light whereas the black label edition is heavier, plus you can see thru the clear case at the top & bottom & sides that there's a manual inside."}
{"product_id": "B000ZKA0J6", "context": "So this is like Warcraft you have to play on line.. I hate that", "response": "No and yes. Has an offline single player campaign (well you log on online but that's to save progress), well worth it for story alone.Also has online multiplayer where you can play vs other people. Oh, online is FREE, no subscription req'd."}
{"product_id": "B004AM5RAW", "context": "Ok, so this may sound lame, but what does MMO mean, and is this wireless?", "response": "mmo = massively multiplayer online, basically games like world of warcraft, rift, star wars old republic are mmo's. This particular model of the razer naga is not wireless. However it gives you plenty of cord length to move around freely. This one is wireless -----> Razer Naga Epic Rechargable Wireless MMO PC Gaming Mouse"}
{"product_id": "B00FM5IY0Q", "context": "Is this game exclusively for XBox One - or can it be played on an XBox?", "response": "This is an XB1 exclusive. Not sure if they plan to release it for 360 later or not."}
{"product_id": "B0088MVPFQ", "context": "Does the game still work if you live in another country? Or does it only work on American 3DS consoles?", "response": "I can't answer you this question, because I bought it, and I didn't received the product. I live in Venezuela and I Haven't it. Thamks!"}
{"product_id": "B00C7103DO", "context": "Hi, I would like to know whether it is the full game or is it the 10 GB version and we have to download the extra 8 GB?", "response": "Just the standard game. No DLC. Wait...you get a \"Deathstroke Challenge Pack. \"  I don't know what it does, because I just found it."}
{"product_id": "B009Q8PP16", "context": "does it work with bo2", "response": "Yes it's great on bo2"}
{"product_id": "B00B1N07QM", "context": "I am looking to hook my computer up to my TV and play on the couch with a lap desk. Will a keypad enable me to do that without needing a keyboard?", "response": "This is strictly for gaming, not a replacement for a keyboard"}
{"product_id": "B004X56PWK", "context": "Can we use it in Spain?", "response": "As long as you have a PS3 system I wouldn't see why you wouldn't be able to play it anyway"}
{"product_id": "B00E88G054", "context": "How is the packaging? does it come in the original box and would it look presentable as a gift?", "response": "It does come in a nice box. I bought two and the boxes were different for some reason but still would make an excellent gift."}
{"product_id": "B00H3VJYD8", "context": "Is this a knockoff or is this an original 360 controller?", "response": "I believe this is a knock off. It feels and looks like a real controller though. It has the same case as the real controller. Just the case has chinese letters. I've had the controller for 2 weeks now and I have had no problems. So for the price, I would get it."}
{"product_id": "B00DHUUTEM", "context": "what type of mechanical keyboard is it? black cherry, blue, brown, etc", "response": "I guess blue berry"}
{"product_id": "B005OSFUZI", "context": "Does it work on Windows 8 laptop?", "response": "Yes. It works on Windows 8 and 8.1 operating systems - 32 and 64-bit (laptop or desktop)."}
{"product_id": "B004C4U1VI", "context": "Are new cables supposed to come in a box or just in a plastic bag? I just got them in a plastic bag and wanted to make sure they aren't used.", "response": "I received mine in a plastic bag as well so I think that it is safe to say that they are new and not used."}
{"product_id": "B0053BCML6", "context": "Will this game play on a 2DS?", "response": "Yes. All DS games as well as all 3DS games will play on a 2DS."}
{"product_id": "B001E93IWI", "context": "How do you use the headset part, it doesn't work i can't hear anything", "response": "The part you actually plug into your controller, make sure it's switched to the right and make sure the volume is up on it anyways"}
{"product_id": "B00886XQO0", "context": "hi this work on mobile ? plz i need fast answer ^^ ty", "response": "Yes, you can use Bluetooth or a cocorthst come with"}
{"product_id": "B00BQWTGIS", "context": "What are the bare minimum PC system requirements?", "response": "Intel Core 2 quad 2.66Ghz, or AMD Athlon II x4,  6GB RAM, Nvidia Geforce GTX 460 768MB, or AMD Radeon 5770 1024MB. You can get away with 4GB RAM though , with some minor performance issues."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "It is normal, just like other keyboards you would buy in the USA."}
{"product_id": "B00006B84X", "context": "Would this be a good fit for a helicopter sim like DCS Black Shark or Huey?", "response": "Don't know, never played that game. Can vouch for the quality though. Worth the price."}
{"product_id": "B00DC7O77A", "context": "Is this a very hard game compared to Donkey Kong Country Returns? Or is it hard in general? I don't want to buy something that will be too difficult.", "response": "like old one, fun with new levels and characters."}
{"product_id": "B0036WTVNG", "context": "I got one.......says to put in disc but it did not come with one.", "response": "I had one also and had to download drivers for it, I had this same model as well but it only lasted a little over a month until the left D pad input stopped working."}
{"product_id": "B009LGO88E", "context": "what does it do", "response": "Some games have the option to have the circle pad, which in most cases, enhances your game play. Best example is Monster Hunter 3 Ultimate which helps with the camera movement."}
{"product_id": "B0009VXBAQ", "context": "does this wii model read gamecube games?", "response": "It doesn't say so, but these are second generation wii's and no, they do not play game cube games."}
{"product_id": "B003ZSHN0O", "context": "will this work on windows7", "response": "Yes, no problem.  Fun game too."}
{"product_id": "B0009VXBAQ", "context": "will this Wii play, all of the \"Just Dance\" versions, \"Wii Sport resorts\" and other regular \"Wii\" games?", "response": "It should, my grandchildren uses just dance on the wii all the time"}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "Yes it is but the character voices are in jappanese"}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "Is there some law somewhere that says that someone has to ask this exact same question about every single Wii U game there is?"}
{"product_id": "B00DE2W33I", "context": "Hello!! Can I use this PS4 in Italy?", "response": "In theory yes. As all the systems are region free. But you may need to pick up a different power cable. I'm not sure what your outlet situation is like there. But the systems are region free and language selectable so you should be fine."}
