{"product_id": "B00J6DLPLK", "context": "Japanese voice & English subtitles  Support?", "response": "Only buying the dlc for them ."}
{"product_id": "B00HKCKA0G", "context": "does this work with the ps3", "response": "No. It plugs into the controllers on the ps4"}
{"product_id": "B0050SVNP8", "context": "can this game work on 3DS XL US version ?", "response": "Yes, all DS games are also playable on the 3DS."}
{"product_id": "B00E88G054", "context": "Does anyone know if this will work with Windows 8?", "response": "The mouse works as well on Windows 8 as well as it does on Windows 7."}
{"product_id": "B00DB9JYFY", "context": "Is this and Dead Rising 3 worth an xbox one?", "response": "For me yes, especially with the upcoming release of the Master Chief Collection, Halo 5 & Destiny"}
{"product_id": "B00DC7FWRE", "context": "Can this game be used with the original wii if you don't care or want the u game pad", "response": "No, you must have a Wii U to play this game."}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "The keys are all the same color. Infinite amount of colors to choose from."}
{"product_id": "B0098EVZZ8", "context": "Is Battle Pack#1 compatible with the PC version? I would hate to make this purchase for nothing.", "response": "I'm really not sure ,sorry I can't help ."}
{"product_id": "B00EZPCWWA", "context": "I have two kids who likes the same games.  Do I have to buy two of the same games or is there a \"share\" function to this console?", "response": "My boys share 1 game. I also make purchases under only my account that way they can share"}
{"product_id": "B0094X28J0", "context": "Does this not coming with a rechargeable Battery Pack?", "response": "No, it does come with unchargeable batteries."}
{"product_id": "B00BGA9YZK", "context": "Can 2 people play this game with 2 controllers on one console in co-op mode? If yes and is not too much trouble, please explain how to do that.", "response": "unfortunately there is no co-op mode.  You can play online matches with other players but not anything local or split screen."}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "It felt the same to me, honestly, I was quite happy with it and still use it."}
{"product_id": "B0053BCO00", "context": "Could a 5 yo play this?", "response": "yes I dont see why not!!!"}
{"product_id": "B001IYR53W", "context": "Is Canasta included in this version?", "response": "I don't play the game but it is on the list for all who do."}
{"product_id": "B001AI7CF2", "context": "where do the gamecube controllers connect to the wii", "response": "There is a hinged cover on the top of the wii when it is in the stand."}
{"product_id": "B00EHBKUTE", "context": "Does the Tartarus gamepad have the glue issue horror stories on the palm rest that I've heard about the Orbweaver?", "response": "no not so far had it a year no issues like that,"}
{"product_id": "B00CD1FC6G", "context": "Does mac support this keyboard???", "response": "Most of the keys, yes.  There may be a few portions such as the media keys or num/caps/scroll lock LEDs that aren't fully supported though.Edit: As I said, it works under OSX.  There are even some of the reviews that confirm this:http://www.amazon.com/review/R22XSK10XCZLS6/ref=cm_cr_pr_perm?ie=UTF8&ASIN;=B00EU5WIDS&linkCode;=&nodeID;=&tag;="}
{"product_id": "B00B67ZTUW", "context": "Can this game be played co-op?", "response": "Yup! Battles only of course and not until you have enough party members."}
{"product_id": "B00FM5IY0Q", "context": "Does this game have multiplayer mode?", "response": "It Has online Co-Op"}
{"product_id": "B000J18SR2", "context": "Can you play with other computers? We tried one w/ this version & another w/ the conquerers CD and it didn't work?", "response": "Actually I haven't tried it yet. Bought it to keep as collector's item."}
{"product_id": "B00FB45YFQ", "context": "Do these completely cancel out all noise?", "response": "Yes pretty well if not completely."}
{"product_id": "B007VH2WPQ", "context": "Do the screws from my original case fit or do I have to buy new screws?", "response": "all the parts were able to be used in the new body, I kept the new ones as a backup.  My boys cracked the body and really that is all I needed."}
{"product_id": "B008CXTW5G", "context": "Does it have a program to change the macros and stuff", "response": "Yes, It comes with software to change the macros."}
{"product_id": "B008U5ZNIG", "context": "can you use this with windows 8", "response": "Yes, you can use this with windows 8."}
{"product_id": "B000B6MLTG", "context": "Has anyone experienced any display ghosting with this product?", "response": "I haven't experienced any. It's been a pretty good purchase for me :)"}
{"product_id": "B006YDPU48", "context": "Does this game have an online co-op mode where you can play private with a friend?", "response": "You can play online co-op with a friend, but not in private. While doing co-op you can be invaded by other players for PvP, but having a friend with you will give you a bit of an advantage in that situation."}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "I think these items are little gifts for you.  I bought three of these lepow 3000 for young ladies for Xmas and they loved the little surprises in the case. Good packaging and fun."}
{"product_id": "B002FY0CM0", "context": "How many pins are on the end of this cable that connects to the game console?", "response": "Doesn't really matter, just know that this will fit ONLY the Model #1 Genesis... if you don't know if you have a model 1 or not, look it up on the internet or go to a game store and talk to someone over 30yo."}
{"product_id": "B008OQTR3S", "context": "Does this game work on the PS3 with PS4 controllers?", "response": "I know the game works on PS3 but I don't know about the controllers I am sure they would work....the game is for the PS3 only but if ps4 controller can be program to the PS3 I don't see why it wouldn't work"}
{"product_id": "B008SBZF4Y", "context": "can this figure be played with other skylander games or just the skylander giants game only?", "response": "Can be played on all"}
{"product_id": "B007SRM5U6", "context": "Is this an Internet game only or can you just play it on  PS3?", "response": "You can play offline the entire game, without an internet connection."}
{"product_id": "B002B9FIUU", "context": "can I use the controller for any PC games, not just N64 emulation?", "response": "If you use Xpadder you can."}
{"product_id": "B001O3066U", "context": "Will this game work with Windows 8?", "response": "It works with Windows XP Pro, I don't see anywhere that says on the disc that it works only with specific versions, although I didn't get the box. It is a great game, & if it doesn't, u can ask Amazon to exchange it or issue you credit. It's a win-win situation."}
{"product_id": "B002I0J4VQ", "context": "does it come with cords", "response": "Yes but no controller"}
{"product_id": "B00D6PTMSW", "context": "I have an xbox360 with only 4gb of hard drive. Can this game be played directly from the Disc without requiring game installation in the hard drive?", "response": "Yes, you can play the game without having to install it to the console"}
{"product_id": "B00GANWVJE", "context": "I want to buy this game but it says 3Ds, is it eligible with a regular DS or just 3Ds", "response": "Nope. You need a 3ds"}
{"product_id": "B00HN9LS48", "context": "Will this fit an LED screen? Credit Card thin might be a problem unless this thing really adjust to the monitor.", "response": "This adjusts to the monitor that you have. It seems to be able to adopt to any reasonably sized monitor."}
{"product_id": "B00DNHLFQA", "context": "can you play this offline?", "response": "You can, but it's very awkward to do so; Origin still makes you \"sign in\" before launching the game. Which is cumbersome and weird."}
{"product_id": "B009WI7V9E", "context": "Is the DLC on a separate disk or download via codes?", "response": "The bonus content is on included discs."}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "I'm not really sure if I understand the question. If you mean can you push down on the mouse wheel to lock and push the mouse up and down to scroll the page, then the answer is yes."}
{"product_id": "B0010WS20W", "context": "Do you need an internet connection to play this game?", "response": "No. It is played right on your local computer against computer generated players with varying Artificial Intelligence levels to simulate realistic game play!"}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "i am using meters fromwww.simmeters.com.  they have the full set of a10c meters available on their webstore. i will be buying the wet compass from simkits.com"}
{"product_id": "B00GG4BBUM", "context": "Can I play with to 2 players?", "response": "You can play with 2 players on each team. You cannot player with 3+ players on one team, even though the game lists 2-4 player co-op, it's 2vs2 head to head play, not co-op."}
{"product_id": "B007FTE2VW", "context": "Do you need origin to install", "response": "Yeah before doing so you should install a anti-virus system probably Webroot is the best. The only reason you should install a anti-virus is so you won't end up having a virus like I did."}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "YES , IT LIKE A BACK LITE, NO NUMBERS JUST A LITE IN THE LEFT HAND corner .I also redownloaded the driver from saitek. From my unit work in fsx and xplane ,go to xplane forum to look for the driver and how to install thems in xplane ."}
{"product_id": "B004HYIAPM", "context": "Bored with Everquest...Is ES V Skyrim a stand alone game? Or must I purchase the earlier installments?", "response": "The PC download Skyrim I downloaded from Amazon gives you a code to type into Steam ( they give directions).  After that it is a stand alone game. I have not had to buy anything else to play this game.  But it is addictive. I hope this helps."}
{"product_id": "B001FBHT34", "context": "Does it work with ps3", "response": "I don't know. I'm on the road, works perfect with my laptop."}
{"product_id": "B00AJILG1K", "context": "Is it possible to change the color of the profile LED indicator, thumbster keys, and LEDs in the upper right hand corner or are they always blue?", "response": "no, they are always blue.  This keyboard is really bad to be honest, I got mine last year and keys always stop working, return asap, get a Logitech keyboard."}
{"product_id": "B00IRHE892", "context": "Can you reprogram all the buttons or are some of the buttons fixed so they only control the DPI or switch the profile?", "response": "As Brett said, all except the mouse scroll toggle as that button is purely mechanical."}
{"product_id": "B004SJFJUA", "context": "Does this work with the 3DS XL or just the 3DS?", "response": "Just the 3DS. The XL is too large for the normal 3DS."}
{"product_id": "B00475AYUA", "context": "I am buying for a Christmas gift.  Does it have to be downloaded when purchased or can I purchase now for my grandson to download after Christmas?", "response": "Civ 5 is only on Steam and you purchase it to download on the computer it is to be used on. Its like a gift certificate, but you have to join Steam as game is stored on cloud."}
{"product_id": "B000B9RI00", "context": "im going to get an Xbox one do you recommend this card to play online", "response": "My friends tell me the same cards work for both, so yes, this worked for me."}
{"product_id": "B00GPH7Y8S", "context": "Does this game require online subscription?", "response": "No.it does not. Stay offline. Try again. Do not uninstall. The game works for me. Check your computer specications."}
{"product_id": "B00IAVDQCK", "context": "Does this work with pc?", "response": "Yes, it has a normal headphone jack that plugs into the Xbox one controller converter/audio controls which plugs into the bottom of the xb1 controller."}
{"product_id": "B003ZSP0WW", "context": "Does it include receiver for PC?", "response": "None of them do, it's sold separately."}
{"product_id": "B0047ERZ7Q", "context": "Which one is better this camera or the one from the ps vita?", "response": "I think PS vita one"}
{"product_id": "B005BLAJ68", "context": "can you play off line without Wi-Fi or internet?", "response": "I have mine loaded on my computer and play it that way.  I do not know whether you can play it any other way."}
{"product_id": "B00503EAG2", "context": "Does anyone still play this game? And does this include multiplayer with steam too?", "response": "I do! I have spoke with a few people that still play, so I suppose the answer is yes!  I see there is multiplayer  on the menu however, I have hughsnet as my provider so with my present provider it is not possible to game on line."}
{"product_id": "B005VO5ZVY", "context": "Will this work with a DS3 XL?", "response": "no - i don't think so. It only fits the normal DS3 size. Fits it like a glove so there is no way it will fit anything bigger."}
{"product_id": "B003O6N64Y", "context": "is it work with PC ? with surround sound and evrything like PS4 or xbox 360", "response": "Mine did work with the PC with no problems."}
{"product_id": "B0081GA50U", "context": "Does this fit the 2000 series?", "response": "I purchased this for my daughter so I'm not sure which one is a 2000 series however I do know she has the original not the slim and it fits perfect"}
{"product_id": "B005M0KSIM", "context": "Without expansion packs, does this game includethings like greek gods?", "response": "No. For that, you will want Gods and Kings. Either get it off Amazon for... last time I checked $12.96, which is 17 dollars less than on Steam. If you don't like that, I would wait for Steam's annual summer sale. I guarantee it will be on there. Last year it was for 7 dollars."}
{"product_id": "B00DH1KRQQ", "context": "does this controller work with Steam games?", "response": "It work with any kind of games on the PC or PS2 & PS3 & PS4."}
{"product_id": "B003VAM392", "context": "does it work on steam? and is there the deadzone problem?", "response": "Yes it works on Steam. Castle Crashers and Bastion are the only two games I've tried with it though. I don't know what the deadzone problem is, never heard of it. I've had no issues with this controller malfunctioning or not working. Hope this helps. :)"}
{"product_id": "B0095P5K8I", "context": "does we need to have a mouse pad or we can us it with out the pad?", "response": "depends if it's a smooth service, mine worked on a black table with no pad fine"}
{"product_id": "B000R0SRNU", "context": "can you play with 2 people without xbox live?", "response": "Yes. By simply pressing start on the second controller while in game you can enjoy playing with another person"}
{"product_id": "B00F2ENJY8", "context": "So this is an actual video game console? Cause the price difference between the Wii Mini and U is about 200 bucks. Can someone specify ?", "response": "the mini just plays wii games.  The more expensive one plays the gamecube game also."}
{"product_id": "B000OLXX86", "context": "Does this come withthe bonus content disk?", "response": "Greatest Hits comes with the DLC Bring down the Sky, but not the stuff found only on the pre order disc."}
{"product_id": "B002I090AG", "context": "is it region locked  if it is which region America  / Europe / Australia", "response": "I am not for sure if it is region locked but I did buy the item in the United States if that helps you in anyway."}
{"product_id": "B00ERDGMT4", "context": "Can we install the add on several consoles front the add-on CD? Or it will only works for one (as code will do)?", "response": "Yes, you can add on the extra downloadable content to multiple devices. I have done this to three different consoles, without issue."}
{"product_id": "B00I14395A", "context": "Can the angle of the keyboard be adjusted?", "response": "It can. But not a lot. 1/4 to 1/2 inch at most."}
{"product_id": "B0000695GX", "context": "What about Windows 8?", "response": "It won't work either"}
{"product_id": "B002B9FIUU", "context": "Does this work on Windows 8?", "response": "Yes it does.  This device makes your controllers show up just like any joystick would, so it works on anything from XP to Win8, and with any software that has joystick support."}
{"product_id": "B005G4CXPK", "context": "Will this work on Windows 8 and 8.1?", "response": "Yes it works on my windows on my windows 8 laptop"}
{"product_id": "B00JC9SWSC", "context": "does the bundle have move controller pack", "response": "No it would be a regular controller."}
{"product_id": "B00DC7O3K6", "context": "Is the Wii U game different than the original Wii one?", "response": "Dear Amy, yes the Wii u game is different, it's a new console."}
{"product_id": "B002Q4U5DK", "context": "is the mouse small?", "response": "Not fit for American small hanging hand size"}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "Yes, the voices are in English."}
{"product_id": "B002LMX5ZW", "context": "Will this run on Windows XP?", "response": "Yes, Moraff's Maximum ran on my laptop with Windows XP.  I also bought MahJong Quest that also runs on Windows XP.  Both programs are fine, but my preference was MahJong Quest."}
{"product_id": "B005OSFUZI", "context": "This may be a dumb question but is this is like a legitimate cable for recording guitar on a laptop? Not just for the game but fo recording software?", "response": "You can definitely use it for direct recording. I've used it on a couple of finished tracks with a couple of different instruments. You'll likely have some latency issues and will have to mess around with the settings, but every DAW I've tried it with has recognized it as an input source."}
{"product_id": "B001AH8YSW", "context": "at launch game.    box pops saying I must be administrator to play first time. I am the administrator. Any help would be appreciated I am running windows 8", "response": "Right click the icon, and \"run as administrator\" should come up."}
{"product_id": "B000GCJ6MK", "context": "does fsx work on windows 8.1", "response": "Yes it does I'm useing mine"}
{"product_id": "B000B9RI00", "context": "works for xbox one?", "response": "I would like to say \"yes\". But you need to check with Microsoft. I'm sure it does. But check."}
{"product_id": "B008BGXYBM", "context": "Why does my razer taipan has only one laser sensor(8200dpi) while other taipan has the 4G \"DUAL\" sensor (2 laser sensor) ?", "response": "I think the Battlefield 4 edition of the mouse has the dual sensors while the standard white and black versions do not. The Mamba also has dual sensors."}
{"product_id": "B00DWXUYN0", "context": "Will a regular 3ds fit well in this case? Would it have too much room and slide around?", "response": "It would fit, but yes it would also slide around a bit. The elastic strap will help though."}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "Yes, though it's not necessarily a bad thing; Ghosts will be automatically updated when patches are released, and Steamworks is known to be one of the least intrusive forms of DRM currently available."}
{"product_id": "B0091WIOJ2", "context": "How do these feel while wearing glasses? I need glasses to see my tv and the current headset I have now digs into me, these look more comforting", "response": "I wear glasses while gaming as well. This headset is fully adjustable, and very comfortable. At first it may seem a little heavy, but after a few hours of gaming, or watching a favorite movie.you don't even realize that they are on your head."}
{"product_id": "B0081Q58AW", "context": "Is it all strictly PvP or is there some PvE as well?", "response": "It's almost all PvE - the PvP is optional."}
{"product_id": "B0050SZ0SY", "context": "Can I play this game with an Xbox controller?", "response": "I have used the xbox controller with it as long as it hooked up to the PC via usb XBOX hub."}
{"product_id": "B00BQMGW4Y", "context": "How long is the cord, and does it have an extenion to the cord to plug into xbox? & What is the warrenty?", "response": "about 6 ft-no extension. No warrenty"}
{"product_id": "B000LQ4HTS", "context": "Can I twist the stick to control yaw in a helicopter  or use it as rudder in a plane?", "response": "Yes! And it works well. Also has a rudder lock if you want to lock it from rotation."}
{"product_id": "B00DB9JYFY", "context": "Is this and Dead Rising 3 worth an xbox one?", "response": "Yeah esp since you can get it new on Amazon for $25 with all dlcs included. Apocalypse edition that is."}
{"product_id": "B00BCEK2LU", "context": "Are the WASD keys textured or simply just a different shell color?", "response": "The WASD keys are like all the others just grey same with the arrow keys grey same as the WASD and the rest of the keys are black you can kind of feel the letters if you rub your finger over them but when typing you dont feel a thing very smooth"}
{"product_id": "B00IAVDQCK", "context": "Does this work with pc?", "response": "The nice thing about this headset is that is has a standard headphone jack. You can use it with your PC no prob. Great for Skype too"}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "I have windows 7 and it worked fine for me."}
{"product_id": "B001H4NMNA", "context": "Does it come with the chargable batterypack for the controller ?", "response": "Did not look in to that option bit it does not come with this item."}
{"product_id": "B00GPH7Y8S", "context": "is this game compatible with windows 8.1 ?", "response": "Yes. However it does hang on my 8.1 pc from time to time but they may be the video card overheating.  I have a basic laptop. Not a gaming laptop"}
{"product_id": "B009JZ04BC", "context": "Where do you install the application for the mouse? To change colors?", "response": "http://www.coolermaster-usa.com/download.php?action=ViewDownload&id;=379 you can find the application here. It allows you to customize the buttons as well as color and dpi"}
{"product_id": "B00E8JZILA", "context": "Any download codes included with this game or is the entire experience in the cartridge?", "response": "Hey, lopez. The game is the cartridge only thing you can do online wise is check out other player scores on a scoreboard."}
{"product_id": "B001DNGCN2", "context": "does this work with the ps3 fat boyalso does actually works there are so many mix reviews about this product", "response": "I was able to get it on my original fat 60gb, but I don't believe it helped at all."}
{"product_id": "B00H8NS1K8", "context": "How well does the microphone pick up noise from the keyboard? I use a blue switch mechanical keyboard.", "response": "So just for you I pulled out my old das keyboard with cherry blues and mashed some buttons, hard. With the microphone about two feet away and angled towards my mouth it picked up some minor noise pollution, was not bad at all."}
{"product_id": "B009S4JZKK", "context": "can you create your own layout? or world? and is their a website for downloading other yards, engines, and or cars? and can you also upload your world so other can play? what you have created?", "response": "yes you can i got all NS and UP heritage units BNSF SD70s and Sherman hill, Donner pass, Marias pass, Portland portal, and many more"}
{"product_id": "B00BQWTGIS", "context": "will it work on windows vista?", "response": "Yes but you need more RAMs if you want to play in high setting.I have 8gb and GTX 780"}
{"product_id": "B00CD90R72", "context": "Regarding FIFA 2014, does the game require the MOVE controller or can 1 or 2 players use the standard game controller to play with maximum enjoyment?", "response": "You can use the standard game controller - hasn't diminished my fun at all!  Enjoy."}
{"product_id": "B002DOC93C", "context": "Are many of these games good for a single player with no wifi?", "response": "I don't use wifi for the DS. There are TONS of games that you can play against the \" computer \" and/or single player games."}
{"product_id": "B00009TW6R", "context": "work for Windows 7 Home ?", "response": "This and halo custom edition both work for win 7"}
{"product_id": "B009XZ1CTQ", "context": "my grandson is 5 - can he do this game?", "response": "Yes the game is kid friendly but it might take him a little time to learn the controls hope this helps"}
{"product_id": "B009AGXH64", "context": "Why is this one $10 more than the one that comes with mario and luigi U?", "response": "This is not an answer but me too, I am very surprised. I would assume that this is because of the different release times. Older Wii will still be sold based on the earlier prices newer will with a free game will be sold with less price."}
{"product_id": "B000OYMYZQ", "context": "How long is the cord?", "response": "According to the pckaging it's a 9 foot cord."}
{"product_id": "B002L93F0A", "context": "Do these controllers directly plug in to the Wii?", "response": "Do they come with the connection cord already attached?"}
{"product_id": "B001DPZE84", "context": "Does it work with windows 7?", "response": "I have windows 7. I received the package and says running under windows vista and XP. This disc contains a \"UDF\" file system and requires an operating systemthat supports the ISO-13346 \"UDF\" file system specification."}
{"product_id": "B002DUCF8A", "context": "I have a Cessna trim wheel for pitch control -- will the trim wheel on this panel conflict with its operation?  And if so, what's the recommended workaround? Thanks!", "response": "I don't have the cessna trim wheel, but there should be no conflict at all"}
{"product_id": "B0083H4NG4", "context": "Does this mouse have \"free-scrolling\" capabilities like some of the Logitech line?", "response": "The mouse does not free scroll. It is the normal notched scrolling."}
{"product_id": "B00EIM3BV6", "context": "Are these updated to the latest firmware before being shipped?", "response": "My mix amp was not"}
{"product_id": "B00DCDZM2I", "context": "does this game have co op?", "response": "no, it does not have story based co-op"}
{"product_id": "B00IYWV5HS", "context": "i hace a laptop dv6 i7 2.oo ghz, 8 gb ram, ati radeon hd 6770m, can play this game?", "response": "Based on the below link you should be able to run Wildstarhttp://www.systemrequirementslab.com/cyri/requirements/wildstar-beta/11647/?p=r"}
{"product_id": "B0087N222Q", "context": "Can it connect to a PC?", "response": "As long as your computer is able to connect to Bluetooth devices. If it's an older computer it's unlikely that it will be able to."}
{"product_id": "B00DGZDFO4", "context": "Can this game can be run Locally on my Pc? I dont like to play online, I prefer play against myself.", "response": "Yes you can play the game offline, if you have 2 usb ports you can plug in 2 controllers and play against your friends as well �"}
{"product_id": "B00001IVRD", "context": "Does this work on Windows 8 x64?", "response": "On my windows 8 it wouldn't go said something about color pallette or resolution but you might have more luck. Also a lot of people have been saying something about it not working on the mac or something"}
{"product_id": "B00EFFVZP0", "context": "This game is in language or subtitles in Spanish?", "response": "Some games depending on your setting if you have them on Spanish they will play in Spanish it's kinda like a automatic thing. But I have mine in English I really don't know if it will play the best way to find out it's through google"}
{"product_id": "B00919RM1Q", "context": "Does this game work with Windows 7?", "response": "yes, I'm running it in windows 7 64bit  and so far I haven't had any trouble with it ."}
{"product_id": "B005QUQP80", "context": "Is this keyboard compatible with Windows 8?The Corsair Website says \"yes\" while the spec information here says \"no.\"", "response": "I don't know if it does.  I would assume it would, mine is working on Windows 7.  You can always try it and return it if it doesn't work.  But it should work."}
{"product_id": "B00D3RBZHY", "context": "Does this game have a split screen option for two players?", "response": "I was very sad to hear bout this game not having split screen because I wanted to play this game at my friend's house."}
{"product_id": "B00IYWV5HS", "context": "I have the new Mac Pro.  Could I play this using Parallels?", "response": "If you use bootcamp, you can"}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "I just bought mine and the DLC code expired 12/31/2013.  Tried it anyway and no luck.  But then I went into the store and Festival of Blood was free.  Don't know if it is because I'm a PS+ member, but it's worth checking."}
{"product_id": "B00FYMTUQY", "context": "\"Pull the back bar down\"?I'm reading the instructions and it says to pull the back bar down, is it supposed to require some force? It feels like I'm going to break it.", "response": "I felt that was going to occur as well but hold it close to the joint and apply pressure. It'll loosen up after a click or 2."}
{"product_id": "B00KGGJPYA", "context": "will this charge samsung galaxy tablet?", "response": "I do not have s tablet so I can't be sure.  Gembonics"}
{"product_id": "B00DFB99UI", "context": "can you use this on ps4", "response": "i know its work with PS3 AND PC BUT IM NOT 100% SURE THAT IT WORKS WITH PS4 BUT I THINK IT SHOULD."}
{"product_id": "B004NRN5EO", "context": "Does this require an internet connection to play? (not update/install)", "response": "No, it doesn't. Only if you want the online features like the PvP and co-op you will need a internet connection."}
{"product_id": "B003O6JJKY", "context": "If you buy this can you buy a kinect sensor separate and then hook them up together or do you have to buy one with it built in?", "response": "For the 360 you buy the Kinect device seperate."}
{"product_id": "B0050SYILE", "context": "Why it is only 29$?", "response": "I don't know seems pretty cheap when I bought it I thought it was fake or something but I took a risk and everything seems pretty good works great runs great I've had no problems good game and good deal"}
{"product_id": "B005MQ3BSK", "context": "Does it have an opening trainer database?", "response": "Hi! I saw this in a web site related to chess: ¨Training modules for openings, tactics and endgames¨. I suggest you to look for a complete list of properties for this chess software, which is an excellent one! Greetings."}
{"product_id": "B004AM5RAM", "context": "How long does the battery last and is it replaceable?", "response": "If you buy wired you don't have to worry about that problem, but I believe the battery is rechargeable so it should last several years."}
{"product_id": "B002I0J51U", "context": "Does this come with the charger, or do I need to buy one seperately?", "response": "Does not come with charger, has to be purchased separately."}
{"product_id": "B0050SVNP8", "context": "Is White 2 and Black 2 the same game? I'm confused because they have the exact same number of reviews and I don't know which to get my daughter.", "response": "They both have some differences in the pokemon you can obtain and some areas you can access. Either purchase is good one!"}
{"product_id": "B00IRHE892", "context": "Can the Back and Forward buttons be customized to do in-game actions like throwing a grenade?", "response": "Yes, buttons can be programmed through the LGS software.  Macros can be made with customization timings like delayed key-presses if you'd like as well.  However, to get full macro capabilities, you need to use profiles through the PC, NOT the in-mouse memory profiles."}
{"product_id": "B00030GSJY", "context": "Can you use joystick separate from the throttle?  On some flight sims I just want to use the joystick by itself.  Thanks.", "response": "Likely no. The joystick plugs in to the throttle with a PS/2 Connector, and the Throttle goes to the PC with USB. I haven't personally tried connecting the throttle to a PS/2 connector on my PC, but I don't imagine it'd work.Not sure why there's not a picture of the connectors on Amazon, but http://www.techwarelabs.com/reviews/peripherals/saitek_x52/images/Complete%20Contents%20saitek%20X52.jpg shows the connector types."}
{"product_id": "B00B3PDHBU", "context": "do these have 7.1 dolby surround sund", "response": "Yes, the XP510 provides surround sound for Xbox 360, PS4 and PS3 consoles. You can also use it with an Xbox One if you add a chat adapter and a talkback cable."}
{"product_id": "B00FQPQO4A", "context": "i had to reload this farming simulator 2013  game on my computer because it crashed where is the product key located", "response": "If digital download,  it would have been provided with the download.  If bought did,  should be in the case"}
{"product_id": "B00EV4O7B4", "context": "Does this come with X & Y games as well as the 3DS?", "response": "It sadly does not unfortunately."}
{"product_id": "B00IYWV852", "context": "Will I be able to redeem the code for the deluxe version after June 3, 2015? Not going to be able to download the game, or register, for 5+ months.", "response": "Asking customer service for Wildstar will get you a more definite answer but I see no reason why you would not be able to. Retail codes don't expire."}
{"product_id": "B00BGA9V2Q", "context": "is there a multiplayer mode", "response": "If you want to play the expansion you have you purchase it on a ps4, or p.c.Unfortunately characters cannot be transferred from ps3 to ps4."}
{"product_id": "B002I0JZIS", "context": "does it come with changer and usb", "response": "It's got everything u need"}
{"product_id": "B00A378L10", "context": "Are the Home, End, PageUp, PageDown  functions accessed by using the shift key or NumLock? Also, I see tat the default function of the \"2\" is up arrow", "response": "When numlock is on and the arrow keys are glowing the keys on that side act as their non-number counterparts. When numlock is off those keys will act as numbers and the arrow keys will not be able to be used as usual."}
{"product_id": "B0015PHMFU", "context": "So this product will work on PS4? Will this console allow the character like batman on Arkum City to walk forward and run?", "response": "With the PS3 component just being a lazy solder of a controller board, chances are it won't. PS4 dropped compatibility with the PS3 USB and controller.http://www.ign.com/wikis/playstation-4/PS4_Compatible_PS3_DevicesIf you want my advice, spring for a new controller or better stick. After about 8 months of use this thing finally broke down."}
{"product_id": "B000B6MLSM", "context": "I have a receiver to use my 360 controller on my PC.  Will I be able to use this for my PC also?", "response": "I haven't tried using this remote on my computer yet, but my old computer remote I had, worked on my 360. So I would think it should work. It obviously sends out the same signals. It is made by Microsoft, so why wouldn't it work with the computer?"}
{"product_id": "B00F27JNGS", "context": "Will the Japan model have an update where it will work with NA accounts once the PS TV releases in the west?", "response": "You can't create NA account because it's region-locked. It'll allow you to update to new firmware like any other console."}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "I'm using a SA (Saudi Arabia) account So I guess U can use a US account"}
{"product_id": "B00DGZDFO4", "context": "not opening and im trying to get help but NOBODY is helping me..I have windows 8????", "response": "hi, u need to check if ur computer can  run the game, and after  u should go to MK Launcher.exe to proprieties and compatibility and the game in windows xp sp3 and us administrator"}
{"product_id": "B00DGZDFLW", "context": "Is the PC pre-order version the Black Armor Edition? It says it's DRM Steam and Steam is providing digital: weapons, soundtrack, artbook, and comic.", "response": "you get them all but digitally read amazon special offer note they updated"}
{"product_id": "B0009WPZOA", "context": "Is it okay for an eight year old? I worry about language.", "response": "i dont see why not. there isnt any profanity in the game. you buy cars, hot rod then out, and race against a list of the top street racers for money and to move your name up the list to become number 1 on the list. you will also have to run from cops."}
{"product_id": "B0002FGFHU", "context": "Is this a physical copy or a download?", "response": "P C    C D"}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "Yes. It is digital code, so you will not receive a physical card."}
{"product_id": "B008M4BNQG", "context": "ok so im really confused, can i just plug the USB and start playing, will it work if i dont plug in the other wires??", "response": "Yes I just checked my daughters hookup and all she has plugged in is the USB. She says the other wires are for systems that don't have USB ports."}
{"product_id": "B004HYIAPM", "context": "As a new player what should I know going into this game? Any recommendations or suggestions?", "response": "Its and awesome game and can be even better with the right specification on a computer. Make sure you have a good graphics card such as Nvidia or AMD, even thought the standard will work, the detail will look better if you buy a graphics card. Also it helps reduce lag during a game."}
{"product_id": "B00IP0H4GA", "context": "Character would not respond to square, circle and triangle buttons on fully charged ps3 only x button worked. Anyone else with same problem?", "response": "Your controller probably is not working correctly I haven't encounter this issue on the game or any for that matter. You may want to ask directly the Sony Support"}
{"product_id": "B00IU3MSF4", "context": "How many USB ports does the 360 E have?", "response": "4. 2 in front and 2 in back"}
{"product_id": "B00ACMM9BO", "context": "i dont know how to program my controller it never came with instructions", "response": "It should have came with a sheet of paper on which it told you how to do so but this might help you out a little goto YouTube and look for Lighting Moz 17 mode rapid fire controller video  by PFCxMORROW sorry didn't reply faster have fun gaming"}
{"product_id": "B00HVBPRUO", "context": "Is it worth trying if I wear glasses? I tried a few headsets before and almost every of them was uncomfortable.", "response": "My son and I both wear glasses and have no problems with them."}
{"product_id": "B004JKZUJI", "context": "is it needed to play call of duty black ops", "response": "I dont know, look on the back of the case and see what you need"}
{"product_id": "B0029LJIFG", "context": "What does this card do does it give the person on line game to play Id like to get this for my sons new xbox 1 thanks", "response": "Yes it allows him to play games online. Be able to watch Netflix and Xbox gold gives you discounts and free game downloads."}
{"product_id": "B00C2B2Y9A", "context": "Does it work for the Xbox 1?", "response": "With the headset adapter yes. I must caution you though my headset broke on first use with the Xbox One and they are discontinuing these headsets. Warranty will only give you in store credit if it breaks."}
{"product_id": "B002I0F5I2", "context": "Will this come in a video game case, or a video game envelope?", "response": "Hi, I'm sorry, I forgot this was still in Amazon.  It is in the original case.I still have the game, but it is in storage in another state.  If you want it, I would need some time to have somebody mail it."}
{"product_id": "B0050SYR74", "context": "Can it work with pc?", "response": "I haven't tried...but if your PC has the correct audible out jack it should, no problem."}
{"product_id": "B0080RAT42", "context": "will it work on a mac?", "response": "Works great on a Mac with OpenEmu ... Tested for both Genesis and 32x with the six button controller."}
{"product_id": "B0050SX4CI", "context": "Does it works with ps4 ?", "response": "supposed to be compatible."}
{"product_id": "B00005QEFD", "context": "Does your system come with all the cords and controller?", "response": "YES! It MUST come with controller and all cables. According to the UPC, that is what the system came with so according to Amazon's policy, it MUST come with all those cables and controller. All the people selling them without them are violating Amazon's policy."}
{"product_id": "B00ANHBJBY", "context": "How is the analog stick sensitivity on this? Does it have any dead zones? Do the buttons feel soft or clicky?", "response": "The buttons are pretty clicky but the analog sticks do have some dead zone. It's not so much that it gets really annoying but just enough to notice."}
{"product_id": "B009Q5XGO2", "context": "Just making sure here but, I don't think this can be on with a case right?", "response": "No a case doesn't fit well with this. I was able to cut my silicone case enough so that it fit."}
{"product_id": "B009ZDPYKO", "context": "Does he work with swap force?", "response": "Yes. All previously made Skylanders figures work with the latest game \"Swap Force.\" Our son uses this figure a lot, since it is his favorite."}
{"product_id": "B0050SYR74", "context": "can the mic be connected to the PC in any way? if so what is the quality?", "response": "No, with the cables that the headset comes with you are unable to do so. If you were to purchase a cable that could connect to a PC then I would imagine the quality would be bad. If I were you, I would look into other headsets from TB in the PC line."}
{"product_id": "B00DRKJBC8", "context": "will this work for windows 8", "response": "So far no--I can't run the game by key only."}
{"product_id": "B009Q8PP16", "context": "Does the controller work with the rechargable battery packs ? i have a charging station with battery pack and i put my controller on it to charge it", "response": "It's for my son.   I don't see why it won't work with the rechargeable pack.   It's built exactly and identically like the original xbox controller."}
{"product_id": "B00FAN4LRA", "context": "can I use these with xbox one ? someone please answer", "response": "Yes! If the TV you are playing your Xbox One on has a headphone/aux output you most certainly can. The 9H comes with an adapter to a 3.5mm headphone so you can plug it right into the TV and be on your way!"}
{"product_id": "B00BI4VVGY", "context": "Is it a 2 or 3 pin fan controller?", "response": "I already answer this question 2 pins for the power connecter and the other one is for the speed control"}
{"product_id": "B00F27JN8Q", "context": "Can the Japanese Vita TV's AC adapter plug into a US wall socket without problems?", "response": "Yes it hooks up with no problems."}
{"product_id": "B00CMQTVUA", "context": "Does this come with a controller?", "response": "The one that I bough didn't"}
{"product_id": "B00EM5UFF4", "context": "What kind of game is this?  Is it just for kids?  I'm a 37 year-old male?", "response": "It is a multiplayer and Co-op action experience third-person shooter. If you like team \"shoot-em-up\" games then you'll love this. Each character has special abilities that you level up as you continue to play. Most of the time I play online against other players. It's a blast even if you're an adult. Website: http://www.pvzgardenwarfare.com"}
{"product_id": "B00E447L8C", "context": "will this charge a iphone4?", "response": "It do work on my ipad so I think it will charge an iphone 4"}
{"product_id": "B003ZMF26W", "context": "I have 6.5 inch hands, and I like to use a fingertip grip. Would this mouse suit me?", "response": "if by fingertip grip you mean claw grip, mmmm.....well....for my taste in games (shooter) you will have to make an effort. I think the size of the mouse for your hand will be between claw and palm grip, you will just have to accomodate and get use to it"}
{"product_id": "B0050SXKU4", "context": "Is this game at all appropriate for a 13 yo boy? My son is begging me for this, and it doesnt seem appropriate IMO.", "response": "Honestly. That's around the age the boys will start to want those games and it is just a game. There is parts with strippers and profanity but ask yourself.. Is my child old or mature enough to handle this content? And that will help"}
{"product_id": "B003VAHYQY", "context": "How long is the length of the cable?", "response": "Its about 6 ft long."}
{"product_id": "B004XGN8W4", "context": "does it need to be plugged into an outlet to work", "response": "yes, you will need 2 outlets. 1 for the G155 and 1 for your gaming system"}
{"product_id": "B00DC7O77A", "context": "Is this game easier or harder than the wii's Donkey Kong?", "response": "Much much harder, unfortunately"}
{"product_id": "B001EYU1WS", "context": "Does it work with X-Plane 10?", "response": "Sorry I do not know if Saitek controls work with X plane, perhaps there is info on the Saitek website, or you could use their contact ticket system to get and answer.  Or go on AVSIM or flightsim.com forums and check out X-Plane forums and ask the question of others who might know."}
{"product_id": "B008FHL56S", "context": "Does this product play Titan Falls?", "response": "YES i have it and it is amazing"}
{"product_id": "B001NXDBI6", "context": "Does VOIP also work with Teamspeak?", "response": "This is a keyboard, not a headset. The keyboard does have the functionality for TeamSpeak/Skype 3rd party apps though."}
{"product_id": "B003EUPCZG", "context": "The buttons are already \"swapped\", or software is required for that?", "response": "The index finger = left click. The middle finger = right click. By default, but the Razer software (you download from their website) allows for customization."}
