{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "I think it is used for wrapping your earphones so that the lines don't get tangled. You could also use it for the charger wire."}
{"product_id": "B00DYAQHTQ", "context": "Hey guys ran into a problem with the Code what does the code give you in this Edition please thanks?", "response": "Hey  the code gives you white tall jacket and white hat"}
{"product_id": "B00J128FPA", "context": "Is Heavenward an expansion to this or is it a completely different game that I'd have to have a subscription for?", "response": "Yes, Heavensward is the first expansion to this game."}
{"product_id": "B00JC9SWSC", "context": "Can you play playstation 2 games on it?", "response": "Got it for my son to take to college so we have not hooked it up yet but we have a PS3 already and can play playstation 2 games on it so we figure he will be able to play playstation 2 games on this one too."}
{"product_id": "B007TMFD7C", "context": "Does it come on a CD or how do I load if I don't have a CD Drive?", "response": "It does come on a cd, and only on a cd"}
{"product_id": "B00HVBPRUO", "context": "Is it worth trying if I wear glasses? I tried a few headsets before and almost every of them was uncomfortable.", "response": "I don't know. I don't wear glasses."}
{"product_id": "B00005B8G1", "context": "Does it use batteries ?", "response": "Yes it uses 2 AA batteries"}
{"product_id": "B003O6JJKY", "context": "I have a 360, can I use the cables and plugs from mine to use on a slim? Or are they different sizes?Thanks", "response": "The av cord on all xboxs are the same however the power cords to switch from unit to unit . Xbox 360 has 2 different power sources where as the slim use only one. http://ecx.images-amazon.com/images/I/41jGFTGuMCL._SX385_.jpg"}
{"product_id": "B005MQ3BSK", "context": "Does it run on Windows XP ?", "response": "Yes it says so on the box. In real small fine print. I have windows 7 but the box says Xp is good to go."}
{"product_id": "B000QJ1NS8", "context": "how long do the battery last?", "response": "I really can't say. :) I have three gameboys and they've been working pretty good. Only one stopped because of the charger cord. Its good to have an extra battery tho. I can play my gameboy throughout the day, so I'd say a day. Then just plug it in overnight. Depends on how much you play"}
{"product_id": "B005FMLZQQ", "context": "When playing Recorded TV, how do you stop playing? The old remote had a \"Stop\" button it seems to be MIA.", "response": "It should be touching the \"Play/Pause\" button again. To get out of the video entirely, I'm thinking it's the \"Back\" or \"X\" buttons. Here's the manual's link for further info: http://download.microsoft.com/download/b/c/e/bce76f3f-db51-4c98-b79d-b3d21e90ccc1/universalmediaremote_na_0609.pdf"}
{"product_id": "B005FMLZQQ", "context": "anyone happen to know if this remote works with windows media center?", "response": "That is why I got this remote: I use my 360 almost exclusively as a WMC extender. If you mean, can it control WMC directly on a PC -no."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "Rubber, it feels real nice though."}
{"product_id": "B00B5QLS4A", "context": "How does it compare to the Logitech G600? I own a G600 and my fat thumb has a hard time finding the 12 side buttons. I end up only using 3 or 4", "response": "Not sure,only ever had regular mice before.  The buttons are spaced out in a kinda ring so having a large thumb shouldn't be a problem. It took a while for me to figure out how to bind the buttons to certain keys though, since windows doesn't recognize them as mb6 and up"}
{"product_id": "B009K7U6IK", "context": "Is this comes with the retail packing ?", "response": "Yes it comes in the retail box."}
{"product_id": "B002DUCF8A", "context": "Can this panel work with X-Plane 10?", "response": "I don't see why it shouldn't work with it, it works just fine with FX Gold"}
{"product_id": "B00BGAA3S2", "context": "Does the camera come with a mount? I've read and watched reviews and they show a mount included. I just want to make sure it comes with one or not.", "response": "It comes with a Velcro mount! Both sides are adhesive!"}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "Inside444 e% ee%5þwi> i0o"}
{"product_id": "B001DPZE84", "context": "will this work on windows 8.1?", "response": "Works well with windows 8.1."}
{"product_id": "B005BLAIGE", "context": "what types of games are there?", "response": "poker, blackjack, roulette and slot machines"}
{"product_id": "B000ND3XXA", "context": "Is it compatible with other emulators? For example, If I wanted to play a SNES emulator with a PS2 controller, would it work?", "response": "Yes, it does work, it doesn't care what controller you're using, you just set up the controls through your emulator and play. No special configuring."}
{"product_id": "B003O6JKLC", "context": "Is everything here to start playing (other than a game)?  Would I have to purchase anything else?", "response": "No, only the console was in the box as pictured and it said that there was nothing else with it, my son already had the other equipment to start using it right away. What I was saying is it came as pictured."}
{"product_id": "B00178630A", "context": "can you play 2 people at the same time", "response": "You can play multiplayer online with two computers, but not two people on one computer."}
{"product_id": "B00BMFIXZG", "context": "Can I buy the DLC later and have it work with this version?", "response": "Yes, you can buy the Doc later because you have to enter the game code into the ubisoft program and then you are able to buy the DLC."}
{"product_id": "B00DFB99UI", "context": "is it compatible with PS4", "response": "I'm not sure, I have only used with PS3."}
{"product_id": "B0041RR0TW", "context": "Do they come with batteries, if so what size, brand and/or type of battery?", "response": "I don't remember if they came with batteries, but i use 2 Duracell AA batteries."}
{"product_id": "B0050SYILE", "context": "Would you let a MATURE 13 year old boy play this game?", "response": "That's a call based on the parent. I personally wouldn't let one play it considering that it can in some ways endorse illegal activities, and the game's language is pretty bad. Not to mention the strip clubs you can freely walk into and multiple sex scenes in the single player."}
{"product_id": "B001V9PTVE", "context": "Can the games run on windows 7?", "response": "Yes it will most of the time."}
{"product_id": "B00D2EGWDA", "context": "Is nuke town map and extra zombie map included on the standard version or is it only on the other versions like the hardened or deluxe pack?", "response": "This version includes nuketown 2025 map for online and bots and stuff but not the zombie nuketown map"}
{"product_id": "B002I0JJ2U", "context": "Why are you selling a game that doesn't work anymore?  This is highly misleading and quite frankly dishonest.", "response": "I have no idea why you would refer to Final Fantasy as a game that does not work any more. I am playing it NOW so please clarify."}
{"product_id": "B00FLLFJ68", "context": "Can this charger be mounted vertically (ex: on a wall) and still work without the controllers falling?", "response": "Nope works with gravity hahaha its the only thing making the pins charge the controller there is no clip o holder just gravity"}
{"product_id": "B000BIZR72", "context": "does it work on 3ds?", "response": "If the game is not 3D, it won't obviously be in 3D but it'll work on the 3D system."}
{"product_id": "B00E4MQODC", "context": "i have M.S.and my fingers are weak, The 2 buttons on top left,are they easy to push,like the left click button,and do they push from side or top.", "response": "The two top silver buttons on the left push from the top, while the black buttons on the left side push to the side. And yes I think the buttons would be easy enough to push!"}
{"product_id": "B0097CUREG", "context": "Is a mouse required to play ?", "response": "Yes. I had to connect one to my laptop."}
{"product_id": "B00BGA9YZK", "context": "Is the game a disc or just a digital download", "response": "I assume if Amazon is selling it it would give all the options, including console, but I don't know if you can get a download from them....but it would say if it was......."}
{"product_id": "B0050SYK44", "context": "I've never had a game consol.  How do PS3 and Xbox compare?", "response": "Sorry i cant say. this was a gift.."}
{"product_id": "B00111SFEU", "context": "can it work for the PS Vita", "response": "sorry dude, I don't know, I don't have a psvita, but probably works."}
{"product_id": "B002DUCF8A", "context": "Is the flap control a 3-way rotating lever, or an up/middle/down switch? I currently use one of the levers from a throttle quadrant as a flap control.", "response": "The Flap lever is a two position momentary switch that steps through the flap positions available for the aircraft in use.  In this sense it is very similar to what you would set in the real aircraft and makes the control more realistic.  Select either flaps movement upward or downward."}
{"product_id": "B003EUPCZG", "context": "is this mouse also good for maya 3d graphic designer ?", "response": "I am sure it would be perfect."}
{"product_id": "B00B3PDH5G", "context": "PS4 users, while playing and chatting, are there any cables connected to/from the headset/controller? or only cables between console/transmitter?", "response": "You must use a chat cable between headset and controller."}
{"product_id": "B007VFHIHA", "context": "can you play this game without the internet and do you get disc & software package for disc?", "response": "No, you can not play this game without having internet. You can download game to your computer,that way you can get all software for game."}
{"product_id": "B00F68LBE0", "context": "How can I use this controller on my PC?", "response": "it comes with a usb dongle (hidden between the joy sticks). just plug it in and it'll self install the drivers (windows 7 tested). after that it's up to you to bind the buttons to your games. the usb cable does nothing but charge it"}
{"product_id": "B00000K4MC", "context": "Will this game work on a windows 7 laptop?", "response": "yes, I have a laptop w/ w7 and it works"}
{"product_id": "B00JC9SWSC", "context": "Can you download movies and save them on the PS3?", "response": "Of course, you can do it, also try this Pages www.divxcrawler.comwww.ezmovies.netwww.free-movies-download.netwww.moviesplanet.comwww.filmannex.comwww.flixdump.com"}
{"product_id": "B0049B2FP4", "context": "will this work on window 7", "response": "Yes i am currently running it on a windows 7 machine"}
{"product_id": "B003YC4D9A", "context": "I just got mine in the mail and I'm wondering how do I connect it to the Wii U?", "response": "Is it Wii U controller"}
{"product_id": "B003ESDQW4", "context": "Is Black cat in this game?", "response": "Its been awhile since I played it, I don't think so...this is the only spiderman game I played more than once. If she is you don't get to play as her . but 99.9% she's not in this one"}
{"product_id": "B003VH5Z2C", "context": "does it work with a flat screen", "response": "Yes it does as long as u have basic setup like red and yellow plugs for video on your flat screen. If not then it won't work"}
{"product_id": "B00ARD5410", "context": "Is it compatible with windows 8?", "response": "yes it is, best mouse for the buck!"}
{"product_id": "B00FATRKWM", "context": "Where do you send it for repairs when it stops reading discs only 9 months later??? Says it has a year warranty on the console?", "response": "Go to http://www.xbox360.com (I think that is right link. Going of memory as I'm sitting at a pool. ) then click the support menu. It should be easy from there. I would wait until Monday though."}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "This game works porperly with Windows 8.1"}
{"product_id": "B00DOD0TZG", "context": "If I buy this will I be able to play the Mac versions of Infinite and Bioshock 1?", "response": "Now, I'm not 100% sure, but I believe it will give you the option for pc or windows download"}
{"product_id": "B00BY0G0YU", "context": "Does this game work outside of the US", "response": "It should? I mean if you have a ps3 then your set!"}
{"product_id": "B00A1Y2STQ", "context": "Does the keyboard light turn off when the computer goes to sleep?", "response": "It does not goes to sleep when the keyboard light turn off."}
{"product_id": "B002I0H2AG", "context": "I have a 4GB xbox 360e but I have a 36GB flash drive do I need a hard drive to play this game", "response": "Not necessarily. For this game, as long as you have the room for saving the content, then it'll play smoothly for you. :]"}
{"product_id": "B002I0J5CO", "context": "Does this headset have a button to mute the microphone? If so where is it located?", "response": "Yes it has one take your headset and go about half way down the cord and there is a little box it will have a red or green light on it if it's green the Mic is on and if the light is red it should be off its easy."}
{"product_id": "B007WPM9GO", "context": "If the hinge on the DS is already broken, will the nerf hold it in place?", "response": "Yes it will hold it in place. The Nerf is made to protect the top portion of the DS from over- bending, so the hinge can stay in tact. But if the hinge is broken already, then the Nerf will hold the top of the DS in place with no problem."}
{"product_id": "B002JTWODG", "context": "is the backlight blue or green?", "response": "This mouse features blue lights."}
{"product_id": "B00004XRBB", "context": "Can u fly the Junkers JU 87-B STUKA", "response": "Sorry I never saw the plane except in movies. I also. never flew a taildrager..Bob"}
{"product_id": "B00EM5UFEK", "context": "What is the xbox gold live membership?", "response": "it is a monthly membership.  if you don't have it - you cannot play the game... AT ALL!  would have been nice to know that before we bought it."}
{"product_id": "B001B5U80K", "context": "is this compatable with the xbox 360?", "response": "The product I purchased was clearly marked for PC. A product designed to work on Xbox would be identified plainly as such."}
{"product_id": "B006PP4136", "context": "Would a ps vita slim fit in this case?", "response": "Yeah I think so.."}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "I bought the Steam version and did not have to complete a separate registration."}
{"product_id": "B00IYWV852", "context": "I was thinking about buying a couple of this game as gifts, it won't be an issue will it? The recipients won't have any problem using the game codes?", "response": "Won't have any problems u can gift the purchase so it's all up to them or just email the redeem code to apply to their ncsoft account both will wrk easy"}
{"product_id": "B002CJ8Z04", "context": "how do you know if it is a fake or real game, thanks.", "response": "I really dont know. Game came with an authentic certificate and there have been no problems with it since purchashed. I usually go by the reviews of other purchases from the seller."}
{"product_id": "B00D78Q4UM", "context": "do the different color WASD keys, and directional keys have different textures than the other keys?", "response": "No, the texture is the same on all the keys."}
{"product_id": "B00IVHQ0KI", "context": "Can you change the gas and brake to the shifters behind the wheel in the controls options. I am in wheelchair and cant use pedals.", "response": "Yes, you can in Forza Horizon 2.  In the CONTROL settings, you have 5 different preset configurations.  It's 'Default Layout 5'"}
{"product_id": "B009RXUOD4", "context": "Can I use this by connecting it directly into my ps4 controller", "response": "Yes you can, but you only will be able to hear audio chat."}
{"product_id": "B00DC9T2J6", "context": "Will Titanfall run on a macbook pro?", "response": "No - if you look at the game details, it says, \"Supported OS: Windows XP   Windows Vista   Windows 7 \""}
{"product_id": "B00BGGIWZM", "context": "is the pc/mac version be used for mac and pc, is that what this means? or only the mac version be only for mac", "response": "It depends on the one you purchase. On the page it ask if you want to buy the PC version or the Mac version, personally I have no experience with a Mac so."}
{"product_id": "B00178630A", "context": "can you play 2 people at the same time", "response": "If you mean on the same computer, then no. You can have 2 copies and play over the internet with more that 2 people though."}
{"product_id": "B00DGZDFLW", "context": "Got my code today on the 22nd.... But I wont be able to download until the 25th? Correct? thanks", "response": "use code on steam you can preload but you cant play until 25"}
{"product_id": "B007C3E5WM", "context": "Is this mouse compatible with a macbook pro?", "response": "Sorry, I am not an Apple user, so I have no idea."}
{"product_id": "B00FC1UH82", "context": "How heavy is this fightstick? I'm confused, because the description said it was 14.1 oz.", "response": "I weighed it and it came to around 14oz, so either my scales are busted or it does in fact weigh this amount. It isn't too heavy."}
{"product_id": "B00CMQTVK0", "context": "what is special about the day one edition?", "response": "Everyone else is accurate except they are leaving out the fact that the Day One edition controller also has a black chrome d-pad, it's another small but nice touch."}
{"product_id": "B00E1L78N6", "context": "does audio pass over usb on the xbox one?", "response": "No audio goes through the controller both voice chat and game sounds basically putting a surround sound over your ears you can mute your tv and not bother anyone around you besides talking loudly to your friends."}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "Yeah, who cares if a 13 year-old is exposed to digital murder and bloodshed so long as they don't, god forbid, see a digital naked person or hear a curse word?"}
{"product_id": "B00HK74G2E", "context": "Where is the All-Stars Battle Royale game?  Is it downloaded or CD included?", "response": "The CD is included with the game system"}
{"product_id": "B00B1N07QM", "context": "[Solved] Does the Orbweaver store the active profile on the device like the n52te does? Does it have only the dpad for the thumb buttons?", "response": "It stores multiple profiles each with 5 different keying sets per profile. The D-pad as well as space and left alt \"or those keys \" are all used by your thumb, but as you already know any key can be any keyboard function or mouse function or macro"}
{"product_id": "B004GINKNQ", "context": "Will it be compatible with the 360 slim, i got one once but it crashed.", "response": "yes. It works fine and is easy to install. I purchased one for a friend and installed it for him, and it works fine."}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "No they're not switchable. the K70 comes in 2 colors Black & Silver. the black comes with red LEDs & the Silver comes with blue LEDs. (CH-9000019-NA) model is silver so it's with blue LEDs. sorry for the misunderstanding :)"}
{"product_id": "B00C7103DO", "context": "Hi, I would like to know whether it is the full game or is it the 10 GB version and we have to download the extra 8 GB?", "response": "Just the standard game. No DLC."}
{"product_id": "B00ECOBFA4", "context": "is there a free play mode", "response": "Yes there is. After each level you can play in free play mode."}
{"product_id": "B000B6MLSM", "context": "Does this remote work with Xbox Live? I need it to work with NetFlix that I'm streaming through my Xbox.", "response": "Yes, the remote can do everything a controller can do except play games. If you find the code for your TV, you can program the remote to control your TV as well"}
{"product_id": "B004YC4NN0", "context": "Will this work on phones, for emulators? Is it wireless?", "response": "I was trying to use it on my laptop.. It didn't work for me."}
{"product_id": "B00G6IJ5QK", "context": "Does the scroll wheel click when you scroll it or is it smooth?", "response": "It's a clicker, but it's a very loose click. There are gradations in the wheel, but it's still very easy to scroll with little actual force."}
{"product_id": "B0050SYK44", "context": "Do you have to hook this up to play it online or can you just get the updates and play offline?", "response": "No. you can not get the updates if your offline. you have to be online to get the updates."}
{"product_id": "B00H1FCUBE", "context": "I just got mine today and I tried to use it for ps3 and it says I need a pass key. do you no the pass key", "response": "I think there are a pass key in the manual. If not try 0000 or 9999."}
{"product_id": "B000056SPM", "context": "Is this only for flight sims, or can this be used for all driving games as well?", "response": "Check with Best Buys.  I think the driving sims use a different controller.Fred"}
{"product_id": "B008HPAXZ2", "context": "Does this product have an a and b protective film, like the ones for mobile phones?", "response": "What do you mean?"}
{"product_id": "B00965WK8K", "context": "Can this mouse be put in rapid fire mod?", "response": "It has a great ROF and trigger response but rpaid fire to me sounds like a hack. So no it cant shoot faster if you push the click just once"}
{"product_id": "B00HN9LS48", "context": "Will this work on a tv that is mounted on the wall?", "response": "What clearance do you have from the wall to back of your TV?"}
{"product_id": "B00EIM3BV6", "context": "Will these work on the Playstation 4 console?", "response": "Ps4 firmware update 1.50 will be available at launch and every usb headset will work! you can check PlayStation blog for the full article on patches and such."}
{"product_id": "B0050SVHZO", "context": "Can I use an SD card or another form of storage to make up for the 8GB?", "response": "Yes you can.  Any harddrive can be formatted to work with the Wii u."}
{"product_id": "B00B98HBTA", "context": "Has anyone had problems with this game locking up? Mine seems to do it about once every mission.", "response": "No my kids say it freezes as all games do every once in awhile but not anything that is a problem. I got the game brand new. Idk if u got it used or not so I can't really say what is happening with urs. Hope that helps u sorry it took so long to respond"}
{"product_id": "B002I0GF72", "context": "Does this game come with the gold foil cover or was that only upon release or preorder?", "response": "My copy looks exactly as in the picture. The packaging was standard with the eco-case & a pamphlet inside with instructions on how to access the electronic (in-game) owner's manual..."}
{"product_id": "B000VLNXRU", "context": "Will the GPS display on the pro flight instrument panel? I dont see it as part of the 12 instruments.", "response": "No, I don't believe the GPS will display on the panels. And I'm thinking they are probably too small and the wrong aspect ratio to be any good for GPS detail anyway."}
{"product_id": "B004JKZUJI", "context": "Does this work when playing games on the Wii Shop Channel?", "response": "NO!!!!!! This crap didn't work for me at all. Thought it was my wii controller at first thinking it wasn't reading it. Then I tried it on someone else's wii and still didn't work."}
{"product_id": "B00A378L10", "context": "Will this keyboard work with a Mac?", "response": "I know I'm late to the party, but this definitely did not work on a mac. It typed fine, but you need that 'command' key to do what 'control' normally does. Shortcuts for undo/redo/cut/copy/post/select_all are all gone unless there is some macro hack I am missing."}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "The game would intermittently freeze and at times would not respond to commands. I gave up"}
{"product_id": "B0002L88HE", "context": "For the Gold edition, it looks like it holds both AoM and AoM: Titans Expansion. Does it? Also, will both of these work on Windows 8.1? THANK YOU!!!", "response": "I have  8.1 on my other computer at home and it works there"}
{"product_id": "B00005NIMA", "context": "Is this a USB stick?", "response": "Will this control work on my new Windows 8 PC?  I have several previous versions of Flight Simulator from 2000 to 1998 and both Combat Flight Simulators 1 and 2.  Will they work as well?"}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "Yeah the blue dualshock 4 is currently only available via Japanese import"}
{"product_id": "B00I9UVY30", "context": "Is there coop online? meaning from the same PS3 system can 2 people play against someone online?", "response": "Yes is online too"}
{"product_id": "B002I0HJG8", "context": "Is this the Veteran code which can make me have 8characters?", "response": "This indeed has the code for the \"Founder\" status that gives 8 character slots, full bank tab, a mout for each character.But beware as it's the code for the NA version for TERA enmasse, so if you want to code for enmasse get it, but if ur looking for the EUropean version it's not this one."}
{"product_id": "B00CJ7IUGS", "context": "Do I need to have played Oblivion to understand Skyrim?", "response": "No. Skyrim is filled with lots of books to help you catch up on past events."}
{"product_id": "B005BLAJRC", "context": "Will these PC games work on a 64 bit PC?  Many games I had stopped working when I upgraded my PC from 32 bit to 64 bit.", "response": "I no longer have the game."}
{"product_id": "B00D96BNGM", "context": "Does it come with OEM Box?", "response": "yes it does all sealed :)"}
{"product_id": "B00BQZ5EWW", "context": "does this have the greek states as playable factions?", "response": "Nope but some faction in greek culture can be playable"}
{"product_id": "B008L3UUPS", "context": "If it only works for PC I can deal with  it, but does it work thru the USB on the wii-u ? Even in Virtual Console would sound great .", "response": "It's not really worth it for the authentic feel. I would recommend a N64 usbadapter instead and no, it's not compatible with Wii-U or any console for that! Hope I could help out! :)"}
{"product_id": "B00FENJVOE", "context": "Whats the content in the box? Only the DVD? Have some manual or something else?", "response": "The box contains a CD with authentication key for installation, a note pad, several guest passes for other battle net games and a very small instruction sheet on installation.Since you have Diablo III installed all you need is the key to get the expansion."}
{"product_id": "B004XIQN3I", "context": "Does it work with any joystick? Which ones?", "response": "Sorry but I use the mouse as the game is real simple and aircraft respond well to the mouse."}
{"product_id": "B00E8JZILA", "context": "How does it look on PS VIta slim?", "response": "looks great, there are some occasional glitches, but nothing that ruins the game."}
{"product_id": "B0073J8BYS", "context": "Does this work for the playstation 4 as well?", "response": "The controller itself will, but the camera that is included in this particular bundle is PS3 only. You would need the need the PS4 PlayStation Eye. You will also want to snag a \"navigation controller\""}
{"product_id": "B001L5TIR4", "context": "does an icon for The Rise of Atlantis appear on the desktop?", "response": "i don't know; frankly this game eventually crashed on my computer and I believe left a virus of some kind.  eventually, I got a new computer, but I wouldn't recommend this to anyone now."}
{"product_id": "B009AGXH64", "context": "Why is this one $10 more than the one that comes with mario and luigi U?", "response": "Is is because this one is 32GB?  Not sure what the other one is, but looks like the Wii U comes in 32GB and 8GB."}
{"product_id": "B00E6OLJ88", "context": "Does this product work for any call of duty specificly for MW3?", "response": "Yes it is amazing for every game easy to use"}
{"product_id": "B001AATQ0Y", "context": "does this work with ps2 DDR pad?", "response": "Pretty sure it doesn't."}
{"product_id": "B00JC9SWSC", "context": "does the bundle have move controller pack", "response": "Comes with one controller game and console"}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "Standard headphone jack. I was under the impression the Xbox One used some kind of proprietary connection on the controllers? I would just use the default headset."}
{"product_id": "B0050SYR74", "context": "Does it interfere with wi-fi?", "response": "It does not interfere with wifi, wifi interferes withe the rf signal from the box to the headset."}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "I wish could tell you something different but I bought it as a gift for my son's birthday and I believe that the disk was blank because I could never get it to upload"}
{"product_id": "B00GP0HQ3S", "context": "Does this come with a rechargeable battery pack? and can it be used on the nyko charger base", "response": "This doesn't come with the rechargeable pack and if you have a normal controller for xbox 360 and it works on the charger base this one isn't any different besides the color"}
{"product_id": "B004RMK4BC", "context": "if i have a Mexico PSN acct . would there be a problem purchasing a USA PS Store card?", "response": "I think it would not work. Just add your credit card information to your Mexican PSN account and you should be fine."}
{"product_id": "B007SRM5MO", "context": "This or old version?", "response": "This one Is really good more stuff. But I haven't played original. But this has dlc's"}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "No, my headphone the both drivers are ok."}
{"product_id": "B008M4BNQ6", "context": "Can you use two of these headsets on one Xbox 360 console?", "response": "Yes, That is what I bought them for and that is what I use them for.  No complaints."}
{"product_id": "B002BXKJA0", "context": "Can you play this with steam?", "response": "It only runs on Windows 7 or down, but if you have windows 7 it should work fine on Steam"}
{"product_id": "B00DNHLFQA", "context": "What is the file size of this download?", "response": "You will download games individually.  You'll just have access to all of them.  The file size varies between 500MB - 2 GB depending on which command and conquer you're downloading."}
{"product_id": "B0010WS20W", "context": "Will my MS windows7Home Premium (64 Bits)  work for your Master Poker Prof. no-limit Texas Hold'em ?", "response": "Yes...I use Win 7 64 bit and it works great"}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "They are compatible. I get a solid light when I inserted the xtra battery pack. So far this has been working just fine in my controller."}
{"product_id": "B00CXI0BPG", "context": "Does the logo glow all the time, or can it be shut off?", "response": "Yes, you are able to turn the Corsair glow off if you want through the software that you download from their website."}
{"product_id": "B000B6MLSM", "context": "I noticed the top picture has the Green MCE button and the second (bottom one in wrapper) does not have the Green MCE button.  Which is accurate?", "response": "if you mean media center button then yes it has the green media center button"}
{"product_id": "B002Z7BE24", "context": "is any of the extra content on the disc or does it need to be downloaded?", "response": "There is no extra disc. It will just be downloaded."}
{"product_id": "B00BMFIXZG", "context": "Can I buy the DLC later and have it work with this version?", "response": "Yes, just like every other game :)"}
{"product_id": "B00BTOAFXS", "context": "Will it make me have a faster trigger finger then now? People say I have a mod?", "response": "Yes it does make your trigger faster only because your finger doesn't have to travel as far to squeeze.  I don't believe this is a mod.  This is a modded controller: http://www.evilcontrollers.com/xbox-360-evil-controller-creator.html  73 Mike"}
{"product_id": "B00HEX8TA4", "context": "The lights come on, but the mouse and buttons won't move or work?", "response": "Was a tad bit wonky on first use. After I installed the driver/config software it work okay. What OS are you using? I am not sure if it is completely Win 8/8.1 compatible."}
{"product_id": "B008KE95UO", "context": "is is two player?", "response": "it is single player"}
{"product_id": "B00F27JN8Q", "context": "can you put ps vita cartridges in it?", "response": "Yes but it only takes the Japanese versions. Everything on it is Japanese"}
{"product_id": "B00D9FQAM0", "context": "does this come with any cords", "response": "Yes, it comes with the basic cords."}
{"product_id": "B002I0GF72", "context": "How long is this game?", "response": "Main Story26 HoursMain + Extras33 HoursCompletionist38½ HoursCombined31 Hours"}
{"product_id": "B008VXCPRY", "context": "Will it play on Windows 8?  Is it touch screen enabled?", "response": "I am not sure, I play the game on my Win 7."}
{"product_id": "B007CM0K86", "context": "Can you play the girl as the main character? or do you have to play the man?", "response": "I really do not know.  My son (in his 30's) is the family game and electronics guru and requested this game as a gift.  Sorry I could not be informative!"}
{"product_id": "B00KAI3KW2", "context": "what is Kinect for and what about a mic for voice commands?", "response": "Kinect is for Motion Gaming, using Gestures to control the Xbox, and most importantly voice commands. Sadly no, a different external microphone will not work for voice commands. Head over to feedback.xbox.com and suggest it, maybe they will add it."}
{"product_id": "B00B3PDHBU", "context": "Was the packaging already opened upon arrival?", "response": "well it was brand new, but i cant actually remember if there were any seals"}
{"product_id": "B00DCDZM2I", "context": "Can 2 or more players play at the same time?", "response": "Yes 2 players can play at the same time."}
{"product_id": "B0086UK7IQ", "context": "Does the second right click get in the way a lot?", "response": "I thought it would at first but it never has"}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "only on the wiiu for wiiu games only, wiiu pro controller doesn not work with any wii games even if played on the wiiu."}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Yes it has in the down side"}
{"product_id": "B00KAI3KW2", "context": "how many gig on the hard drive", "response": "The hard drive is 500GB BUT and update coming to the system in June will allow you to attach your own external hard drive."}
{"product_id": "B001GROEEO", "context": "may  iuse it in costarica", "response": "You can use it anywhere as long as you use it on an american account with an address in the US."}
{"product_id": "B00FNKMVUO", "context": "can you program this for things like Adobe Photoshop editing steps? thanks.", "response": "You should be able to bind them to anything, usually it binds to keyboard key(s), anything in photoshop that can bind to key(s) is thus covered by this."}
{"product_id": "B00B15EXJC", "context": "Does this controller work well with call of duty games", "response": "Yes, works great on all games.  A really good product."}
{"product_id": "B00CX8VY4S", "context": "Is this watch dogs a disk or download", "response": "I bought the disc but the download was available."}
{"product_id": "B00DC9T2J6", "context": "With Titanfall for PC ... are you playing against XBOX One, etc, players? Also, can you pull your game data from XBOX Live account (I take it not)?", "response": "don't know about second, but it is totally online against others, and there seems no differentiation of platform, and there is a lot of hacking.  great graphics and controls, but very short till it isn't enjoyable.  At ant rate, there are plenty of opponents."}
{"product_id": "B0018YXM3Y", "context": "What are the requriements for this game and does it require STEAM to play simple campaign mode?", "response": "Yes you need steam :/ and if you dont have fast wifi like xfinity it will be a pain in the butt to try to download it plus the game, but it will be worth it, this game is the best!"}
{"product_id": "B009XZ1CTQ", "context": "Can you load the DVD on 2 different laptops,or once only?Do you need a space bar to play(ours is currently broken)?Is the PC version superior to xbox?", "response": "you can only use the code once, and u don't need a spacebar, and i dont know about pc and xbox b/c ive never played it on xbox."}
{"product_id": "B00A378L10", "context": "Are the Home, End, PageUp, PageDown  functions accessed by using the shift key or NumLock? Also, I see tat the default function of the \"2\" is up arrow", "response": "The numlock key will enable/disable all of the secondary functions on the keypad. Press it once, and you've got up, down, left and right as well as End, Home, PU and PD... Press again and the keypad is enabled."}
{"product_id": "B005L38QK2", "context": "How long is the cord?", "response": "approx 6 feet.  and very heavy duty braided cable.edit:  according to the ad info Cable: 2m (6.5ft), braided"}
{"product_id": "B00886XQO0", "context": "This or turtle beach xp510 ? Is there differences between these two headsets?", "response": "The color and voice notifications, otherwise there identical."}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "Its an audio jack input, not USB, so there is no reason why it wouldn't work on a mac. I use my set with both my PC and my iPod when I am at home, and have no issues."}
{"product_id": "B000TGQLYE", "context": "You said you tested this multitap with your own PS2.  Which model version is your PS2?", "response": "Mine is the after market ps2"}
{"product_id": "B00BI83EVU", "context": "I was under the impression that games would be able to be delivered to arrive by the release date.  Is this correct?", "response": "The estimated date for me changed when I went to two-day shipping. I changed mine to do one-day shipping and about one hour ago I got a email saying that they shipped it."}
{"product_id": "B007JDMPOK", "context": "Does this open up more than 2 character slots on a single server?", "response": "Yes it opens more than 2 slots. You have full access to the server with the ability to have 8 characters per server."}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "It has a key which allows you to add it to your steam library after installation. I believe I downloaded the game files with amazon but it is also now in my steam library."}
{"product_id": "B0081GA50U", "context": "Does this work for the PS Vita 1000 series?", "response": "Yes, I have the 1000 series and it fits like a glove."}
{"product_id": "B008KE95UO", "context": "Does this game have multiplayer mode?", "response": "No. It has a giant SP campaign. No MP at all."}
{"product_id": "B00CMQTUY2", "context": "I'm new to all this, why do I need a play and charge kit?", "response": "I'd recommend it just for the fact that if you controller is during while your playing you can go ahead and plug it in and still be playing as its charging"}
{"product_id": "B004S5PBM0", "context": "Is this for a 13 year old beginner?", "response": "around that age group"}
{"product_id": "B002VBWIP6", "context": "Does this work with xbox one?", "response": "this is a universal membership and it will work with anything on the xbox live server"}
{"product_id": "B004RMK57U", "context": "how can i use ps plus memnbership from my ps3 to my ps4 system? can i use in my ps4 and delete from ps3?", "response": "If you are using the same PS account, it doesn't matter which system you use, you always have the PS Plus benefits, but beware since you have a numbered of systems and consoles allowed to each account."}
{"product_id": "B005VO5ZVY", "context": "does this cover fit the 3dsxl", "response": "Yes, but to be honest it makes it very bulky."}
{"product_id": "B00006C2HA", "context": "Are there only 3 discs in this game?", "response": "Yes it only comes with 3 discs"}
{"product_id": "B00CX8VYM0", "context": "Is this a digital code or the actual game disk?", "response": "actual game disk. Works fine."}
{"product_id": "B004C4U1VI", "context": "Have the Xbox 360. Do not see how the cable hooks up to the gaming console.  None of the slots fit any of the cable.", "response": "It does work for the 360, I've used it with it. It's the biggest out of the three on the cable."}
{"product_id": "B00B98HDNO", "context": "Any chance I could get this to work in Linux?", "response": "I don't think so. However, Steam has a platform they built on Linux that runs games."}
{"product_id": "B008X73CE8", "context": "will this run on windows 8.1?", "response": "Yes, I have 8.1 and have had no problems thus far."}
{"product_id": "B002BS47JE", "context": "will this system work with a U.S. purchased sysyem. thanjs", "response": "Yes!  Perfectly.  NO problems."}
{"product_id": "B008BT2FWI", "context": "Will it work with Windows 8.1", "response": "I don't use win8,  sorry"}
{"product_id": "B002ZS6Y64", "context": "This works with any PC right ?", "response": "It should. My brother used it on his laptop."}
{"product_id": "B007VTVRFA", "context": "I bought the Standard Edition,where am I suppose to download the game,the download link seems leads to an html file.", "response": "Just redeem the key origin: https://www.origin.com/en-us/store/. You can download there."}
{"product_id": "B004AM5RAW", "context": "Is this the special edition Naga?", "response": "Well one my best friends has that mouse. I have the original and the 2012 version so far. Really only major difference is graphics on the mouse and not sure if molten is hand size customizable. 2012/2013 standard Razer is."}
{"product_id": "B0096L2SJ0", "context": "Does this fit with the phone, when it has a case on?", "response": "Umm, most likely (vague question???), but the tilt only goes so far and then it still sucks. You didn't read my review didn't you?"}
{"product_id": "B002I0K3PM", "context": "is this appropriate for 6 year olds", "response": "Yes. My 6 yr old loves it. No problem with content"}
{"product_id": "B006NU6F28", "context": "does it work with logitech driving force pro?", "response": "i think any wheel works but it should don't see why not"}
{"product_id": "B00BM7NXMW", "context": "The scroll wheel won't scroll back, is there any way to fix that?", "response": "Sorry but I guess that the better solution for that is send back the item and request another from the seller.I really have not the minor idea if that is fixable."}
{"product_id": "B008X73CE8", "context": "will silent hunter 4 wolfs of the pacific run on windows 8?", "response": "Yes, I have windows 8.1 and it runs fine, good luck."}
{"product_id": "B00FC1UH82", "context": "Is this fightstick compatible with PC ?", "response": "Yes, both the PS3 and Xbox360 version are."}
{"product_id": "B00B0QONB0", "context": "Does it comes in Retail Box or bulk ?", "response": "It was in a little box. Did not work for my Xbox.  It gave the red ring of death."}
