{"product_id": "B00HS5FETM", "context": "will this work for Xbox360? and also will it work for the turtle beach phantom headset?", "response": "I don't think it will work for the Xbox 360 because the plugin on the controller side is different. Which is why I purchased this cable to use with my ps4."}
{"product_id": "B000TLU67W", "context": "can it play the ps1 games like the ps2 original did?", "response": "Yes, it plays PS1 games and accepts PS1 accessories such as memory cards or multi-tap."}
{"product_id": "B00EOI2MRS", "context": "does this controller work on pc?", "response": "Yes, I've used it with steam games. Had to map buttons manually but worked great. :)"}
{"product_id": "B00EZKNSTQ", "context": "what do they mean by 3rd party controller?", "response": "It simply means that Microsoft did not manufacture the controller at one of their plants or a company That is officially licensed to manufacturer their products."}
{"product_id": "B00EF1OGOG", "context": "How many times will it charge my Galaxy S4?", "response": "My Galaxy S3 charge about 1 and a half times"}
{"product_id": "B001V9PTVE", "context": "Can i play these on a mac?", "response": "You will have to use W.I.N.E to do it, but it can be done."}
{"product_id": "B003O6EE4U", "context": "Is it possible to watch DvD's with the Xbox 360?", "response": "yes you can watch the videos."}
{"product_id": "B00HK74G2E", "context": "Can you play PS2 games w/ this PS3?", "response": "No, this PS3 cannot play PS2 games. The PS3 model that allows PS2 back-play essentially has a PS2 inside that allows the back-ward compatibility, making that model MUCH heavier. PSone playback however is possible. Of course, PS2 games that have been brought into the PSN for digital download for the PS3 can play on here."}
{"product_id": "B00DBDPOZ4", "context": "The description claims 30 hours of battery life, but how much did you get out of it before having to charge it?", "response": "I can say I've put in about 35+ so far and still haven't had to charge it yet."}
{"product_id": "B00I14395A", "context": "This item as a combo is $157.99. They are separately (Mouse MX for $67.39 and K800 $64.99) $132.38. Why?", "response": "Because the K800 keyboard is not the same as the MX800 keyboard. Big quality difference!"}
{"product_id": "B00CMC6HCY", "context": "Is the commentary in this game as good as those hereby found in SVR 2006 or better?", "response": "The commentary is terrible, plain and simple."}
{"product_id": "B009LGO88E", "context": "can i use the Circle Pad Pro as a grip for non supported games", "response": "Yes you can. You can just leave it on as a grip."}
{"product_id": "B00EM5UFF4", "context": "What kind of game is this?  Is it just for kids?  I'm a 37 year-old male?", "response": "I would say players of any age would find this game incredibly fun. At it's core it is a shooter, but with fun customization and upgrades, I like it more than CoD"}
{"product_id": "B00BXONG7G", "context": "if i purchase this (Battlefield 4 [Online Game Code]) will i get the full game to download or only the key ?? if only key, where is the game", "response": "Amazon let you download it and give you the key, too"}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "But if you have ps3 you can play with everyone pc to ps4"}
{"product_id": "B009Q8PP16", "context": "Will this work for TitanFall?", "response": "Not on xbox one obviously, but I have used this mod remote for a ton of other games :) if its an FPS its going to work for sure...just not as good as call of duty games...."}
{"product_id": "B00DBDPOZ4", "context": "Is this product essentially the same as putting 2 aa rechargeable batteries into the controller and just plugging a micro usb until charged?", "response": "it's much better you put it in the controller and let it charge for 30 or 40 miniutes unplug the charger  and use it recharge is the same way and you don't have to keep buying batteries"}
{"product_id": "B001444IN6", "context": "Can Sims Deluxe be played on a Window 7 64bit PC?", "response": "Yes, I have it installed and running on a Windows 7 Pro 64bit PC"}
{"product_id": "B0050SX7BQ", "context": "Please, is this game translated to spanish?", "response": "Yes it is, you may have to contact SONY and order from them."}
{"product_id": "B00A378L10", "context": "Are the Home, End, PageUp, PageDown  functions accessed by using the shift key or NumLock? Also, I see tat the default function of the \"2\" is up arrow", "response": "Switches with NumLock. Switching can be a hassle while typing, so I've found myself using the top row for numbers now."}
{"product_id": "B00HVBPRUO", "context": "is there a separate volume button for chat sound and game sound?", "response": "There is an app; \"Headset Companion App\", that should allow you to customize your listening experience for the Pulse Elite & Gold headset.  I've DL it, but unfortunately it doesn't support the original Pulse Headset."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "yes because i got when i was 10 and i skipped all cutscenes and just followed the instructions on what to do"}
{"product_id": "B00DB9JYFY", "context": "Do you need a \"chat headset\" and a \"Kinect\" in order to play Titanfall?", "response": "No, you definitely do not need either. You will need a headset if you want to talk to other players online. What you do need is a subscription to Xbox Live Gold because this game is 100% online."}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "The system that I purchased for my little brother is a super slim. It has the manual sliding option."}
{"product_id": "B002P35JMO", "context": "will this work for turtle beaches on the xbox one or only 360?", "response": "Im not sure about the turtle beaches, it worked for my after glow. I think it should work on the beaches too."}
{"product_id": "B003O6E986", "context": "Is this a full game?", "response": "Yes, and while some dlc codes aren't guarenteed, there's still lots of stuff for you to do. :)"}
{"product_id": "B00FFL0T46", "context": "Does anyone know who the VA for Bigby is?", "response": "The actor is Adam Harrington.  He's a voice actor who has worked on several video games including telltale's Walking Dead series."}
{"product_id": "B000TK99PS", "context": "Is the game Bump Em on this", "response": "Yes, Bump Em is on this."}
{"product_id": "B0053BCO00", "context": "Works in the 2ds?", "response": "Yes, all 3DS games should work on the 2DS. I only have the 3DS XL, and this game works great on there."}
{"product_id": "B000BD9PBQ", "context": "Palm Tungsten E2 Compatiblility Is this item good for a Palm Tungsten E2?I need to know before ordering it.Thank you", "response": "hi guys, did you find out if it works with Tungsten"}
{"product_id": "B0081GA50U", "context": "Does this Work with 2000 series?", "response": "That's a totally different system."}
{"product_id": "B007TYC8MI", "context": "Was this new copy supposed to include an online pass voucher?", "response": "I have the same question, I can't seem to find where the online pass is supposed to be."}
{"product_id": "B004G5TUJM", "context": "Does This Steering Wheel work with \"Gran Turismo 6\"", "response": "Yes it does, im playing on it right now! It plays all ps3 racing games."}
{"product_id": "B00BGA9X9W", "context": "Are the sticks confortable to play with? Meaning it won't slide my thumbs by mistake like with the DS3?", "response": "Definitely. There's an exterior material on the sticks and grooves all around the inner diameter of the sticks, making them grip so much better than the DS3. The texture ensures solid grip unless you get unnaturally sweaty."}
{"product_id": "B003RS1A7Y", "context": "Is it compatible with PAL system?", "response": "I do not know I think that it should being as it is for a PS3 I should think it would work on any PS3"}
{"product_id": "B00H72EMP8", "context": "Can I connect these to my PS4 so I can use the inline controller?  It is a must-have for me to have a quick mute for my headset.", "response": "My 9yo nephew says yes. Hope we helped."}
{"product_id": "B00B5QLS4A", "context": "Is this mouse comfortable with large hands, i currently have a g600 and it just isn't comfortable for my meaty hands anymore....", "response": "I don't have meaty hands, but I have long fingers and it fits me fine. Sorry if this doesn't help!"}
{"product_id": "B00GG4BBUM", "context": "what means canadian cover?", "response": "MLB the show games always have 2 covers one that is an American cover and one that is a Canadian cover"}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "The difference is that the online game code allows you to see the code as soon as you buy it,the other you have to wait for it to ship to you."}
{"product_id": "B005BLAJRC", "context": "what games are included on the cd?", "response": "I didn't like the choices so I donated it. Sorry not much help."}
{"product_id": "B00H45K6KS", "context": "Is the language uesd in the game Japnese or English? I am looking for the Japanese version.", "response": "This version is not the Japanese version, but it has dual audio, meaning it has both English and Japanese voice actors. Interface is solely in English though."}
{"product_id": "B00CQOG8MM", "context": "If I brought this game first can will I be able to download the sims 3 generations?", "response": "Yes! That is exactly what I did!(:"}
{"product_id": "B00E1A1SP6", "context": "Will the new one come with an sd card, wall charger, stylus, etc?", "response": "Yes. It did come with the SD card, wall charger and stylus."}
{"product_id": "B008X73CE8", "context": "What's the DRM on this?  Does this redeem on Steam?", "response": "I have not played this product on steam. I downloaded it from amazon directly to my computer. The product comes with a key that you have to use while installing the game."}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "it came with a belt and you need it in order to play"}
{"product_id": "B00ARCWQOO", "context": "Why does the game not allow you to have full control of fielding?", "response": "Well it should say somthing about the throwing are assists...... Not sure I sold mine yesterday are I would look for you."}
{"product_id": "B004IK24MU", "context": "is the wrist strap a problem while charging?", "response": "Barely!! If you pull the wrist strap under the controller as if it were a tail coming from the front, it works just fine :)"}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "I had lots of problems installing Titan Quest on Windows 7.  I had to copy the CD to a memory stick and install it from the memory stick. Use google to get tips about getting Titan Quest to run."}
{"product_id": "B00ANHBJBY", "context": "Will this controller work with the new Super Smash Bros. Wii U game? Does it register as a pro controller?", "response": "Yes, it is actually really good for super smash."}
{"product_id": "B000FN7K2S", "context": "I got the game and it did'nt work and it did'nt even come out of the computor. This game got alot of reviews but it's really hard to install", "response": "Same problem here. Got it installed once but it stopped working. Couldn't get it installed again."}
{"product_id": "B008GEH9HO", "context": "which region this 3ds xl belong?", "response": "Should be the same region its shipped from."}
{"product_id": "B0009PRCNO", "context": "Is it backwards compatible?", "response": "Yes , this specific model ( first ps3, as shown in the pictures ) is backwards compatible with the ps1 and ps2"}
{"product_id": "B008O510Y8", "context": "does this have a usb connection", "response": "I recommend this if you would like to connect the headset to USB: SYBA external USB Stereo Sound Adapter for Windows, Mac, Linux Extra Audio Source with Microphone SD-CM-UAUD"}
{"product_id": "B00C2B2Y9A", "context": "So far ive read it works on the PS4, Xbox1, PS3, and 360? Is it wireless for all systems? just plug them in the controller for sound and chat?", "response": "Yes indeed. All you need to do, is plug in the opitcal cable from the receiver to the console. And yes, you will also need to use the chat cable if you want to chat, haha. But you actually don't need it if you're not talking. I have found that the audio is also quite a bit better too!"}
{"product_id": "B00D96BNGM", "context": "This or the Tangos?", "response": "Same headset different look.  My personal favorite is the MW3 Delta.  The MW3 Delta has 7:1 Dolby Surround (Tango/Phantom have 5:1) and the ear cups are cloth which are a LOT more comfortable than the material used on the other headsets.Comes down to personal preference!Go to turtlebeach.com for presets and updates on any of the headsets."}
{"product_id": "B00BGA9X9W", "context": "Why doesn't this come with a USB cable to charge it?", "response": "They expect us to use the cable that comes with the ps4 console"}
{"product_id": "B003RS1A7Y", "context": "Is it compatible with Guitar Hero: Metallica and GH 5?", "response": "I don't think so."}
{"product_id": "B002I096AA", "context": "can i play older gameboy games on this such as pokemon yellow?", "response": "No, the cartridges are completely different."}
{"product_id": "B000M6DHA2", "context": "good for project m ?", "response": "Perfect For Project M , I Got This Very SD Card Just For It And Works Fine"}
{"product_id": "B005S0KH7I", "context": "How long is the wire?", "response": "Eyeballing it, I'd say 6 feet."}
{"product_id": "B007FVVXXA", "context": "should I tape it to the ps3 if it wont stay or is there somthing I can use something else? will it help to put my ps3 vertically", "response": "I'm just saying from my experience that it fried my turtle beaches and a racing wheel so I would use it"}
{"product_id": "B00GPH7Y8S", "context": "Do each of these games have single player options? I ask because IE 5 is required to play each of them?", "response": "Yes they do, and they are good!"}
{"product_id": "B0090ECASW", "context": "do you get the mad catz or cyborg version? Also, do the keys light up and (if so) are you able to choose the color?", "response": "I had the Mad Catz version, and it was the biggest piece of crap I have ever bought. DO NOT WASTE YOU MONEY ON THIS."}
{"product_id": "B0072A4JVW", "context": "Does it work well with the PS Vita Slim?", "response": "I don´t think so, the Ps Vita Slim is thinner and maybe it will not suits well."}
{"product_id": "B001B5U80K", "context": "I have a Netbook without internal DVD player. Do you need to have the DVD on the system (external) to play it?", "response": "No, you don't. Once you install the game, you can go on to play without the Disc."}
{"product_id": "B005L38QK2", "context": "Is it fully rubberized? or is it a slippery plastic?", "response": "It's lightly coated and doesn't feel slippery at all. It grips fairly well. Only thing I've noticed is that after a few weeks of moderate use, the moisture from my hand has started to fade the design colors a little. Mouse is a beast though."}
{"product_id": "B008BT2FWI", "context": "does it work on window 7", "response": "I would look at the recommendations for the game which you will find below the game when you  look it up to get it. Always check to see what the game recommendations are. I think that this game is going to be okay because its a newer game. kitty58miner@gmail.com"}
{"product_id": "B004QRKWKQ", "context": "Does it work well with the XBOX 360?", "response": "As it is an XBox 360 controller, it works fine.  :)"}
{"product_id": "B000VLNXRU", "context": "Hello, this instrument supports P3D V2 it? Buy.", "response": "I only know that it supports FSX"}
{"product_id": "B00DWXUYN0", "context": "Is this made to hold the 3ds XL during gameplay or is it just a storage case? Thanks in advance!", "response": "Just a storage case."}
{"product_id": "B00D96BORK", "context": "how would i set it up for hdmi?", "response": "The same way you set up any turtle beaches, just put the red & white component cables from your console into the turtle beach ports & you'll be fine, the HDMI is from your console to your TV, that has nothing to do with the beaches. :D"}
{"product_id": "B0086UK7IQ", "context": "I often switch between a palm grip and a claw grip depending on what I'm doing. Is this mouse only suited for one style of grip preference or not?", "response": "Honestly, it's a mouse that really wants you to use palm grip, but is suitable for claw grip if that's what you're comfortable with. It's what I use most often."}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "They work perfectly and for longer than i thought with the lower mAh"}
{"product_id": "B00C2B355W", "context": "Can this be hooked up to my Xbox One and PS4 simultaneously?", "response": "Probably only with an optical switch, which the manual ones are very cheap"}
{"product_id": "B006W41X36", "context": "does it work with ps3", "response": "I use mine on an Xbox Kinect. Not sure about PS3 - you can contact Turtle Beach and ask them. I would think it would work OK, but better to check first."}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "It doesn't require batteries as it uses power from the controller. My husband uses the rechargeable batteries, so that might be something you'd want to look into purchasing! It's wired to the controller. :) Hope that helps! (and I'm sorry for the delay - this email was lost!)"}
{"product_id": "B0057WDBHA", "context": "Will it work on PS4?", "response": "as of now, no. might need to mod it further."}
{"product_id": "B00EZPCWWA", "context": "Can the DS2 link to a Nintendo DSI or just another DS2? I have two sons and I would love for them to play  simultaneously on one game.", "response": "Yes, it is indeed possible.Just make sure that when your son goes to the DS Download app, he selects \"NintendoDS\" and not \"Nintendo3DS\"."}
{"product_id": "B00FC1UH82", "context": "Is it wireless? or you have to plug it via usb?", "response": "It plugs in Via USB to a PS3. It can be dual modded for Xbo 360 as well if you know how o do it or find someone who does."}
{"product_id": "B00BGAA3S2", "context": "does this have motion gaming like the kinect", "response": "No motion gaming. Just a camera so you can see your friends while gaming"}
{"product_id": "B00001LDCK", "context": "will it work with vista?", "response": "I would say. NO.  This game barely worked with xp with high level graphics cards"}
{"product_id": "B004EJ0L8E", "context": "how long is the cord?", "response": "Oh man like 4-5ft? Plenty of cord."}
{"product_id": "B004RMK57U", "context": "i'm from Portugal , and i have a portuguese psn account , if i buy it ,will it work for me?", "response": "Yeah Tiago it should"}
{"product_id": "B00ENFVJJO", "context": "does it charge one controller at a time even if you dock both at the same time, and automatically charge the second after the first?", "response": "It will charge both at the same time."}
{"product_id": "B00E1L786S", "context": "how do you change the modes?", "response": "Find the source key on n1 or the  key of 1,2,3 on the remote control,then  try to press by turns"}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "It's multiplayer online only. Completely lacking single player campaign or mode. You cannot even created a private match alone against grunts and spectres and even if you could you still need to be connected 24/7 to actually play any of the game including the tutorial. It needs Internet to be playable."}
{"product_id": "B00FB45YFQ", "context": "Do these completely cancel out all noise?", "response": "Not really, but just a little out noise you can hear."}
{"product_id": "B00CMSCWGS", "context": "Does this work on Macs ?", "response": "No unless you have windows installed on your Mac"}
{"product_id": "B002FY0CM0", "context": "Will this fit the Sega Genesis system model number MK-1631 9 pin?", "response": "It works for me, I`m very satisfied with mine, see ya!"}
{"product_id": "B000ZBZK7C", "context": "will this run on mac", "response": "My version will not run on apple products...only windows based systems. I dont know if they sell a apple based version. I bought a net book with win 8.1 just to run the software."}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "Yes it is compatable. I have a Samsung flatscreen and used the AV cables it came with. (The red yellow white cable)"}
{"product_id": "B001GROEEO", "context": "may  iuse it in costarica", "response": "Yes sir, it works fine. No va a tener ningún problema."}
{"product_id": "B002DUCF8A", "context": "Does this require a driver download for Windows 8.1?", "response": "Not a problem, anytime."}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "Pro is for United Kingdom and the black one is for US"}
{"product_id": "B000PD0HQE", "context": "Does it come with all the games", "response": "mine didn't come with any games...but I bought only the console and controller"}
{"product_id": "B005S0KHIC", "context": "does this work with windows 8?", "response": "yes, it certainly does. you can just plug it in and use the native windows driver or download and install the Logitech software for it."}
{"product_id": "B00009W5WB", "context": "Judging by the picture the connector is the same connector for the wired Xbox 360 controller, so can I use my 360 controller for the OG Xbox?", "response": "I don't know for sure. I think that particular equipment was for original x-box. I still have my original x-box and play games such as Halo and need for speed, but haven't use it on x-box 360"}
{"product_id": "B004774724", "context": "I accidentally bought the wrong one, what should I do?", "response": "I am not sure what you can do if you bought the download version. If it's the disc version as said in another one you can go into your orders and go through the list and find the return/replace and go through the steps."}
{"product_id": "B001O3066U", "context": "Replies indicate this edition will play on Windows 7 Home Premium.Reviews in other places indicate there are problems. What do you think?", "response": "I have Windows 7 Home Premium and it plays great! I really like the graphics, too. The sound is good and it's responds quickly after a play."}
{"product_id": "B00H4BBVZQ", "context": "Is it worth it to get the GOTY edition or is the regular one ok?", "response": "The GOTY edition just has an extra tomb and a few extrea costumes (which aren't the most exciting costumes). Most of the extra stuff is online content. I've noticed that no one plays online these days anyway. So... if you don't care about the extra stuff... then any version is fine!"}
{"product_id": "B0086V5UF0", "context": "Does this game requires video controller or the Active floor Mat?", "response": "Just the controller, I use is all the time and we don't have a floor mat!"}
{"product_id": "B00FOGFP0A", "context": "Will a PS4 upscale the game or no?  Is this collection even playable on a PS4?", "response": "PS4 will NOT play this game"}
{"product_id": "B0095P5K8I", "context": "can i turn the light off?", "response": "Nope. i don't think so."}
{"product_id": "B0083H4NG4", "context": "Does this mouse have \"free-scrolling\" capabilities like some of the Logitech line?", "response": "No, not to my knowledge. I purchased this mouse on behalf of a friend. I also researched youtube.com for reviews. My current mouse is \"Logitech Wireless Performance Mouse MX\". it has free-scrolling."}
{"product_id": "B009SJR28W", "context": "Whats the difference between the expert version and the essential version?", "response": "Hey, David.  It's mainly the green LED back-lit keys.  I recommend the expert edition though.  As all it's keys are programmable, it does have the green LED back-lit keys, and it's just a lot more fun to look at.    :)"}
{"product_id": "B00CJ7IUGS", "context": "Do I have to start a fresh game to play the DLC? I have a level 12 character and I don't want to start from scratch.", "response": "I do not believe so.  You should be able to play the DLC once you download it.  The DLC I have played so far is really long and fun - the Dawnguard DLC.  Good luck to you!"}
{"product_id": "B00FB5R3XQ", "context": "Does this also work for ps2 games played on the ps3, the old ps3 with the actual games not digital downloaded ones?", "response": "Yes it does work with compatible ps2 games on the original ps3 model"}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "I have Windows 8.1 and I've never had it crash on me"}
{"product_id": "B00A8HIGSS", "context": "Is this different than the game Okami HD on the Playstation store?", "response": "Its mostly the same."}
{"product_id": "B00CD1FC6G", "context": "Corsair Vengeance K70 or CM Storm QuickFire TK?", "response": "K70 has the removeble wrist rest, it makes my wrist feels comfortable. I think it's better than that one."}
{"product_id": "B0036WTVNG", "context": "I got one.......says to put in disc but it did not come with one.", "response": "There's a driver available on the website here:  http://steelseries.com/us/support/downloads"}
{"product_id": "B00ATF5YZM", "context": "Do you redeem this on Steam?", "response": "Well that's the way I did it. On the main steam window, at the bottom left corner, there should be some text that says \"add a game\". Click on that, and then click on \"activate a product on Steam\". You should redeem your code there."}
{"product_id": "B007MM9E42", "context": "What ages can play this game?", "response": "I would say it is meant for ages 5-10 but honestly no one should play it because it is made very poorly."}
{"product_id": "B0041RR0TW", "context": "Has anyone used the 710 Gamepad on a windows 8.1 system?", "response": "I have 8.1 and had no trouble installing it.  Didn't even have to go online looking for drivers.  But I have heard of others having trouble getting it to work with 8.1."}
{"product_id": "B00B23MO9Y", "context": "If i buy the codes online will i be able to play with just this disc?", "response": "No, I believe this is just the add on.  You're better off finding an all inclusive edition if you dont have the originals already."}
{"product_id": "B0096L2SJ0", "context": "Can the controller be charged?", "response": "It takes ,2 AAA battery"}
{"product_id": "B001COU9I6", "context": "does it last long", "response": "It will last as long as you allow it. Take care of your system and it will take care of you. Do not overwhelm it with photos, music, or even data. I would suggest that utilize a external hard drive for any extras you have for your system."}
{"product_id": "B003VH5Z2C", "context": "Can you use original NES controllers?", "response": "I never tried it but the inputs are the same that the original nes had. I think they are compatible and as soon as I see an old nes joystick I will buy and try it out"}
{"product_id": "B008O510Y8", "context": "does this have a usb connection", "response": "No it doesn't... You can get a usb adapter though."}
{"product_id": "B000RA778G", "context": "I have windows 8, will it work.", "response": "Yes. It works great on my laptop & I have windows 7"}
{"product_id": "B005QUQP80", "context": "Is this keyboard compatible with a MAC?", "response": "It should be although I'm not sure if the media buttons will work.  If you're planning to use the USB port on the keyboard (there is one on the back close to where the cord connects), you'll need 2 USB ports fairly close to eachother on your computer."}
{"product_id": "B005M0KSIM", "context": "Does this game have a multiplayer option?", "response": "I do not know. Bring it up on the internet or call a games store. It is on The back of the box. I returned the game because it would not work on my computer. You have to have \"steam\" to install it."}
{"product_id": "B00AKIPBNS", "context": "IS this appropriate for a 8-9 year old?", "response": "I would let my kid, but ultimately its up to you. Plenty of violence, however. nothing is graphic (blood etc). Nothing sexual at all (there is minor romance plots, but nothing outside that). It's a great game."}
{"product_id": "B00BGAA0SU", "context": "is this infamous really the limited edition?", "response": "Yes, i love the game."}
{"product_id": "B002XLR0JI", "context": "My palm is a little big, so is this mouse small, mid, or big size??", "response": "It's going to be small for your hand if you are a 'palmer'. If you're a 'claw' or 'finger tip' gripper it might not be much of an issue."}
{"product_id": "B003VH5Z2C", "context": "is it hard to hook up", "response": "No. It's just as simple as the original Nintendo."}
{"product_id": "B00DRKJBC8", "context": "will this work for windows 8", "response": "I have Windows 8 and it worked just fine for me."}
{"product_id": "B004TTNTYW", "context": "Does this actually work for Nintendo 3DS? Because I brought this for a replacement charger because I lost my previous one.", "response": "Yes it does. My son has a 3DS and uses this one."}
{"product_id": "B00GANWVJE", "context": "Does this game work with Nintendo DS?  Or is 3DS required??? buying for gift, not familiar with game systems . . .", "response": "This game only plays on the 3ds 2ds and 3ds xl"}
{"product_id": "B00GJSUXLS", "context": "Does this game still come with the code for unlocks when TPP comes out?  Does the One version?", "response": "It comes with a code but it doesn't say whats it's for. Something nice im sorry. Just says login and add your code."}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "Yeah it does Katherine, you're gonna need some adapter to get the mic working though, it works great on pc and 360 but i seriously don't notice any differenced from using a $80 headset"}
{"product_id": "B00GU8W5AE", "context": "How clickable are the 12 side buttons on a scale from 1-10", "response": "I'd say 8. They're not too easy to click... but if you freak out cause a zombie pops into your screen, then you might switch to a flashlight by accident instead of keeping your gun out."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "If you have an Xbox One, you could just got digital with it or Gamestop.  Right now Gamestop is offering \"digital\" pre-orders.  Basically, you're buying $60 in XBL credit that you redeem on the Xbox Games Store, but you still get Gamestop's pre-order bonuses."}
{"product_id": "B0018YXM3Y", "context": "do you have to download the game of the disk.", "response": "you install with a disc but during the install you have to be connected to the net as you have to set up a stream account before you can play.. a hassle at first but if you ever loose the discs you can download the game from stream as they already know you own it, kinda cool.."}
{"product_id": "B00GY4OAIE", "context": "Why did this product come in a paper sleave instead of the protective plastic blue ray case?", "response": "Mine also came in blue plastic case. Sounds like something to take up with amazon or the seller."}
{"product_id": "B00BFOEY3Y", "context": "Does this G700s work on glass? I have the Logitech MX performance, and want more macro keys.", "response": "No. I have a glass desk and the mouse picks absolutely nothing to track. If you are going to purchase a serious gaming mouse like this one, I strongly recommend a mouse pad, a SteelSeries mat usually runs in the $10 dollar range."}
{"product_id": "B007JDMPOK", "context": "Is it worth buying this when I already am playing for free? I have heard buying this gets you founder's status, but will i have to start over again?", "response": "You will not have to restart, it'll just upgrade your account and as far as worth it? ABSOLUTELY in my personal opinion. Preferred/Founders bonuses are awesome. Definitely worth the $ when I bought it (was around $30-35 at the time I think?)"}
{"product_id": "B000WCCURW", "context": "I have windows 7 can I install it? I just bought it", "response": "I've played it on xp to 8.1  it's worked just fine.  I have also played for a few years and still finding new things. Have fun !"}
{"product_id": "B00DBKSN8M", "context": "is the game a download or a disk, and does it need internet to play the game.", "response": "The game is a disk.You don't need internet to play alone, but if you are connected you can play with others."}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game", "response": "The more figures you have the different scenes and adventures you can play. Each character has their own world the more you have the more you can unlock."}
{"product_id": "B005CELN8W", "context": "Will this run on Windows 8. This was asked before but never really answered.", "response": "On the back side of the box, it states the minimum requirements.  I see Windows XP, Vista, and 7.  No Windows 8.  I use Windows 7 and do not need to be on the internet."}
{"product_id": "B001CU2SE8", "context": "is it in english", "response": "Yes,  the version i played is"}
{"product_id": "B00FAN4LRA", "context": "do these have an inline on off switch? And, is there one wire or two leading to the headset?", "response": "Yes. Inline on/off for the mic. Entire cable is removable from the headset. The dual option can be connected or the USB, or simply the auxilary. USB seems to have the best connection. Overall, all connection options are available and interchangeable. via connection from mini USB."}
{"product_id": "B00CX8VY4S", "context": "I own the 360 version; is there any new material on the Xbox One version, or is it pretty the same except for improved graphics? Thanks!", "response": "It is indeed basically the same game, save for the graphics. However, I can attest that the load times for the Online portion of the game are much shorter than on the 360 version."}
{"product_id": "B00DCBDNW6", "context": "Do you have to buy a subscription to play this game?", "response": "Yes. I'm not sure how much it is, but you need to buy the subscription and some sort of account activator."}
{"product_id": "B005LN5UOC", "context": "Is it compatible with the PS4?", "response": "NO it is not compatible.  PS4 dropped the ball on Bluetooth.  Where with ps3 you could basically use any bluetooth Mic/headset.  I learned this the hard way after purchasing this.  Only good with PS3"}
{"product_id": "B00GJSUUC0", "context": "Is this entire game just one level?!!!!!", "response": "Is not a beta, but is not a complete game, is the first missión, the game have a secondary short missions, in the cover it say that when the new game be published, you will get a special price and special gifts (guns and others). I played this game and i finished it in less than 1 hour."}
{"product_id": "B009DL2TBA", "context": "Does it comes with Netflix?", "response": "All system come in it you just have to download it"}
{"product_id": "B00CHGYUE2", "context": "Okay what is the difference between the map pack version and the regular black ops two?", "response": "Well not really anything the map pack just brings a map pack you need to buy so it save you time from buying that one"}
{"product_id": "B002ST7AEU", "context": "Will this work with the energizer charging station?", "response": "I don't see why not. I've been using the base two battery charger and its worked fine so far."}
{"product_id": "B00009TW6R", "context": "does Game Spy still running the server", "response": "if your asking if the servers are still up then the answer is yes"}
{"product_id": "B005QUQP94", "context": "Can you adjust the light intensity and the color? or is it just blue?", "response": "its just blue light with three intensity settings and you can turn the light off."}
{"product_id": "B003VAHYQY", "context": "Is it compatible with windows 8?", "response": "Is it compatible with Windows 10?"}
{"product_id": "B0002EAA36", "context": "Will this Joystick work on an older computer using windows 98?", "response": "I don't think females over the age of 40 should be using a thrust master...they may seize up."}
{"product_id": "B0072A4JVW", "context": "Will the grips still fit on the vita if it has a case on it? I have the eForCity snap on crystal case", "response": "No it will not. The grips are made to fit snuggly and securely on the vita itself."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "The new slim that I purchased in the boarder lands2 bundle, DOES fit. It isn't too tight, and will work fine "}
{"product_id": "B004RMK4P8", "context": "Is this going to work in Europe", "response": "I think so, but It need to be changed to euro dollar, but I believe it will still work."}
{"product_id": "B0096DMDXY", "context": "Is this compatible with iMacs", "response": "I purchased the same unit for use with a Mac Pro running Mavericks. I use it with AeroFly. i did absolutely nothing to configure and it worked perfectly. All of the buttons were predefined. it works fantastic."}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "No it comes from both but its a simple fix. Just go to the sound settings from the xbox one dashboard and turn HDMI off."}
{"product_id": "B0053B66KE", "context": "Is Pokemon X and y a good entry for someone who has never played any Pokemon game at all but does love to play RPG's?", "response": "Of course, each game they make is made to introduce new players since there are always new fans to the pokemon franchise. All pokemon games have a tutorial that will help you play the game and understand it. As for the more advance things to learn in Pokemon, it is not needed to enjoy the game and its storyline."}
{"product_id": "B0041RY3W4", "context": "Can this be used to charge a single Sixaxis controller?", "response": "1, 2 or have all 4 hooked up at the same time. It's stated in the description."}
{"product_id": "B008TP1OKI", "context": "Can this hard drive recognize original xbox games, most aftermarket HDD's don't", "response": "No, and strongly advise you not waste your money"}
{"product_id": "B00F9RGFEY", "context": "I just want some clarification. Some customers are saying it works on Xbox One. The advertisement does not. So, is it compatible or not?", "response": "Im not 100% sure i bought it to use on my laptop and ps4 and it works on those 2 but im not sure about the xbox 1 sorry i could not be of any assistance."}
{"product_id": "B00ATF5YZM", "context": "I downloaded the game COD 4 MW but steam isnt working and i cant get to my game!!!!", "response": "reinstall and make sure your logged into windows as administrator, make sure your password is correct, make sure your fire wall is allowing all the game process's to communicate, and if you have to, turn user settings to minimum and allow all process's to install."}
{"product_id": "B001BYMZ5W", "context": "is there a better gaming headphone than this? or this is top of the line?", "response": "To be honest, I can only answer subjectively, based on my research into the same question. I can say that, coupled with the Soundblaster ZxR, it is by far the best sounding headset I've found."}
{"product_id": "B00B3FIXJQ", "context": "the synk button is not working", "response": "You have to hold Lt and press the sync button at the same time the to reverse the mod press Rt and press the sync button"}
{"product_id": "B00HPU96FI", "context": "Just got this cable from Amazon. Fits my 42\" vizio nicely. However, the screen colors are skewed and oddly green. Anyone else experiencing this?", "response": "I would check the pins to see if they are broken. Could be a bad cable also check it with another tv if it works fine with another TV could be the settings for the tv."}
{"product_id": "B000PD0HQE", "context": "will i need to buy a built in wifi device for this console?", "response": "Hi Tanya,Yes if you want to use the Internet you can either plug in an Ethernet cable into the back of the console or you will need to buy the wifi adapter."}
{"product_id": "B0029M6VKA", "context": "I wear a really thin pair of headphones when I game, is it a wise idea to get the clip pro over this or will this be fine and comfortable?", "response": "you certainly can use them, however when you look up the moment trackir cannot see the tracking points it will stop moving. its just a better idea if you got a hat."}
{"product_id": "B00D6PTMB4", "context": "is it lead only or can it teach me bass aswell?", "response": "Rocksmith can teach you lead rythm and bass"}
{"product_id": "B00292OW1U", "context": "Do the Home/End buttons require additional keys to be pressed (aka Function key)? What about F-keys (F1, F2, etc)? Location of Home/End?", "response": "Keyboard is junk. Dont waste your time. I had issues with mine. Layout is also aweful. Went with the g510s instead."}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "there is local co-op on pc so yes, you can play with a friend\\brother\\parent"}
{"product_id": "B0098EVZZ8", "context": "New to all of this...can you use on PS3?", "response": "You have to have the game specific to your system, but the figures, adventure packs and battle packs will work on any game system."}
{"product_id": "B002B9XB0E", "context": "Does it come with a CD to configure controls or does it have plug and play compatibility?", "response": "it's plug-and-play, no cd included."}
{"product_id": "B00886XQNQ", "context": "is it compatible with the ps4", "response": "These headphones are a discontinued item by Turtle Beach. We know because we are having to get a substitution on a warranty issue. The box states XBox 360 & PS3."}
{"product_id": "B0002FGFHU", "context": "Is this a physical copy or a download?", "response": "This is a physical CD, it is not a digital download."}
{"product_id": "B00GQTZ8TM", "context": "Does this really come with Pokemon X?", "response": "Yes it does. When you turn on the DS and scroll through the apps Pokemon X will appear."}
{"product_id": "B00C2B355W", "context": "Does the PS4 allow 7.1 through PS4 dashboard audio out sound settings or does it limit the output to 5.1?", "response": "5.1 sadly but the headset is still worth it. Love it so much. Comfortable and the sound quality is awesome."}
{"product_id": "B00E4MQODC", "context": "i have M.S.and my fingers are weak, The 2 buttons on top left,are they easy to push,like the left click button,and do they push from side or top.", "response": "I have yet to use those 2 buttons. Pushing them now they seem to take a little bit more of a push but not much.  Hope this helps."}
{"product_id": "B0058GMO0A", "context": "will it work on vista?", "response": "It should. I think it's not said to be able to work on Windows 7, but it does."}
{"product_id": "B00JFPO7JG", "context": "After download the patch to start the program it start but after I hit the play button it turn off or said it can be run. What I need to do to fix it?", "response": "I would contact Kalypso, the game developer"}
{"product_id": "B00GJXMRX0", "context": "Is it compatible with windows 7?", "response": "Win vista sp2, win7 sp1, win 8, 8.1 support"}
{"product_id": "B00EI4V3FU", "context": "Can this work on ps3", "response": "I personally don't own a PS3, but my friend uses it for hers."}
{"product_id": "B007VTVRFA", "context": "How can I be sure I have a version that will let me play off-line. Mine still says on the box that \"persistent internet connection required\"", "response": "Once you update the software from origin it will allow you to play online."}
{"product_id": "B007C3E5WM", "context": "Is the light bright and should I buy this product?", "response": "The light is more than just a decorative glow, and I've found it to be a cool and very functional mouse for the price."}
{"product_id": "B00B1N07QM", "context": "I have small hands and I'm used to three rows of buttons (nostromo). Are 4 rows doable for most people?", "response": "I have average sized hands, so my advice might not be very helpful. But I have adjusted the palm rest to be comfortable using the lower three rows of keys, quickly sliding my lower palm onto the top of the palm rest to use the fourth. Therefore, I only ever assign keys I hardly use."}
{"product_id": "B00B0QONB0", "context": "This hardrive can be used on the xbox 360 slim console in black.", "response": "yes, i use it on my slim. The only thing that doesn't work is original Xbox games."}
{"product_id": "B00DWXUYN0", "context": "I have a 3ds with a small case on it. Would it fit well inside of this carrying case?", "response": "If you were talking about a regular sized 3ds with a small case... then yes. If you're talking about a 3ds XL then it might be a little tight. There's about an extra 1/4\" all the way around on the inside."}
{"product_id": "B007LQG9A6", "context": "Does it work with Windows 7", "response": "Yes it does. I purchased this for my son and he loves it."}
