{"product_id": "B00B1N07QM", "context": "DOES A GAMING KEYPAD REPLACE A GAMING KEY BOARD?", "response": "Yes and no.  It will replace some functions, but not typing.  The keypad will replace the left side of the keyboard essentially, but you can map the keys to anything."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "http://www.microsoft.com/en-us/windows/compatibility/CompatCenter/ProductDetailsViewer?Type=Software&Name;=Microsoft+Flight+Simulator+X%3A+Acceleration&ModelOrVersio;n=10&Vendor;=Microsoft&Locale;=1033&LastSea;rchTerm=&BreadcrumbPath;=fsx&TempOsid;=Windows+8is the FSX:Acceleration website."}
{"product_id": "B00F2ENJY8", "context": "does wii mini use regular memory cards or hard drive or both?", "response": "it has a usb port, but it does not work. the classic wii is better if u  can find it."}
{"product_id": "B00FYMTUQY", "context": "Is the angle of the camera adjustable? Can I adjust it took look lower or higher as I desire? (Use Xbox fitness a lot and need it to see floor level.", "response": "No it has an easy adjustment where the back piece has a bit of rubber to set on the TV. I would recommend looking at something else if you are looking for more angle adjustments."}
{"product_id": "B003O6C0V4", "context": "Has anyone actually been able to create a user account on the WII?  Each time I try the game informs me that the EA servers are down.", "response": "When starting the program, you can skip the part when it tries to log in. EA decommissioned the Active servers quite a while ago. The program tracks everything you do well enough, the servers aren't needed."}
{"product_id": "B004IK24MU", "context": "Does this work with white Wii remotes?", "response": "yes it works with white Wii remotes just a different color"}
{"product_id": "B008U5ZNIG", "context": "Does it work well?", "response": "For what it is it works great. Haven't had any problems with."}
{"product_id": "B001GIUWX0", "context": "How many players can play at one time.", "response": "But the more players the smaller the view is. If 1 person is playing they have the whole screen, if 2 people are playing it is half a screen for each player, if 4 play it is a quarter of the screen per player."}
{"product_id": "B003VANOFY", "context": "I've seen a lot of connectivity issues with this headset. Does it have the ability to function plugged in as if it is not wireless?", "response": "Yes it does, is possible to use plugged."}
{"product_id": "B00AJILG1K", "context": "Is it possible to change the color of the profile LED indicator, thumbster keys, and LEDs in the upper right hand corner or are they always blue?", "response": "Sorry, didn't keep this keyboard to say for sure.  Found this on Youtube explaining the illumination features.  But, maybe there's a company telephone number that you can call?   http://www.youtube.com/watch?v=BPMh9yzAxoo"}
{"product_id": "B000VBFWAG", "context": "will it work on mac or is there another version for mac?", "response": "It'll run in VMWare or Parallels, or in BootCamp, but this version requires Windows to run and there unfortunately isn't a version for Mac OS X."}
{"product_id": "B00DPQ6GPO", "context": "I am a black ops 2 player on ps3. I like using single shot guns, like the FAL, and pistols, like the five-seven. Is this a good controller for me?", "response": "It would be a good buy. I thing is my running button dose not work, broke fairly quickly."}
{"product_id": "B00A8HIGSS", "context": "Is this different than the game Okami HD on the Playstation store?", "response": "Not really. It's the Chinese version but the Chinese version is completely in English. So basically this is just the disc version of what's on the Playstation store."}
{"product_id": "B00GHJ6X8G", "context": "Does this game support move controllers also...???", "response": "I think so... at least when I'm playing ROAD TO THE SHOW it shows like you can choose the type of controller that you are using... I have never tried it hower..."}
{"product_id": "B009IR1SR0", "context": "Does this game download work on Windows XP too?", "response": "Yes it does, it works on all windows os's from 95 and up. Hope you buy it you'll love it."}
{"product_id": "B0050SYX8W", "context": "do you have to have xbox live to play this game?", "response": "I have a xbox 360."}
{"product_id": "B00B1VJZO4", "context": "Is this an expansion pack? do i have to buy sims 3 first before i get this?", "response": "Need to buy the base game first."}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "Yes, I play all 3 games on my Windows 7."}
{"product_id": "B007VFHIHA", "context": "I have a desktop windows 7 thats been upgraded from XP will this game work on it?", "response": "It works on Win7(either upgrade or not), but you should worry about the recommended specs of your PC that the game requires."}
{"product_id": "B00CMQTVUA", "context": "Does the xbox one only support hdmi?", "response": "yes hdmi only,there is no conversion kit to put it into component if need be I looked for a week for one so I could play it on my friends tv"}
{"product_id": "B00FM5IY4W", "context": "will this play on the 360?", "response": "I am not sure if it will"}
{"product_id": "B00E6OLJ88", "context": "does it work for all games?", "response": "Most Shooting  Games But Wouldn't Recommend Using On Driving Games Or Sport Games"}
{"product_id": "B007W8S2MG", "context": "Is everything from the PS2 version intact?", "response": "Yes, the only differences are improvements. When you go to make a persona you can pick skills instead if letting it be random ."}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "Yes. My niece is only four and she loves it."}
{"product_id": "B0000C7GHG", "context": "Does it come with all the games and controllers and other stuff as shown in the picture or is it just the console and is it compatible with rockband?", "response": "It came with one controller and one game, as far as rockband goes im not sure."}
{"product_id": "B002Q4U5DK", "context": "is the mouse small?", "response": "It is decently sized. My hands are large and it feels comfortable."}
{"product_id": "B00GANWVJE", "context": "Does this game work with Nintendo DS?  Or is 3DS required??? buying for gift, not familiar with game systems . . .", "response": "This game is Only playable with either the 3ds or 2ds (2ds is the 3ds without 3d capabilities). This game is not playble on last generation nintendo ds system."}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "Its perfect. Nothing more (es perfecto, nada más)"}
{"product_id": "B0065NP6NC", "context": "Can I play a previous save from the original Fallout New Vegas or will I have to start over from the beginning?", "response": "It seemed to work. All my open and completed missions were there. I did start Lonesome Road (I Think that's the one) and you have to complete that before going back to the main game."}
{"product_id": "B00IRHE892", "context": "Can the Back and Forward buttons be customized to do in-game actions like throwing a grenade?", "response": "Yes they can. All of the buttons are highly customizable but beware of the shape of the mouse. I cannot play for long durations with this mouse without having cramps in my hand. I ended up using my old mouse now instead of the Logitech that I bought. I'm most likely going to sell it."}
{"product_id": "B00FZ12F34", "context": "Is buying this bundle just like buying them in store? Do each of characters and play sets come in boxes with power discs, and original packaging?", "response": "they are all packed like you would get them in the store the only play set that comes with power disks is the frozen set the others come with there play set piece (the clear \"crystals\" that open up the figure specific game sets)"}
{"product_id": "B000PS1TG6", "context": "Does this work with a Dualshock 1?", "response": "It does,but it's a pos. One time use,so make sure that u download all info that one time. The insert will start to fall apart as soon as u take it out. pos items like that should be free...."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "Yes, It works... I have two wireless controls on my Windows 8 Pro 64 bits"}
{"product_id": "B00ENFVS5Y", "context": "Does this have the most recent update? And did they fix all of the earlier batch problems?", "response": "There good now you'll still need to updated on a PC to the latest firmware."}
{"product_id": "B00F8W9SWQ", "context": "Does this keyboard have feet, to elevate the back of it?", "response": "Yes, it does.  The feet flip up to raise it approximately 1/2\"."}
{"product_id": "B00656HLGO", "context": "Will this work on xbox 360 Pro??", "response": "If it has a detachable Hard Drive then yes."}
{"product_id": "B00BKF5IXS", "context": "Good day. Does it include also the original PlayStation controller?", "response": "It has a DUALSHOCK 3 wireless controller and a MOVE wireless controller (with white ball that turns different colors during gameplay) and the EYE for the MOVE. Hope this helped."}
{"product_id": "B00503EAG2", "context": "can I put this on steam?", "response": "Retail copy or digital purchase through Steam, it will require it either way. All PC versions of CoD games since MW2 require Steam activation/authentication."}
{"product_id": "B003O3EFY2", "context": "How good is the wireless connection?", "response": "Not good at all. Plus the console played less than 20% of my games."}
{"product_id": "B00DC7G2W8", "context": "Can you use the Wii U gamepad? Or do you have to use a wheel?", "response": "It supports every controller but the balance board. Gamepad, Wiimote (wheel) wiimote (no wheel) wiimote+ nunchuck, pro controller, classic controller, classic controller pro all work."}
{"product_id": "B0054SCSQM", "context": "Will it download on Windows 7?", "response": "Yes, I have windows 7 and it downloaded and ran just fine."}
{"product_id": "B000QJ1NS8", "context": "how long do the battery last?", "response": "Using mine for 6 month and with regular charging it is holding up fine"}
{"product_id": "B00D3TRMD8", "context": "is this compatable with windows 8", "response": "I have Windows 8 and it works on my PC just fine :)"}
{"product_id": "B001UIG6M2", "context": "Does it have star ocean till the end of time codes installed on the disc?", "response": "Yeah, man. Max Money When Item Is Sold, Max Exp After A Fight, Max Sol After 1 Fight, and Heat Up Gauge MAX During The Fight. Just those four from the start."}
{"product_id": "B0002XJBG4", "context": "Is it for Windows 7", "response": "It does work for Windows 7 ."}
{"product_id": "B0016897GS", "context": "I see in one of the product pictures, the cable covering is torn.  Is this just for illustration of the wiring, or will my cable be defective?", "response": "I think they are just trying to show you what's inside.  Mine arrived in perfect condition--no tears, no problems,"}
{"product_id": "B00E3667XQ", "context": "I have two question: is it able to play offline any game? does support steam application?", "response": "You can play the android games offline but not the windows games.  As far as steam goes, on your pc make sure you meet the minimum requirements to stream if it does you can add almost any program from your pc, including steam, to the unsupported games and stream to the Shield."}
{"product_id": "B002BRZ79E", "context": "game did not come with registration code", "response": "it should be on the back of the manuel"}
{"product_id": "B009GTV5HS", "context": "Can you use macros for often-used text insertion? Thanks.", "response": "Yes, I believe you can"}
{"product_id": "B000BIZR72", "context": "Does this game work in the DSI XL?", "response": "Yes, all DSi models are fully compatible with all DS games."}
{"product_id": "B00009ECGK", "context": "Does this need a CD key?  Will I be ok if I buy a used copy?", "response": "It does need a cd key for install so don't buy one used unless they didn't use key."}
{"product_id": "B00FM5IY0Q", "context": "I havent played the prior Dead Rising's. Should I play them for any story knowledge or can I jump right into this game?", "response": "You can just pick up and play this one.  You won't need prior knowledge."}
{"product_id": "B0072A4JVW", "context": "Does it come with l2/r2 buttons because I am trying to play ff8", "response": "No L2 R2 are don't by the touch pad on the back of the psp"}
{"product_id": "B00DBDPOZ4", "context": "Is this product essentially the same as putting 2 aa rechargeable batteries into the controller and just plugging a micro usb until charged?", "response": "No, Microsoft was smarter than that. The battery back in the kit has an extra connection that actually engages the charging feature."}
{"product_id": "B009SJR28W", "context": "Are the keys noisy", "response": "I asked my son and he said that their not noisy they just light up and its awesome!"}
{"product_id": "B005BLAJRC", "context": "Does it work on Mac os x maverick?", "response": "On the front of the box it says  \"PC MAC DVD-ROM\". On the end it says  \" Windows 7, Vista, XP, and Macintosh"}
{"product_id": "B0041RR0TW", "context": "How does this compare in physical size to the PS3 controller? I'm looking for a controller smaller than the 360 one, hopefully PS3 size.", "response": "To me this feels right in the middle between the Xbox controller size and the PS controller size."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "I don't know about windows 8, but it sure runs lousy on windows 7."}
{"product_id": "B00DT55P94", "context": "are they all on one disc? or seperated?", "response": "Each one is on a separate disc... expect for mega man you get a digital download code.  So 4 discs."}
{"product_id": "B00F9RGFEY", "context": "I have two game systems. PS3 and PS4. This team works for both?", "response": "Yes. It works on both."}
{"product_id": "B006NU6F28", "context": "This game compatible by using G27 PC Wheel with H-Shifter 6 speed?", "response": "i believe it is"}
{"product_id": "B009IR1SR0", "context": "I love Red Alert and Red Alert 2/Yuri's Revenge. Will they run on 8.1? I had problems with the decades edition where they wouldn't open.", "response": "I'm still running on win 7 so I can answer that question, but if you have a monitor that's 1920x1080 hd then it won't run. I had to hook up my old 1366x 768 monitor. Good luck on finding your answer. Maybe try google"}
{"product_id": "B00GHJ6X8G", "context": "are the cooperstown all time greats included ?", "response": "Although, some people have uploaded rosters with them on it that are free to download"}
{"product_id": "B00CJD4HD2", "context": "does the button on the side with the red dot do anything on this one? g500 it was just a dead button", "response": "By default it's just a generic programmable button.  I set it to act as the mouse wheel click, because I don't like clicking the mouse wheel.  You can set it to practically anything you want through the software though, like keystrokes or macros.  Hope that helps!"}
{"product_id": "B002BRZ852", "context": "can you play 4 person offline co op?", "response": "I m not sure. I know you can play two players co op offline"}
{"product_id": "B00178630A", "context": "What i get if i buy this product? The game or the key?", "response": "i need a downloadable game cause i live outside of states. do u have it?  is th"}
{"product_id": "B0000512IE", "context": "Will these work with the Saitek Yoke, Throttle Quadrant and Trim Control?", "response": "The rudder pedals are independent of the yolk and throttles. They should work fine.Greg"}
{"product_id": "B001Q24UAM", "context": "What operating systems will it work on?", "response": "i have windows 8,but it will work on windows xp also"}
{"product_id": "B00F4GSAYI", "context": "is there a separate disc for the dlcs?", "response": "Yes, the DLC's are on a second disc."}
{"product_id": "B007VTVRFA", "context": "I bought the Standard Edition,where am I suppose to download the game,the download link seems leads to an html file.", "response": "If you downloaded it from amazon, you will need to download the origin \"app\" onto your computer. Once downloaded create an account with origin and register your product key with it and it will open right up"}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "I'm pretty sure they are all English. I have had mine over a year and don't remember being asked for language"}
{"product_id": "B004N7HSGU", "context": "Does this work with the XBone?", "response": "It works with xbox 1 and ps4"}
{"product_id": "B0050SX7BQ", "context": "Are there actually puzzles in the game - and are they good?", "response": "Not really puzzles. It's a very linear game. More like a movie with choices in some situations. A few spots you have choices that will change the different endings, but to directly answer your question. No there aren't many puzzles."}
{"product_id": "B00F27JGVA", "context": "Is this PS Vita card in sealed original packaging?", "response": "Yes. It comes well packaged too so that it won't get damaged. I have ordered 3 off them."}
{"product_id": "B005Q1YA5O", "context": "it says i need to intall the sims 3 platform or gateway before it can install someone please help", "response": "That pretty much means you need to have the base game, I believe. The Sims 3 Pets is just an add-on, it isn't the game itself."}
{"product_id": "B00GZ1H07Y", "context": "Does this game have 3D capability?", "response": "If you are speaking of Stereoscopic 3D, Farsight just released patches to all current tables as well.as DLC on the PS3 to add this feature and plans on adding this \"coming soon\" to the PS4 version as well. So to answer your question.... NO, but it will."}
{"product_id": "B004HYIAPM", "context": "Do you have to insert the CD into the computer every time you play (like Sims) or is it just used for downloading the game?", "response": "It makes me run it through Steam. CD not needed once installed."}
{"product_id": "B003ZSN600", "context": "Does the wired controller can connet to PC through USB directly? or I need other tool support ?", "response": "Works directly with the pc. Just plug and play!"}
{"product_id": "B001V9PTVE", "context": "Fallout Tactics does not run, cannot find the CD. Has anyone found a real solution? Win7", "response": "Yes, I have found one, don't play that old crap, get Fallout 3 or New Vegas"}
{"product_id": "B00DE2W5XG", "context": "Does everything like ps plus membership etc works in India?  Please answer. Thanks....", "response": "Not in India so can't provide any insight. Give psn a call and ask them."}
{"product_id": "B0012DPHKW", "context": "Does it run on windows 8?", "response": "yes it does i have windows 8.1 and i have no problems"}
{"product_id": "B003YC4D9A", "context": "We have a Wii system and got a Zelda game via the wii shop, will this remote work with this Nintendo64 game? Our currentWii remotes aren't compatible.", "response": "Yes, it will work. The buttons are not in the same position as original N64 controller so takes some getting used to. I am not sure if this is because it is a generic controller or not. Possible non issue if go with brand name controller."}
{"product_id": "B003O6EE4U", "context": "Once I bought Xbox 4GB option, could it be somehow upgraded to 250 GB option?", "response": "The later model 360 cannot be upgraded because the hd is internal. Unless you know someone who can mod it for you or you can do it yourself, there may be a cheaper route. The earlier models had external hard drives you could swap out. Sorry for the let down"}
{"product_id": "B00IU3MSF4", "context": "dose the built in wifi have to be   hooked up to wifi or dose it make its own", "response": "\"Does\".  \"Dose\" relates to medication, which you should be taking."}
{"product_id": "B000087H7T", "context": "is the screen bigger than original gameboy advance", "response": "I think they're the same screen size, but I've never owned an original Gameboy Advance. The main attraction with the SP, for me, is the flip screen and the backlight."}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "I didn't... returned it... I would suggest purchasing directly from Microsoft/Xbox..."}
{"product_id": "B00503EAG2", "context": "can I put this on steam?", "response": "Yes u can.  all of the cod games are steam after cod 2.  I have them all codmw2, codmw3, codmw4. cod blackops 1 & 2.   So, I do know what I'm talking about."}
{"product_id": "B00BV72X1U", "context": "Will this work with Fire TV?", "response": "The only drivers available are for Windows so I doubt you would be able to get it to work. You need the Amazon Fire Game Controller Amazon Fire Game Controller"}
{"product_id": "B008XHCLFO", "context": "does this fit the new 3ds xl?", "response": "This WILL NOT fit properly for the NEW 2015 3DS XL. The grip portion is too snug and will keep the top shoulder buttons constantly pressed in, making certain games unplayable. (Example: Monster Hunter 4)"}
{"product_id": "B00FENJVOE", "context": "can we have more than one account or username", "response": "Not unless you plan on purchasing a new license key."}
{"product_id": "B00FLLFJE0", "context": "What's better, Rayovac AA rechargeable batteries or this nyko charge base for the xbox one. Which one will last longer?", "response": "The charge base I received was DOA. But I have two for Xbox 360 that I love.  The batteries last all day and then some.  I want to get another for the one."}
{"product_id": "B00J6DLPLK", "context": "What is required to get Branch A in Drakengard 3?", "response": "Branch A is the main branch of the game. You don't need to do anything to unlock it, just play normally. To unlock Branch D, you need to do the Lost Verses and get all the weapons."}
{"product_id": "B00EV4O8VS", "context": "Does this Bundle come with the Legend of Zelda Windwaker game?", "response": "Yes, it is a digital download from the Nintendo Store. You only need a internet connection to download the game."}
{"product_id": "B00HWMP0OU", "context": "Does this work on the Nintendo DS XL?", "response": "The official statement on the box reads (in tiny print)\"Plays on Nintendo 3DS family of systems sold for the Americas only\"ie it depends on where you bought your console."}
{"product_id": "B007C3E5WM", "context": "Does it work with windows 8?", "response": "Yes it works with windows 8"}
{"product_id": "B00BMFIXZG", "context": "Why is game in slooow motion and video is like watching old kung fu movies?", "response": "Get a better computer, should help"}
{"product_id": "B00EZKNSTQ", "context": "Does this controller have the same in hand feeling as a normal Xbox 360 controller?", "response": "I don't know, I had a problem with it after purchase."}
{"product_id": "B0096L2SJ0", "context": "Does this fit with the phone, when it has a case on?", "response": "No it does not"}
{"product_id": "B0050SXKU4", "context": "Is this game at all appropriate for a 13 yo boy? My son is begging me for this, and it doesnt seem appropriate IMO.", "response": "Unless you are sheltering him from language that he hears at school and on basic cable, then yes this game is appropriate. And as long as he doesn't confuse reality and fantasy, he will be fine. Let him play it in the safety of his own home so he doesn't have to find it on the streets."}
{"product_id": "B002CJ8Z04", "context": "you can play this on the gameboy color right?", "response": "No. This requires a gameboy advanced, gameboy advanced sp or an older Nintendo ds with a bottom gameboy slot.I wouldn't recommend this purchase as my copy ended up being counterfeit"}
{"product_id": "B00DLRLDBO", "context": "Does the headset acutally connect to an Xbox 360 controller? For chat?", "response": "Yes it did connect but the head band has already broke and they're vitually useless now"}
{"product_id": "B0050SZBP6", "context": "is this the physical game?  or just the serial... Standar Version", "response": "It is the actual physical box copy of the game"}
{"product_id": "B0087ZMATE", "context": "I am wondering if the mic volume is very good or not. I have a cheaper headset and the mic is almost inaudible, even when boosted from the PC", "response": "The mic is loud enough and sounds natural even if you raise your voice."}
{"product_id": "B00GHJ6X8G", "context": "I'm from NY  so I'm very interested in what the Yankee roster is before i buy this.....do they have any of the new players like Tanaka, Ellsbury,etc?", "response": "Yes they do. They release live roster updates every week or two so you will have all those guys"}
{"product_id": "B00BQWTGIS", "context": "will the game be installed on steam or at least will you be allowed you to play without the disc ?", "response": "I don't think it is on Steam, but you can play without the disk"}
{"product_id": "B00FE8WKPQ", "context": "Can you use this in a Wii?", "response": "You'll have a hard time getting it to fit in the cd slot.  There is a specific Wii fit model, this one won't work for the Wii."}
{"product_id": "B00027CXEM", "context": "Will this game work on a modern computer?", "response": "you have to adjust the screen resolution. I don't know how to do it, but look it up online."}
{"product_id": "B005BLAJRC", "context": "Does this include the game Pachesi?", "response": "It was a gift so I do not know."}
{"product_id": "B00CD90R72", "context": "Regarding FIFA 2014, does the game require the MOVE controller or can 1 or 2 players use the standard game controller to play with maximum enjoyment?", "response": "This version as well as 2013 version is fully Move compatible. Though I doubt you will be able to execute the full array of moves without a standard controller."}
{"product_id": "B007SRM5U6", "context": "I bought this game, and comes without a code for Harley Queen's Revenge, is this normal?, or I'm doing something wrong?", "response": "Probably the game is used and that´s why you don´t have it. But if the game is new.... it should have come inside the box. You gotta have a piece of paper with a code on it. If not... contact the seller."}
{"product_id": "B00EZAWV6W", "context": "How long did it take you to download onto PC (Windows 8)?  I have DSL and it is saying it's going to take 9 hours for download!", "response": "It took me 1.5 hours on cable. I would say double that on DSL. Maybe up to 4 hours but its worth the wait. . .fun game."}
{"product_id": "B004N7HSGU", "context": "Does it come with a chat cable for Xbox 360", "response": "Yes, it is compatible with an Xbox 360 and comes with everything you need to set it up."}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "Iphone/IPad platform has a version also"}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "No, LED on silver is blue. Red LED is on black K70. All are Cherry MX Red."}
{"product_id": "B002BXKJA0", "context": "Can you play this with steam?", "response": "Yes. I bought this product and used the product key to load directly into steam. Buy without fear citizen."}
{"product_id": "B00DC7FWRE", "context": "does this game have bowling?", "response": "No, this is no Wii Sports wich you can buy online at the eShop"}
{"product_id": "B000RA778G", "context": "does it work with windows 7", "response": "I have Windows 7 and it works fine. Hope you enjoy the game as much as I do"}
{"product_id": "B00AYBKQRW", "context": "I have a lg mini split model number m122cd i dont have the remote can this remote work? just want to make sure it is compatible", "response": "sorry it want work Thanks EF and Dime"}
{"product_id": "B000PT18OS", "context": "Is this ac to dc power converter? Curious because I know how to hook a car amp up to one but it must be dc", "response": "No, just a replacement ac adapter"}
{"product_id": "B004C4U1VI", "context": "why cant i get sound when i hook up my ps2?", "response": "Didu plugin all 5 plugs? Three of them r for video two are for audio. Hope this helps"}
{"product_id": "B00D4WTO1M", "context": "Hello , good afternoon , the game that sold you sell in physical or digital ?", "response": "i think Both I only play physical"}
{"product_id": "B00FE8WKPQ", "context": "Is this ready to play out of box or is another console required? Do I need to buy a regular Wii U first?", "response": "A Wii U is required to play this.  Once you have a Wii U, this box includes everything you need to play Wii FIT U."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "I haven't noticed any high pitched whine from my G9X. The only sound I can sometimes hear is a clicking noise from the loose fitting interchangeable grips."}
{"product_id": "B00EV7AYAO", "context": "i cannot turn the backlight on even when i press Fn+esc", "response": "I believe the red one is the older version and do not have the backlight."}
{"product_id": "B002JVX5V4", "context": "do I need to leave the disc in the computer to play this scrabble game?", "response": "No, you can load it onto your computer and then remove the disk."}
{"product_id": "B00EI4V3FU", "context": "How come I just bought this headset and it does not work on my PS4?", "response": "it should work just fine..  i bought mine 6 months ago and it works perfectly with my ps4..  make sure the jack is all the way plugged into your ps4 controller, and make sure the volume control is not turned all the way down.."}
{"product_id": "B00005B8G3", "context": "Are there games that are preloaded on this unit, or do you have to buy them seperately?", "response": "You have to buy game cartridges separately.  And make sure they are Gameboy cartridges (e.g., not DS cartridges)."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "They definitely are clicky! Not silent at all."}
{"product_id": "B005764CWO", "context": "Hello, does this controller have sixaxis support?", "response": "well it is a great controller but it doesnt have the sixaxis feature wich only matters on the ps3 exclusives such as god of war infamous uncharted and last of us but ever other game will play as usual"}
{"product_id": "B00EOI2MRS", "context": "Does this controller work well with TW14?", "response": "Yes it does, it's almost impossible to shank a shot with it.  Also, the rapid fire option makes putting spin on the ball very easy."}
{"product_id": "B003O6C0V4", "context": "does this include the total body tracking system?", "response": "I can't seen to get it to log my motions when I do the arm exercises"}
{"product_id": "B00IYWV5HS", "context": "On the Wildstar website, it states that the game comes with 3 7 day guest passes. Does this download give the same guest passes?", "response": "Yes I had three game passes, though I'm sure if they were for 7 days or not."}
{"product_id": "B00FNQUN7Q", "context": "hello friend which sends the code?", "response": "It comes in the for of a card with a scratch off behind it revealing the code. The card should come directly from the seller."}
{"product_id": "B005THAX5Q", "context": "Is it couch co-op?", "response": "What is couch co-op, enlighten me? I did not play that far in the game and played it by myself, but I believe that it is co-op."}
{"product_id": "B001EYU1WS", "context": "Is this product compatable with windows 8", "response": "It works on my windows 8 and flight sim x no problem"}
{"product_id": "B00HWMP0OU", "context": "Do the characters speak their lines, or do you need to be able to read?", "response": "Their words come up in bubbles which you have to read. Their voices are not audible unfortunately."}
{"product_id": "B00CX8VY4S", "context": "the game is digital download?", "response": "I bought the disc you'd have to check the Xbox store. It's likely there."}
{"product_id": "B008O7J1K6", "context": "Is this a Steam key?", "response": "Yes sir it is ^___^"}
{"product_id": "B0009WPZOA", "context": "Is it okay for an eight year old? I worry about language.", "response": "Pretty sure its ok. Just worry about his road rage (laughs). I dont remember any vulgar language and besides clashing cars, there is no violence."}
{"product_id": "B00HEX8TA4", "context": "Can you change to any color without the dpi changing? Or is each color locked into a dpi preset? Thanks!", "response": "There are for settings each setting has an independent dpi so if you set all the colors to the same dpi then yes, you could simply change the color with the button."}
{"product_id": "B0085P7U0U", "context": "what games are on the disc?", "response": "I have the download version.  The games are:  Bridge, Canasta, Crazy Eights, Cribbage, Euchre, Gin, Go Fish, Hearts, Memory Match, Old Maid, Pinochle, Pitch, Poker, Rummy 500, Skat, Solitaire, Spades, Spite & Malice, Tuxedo, War."}
{"product_id": "B00C710AQO", "context": "Can I play it in spanish language?", "response": "maybe, if u set ur console language to spanish"}
{"product_id": "B00DLRLDBO", "context": "how many cords to i have to deal with?", "response": "One short. One long"}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "The cord itself is around 60in long, which wasn't quite long enough for what I needed it for. So what I did was I bought a 6ft USB extension cord that brought the whole length up to about 11 ft long. I hope this helps."}
{"product_id": "B003VAHYQY", "context": "DOES IT WORKS WITH A MAC???", "response": "It works (OS X 10.10.4), just move the switch to direct (D on bottom). Probably usability depends on game itself as well..."}
{"product_id": "B00ACMM9BO", "context": "I lost my instructions.. Where can I get a digital copy?", "response": "I can email a copy to you if you can reply with your email address."}
{"product_id": "B00GQTZ8TM", "context": "if 2ds is broke do u lose preloaded game forever", "response": "No the game is actually in the 4GB memory that the 2DS comes with"}
{"product_id": "B000BAVN14", "context": "I've heard that since this is an older copy a Used copy links to one account, if I buy Used can my wife still play it + the expansions?", "response": "My used copy doesnt seem to have any problems, after i installed it, it acted ask it should, all expansions were there and working bring back memories of the good old days, just go by there possiative rating and how many good rating it has,"}
{"product_id": "B00G6CLZPA", "context": "Are the voices in japanese ?", "response": "Yes, they are. Japanese voices with English text translations. But if you think you'll enjoy otomes please don't let that deter you. I got used to it in a matter of hours and hardly noticed it afterwards. In fact, in my humble opinion it made it that much more authentic. :)"}
{"product_id": "B00D6NPFDK", "context": "Can you use the Swap force with the Trap team?", "response": "Yes, you can. You can use older versions with newer version, but not vice versa. So you CAN use Swap force with Trap team, but not the other way around."}
{"product_id": "B002I0J4VQ", "context": "can ps3slim play with newer version", "response": "The ps3 slim can play any ps3 video game. It will NOT play any ps4, or ps2 games."}
{"product_id": "B002B9XB0E", "context": "Does this Buffalo Game controller have R and L buttons?  Pic doesn't show it.", "response": "Yes there is left and right top buttons it is very close to the feel of the original"}
{"product_id": "B00C2B355W", "context": "does the mic work wirelessly with ps4 or does it need to be connected to the controller?", "response": "With the most recent PS4 updates, the mic works wirelessly.  No need to plug in!"}
{"product_id": "B00AKIPBNS", "context": "If I've never played a Fire Emblem game, will I still understand/enjoy this game?", "response": "I never played it either, and I played on Normal--Classic and absolutely loved it. I beat it twice now and i'm going on my 3rd. GET THIS GAME"}
{"product_id": "B00B0QONB0", "context": "This hardrive can be used on the xbox 360 slim console in black.", "response": "Yes it can! If you stand the console upwards, just flip it upside down to reveal a hidden door that you can open. Once you get the drive, simply insert and press down all the way, place the bottom cover back on, and install your games to speed up loading times!"}
{"product_id": "B006NU6HAS", "context": "Does this stand on its own or is this an addition to Flight simulator X", "response": "this addition for FSX not the game."}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "nope. I requires special drivers and program to be installed."}
{"product_id": "B0072A4JVW", "context": "Does this get rid of having to use the rear touch pad?", "response": "No it does not."}
{"product_id": "B0050SZ0SY", "context": "Do you need steam to play?", "response": "No, it works with Origin"}
{"product_id": "B00FXOP1JI", "context": "CAn you transfer the pre installed game to a bigger sd card?", "response": "I'm not sure but I don't think so. There might be a way to put the card into another device and then use a cable to transfer but I don't know of those materials."}
{"product_id": "B00D96BNGM", "context": "Does it come with OEM Box?", "response": "Yes it does..the box is the original one from turtle beach"}
{"product_id": "B00AJXEYOG", "context": "what games are included?", "response": "100 Ladies, Billy Goat Bucks, Boingy Beans, Bean to be Wild, Blackbeard's Doubloons, Bonus Bubbles, Cougarlicious, Crazy Chameleon, Diamond Jubilee, Fantic Antics, Miss Red, Whale Song, Wild Red Sevens, Win Zeroes, Blue Blazes, Winning Colors, Red White & Blue, Wolf Run 2, Into the Wild."}
{"product_id": "B0050SZE2G", "context": "will this also work with windows 7?", "response": "Game did not work for me.  I have a basic computer (Dell i5 with 8 gig of ram, win 7).  Runs very choppy, will NOT save, cannot craft etc!All other games work fine."}
{"product_id": "B00D6PTMHI", "context": "Does it work on a macbook air?", "response": "I think so, it works fine on my mac book pro. They have the same OS right?"}
{"product_id": "B00576U8CC", "context": "On a scale of 1 to 10, how difficult is it to play the first couple hours of the game?", "response": "This game is easy to play. It takes 'Forever' to download though. But, once it's downloaded - Let The Games Begin!!! It seems like everybody's playing it! Including me!"}
{"product_id": "B009M72E5Q", "context": "Will this particular Wii play the GameCube games?  Does it have the ports to connect GameCube controlers?", "response": "I don't know the answer. sorry"}
{"product_id": "B00E88G054", "context": "How is the packaging? does it come in the original box and would it look presentable as a gift?", "response": "If it's the same packaging I got, then yes. Very presentable. Package is a retangulnar box that opens up in a clam she'll design. It opens to show the mouse presented under a plastic enclosure."}
{"product_id": "B003VH5Z2C", "context": "does it work with a flat screen", "response": "I have an older LCD flat screen and it works fine."}
{"product_id": "B00DBKSN8M", "context": "is the game a download or a disk, and does it need internet to play the game.", "response": "The game is a disk. If you play the story mode only then you don't need the internet access. If you want to play online with other players( very cool) the you need internet access."}
{"product_id": "B008FHL56S", "context": "If upgrading from a 250GB HDD to 320 GB HDD, is there a way to transfer all of my info from the first to the second so I won't have to swap them out?", "response": "Yes, you need a transfer cable. Put one of the drives on the cable and plug into USB. The Xbox should recognize it and offer to transfer the data for you. Once complete, make sure the new drive is installed in the HDD slot of the Xbox."}
{"product_id": "B000B9RI00", "context": "So if you have an Xbox One AND an Xbox 360, you need two seperate cards?", "response": "No, the card counts towards your profile and not the specific console, so one card is all you need"}
{"product_id": "B00E9I1FPI", "context": "Does it include \"Oblivion Game of the Year Edition\" or \"Oblivion Game of the Year Edition Deluxe\"? Deluxe has extra DLCs beyond the two listed.", "response": "Game of the year delux. It comes with the final version of each game each with their respective DLC."}
{"product_id": "B00BT9B2LC", "context": "is the LL have the same size of game cards as Xl?", "response": "Yes, the LL is Japan's version of USA's XL."}
{"product_id": "B009O8HH3M", "context": "Hello, I am using a Mac (which will work with this, I know) but I only have 1 good usb port, which I use for my mouse. Will I still be able to use?", "response": "It connects via audio ports, not USB. You should have no problems."}
{"product_id": "B004HYIAPM", "context": "Bored with Everquest...Is ES V Skyrim a stand alone game? Or must I purchase the earlier installments?", "response": "No skyrim is a standalone game but there are 3 dlcs for it"}
{"product_id": "B00E447L8C", "context": "What is the little key and pink fish thing that came with this?", "response": "I believe, (and I could be wrong) that the fish is for wrapping your earphones on and I'm not sure about the key. :)"}
{"product_id": "B0081Q58AW", "context": "Is this key redeemable on steam?", "response": "No it doesn't run through steam"}
{"product_id": "B000R0SRNU", "context": "can you play with 2 people without xbox live?", "response": "Yes...my son and hubby play this together for hours...without being connected to xbox live."}
{"product_id": "B0081Q58AW", "context": "Why is this $40 for a physical copy and $60 to download?", "response": "I don't see any extra content in the download version, but I encourage you to investigate further. Barring that, this one certainly looks like the better value."}
{"product_id": "B000BD1AFA", "context": "How do you download this? is it an installer or a Steam Code? I have a Steam account so i was just wondering.", "response": "mine came on a old fassioned cd-rom"}
{"product_id": "B0049B2FP4", "context": "will this work on window 7", "response": "Yes, it will, on my PC with windows 7, it has glitches to play a small screen size, smaller than my monitor"}
{"product_id": "B00C2B2Y9A", "context": "Do these break easily, are they worth buying? In a scale of 1-10 how would rate the bass and sound quality of the surround sound?", "response": "Joel, these are one of the best headsets I've ever owned. There worth every penny and as for bass and sound quality it is also at there best you can't go wrong. Just try them and see what awaits you!!!"}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "Ir works in windows 7, dont know if it works on 8 or 8.1"}
{"product_id": "B009ZDPYKO", "context": "What does \"Loose\" mean?  I've many places they list their Skylander figures as loose..  What does it mean anyway?  Thanks in advance.", "response": "Since the one I bought for my grandson was listed as loose and it came without a box, I assume that's what it means."}
{"product_id": "B00BGAA29M", "context": "would it work on European PS4 ?", "response": "yes, Playstation 4 is region free, meaning you can play a PS4 game of any region on a PS4 console of any region"}
{"product_id": "B005VA5D24", "context": "Dose I fit in the Xbox 360 E E", "response": "yes it does check the side panel that looks like a vent pop it open n ur hard drive fits into the slot"}
{"product_id": "B0091A3AHA", "context": "Will it work with the Xbox One, PS3 & PC? Does it have speakers & HDMI? How is it powered?", "response": "Not xbox one its to big to fit will work with ps3 slim & a very small PC. it has speakers on the TV & brings a small hdmi cable."}
{"product_id": "B00DC7G3Q8", "context": "is yoshis new island suitable for 6 year old", "response": "it's a little hard for anyone, but keep the 3d off :) make sure they don't get mad and throw it  LOL :) but yeah it's okay for any age"}
{"product_id": "B007MM9E42", "context": "What ages can play this game?", "response": "All ages, my 9 year old son and my 15-year-old daughter play and we also play, especially when it comes to a solution on a level"}
{"product_id": "B00HG0B8NA", "context": "is this the same freecell on my windows seven computer", "response": "I think it is different.  It has many other games that I had not seen before.  I like it a lot."}
