{"product_id": "B00CX9L30W", "context": "Does buying this come with a subscription?", "response": "If you buy for ps3 you have a suscription for 30 day, for PC don't have free suscription"}
{"product_id": "B00CXI0BPG", "context": "does it work for windows 8?", "response": "Works really well actually. Haven't had any problems with it in Windows 8."}
{"product_id": "B002I0J5CO", "context": "is it good for hearing the steps in black ops? please be honest", "response": "I think they're pretty darn good myself. I like the Playstion headset a bit though."}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "It is only compatible with the Wii U. And only compatible with certain Wii U games (ex. Donkey Kong Country Tropical Freeze, The Wonderful 101, Super Mario 3D World, and more.)"}
{"product_id": "B00F27JDUY", "context": "can i change the full internal language to english?", "response": "However, only Japanese has the manual. Please think slowly and carefully."}
{"product_id": "B005HN5LKY", "context": "will this work for  a360 xbox 4g", "response": "yes buddy it will....."}
{"product_id": "B005YR1VP2", "context": "Does it come with all the av cables and have an easy setup?", "response": "Yes everything was there a good deal this very easy"}
{"product_id": "B0061PAZUS", "context": "I currently have the Zumba Core DVD, does this DVD (Zumba Rush) have workouts that are different from Zumba Core?", "response": "It is so much better since it focus in the whole body and the sessions range are really nice"}
{"product_id": "B005YR1VP2", "context": "Does it come with all the av cables and have an easy setup?", "response": "Most consoles now days dont use av cables. Mine came with HDMI cable and that was it. If you have wifi its easy to set up too."}
{"product_id": "B008X73CE8", "context": "what version will i be downloading", "response": "Hi, Brian. I suggest downloading the Gold Edition that has the U Boat version included. I forgot what the version is called but I am very pleased with this game and you really can't beat the price. One thing this game requires a lot!!!! of patience to play it in real mode. I hope this helps."}
{"product_id": "B000PD0HQE", "context": "does this come with the 120 gb harddrive?", "response": "Please read the seller notes for each listing to see what seller offers.  Our listing is for console only without hard drive or any other accessories."}
{"product_id": "B005764CWO", "context": "What kind of plug does this have? I'm looking for s USB controller.", "response": "Its a USB. A good one too."}
{"product_id": "B00B23MO9Y", "context": "What do I need to be able to play this? do I have to buy another game? does it cost monthly?", "response": "You need to have the original FFXI game installed. You can get the game with all the expansions on one disc. You also need an internet connection as its an online game. Yes it has a monthly fee."}
{"product_id": "B0040UAYI4", "context": "Can i use this and play MW3 on the ps3 with the Eagle Eye?", "response": "don't waste your money on this. it is a piece of junk. i could not get it to work."}
{"product_id": "B00FJWNSWQ", "context": "Will this work on the new XBOX 1 connect?", "response": "I'm going to assume no since it's a 360 game."}
{"product_id": "B00EZAWV6W", "context": "Does it work on Mac?", "response": "I did not try it on mac. I am using windows 7. But i think it should work on any PCs. As long as the origin server works on you pc, you should be able to play this games on that server."}
{"product_id": "B00F27JDY0", "context": "A friend of mine said that the materials used for the Japan version are \" less reliable\", is this true?", "response": "No. Is not true."}
{"product_id": "B0065NP6NC", "context": "Are you required to install disc 2 dlc before playing disc 1? I wanted to play the game without the dlc prior to installing it.", "response": "No you do not just put in the game and play at any time you can install the dlc. I know because this is my 2nd copy of the game. I got halfway through the story and this was on sale so i bought it and installed, it works fine and I enjoy me Dlcs"}
{"product_id": "B00GP0HQ3S", "context": "Does this come as shown in the picture without packaging or is it factory sealed?", "response": "The one I bought came factory sealed."}
{"product_id": "B000RA778G", "context": "I love this game but now Im not able to play it and Im not sure why please help I miss my game", "response": "Hi sweetronna, my only suggestion would be to uninstall, then re-install the game.  I haven't had any trouble and I too love this game. If you have other games and they are not affected, then try to uninstall then re-install. If you are having over-all program problems you might need a computer tech to help solve this."}
{"product_id": "B007LQG9A6", "context": "This controller is working for racing games while it is not working for any action game and online game. But why?", "response": "It's not working at all.."}
{"product_id": "B002DOC93C", "context": "i have bought my first Nintendo, it is DSi XL. This classic games work in DSi XL??", "response": "This game works on DSI lite."}
{"product_id": "B00CD90R4K", "context": "- Does this game have multiplayer mode?", "response": "Yes, it does. Pretty fun game."}
{"product_id": "B009GWLSFY", "context": "Does it have root beer tapper", "response": "Yes and its sooo awesome!"}
{"product_id": "B004JKZUJI", "context": "how long is the cord", "response": "Its a decent. Size"}
{"product_id": "B00BM7NXMW", "context": "Can the DPI buttons (+/-) be remappped, such as making them +/- zeroing for a scope?", "response": "Son uses mouse, asked him and he said yes you can assign the buttons to a key or keystroke."}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "Yes, it has every game in the Metal Gear Solid canon (Ac!d and the GameBoy MGS games are not included, however)."}
{"product_id": "B009JZ04BC", "context": "Does it work with windows 8?", "response": "yes it works, even on windows 10. Best thing is that the unit has onboard memory, so it will take along the configurations"}
{"product_id": "B00DC7G0GG", "context": "If i use the Wii-motes to play, do I NEED the nunchuck thing, if so then would it be better to just get the pro controller?", "response": "You do not need the nunchuck, you can hold the Wii remote sideways. It does make it easier to move though because it's not a side scrolled. However, one player automatically makes you use the gamelan, but I think it can be changed in system settings; although I'm not positive."}
{"product_id": "B00DLDEKOK", "context": "Can you hear the game sounds rather than using tv volume? I am new to this and hope gran kids can play quietly", "response": "Sadly no. The speakers are used for listening to the friends you're playing with."}
{"product_id": "B002BRZ79E", "context": "Registration info? I tried to play this game I bought but it's impossible without a valid registration.. Can someone help?", "response": "Did you buy it new because you have to. If you did buy it new then get in contact with the seller because they may need to get you a new copy."}
{"product_id": "B0027AP5S8", "context": "is this just a case or is it that actual console", "response": "This is just the case and lights for the console.It does not come with any instructions so if you don't know what your doing it could be difficult."}
{"product_id": "B001CXYMFS", "context": "Anyone have experience using it in Warthunder and/or Aces High? Does it work with either of them?", "response": "don't know about warthunder but I use it in aces high works great...."}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "It supports quite a few languages. You select the language during setup."}
{"product_id": "B00BMFIXOW", "context": "I played AS3 It was my first AS game. I loved every thing about it, it litterly amezed me. I Played it on Wii U. do you recommend BF on PS4 or Wii U?", "response": "Is this an actually question or are you just trolling.... There is never an instance where I could choose the Wii U over the PS4.... ever...."}
{"product_id": "B00B67ZTUW", "context": "Is there an English strategy guide available? I am only seeing the Japanese guides in searches.", "response": "Unfortunately, there's no solid copy strategy guide in English. However, there are many excellent strategy guides/walkthroughs available to read online. The ones at gamefaqs stand out above the others, and have in-depth information on characters, storyline, as well as trophy guides. Here's the link: http://www.gamefaqs.com/ps3/616012-tales-of-xillia/faqs.Hope this helps."}
{"product_id": "B003Q55Y5C", "context": "does it come with a steam key?", "response": "The key that comes with the game can be used on steam"}
{"product_id": "B00GOOSORM", "context": "If I use a 60 Day Time Card, does it countdown based on my time played or just 60 consecutive calendar days?", "response": "It's 60 consecutive days it's pretty much a 2 month subscription because it's $14.99 month"}
{"product_id": "B00GLG2D4I", "context": "Any PDF of Manual for this device?", "response": "Not sure why you would need a virtual manual, but it comes with a physical one when you purchase it. It tells you everything you need to know about the device."}
{"product_id": "B004RMK4BC", "context": "I am trying to ender a psn card to my account but it is saying that it is  no longer valid but i just bought the card 20 mins ago what could be prob?", "response": "Mayby you are misswriting wrong the code.never happen to me that problem.i bought several codes and just ender few hours later without no problem."}
{"product_id": "B002DUCF8A", "context": "I have a Cessna trim wheel for pitch control -- will the trim wheel on this panel conflict with its operation?  And if so, what's the recommended workaround? Thanks!", "response": "As far as I know it will not interfere"}
{"product_id": "B001V9PTVE", "context": "Can the games run on windows 7?", "response": "I installed it on windows 8 and it work.  The game was way more \"old school\" than I like so I didn't play it much."}
{"product_id": "B00EV4O8VS", "context": "Does this Bundle come with the Legend of Zelda Windwaker game?", "response": "No, it only gives you a code to download the game. If you have no internet or have trouble connecting to the internet you will not have your game you paid for."}
{"product_id": "B00ECOAX34", "context": "this game include spanish language????", "response": "You should be able to change the language settings under the game options."}
{"product_id": "B00030GSJY", "context": "What are the base dimensions for the two parts?  I need to fit in 6.5\" space.", "response": "I'm sorry, we did not measure the dimensions of these products before we sent it to the warehouse.i cannot give you a definite answer."}
{"product_id": "B0016897GS", "context": "does this work for the ps3 ?", "response": "It works on my PC and Xbox 360 and on my tv box so I don't see y wouldn't work on ur ps3"}
{"product_id": "B00DC7G3Q8", "context": "How bad is the music?", "response": "When Yoshi grabs a \"yoshi star\" the music is pretty cool...the rest of the time the music is just 'ok'."}
{"product_id": "B0091WIOJ2", "context": "Is Astro support really as bad as many of the reviews on Amazon state?", "response": "I haven't had to get incontact with then as of yet. My headset has given me no problems that I couldn't take care of myself."}
{"product_id": "B008L3UUPS", "context": "will it take a rumble pack?", "response": "It does have the space to put it on, but i dont have the RP so im not sure if it works"}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "it comes with the controller, but i would suggest buying the 360 plug n play adapter made for the xbox 360, as that gives it a better rechargable battery pack instead of the double A batteries that come standard."}
{"product_id": "B001H4NMNA", "context": "Does it come with the chargable batterypack for the controller ?", "response": "No it just comes with the charging station"}
{"product_id": "B00IA2NYT4", "context": "is this the dualshock 3 wireless controller?", "response": "Yes, it is, but is the only one it comes with the console, if you want another controller , you have to buy it."}
{"product_id": "B0073QM45I", "context": "Hey, I have a regular xbox 360 wireless controller. The product says \"Charging Cable,\" but if it plays PC too (given the drivers)?", "response": "Yea totally, it has the USB tip for when you put it in your XBOX so it'll fit in your PC too ...given the drivers :P"}
{"product_id": "B000GP8448", "context": "Is it compatible with Windows 7 ?", "response": "Yes! It is also compatible with Windows 8 / 8.1Make sure you install the drivers that come with the wheel or download them from the Logitech website or else you will not be able to use the H-shifter and some miscellaneous buttons."}
{"product_id": "B00JC9SWSC", "context": "Does it play Netflix?", "response": "Haven't tried Netflix on this one because we bought it for our son to take to college so have not set it up yet but PS3 my husband bought years ago which I think is only 40 GB plays Netflix so hoping this one does too our our son will be so disappointed."}
{"product_id": "B008UQWX0Q", "context": "what is the age group of this?", "response": "We actually purchased 2 for Christmas gifts for our grandsons. One was almost eight years old.  The other was three and a half.  Both do fine with it.  We make sure we purchase age appropriate games."}
{"product_id": "B0016897GS", "context": "do you need clips", "response": "This is just like any Ethernet cord only 50 feet long., as for clips No built in"}
{"product_id": "B00ARD5410", "context": "is this mouse for right or left hand??", "response": "Right hand unfortunately. It would be extremely counter-productive to buy this mouse for a lefty."}
{"product_id": "B003O6N64Y", "context": "Are all accessories included? Like the wireless tower and or mix amp?", "response": "Yes Headset, removable mic boom, receiver, chat cable for xbox 360, and cable for audio, you should pick up an additional optical cable if you are using a stereo for surround sound."}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "There is an attachable plastic piece that extends to give a larger hand rest.  The one I bought came with this."}
{"product_id": "B000056SPM", "context": "Will this work with Microsoft X on Windows 8 ?", "response": "I have on way to test im on win7 for my games and sims"}
{"product_id": "B00IIHU44E", "context": "does this come with the hdmi cable?", "response": "yes it does but i would sugest getting a higher quality such as a monster cable product to get a better picture quality"}
{"product_id": "B002J9GDXI", "context": "Does this mouse have volume control?", "response": "it has programmable buttons which I assume could be used for that....but I'm not 100% certain."}
{"product_id": "B006JSY3MI", "context": "Can it run on any version of Windows after Windows 2000?", "response": "I ran it on XP and Windows 7"}
{"product_id": "B000HZFCT2", "context": "Does it work with Xbox One controller ?", "response": "No, adapter for Xbox One controller coming out at the end of the year. Microsoft Xbox Wireless Adapter for Windows"}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "For my gaming setup, I use keyboard and mouse. I prefer to use that setup compared to a controller because aiming with a mouse (in my opinion) is a lot more accurate than a controller."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "The default driver in w8 will work just as in w7 but  Microsoft suggests still downloading the specific driver but as of right now there is no such driver yet. In short yes."}
{"product_id": "B001FBHT34", "context": "Can you make this compatible with a ps3?", "response": "I believe you can. Sony doesn't seem to go the microsoft route by making their headsets exclusive."}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "Seriously!?  ....No...No it does not."}
{"product_id": "B00BV72X1U", "context": "Is this compatible with mac?", "response": "normally yesread this first:http://www.cnet.com/how-to/how-to-connect-game-controllers-to-your-mac/"}
{"product_id": "B007MJSZDQ", "context": "is it good and last along time", "response": "The length of time the batteries holds a charge sucks. If you basically play alone they should be fine. If yuo rutinly play with others, you probobly wont be satisfied"}
{"product_id": "B008M4BNQ6", "context": "Can you also use this for Bluetooth or iPhone?", "response": "No and no, its a gaming wired headset"}
{"product_id": "B006LVZEN0", "context": "have you been satisfied with this mouse so far, does it hold up?", "response": "I've used my excessively for 2 years without any issue and I still love it.  At 2 years, it's shown far less wear from use than my RAT 7 did."}
{"product_id": "B004MR3QY4", "context": "I'm considering buying this for my boyfriend, who plays StarCraft: Heart of the Swarm. Do you think it would be good for him, or not make a difference", "response": "I play Star Craft: Heart of the Swarm with this mouse, and it is amazing. Very precise. I would highly recommend the Death Adder 2013."}
{"product_id": "B00AXI9WFS", "context": "Do you need to have Kinect to play this?", "response": "No you dont need a Kinect."}
{"product_id": "B00E3667XQ", "context": "Is there a Micro SD card port to add content (music files, etc.); and could I download to the console from Google Play, etc?", "response": "Yes. There is a micro SD card port in the back that supports up to 32 Gb.64 GB microSD comes with exFAT format that is not supported on any android system.If you want to use 64Gb, you need to format the 64 GB microSD card to FAT32 using your PC or Mac computer."}
{"product_id": "B00E1L78N6", "context": "Did the controller update with little to no improvement for my mic. Did you guys have the same issue?", "response": "The MIC built into the headset still has issues. A replacement Boom Mic Pro can be obtained for free by contacting Polk directly. The replacement Mic completely fixes all problems."}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "Sorry, I have no idea. Had mine for 5 years but I'm running XP. It works OK on that OS. Good luck."}
{"product_id": "B00I9GZZGG", "context": "Is the Microphone flexible or does it just rotate?", "response": "swivels up and down to out of way and is flexible boom"}
{"product_id": "B00I9UVY30", "context": "Can I play as the goalie?", "response": "Sorry I took long to respond, I haven't checked my email in a while. No you cannot play goalie on this game."}
{"product_id": "B008D7F47Q", "context": "I bought the game and downloaded it today. I created an origin account. When I start the game the icon comes and then goes off. I cannot play the game", "response": "Yea try it again. If it fails contact amazon customer care and they will help you solve the problem. On the other hand it may also be that your system doesn't  the required specifications to run the game, take note of that too"}
{"product_id": "B005S0KH7I", "context": "Is this compatible with windows 8?", "response": "Yes. Drivers get installed automatically"}
{"product_id": "B0038PBF1W", "context": "Does game have cockpit views to action", "response": "Yes sir..... If You have a track ir the experience Will be much better."}
{"product_id": "B006YDPU48", "context": "I really want to play this game but I'm sort of leery of the difficulty level I keep hearing about. Is it so hard it's frustrating?", "response": "It is kind of difficult but the more you play you learn tricks to playing it and it is somewhat easier when you figure out the tricks and of course you can get help from other online players if you are playing a particularly difficult area.  Its worth it.  :D"}
{"product_id": "B00HKCKA0G", "context": "Question is it compatible for a PS4  and can you talk and hear the game while playing online?", "response": "Yes it is compatible for a ps4. Yes you can talk and hear the game while playing online you just have to change your settings."}
{"product_id": "B00E1DMWBM", "context": "this may be a stupid question but can it play sega genesis cartriges?", "response": "no it dosent still has alot of good games"}
{"product_id": "B00B3PDHBU", "context": "Do they work with the ps4", "response": "Yes they are made for ps4"}
{"product_id": "B00D9FQ9CQ", "context": "if you have an xbox and use  it only for games on a disc... do you have to pay the monthly fee for the xbox LIVE?", "response": "No you don't have to but if you want to play online and chat with other players then yes"}
{"product_id": "B00FNKMVUO", "context": "is the software user friendly?", "response": "YES  These was a gift for my grandson he is loving and enjoying this Item."}
{"product_id": "B002BRZ9G0", "context": "Does this use the classic controller?", "response": "Yes, we only have the controller that came with the wii and it worked."}
{"product_id": "B00DE2W33I", "context": "how many GB is it?", "response": "500GB hard drive memory and 8GB DDR3 graphics memory."}
{"product_id": "B0076HD2W8", "context": "Will this work with 64 bit Windows 7?", "response": "I could never get the non Microsoft models to work with windows 7 64-bit.  It only includes 32-bit drivers with mine. Note that the Microsoft 64bit drivers did not work with this model."}
{"product_id": "B00HLT0YT0", "context": "The description for the included game, Borderlands 2, says you can have 4 players. I've read elsewhere that it is really only 2 players. Is it 2 or 4?", "response": "2 players bro. only 4 player on console."}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "Supports other languages and it's region free. I use it in the U.S. no problem �"}
{"product_id": "B00GHTP7SS", "context": "Can you play this game without being online?", "response": "I had redeemed my code through Steam, but I believe Amazon offers a DRM-Free download as well."}
{"product_id": "B00635N6YI", "context": "Does this actually come with a printed code for the crystal?", "response": "Honestly I don;t 100% remember since that was some time ago. If I am not mistaken, you had to sign up on the Razer site and then you would get a code."}
{"product_id": "B0050SVHZO", "context": "Does it come with the gamepad?", "response": "Yes the GamePad is included in the box from the Nintendo factory."}
{"product_id": "B00HEX8TA4", "context": "How is the mouse wheel? Can you feel it when you scroll with the mouse or is it more like 'slippery'?", "response": "The mouse wheel is very smooth and you can definitely feel it when you scroll."}
{"product_id": "B004HYK8Y8", "context": "Combat seems a bit slow, like old people fighting slow.", "response": "The whole game seems a bit slow to me, and I am an older person. In fact at one point my character was hardly moving and got killed by a bunch of villagers with pitchforks. I have not played it since."}
{"product_id": "B006POYBUA", "context": "My XBOX 360 Kinect won't connect to the USB port of my Mac. Will this solve my problem?", "response": "The kinect is a very sensitive device an struggles with compatibility im pretty sure there not compatible with each other"}
{"product_id": "B005L38QK2", "context": "Is anyone else having an issue where the cursor doesn't react appropriately. it's like going into a \"seizure\", or something.", "response": "I notice that on a different mouse that has a damaged cord, but not with the Diablo mouse. The issue I am having with this mouse is my computer doesn't always register that the mouse is plugged in."}
{"product_id": "B00001LDCK", "context": "does it work on Windows 7?", "response": "It does! You may have to run it in compatibility mode (right-click on the game's shortcut and click 'compatibility mode'), but I'm running all 3 Homeworlds on my Win7 machine."}
{"product_id": "B004RMK4BC", "context": "Can i give this code as gift for someone else? or is it linked to one's amazon account email", "response": "i am in another country and I cannot open my yahoo in turkey can and i want to buy 30$ (10+20) cards can you send the codes to my new email (that I will send it to you)"}
{"product_id": "B00DC7FWRE", "context": "Can one player use the Wii U gamepad or do all players have to use a Wii Remote Plus controller?", "response": "In the parts I've played all players needed a Wii Remote, not necessarily wii remote plus. The Wii U gamepad got passed from player to player for some specific individual challenges."}
{"product_id": "B004AM5RAW", "context": "Is this the special edition Naga?", "response": "Molten just has red lighting with the design. To my knowledge the Molten has not recieved mechanical keys like the 2013 Naga. None customizable hand grips.If you want a color selection and customizable hand grips with a wired or wireless option, the Razer Naga Epic edition is the way to go. I purchased one not to long ago."}
{"product_id": "B00G21VQ2M", "context": "Is there an english version?", "response": "No. There will never be one because of copyright issues"}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "Yes. Ensure you do the updates (for profiles)"}
{"product_id": "B00GHTP7SS", "context": "Does the audio work?", "response": "Not for deaf people"}
{"product_id": "B00CMQTVK0", "context": "what is special about the day one edition?", "response": "There is nothing \"special\" about it. You can get the non-Day One Edition for $50.00 cheaper."}
{"product_id": "B00E1L786S", "context": "how do you change the modes?", "response": "modes? Do u mean halo, forza,movie? Use remote or function buttons on soundbar"}
{"product_id": "B0085VIILY", "context": "does this flight stick work with all other flying games on xbox 360?", "response": "I used it with \"birds of steel\" \"ace combat 6\" and \"ace combat assault horizon\" until it broke anyway."}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "The Wii U Pro Controller has 80+ hours, as a matter of fact, but the Nyko Pro Commander U only has 20+ hours.  However, this should not be a problem if you either plug it in while you're playing, or at the end of every session."}
{"product_id": "B0091A3AHA", "context": "is a tv or what ever that screen is included", "response": "when the game system is on the bottom (in its position)  there is a beautiful screen built into it ... that's why it cost so much .... and the sound is awesome ... I still love it, had it for almost a year now."}
{"product_id": "B00FRESQYG", "context": "Will this game work with Microsoft xbox 360 controller for windows", "response": "It has a Lot of commands and sub commands that xbox windows controller won't be enough'"}
{"product_id": "B002XLR0JI", "context": "Which version is this, mirror or regular?", "response": "It´s the regular version."}
{"product_id": "B007W8S2MG", "context": "Does the have a tutorial to explain the mechanics?", "response": "The game does have a great way of introducing you to the game mechanics. After a short time I felt like I had a good handle of the game."}
{"product_id": "B00BGD6LMG", "context": "Does this game come with two disc?", "response": "yes download and play discs"}
{"product_id": "B0095D1CM8", "context": "How long of a cord does it have?", "response": "Its around 5ft long"}
{"product_id": "B008L3UUPS", "context": "Does it feel authentic, like a real Nintendo 64. Be honest, I want to know before I buy?", "response": "The joystick feels a little funny. But other than that its pretty ok"}
{"product_id": "B001GIUWX0", "context": "If you have more than one player, do you need to have more than one steering wheel for them to play at the same time?", "response": "The steering wheel is optional. It is used for comfort, it is just an addition to the controller."}
{"product_id": "B0007U2CX6", "context": "is this original sony psp charger ? the picture dosn't show", "response": "No, I don't think it is, but it worked fine and is still working fine."}
{"product_id": "B00DRKJBC8", "context": "Is this the whole game or just a code for items?", "response": "It is the full game and costs the same on Steam, but I do recommend you buy it on http://smile.amazon.com that way you can also donate part of your purchase to a charity of your choice."}
{"product_id": "B0000C7GHG", "context": "Is this the older and bigger play station 2", "response": "Yes, I would consider it older and bigger."}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "I have windows 7. The game will sometimes crash. Go right into the start icon.relaunch the program. It will take  you  where it crashed you will not lose any progress"}
{"product_id": "B0076HD2W8", "context": "Does this connect more than 1 controller or do I need to buy multiple one?", "response": "I have connected at least 2 controllers. I believe a single unit will connect up to 4."}
{"product_id": "B004AM5RAM", "context": "Does it come in the Razer box and does it have all the pieces and paperwork included that it would have if it came from the website?", "response": "I got mine new. It came with everything I needed, inside the box."}
{"product_id": "B00BMFIXKQ", "context": "Is this NTSC or region free?Thanks in adcance.", "response": "I do not know, bought for someone else"}
{"product_id": "B0073J8BYS", "context": "is this kit oem (all parts separatly) or BOX (all parts in sony color box ?", "response": "If I remember correctly, they were all in sony color box."}
{"product_id": "B00FKV8AK6", "context": "i have never played Halo before, is this first person shooter?", "response": "Yes! In fact it used to be different from other FPS titles such as battlefield and cod. Halo is known for its amazing storyline campaign and its unique multiplayer. It's a start of your intrested in getting into the FPS genre."}
{"product_id": "B002B9XB0E", "context": "Has anybody tried this with an emulator on Android?", "response": "Yes, works fine with Dell Venue 8 (Android) and SNES9x through and OTG adapter. Sometimes it gets disconnected but unplug/replug works, maybe it's because of the adapter."}
{"product_id": "B00DHF39KS", "context": "Does this have the \"Legacy\" control options (\"turn\" on left thumbstick and \"strafe\" right thumbstick), please?", "response": "I believe so yes, I played around with the controls once and I think there was a lefty option."}
{"product_id": "B0045ZB66I", "context": "What are the system requirements?", "response": "I know it plays on my laptop, a little laggy. The new game dragon age inquisition does not play on it. Have to hold on to it until I get a new laptop. :("}
{"product_id": "B00FQPQO4A", "context": "Do you have to buy the base game when you buy this, or is this pre-built in to the base game for the 27.99?", "response": "The base game is included with it. For me i got two activation codes. One for the base game and the other for the titanium add-on. Its all downloaded at once and need to put your code for the base game then there's a separate icon on the desktop for the  add-on to activate it."}
{"product_id": "B003RS1A7Y", "context": "What other midi devices does this work with? Can I use on my computer?", "response": "at this time realguitar by musiclab is the only one and seriously is worth the price I caught it on sale for $149 that beening said if you get the coins it is worth it and so much fun, especially if you don`t play a real guitar. hope this helps. jerry"}
{"product_id": "B00DNGQQUQ", "context": "is this in english?", "response": "Yes. It's in English and Japanese."}
{"product_id": "B003RS1A7Y", "context": "any way to plug it into an amp?", "response": "Sorry, but no.  It is a MIDI device, but I don't know how to use it as one."}
{"product_id": "B001O3066U", "context": "Does this game work on windows 8.1", "response": "Yes. I've been playing it for weeks without any problems on my Windows 8.1 laptop."}
{"product_id": "B0029M6VKA", "context": "Can the device be fitted to the side of the monitor? Or does it have to be the top?", "response": "Maybe if your monitor is very thin, but it is probably best for viewing angle if its at the top."}
{"product_id": "B00IU3MSF4", "context": "How many USB ports does the 360 E have?", "response": "Two, I'm pretty sure. It's at least that much"}
{"product_id": "B008HPAXZ2", "context": "how many come in the pack?", "response": "I only got 1 in my pack."}
{"product_id": "B002L6HJCI", "context": "Did everyone find a cd key?", "response": "If downloaded from Amazon, the key is printed out several screens before the final download screen."}
{"product_id": "B00009ECGK", "context": "Is this an RTS or similar to the current WoW?", "response": "It's a RTS. Not similar to WoW. The online gameplay on WC3 is dead . So it's only worth buying it for the campaign. I've played WoW for 8 years and plenty of time on WC3"}
{"product_id": "B002BRZ79E", "context": "does this game come as downloable content, or must i purchase and wait for game disks? i'm asking for the ps3 version", "response": "so far the new content and stuff have been free through the game's updates and if there is an expansion pack it will be available through the PS store as a digital download as far as I know."}
{"product_id": "B00CMQTVK0", "context": "If I was to buy the used like new day one edition will I still be able to get the day one achievement?", "response": "Yes, you will still receive the achievement. It's a little QR code that you scan into the Kinect."}
{"product_id": "B00GS1TYIO", "context": "Is this Windows XP compatible?  I didnt see it on the description.", "response": "My box says windows 7, visita and windows xp."}
{"product_id": "B00BMFIXKQ", "context": "I played the first assassins creed and stopped because it was so repetitious. Are the later assassins creed games the same way?", "response": "I never even played the very first one because I was informed it was highly repetitious and boring.  I started with #2 and absolutely LOVED it. Haven't gotten to mess with this one yet."}
{"product_id": "B002I0JZIS", "context": "can i play with someone on the ps3 with the vita", "response": "Not that I know of"}
{"product_id": "B00FLLFGO8", "context": "Can be used for sony Z2 tablet?", "response": "No. Only for phone size."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "No, it droped many times on the ground from my kids and still working well."}
{"product_id": "B00005QEFD", "context": "Does it come with a memory card?", "response": "No it  doesn't . The only thing it comes with its Is the console itself  everything else is sold separately."}
{"product_id": "B003Q55Y5C", "context": "Is Multiplayer still online ?", "response": "idon,t know hven,t played that game in a while.on line is fun thogh.it should be still alive"}
{"product_id": "B0095D1CM8", "context": "How do you bind the thumb wheel to a key?", "response": "There is a software disk that comes with this mouse.  In that software is where you can bind the thumb wheel to a key.  The software only works with Apple and Microsoft op systems."}
{"product_id": "B000035Y6D", "context": "How do you set it up with the new flat screen TV's.  Any differance?", "response": "You plug the three color coded wires into the video input on the back of the TV."}
{"product_id": "B003O6CB6S", "context": "Is it 2 player?", "response": "Don't know.  I've only played it solo."}
{"product_id": "B00EADTVL2", "context": "Does this plug into the wall?", "response": "Yes - this plugs into the wall and works very well!"}
{"product_id": "B005DKZSVS", "context": "I bought one but the software can not run correctly. It doesnt work now. Where can I get help? I have visited the website of mad catz and ambx", "response": "I would try looking through the ambx forums.  Some users have worked through various issues with these lights and have documented their fixes.  Make sure to download the latest software and follow their install instructions.  Good Luck!"}
{"product_id": "B0041RR0TW", "context": "Any Ubuntu Linux users? I'd like to buy this for my Ubuntu 13.10 gaming rig.", "response": "The F310 works perfectly out-of-the-box in Linux, so I assume this does as well."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "Perhaps I have gotten lucky, but my mouse makes no such noise, works great."}
{"product_id": "B000056SPM", "context": "Is this only for flight sims, or can this be used for all driving games as well?", "response": "Although I only use it for flight Sims I've used an older version for Nascar driving programs you just have to configure it in your settings"}
{"product_id": "B00DJYK8XS", "context": "does is comes with a belt", "response": "It didn't, I already had one."}
{"product_id": "B008RA5AWS", "context": "I will run payroll on office computer and do all other accounting, invoicing, reports, etc on my home lap top. how to sync the payroll info to home?", "response": "I have always been skeptical of syncing data files and would suggest backing up and restoring your data file as you work from  laptop to desktop and vice versa - or having your desktop be also the server and then access it from your laptop."}
{"product_id": "B004RMK5QG", "context": "I have a Canadian PSN, this card will work on it?", "response": "I guess it wont work in for Canadian psn cause this ones say that are exclusively for Us. Im not sure if it works but I think no. Cause as you know Canada is not US. I suggest you call Playstation Network and ask! Good luck buddy!"}
{"product_id": "B00CMQTVK0", "context": "what is special about the day one edition?", "response": "Nothing really, the box it comes in is black and the controller says Day One Edition in tiny white letters... thats really it."}
{"product_id": "B00008J7NZ", "context": "Will this work on the Xbox 360?", "response": "Im pretty sure! My friends say it works"}
{"product_id": "B00AEX81SG", "context": "does this slim design still have wireless internet and bluetooth", "response": "Yes, the version I purchased has both( Slim). I had some little difficulty setting up the wireless network( It isn't that hard, I just didn't know what I was doing). I also established a Bluetooth connection with a Bluetooth keyboard( It was relatively easy.)------ FYI, not backwards compatible with Ps2 games :("}
{"product_id": "B00DHF39KS", "context": "Just getting into these games; are there levels of difficulty on this game so a newbee can learn easily???", "response": "Yes there are. There are five different difficulty levels, many even at the easiest difficulty it is easy for a new player but you still get the good feel of the game and story and you don't feel too powerful, but still easy enough where you won't get stuck. Definitely worth getting."}
{"product_id": "B004UJNN5G", "context": "it can work on any mac right", "response": "Yes it does I played it on my old Mac"}
{"product_id": "B00B1VJZO4", "context": "The installation is not working !!!!!!! It says that you have to have sims 3 installed before? WASTE OF MONEY", "response": "This is an expansion pack to the original game The Sims 3. Buy the ori first then try installing this one."}
{"product_id": "B0079V29EI", "context": "Does this come with a charging cable as well? I lost mine and was hoping for a two for one.", "response": "no it does not come with a charger"}
{"product_id": "B00IYWV5HS", "context": "On the Wildstar website, it states that the game comes with 3 7 day guest passes. Does this download give the same guest passes?", "response": "It applies to the upgraded version of the game I believe"}
{"product_id": "B0049B2FP4", "context": "Will this game work on the Windows 8 operating system?", "response": "Yes I use it on windows 8"}
{"product_id": "B0036VO4XO", "context": "Can I connect a headset that only has one 3.5mm connection and be able to use both the headset and the mic? There is only one line from the headset.", "response": "No  it wont work, you would need something like this.  PC Computer Headset to 3.5mm Smartphone Adapter - 01-PH35-PC35"}
{"product_id": "B000RA778G", "context": "I love this game but now Im not able to play it and Im not sure why please help I miss my game", "response": "What is ur OS?"}
{"product_id": "B0041RY3W4", "context": "It shows that it can charge one motion controller and one navigation controller.  Do 2 motion controllers fit?", "response": "Yes, two motion controllers and two navigation controllers can be charged all at the same time."}
{"product_id": "B00FLLFJE0", "context": "How does the base recharge the batteries? Does it plug in? Or does it have to have batteries in it?", "response": "It plugs into the wall, cord is about 3' long."}
{"product_id": "B004S5PBM0", "context": "Can two people play this at the same time with two different guitars?", "response": "yes two people can play, you will have to have 2 of the adapter cords"}
{"product_id": "B0099OZR9W", "context": "I have a 4GB xbox 360 slim and am unable to install battlefield 4. Can I use this HDD and install it?", "response": "Of course. Thats why those exist so you can take up the space and  install games, save settings etc."}
{"product_id": "B00EHBKUTE", "context": "For those of you that have bigger hands, does this \"fit\" well? I have bigger hands and its hard to find peripherals that \"fit\" comfortably.", "response": "I'm 6'2\" / 205lbs, so I have fairly large hands. This device fits me hand just fine. If you have very large hands you may have issues with the lower row outside keys, but I haven't experienced any problems. The palm grip slides out a bit,which helps."}
{"product_id": "B004JKZUJI", "context": "how long is the cord", "response": "A little less than arm's length."}
{"product_id": "B001BZ2F56", "context": "Is this software work well with Windows 7?  Based on reviews, it didn't seem like it.", "response": "It works well with my Windows 7.  My kids love to play it, and haven't had any problems with it so far."}
{"product_id": "B0056JPS84", "context": "My XBOX 360 drive is the DG-16D2S-09C and does not work, if I order the same model, I just have to switch it and my XBOX will work without any problem", "response": "You'll need to swap out the circuit board on this drive with your old circuit board, uses very little soldering to reattach the wires"}
{"product_id": "B00B3PDH5G", "context": "Just To be clear it can be used with a pc and how would I connect it to my pc?", "response": "The transmitter has optical in or rca type inputs if your sound card has those or you can use a usb Bluetooth adapter or the mobile device cable for a wired connection direct to the headset from any mp3,mp4 player,smart phone,tablet or your computer headphone jack.  The user manual is available @ http://www.turtlebeach.com/support/entry/830517491/"}
{"product_id": "B002CJ8Z04", "context": "how do you know if it is a fake or real game, thanks.", "response": "You don't until you actually have it in hand.  You have to start playing it.  If it's fake it will play for a while and then just stop."}
{"product_id": "B001L5TIR4", "context": "does an icon for The Rise of Atlantis appear on the desktop?", "response": "Yes it does. Fun challenging game. Enjoy !"}
{"product_id": "B00EFFW0HC", "context": "How do you get the Premium for Battlefield 4? Can you purchase the code on Live?", "response": "Yes. You can buy it online. When you log into the game, you just go into the store from the main menu. You can buy singular expansions, or the whole thing."}
{"product_id": "B004W1IX1G", "context": "What is the difference between the edition of  \"software only\"  and \"with wii motion plus\" ?", "response": "Wii motion plus is the adapter on the controller in order to play the game."}
{"product_id": "B00ATF5YYI", "context": "if I buy the PC Download, (I just want to make sure so I get my money's worth), I can download this on steam, im still a bit confused", "response": "It works with your Steam account.  The only difference is the vendor /cost for the game."}
{"product_id": "B009GWLSFY", "context": "Does it have gauntlet?", "response": "It has Gauntlet 1 and 2!"}
{"product_id": "B008IYCVK2", "context": "If this is just a game code for steam, does that mean it can be played cross-platform on PC and Mac?", "response": "You can add the game to Steam using the product codes that come with it (did this myself) and then install it via Steam in the future without need for the physical discs or keys. Not sure if that will allow you to play on Mac, but hopefully Google can help you with that!"}
