{"product_id": "B00BKF5IXS", "context": "does this version play Madden 25 and NCAA 14?", "response": "If Jeff says so, it must be true. Unless Steven says otherwise ;)Woz can provide third party verification along with Morito San. That's about as much as I can tell you for now. Sorry :("}
{"product_id": "B00DC7O77A", "context": "Does this game have multiplayer mode?", "response": "Offline yes, Online no!"}
{"product_id": "B002RRLQIO", "context": "how many concurrent keys can you press before it stops recognizing keys?", "response": "It's at least 4. 5 may be pushing the limits."}
{"product_id": "B00BQWTGIS", "context": "What are the bare minimum PC system requirements?", "response": "The bare minimum pc system are ram 4g, windown 7, video card 1g, hard driver 10g"}
{"product_id": "B00005B8G3", "context": "Are there games that are preloaded on this unit, or do you have to buy them seperately?", "response": "you have to buy them separately."}
{"product_id": "B0054JGGGY", "context": "Does this mouse have the same input lag as a wired mouse compared to my DeathAdder? I would love to use it for CSGO", "response": "I use the mamba all the time and also own the DeathAdder.  I have no issues with the Mamba as far as input lag, with no mouse pad.  The DeathAdder requires a mouse pad to track correctly.  The Mamba does not have this issue, and I would highly recommend it."}
{"product_id": "B00DGZDFO4", "context": "what controller is best to play this game on PC?", "response": "either an xbox controller or a logitech 710 are what i use"}
{"product_id": "B003NVMEVQ", "context": "is this usb powered", "response": "Yes, it's USB powered. Just plug it into a usb port and you're good to go. The software configurator is not needed, but if you want to tweak the speed, acceleration, and have macros, then install software from the provided CD."}
{"product_id": "B00IIHU44E", "context": "will x box 360 games play in it", "response": "Hi danny, unfortunately....xbox one only accepts xbox one games. We cannot play xbox 360 games on it."}
{"product_id": "B00BMFIXOW", "context": "What kind of gameplay should I expect from this?", "response": "With this game you get lots of action with less dulldrum that you got from previous versions of assassins creed as you get to sail the seas and blow stuff up along with refined controls best assassins game yet."}
{"product_id": "B00BXONG7G", "context": "can ı use in europe ?", "response": "Under Product Details: \"Currently, this item is available only to customers located in the United States and who have a U.S. billing address.\""}
{"product_id": "B00E3667XQ", "context": "Is it true Android emulators have 1000 ms of audio lag?", "response": "I've never had a problem with mine.audio works great"}
{"product_id": "B00A8HIGSS", "context": "Does this also have english subtitles like the Japanese version?", "response": "Yes, it has English subtitles."}
{"product_id": "B00HS5FETM", "context": "can you adjust the game volume and chat audio indepently from each other", "response": "There is no in-line volume control on this audio cable. The game volume is controlled by headset (depending on the headset) while chat volume is controlled via the headset options on the PS4."}
{"product_id": "B00001IVRD", "context": "Has everyone playing on Windows 7 had problems with saving games?", "response": "I have never had a problem saving"}
{"product_id": "B00DE2W33I", "context": "How many controllers does the console come with?", "response": "I bought this for my step son for Xmas and I really am not sure because I wasn't there when he hooked it up, all I can say is that he's very Happy with the system. Im positive it was one not sure if two were in it, sorry"}
{"product_id": "B008U5ZNIG", "context": "Can you set the macro keys (on the left of the keyboard) to media keys? (I.e: Mute, Volume up, Volume down?", "response": "Yes. They even have presets on Synapse 2.0 for this."}
{"product_id": "B0083H4NG4", "context": "How much does this mouse way and how much do each gram of steel weigh?", "response": "Net weight 5.00 oz. with weight it is 6.03 oz"}
{"product_id": "B00BMFIXT2", "context": "Is there a 2 player co-op? I want to play split screen, is that possible? thanks", "response": "While there is an online multiplayer, there is not a split screen mode of any form."}
{"product_id": "B000TK99PS", "context": "Does anyone know if this is compatible with Windows 8 operating system?", "response": "Yes, I've been able to play it with no problems."}
{"product_id": "B002YVD3KM", "context": "Can you hook up two of the controllers for co-op games like contra?", "response": "I think he was asking if 2 controllers physically fit at the same time on a macbook. From my experience 2 side by side usb connections do NOT fit but I haven't tried these."}
{"product_id": "B002I0K6X6", "context": "Could I just use my previously purchased remote controller instead of this navigation controller?", "response": "friend if this browser control is only for accuracy, in some games, you can use other commands without problem"}
{"product_id": "B00FE8WKMO", "context": "Do you NEED a balance board in order to use the Wii Fit U?", "response": "Almost all the exercises do so yes you need one."}
{"product_id": "B00JM3R6M6", "context": "Is this game appropriate for an 11yr old girl?", "response": "honestly no it shouldn't because depends if you girl will take care of it because I am 23 years old and I have 10 model trains"}
{"product_id": "B0009VXBAQ", "context": "Is this just the regular Wii?  I had one but my daughter took it when she left and now I can't watch Netflix or use the Wii fit.  I have the disks.", "response": "i bought them the regular WII, with the netflix I can watch it on my computer. I think the knew one is like Wii U or something, but I have the regular one. Are you looking to buy another Wii?"}
{"product_id": "B005764CWO", "context": "Hello, does this controller have sixaxis support?", "response": "No, I don't believe so."}
{"product_id": "B00CPKUV9I", "context": "Is a persistent Internet connection required for the game?", "response": "No persistent internet connection DRM for Wolfenstein: The New Order. Bethesda Softworks announced that the game will use Steam DRM.  You will need to be online to activate the game and to run the initial setup process the first time you start the game, but you can play the game offline afterward."}
{"product_id": "B00B312UDU", "context": "Will this work on a Mac / OS X and being that the instructions aren't in English, are the buttons programmable without instructions?", "response": "Not programmable but compatable."}
{"product_id": "B00BGAA0SU", "context": "What is the difference between the inFamous:  Second Son Limited Edition and the Standard Edition?", "response": "Limited edition is the release edition which comes with a code or two for bonus stuff. Standard edition won't have the code(s)."}
{"product_id": "B0061PAZUS", "context": "Is the game in Spanish?", "response": "The game is in English as far as I know but it has many songs in Spanish, regeton merengue, flamenco, Irish, Salsa, belly dancing, cumbias.  there is actually no talking in the video just music and a whole lot of butty shaking.  It is very good for fun or fat burning. And is self explanatory."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "I think it suggested you to start the download on the 360 first. And then you sre easily able to search ghosts gold edition on the xbox one and you will be able to re-download it"}
{"product_id": "B002I0GF72", "context": "Does this game come with the gold foil cover or was that only upon release or preorder?", "response": "Assuming the Gold foil means its gold and shiny, then yes it came that way for me."}
{"product_id": "B00BMFIXKQ", "context": "My son is 12 years old and really wants to get this game. Is this game appropriate for his age? Should I wait a year or two? What say you???", "response": "My son watches me play it and he's 9. There's no nudity and very limited blood. It doesn't squirt out all over the place so I would say yes. There is a little language but it's far and few apart"}
{"product_id": "B0036WTVNG", "context": "Is this compatible with Android devices?", "response": "I'm not sure, but I'm doubtful of Android compatibility. While the 3GC is a good Direct Input (D Input; Logitech and most generic) gamepad, it doesn't feature Xinput (360) compatibility either."}
{"product_id": "B0009WPZOA", "context": "Is this the same as the other need for speed most wanted", "response": "This is the first, original most wanted. Its my personal favorite of all NFS, the newest one is a remastering of this with a whole different storyline."}
{"product_id": "B00AWEMODK", "context": "When I install it on my bootcamp for windowns 7 It starts to install then nothing happens. I know my computer can run this game. Help Needed!!!", "response": "There's a POL viewer bug with windows 7 and beyond. The architecture of windows changed after XP. Your computer can run it! You just have to download the new POL viewer client from: http://www.playonline.com/ff11us/download/media/vista01.html?pageID=mediaHope this helps! Happy gaming!"}
{"product_id": "B007LQG9A6", "context": "Does This Work With Windows 8 and I would like to know how this product preforms from a actual owner of this product thank you!", "response": "I don't have windows 8, but I'm sure it does."}
{"product_id": "B0027AP5S8", "context": "is it Jtaged for copy games? and can European/PAL games work on it?", "response": "HelloIt's just a case. No worry about jtag. And ur DVD rom will be the one playing games not this case or led light. I have used this case and led lights and my relatives luv this. I install 1 to million light in my case. It looks very cool in dark."}
{"product_id": "B005DKZSVS", "context": "Has anyone ever had an issue with the amBX control panel not adding software automatically?", "response": "Yes I have. Make sure you have Amex effects enabled before running the program or game. Hope that helps"}
{"product_id": "B002DUCF8A", "context": "do the pro flight panels work on mac`s?", "response": "Yes, it works very fine."}
{"product_id": "B00GHTP4ZY", "context": "Can u use on multiple computers? Ex..if I buy..can I play on laptop one day and desktop the next? Ty.", "response": "Yes, you should be able to do so. I haven't tried it, but the point of a cloud based game is that you can play anywhere. It may get a bit more complicated if you want to play the same offline city on both though."}
{"product_id": "B0017KIBAI", "context": "Is this an official Nintendo Product and does it work with US Wii consoles even though it says \"Use in Japan only\"?", "response": "U can use any GameCube controller."}
{"product_id": "B00FB4BUMW", "context": "Will the computer see this keyboard preboot so the bios can be accessed with the F2 or ESC key?", "response": "It works for me. I'm using it on an old Gigabyte 880GMA-UD2H. Most modern motherboards will support USB BIOS input now days."}
{"product_id": "B00FEDP968", "context": "can you hear your own voice in the headset while chatting?", "response": "You can hear your voice if you have the option to play your mic through your headset on in your sound options. It's the listen tab with a check box to \"listen to this device\"."}
{"product_id": "B008VQ68C4", "context": "Is this a good headset maybe for game recording or capturing, I am really depending on the microphone the most.", "response": "Excellent sound quality for the money, two year warranty. Buy with confidence."}
{"product_id": "B008WZRZJY", "context": "Is this game compactable with windows vista or windows 7?", "response": "i have Windows Vista and it works fine"}
{"product_id": "B0087ZMAUS", "context": "Are these open eared?  Will i be able to hear whats going on around me and myself talk? Thanks.", "response": "They are over-ear and do block out most ambient noise. If you're looking for something that lets you hear both music and your environment, these aren't it."}
{"product_id": "B000HZFCT2", "context": "how many controllers work at a time", "response": "One can only be sincronized"}
{"product_id": "B0000A2TPE", "context": "Can this work on Windows 7?", "response": "Yes, I have windows 7 and It works great"}
{"product_id": "B00GJ2HZ7E", "context": "it doesn't say windows 8.1 compatible but if it's all steam based doesn't it only matter on what OS you can run steam on?", "response": "It runs on 8.1 I just played it yesterday. For games that have issues you can always right click on the .exe file and set compatibility mode to a earlier version of windows (If your using a PC)."}
{"product_id": "B00DYAQHTQ", "context": "Is this a non-stop violence game?  I find most games to have too much story and that's boring.  I like just pure violence.", "response": "it has action sense, and violence but its story driven game as well i personally liked it specially because its about hacking :)"}
{"product_id": "B0065NP6NC", "context": "If you buy used can you still install the dlc from the second disc?", "response": "i believe so i think the install disk is unlimited but dont quote me"}
{"product_id": "B00E3667XQ", "context": "Which are the best native games available for the Shield?", "response": "Bard's Tale is wonderful."}
{"product_id": "B003981JQ4", "context": "Would this fit a dsXL?", "response": "No it will not."}
{"product_id": "B0050SYR74", "context": "Can it work with pc?", "response": "For hearing sound it will as for speech you will probly need a wired cord as the Bluetooth dongle is meant for the xbox only if you are looking for a PC mic buy a universal headset that will work on all systems"}
{"product_id": "B008CP6Q6M", "context": "Are the codes still active and working as of April 2015 for the current printing?", "response": "the codes working until june 2017"}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with consoles sold in U.S.?", "response": "Yes with some games not all"}
{"product_id": "B006QRMR4S", "context": "The device comes pre-installed games. regards", "response": "No , you have to buy the games."}
{"product_id": "B002FY0CM0", "context": "I have a late model 1 sega genesis.  Will this cable work?  The RF connector in the pic doesn't look as though it will fit my system.  Thanks!", "response": "I have the model 1 geneses and use this cable.  Make sure the system has a volume slider on the left of the case, to verify you have a model 1.  Models 2 and 3 do not have the volume slider, and they have a different cable, which will have 3 inputs for the tv."}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "Unfortunately, with my bad memory at the age of 78, I don't really recall if a registration was required.  SORRY!!!!"}
{"product_id": "B00GLZQR96", "context": "Is there a monthly fee?", "response": "If i have Diablo for ps3, I will lose my progress, or I will continue with the same chapters?"}
{"product_id": "B007CM0K86", "context": "Is I have be 17 to by game?", "response": "If you can handle blood, gore, violence, and language, then you can play this game."}
{"product_id": "B00IP0H4GA", "context": "Could 4 players play versus(against each other or 2 vs 2) offline?", "response": "No unfortunately no 4 player option hopefully next jstars has it"}
{"product_id": "B0045ZB66I", "context": "can you use a mouse to play this game?", "response": "Yes in fact id go so far as to say its required."}
{"product_id": "B00FLLFJE0", "context": "Is it worth it", "response": "I love it! I play all the time and it keeps a good charge. Also It's nice not too see wires."}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "No the ps3 system does not allow you to play ps2 games."}
{"product_id": "B000ZHMRTA", "context": "Does this monopoly game play fine in Windows 8 pro and RT?", "response": "sorry I am not sure.  I looked on the disc and it didn't say.  I have Windows 7."}
{"product_id": "B000QJ1NS8", "context": "Does it increase the stock battery life?", "response": "no, but if your battery ceased to work, this is a stock replacement."}
{"product_id": "B0087ZMATE", "context": "Are the ear cups over-the-ear (like ear muffs) or do they sit on top of the ear like earpads?", "response": "They do not completely cover the entire ear. They sit on top of the ear."}
{"product_id": "B00562O8U0", "context": "my tv is a Samsung and infrared / shutter/ battery glasses. one of the first 3d tv. will they work ? I really want them for mulitplayer", "response": "my tv is same style but a panasonic and it works great. nose gets sore after wearing it a long time."}
{"product_id": "B006YDPU48", "context": "Can you dodge, block, and counter? Do you get health regain rings and necklace, and do you get health steal per hit armor?", "response": "Yes, you can dodge, block, and counter. There are no health regain rings or necklace and only weapons could have steal per hit"}
{"product_id": "B00BGAA29M", "context": "What type of game is this?  Is there strategy involved?", "response": "It's a platformer. Not a whole lot of strategy. Think of Ratchet & Clank (without guns), or Jak & Daxter. If you liked those two, and you can excuse the overall simplicity of the game, it should be right up your ally."}
{"product_id": "B00CX8VY4S", "context": "Is there anything included in the box that would discourage buying it used (Xbox One version)?", "response": "Yeah, the game itself. It's horrible."}
{"product_id": "B004CFASL0", "context": "will they play on Windows 7?", "response": "I love this trilogy!  I have never had a problem with either Windows 7 or 8 playing any of the games.  The graphics and colors are great.  Have fun!!"}
{"product_id": "B00BBUCCKO", "context": "How big is it? Some of the gaming keyboards seem to be made for huge hands and mine are probably pretty average woman hands.", "response": "I have very tiny/skinny hands and they feel fine to me."}
{"product_id": "B00HHAIY72", "context": "It looks like the theres backlighting on the throttle controller. Is this device backlit?", "response": "Yes, you can change the colors from blue, red, green, amber on throttle and joystick."}
{"product_id": "B00CD90R4K", "context": "I ordered this item, and received the Central/South America version (with Messi, Vidal and Falcao on the cover). Will this work on PAL?", "response": "I do not know what PAL is....I personally do not play this game. It was for my two young boys and they don't know what the PAL is either so I am not able to help you...sorry"}
{"product_id": "B002I0K6X6", "context": "Does the stick have a input for pressing in?", "response": "Sorry, I did not understand your question. Did you mean pressing like R3/L3 in dualshock?"}
{"product_id": "B008VXCPRY", "context": "can we downloAD IT for xbox?", "response": "No, this download is from PC only."}
{"product_id": "B001COU9I6", "context": "Does it play PS2 games?", "response": "Yes, this model DOES play both Ps2 and Ps games in addition to the obvious Ps3 games. Does NOT play or cross-play Ps4 game servers since it is NOT a Ps4. There are, however, Ps4 games that are made with an alternative Ps3 version that plays on the Ps3."}
{"product_id": "B004C4U1VI", "context": "Are new cables supposed to come in a box or just in a plastic bag? I just got them in a plastic bag and wanted to make sure they aren't used.", "response": "The packaging is somewhat random, I got a folded piece of cardboard taped over the plastic bag as packaging. Monoprice is known to have good standars of quality and if the plastic bag was sealed there's nothing to worry about."}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "The game code will allow you to get the download from Steam, after you download & install the steam client & set an account up. The game should run fine on W 8.1. My issue with this DL was that it wouldn't download using the Amazon Download tool, the tool installed but wouldn't execute."}
{"product_id": "B000FP0K0U", "context": "Can I open my saved projects from Printmaster gold 16 with this?", "response": "We have no problem opening projects made PM 16."}
{"product_id": "B000QJ1NS8", "context": "Is it just the battery or does it come with the screwdriver too? Whenever I add this product to my cart, it only shows a picture of the blue battery.", "response": "It is just the battery.  I had no trouble replacing it with my own screwdriver."}
{"product_id": "B00BMFIXT2", "context": "Is this ok for a 13 year old?  I'm not too concerned with blood or fighting...mostly wondering about language or nudity/sexual content", "response": "That's what ratings for video games are for...."}
{"product_id": "B0054JGGGY", "context": "Does this come with a bluetooth doggle or does the charging stand act as the receiver?", "response": "My understanding is that it isn't using bluetooth, as that would add to delay for gaming. It uses a proprietary communication, which I think is unencrypted to reduce response time and make this viable for gaming. I've never used a wireless mouse with better response time, feels same as a wired one to me."}
{"product_id": "B001Q24UAM", "context": "Is it only in English? I would like to get it for my mother in law, and she does not know English.", "response": "I am not sure but it does have settings for you too customize it for your own use or kids use."}
{"product_id": "B00E1A1SP6", "context": "is this the new nintendo 3ds xl? and if so how can i be sure its not a knock off or fake?", "response": "I don't think so. It's discounted and the pictures don't show the second analog stick on the right. I guess Amazon isn't selling it before it launches on the 13th."}
{"product_id": "B0036VO4XO", "context": "Hello, a straightforward question: I have a Win 8.1 laptop with no mic-in jack. Will the Amigo II enable me to record the audio from the mic?", "response": "yes, this is a self contained sound card"}
{"product_id": "B007W8S2MG", "context": "is this in English speaking when played? or English subtitles?", "response": "Yes, it is voiced in English and also with English text."}
{"product_id": "B009GTV5HS", "context": "is that work for mac (OSX system)?", "response": "In terms of plug and play yes, however I don't believe the software suite will be compatible with Mac."}
{"product_id": "B008RA5AWS", "context": "Once i purchase the Quickbooks Pro 2013 with Enhanced Payroll, will i still need to purchase a year subscription ??", "response": "Yes. Subscription is based on number of employees."}
{"product_id": "B00AJILG1K", "context": "What do you people mean by this keyboard doesnt have a caps lock key? i see this in some of the lower ratings like 4/5 stars.... care to explain?", "response": "It has a caps key but I hate it. Its flimsy keys are cheap feeling and the caps lock does not have a gap between it and the letters, making it hard to not accidentally press, which happens alot...which is why im considering a new keyboard to replace due to this horrible design flaw..."}
{"product_id": "B00DGZDFO4", "context": "Is this thhe global version or in USA only ?", "response": "It's the won't work for nothing version.  Don't buy download."}
{"product_id": "B0080RAT42", "context": "I know this is for Genesis, but would it also work with Sega Master System controllers as well? don't both the controllers have the same plug-in type?", "response": "Yes it will.  It will also work with Atari controllers"}
{"product_id": "B0048XAVC2", "context": "Can I run Roller Coaster Tycoon 3 on MAC OS X 10.9.5??Also, Do I need a video card?", "response": "I'm running on a 10.9, I've never needed a video card, I just had to turn off shadows."}
{"product_id": "B002I090AG", "context": "would the charger and pen be included with the console/", "response": "Yeah, they come with a charger and stylus."}
{"product_id": "B006W41X1S", "context": "Do these let in alot of background noise?", "response": "No they work very well no background noise"}
{"product_id": "B00CBNV7UQ", "context": "Is there a \"customizable officer\" feature?", "response": "You can pick your own weapon and companion for set characters. The game does not provide an option to custom build a character regarding looks, moves, names, or weapon affiliations."}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "Ok what you mean by regular tv not using the Xbox? And using the cable box? And yes you can hear apps like YouTube and Netflix"}
{"product_id": "B004QRKWLA", "context": "Can I use this controller in the place of a mouse and keyboard on SIM type games?", "response": "I do not believe so, unless the game has controller support, the analog sticks do not take the place or act as a mouse in any situation.  This could vary widely on the game, but in most cases this answer will be no."}
{"product_id": "B00ECOBFA4", "context": "is there a free play mode", "response": "Once your child beats each level they will be able to play them in free play mode, collecting more items using the extra gained and bought characters throughout the game."}
{"product_id": "B00BFOEY3Y", "context": "Does this G700s work on glass? I have the Logitech MX performance, and want more macro keys.", "response": "I have both now, and I would not pick this mouse for glassy surfaces. It just DOES NOT WORK. I can't believe Logitech would put such an inferior sensor in an otherwise well-built modernish mouse."}
{"product_id": "B0002EAA36", "context": "I am assuming, it is analog? Want to us it as an economical substitute for an E-brake on a racing sim.", "response": "Yes, its analog as well as an analog throttle control. The hat is a 4-way digital."}
{"product_id": "B008BT80O0", "context": "Is this the English (U.S.) version of the game or an import?", "response": "It is an English US version of PS3."}
{"product_id": "B00BI4VVGY", "context": "Will this work with the Cooler Master Jetflo 120mm fans? They are PWM fans", "response": "I don't see why it wouldn't. I am using mine with a couple of nzxt fans."}
{"product_id": "B00EZKNT18", "context": "Can you turn the rumble feature off?", "response": "As far as I know, you can only turn off the lights."}
{"product_id": "B00ARD5410", "context": "is there a wireless version to this?", "response": "No, with USB cable. tks."}
{"product_id": "B000056SPM", "context": "does it works with car simulation game?", "response": "I think it is for flight.  There Is a controller for cars.  Tho ch foot controller is for both."}
{"product_id": "B002CZ7P04", "context": "I was addicted to the Island Cycling game on Wii Fit Plus.  Is this game as fun in your opinion?", "response": "Yrs, the game is terrific and addictive. My grandchildren and myself really love it."}
{"product_id": "B005MQ3BSK", "context": "Is this compatible with a mac???", "response": "only windows,   using windows running software on the mac might work."}
{"product_id": "B004RMK4P8", "context": "MAN IT DOESN WORK THE CODE", "response": "It worked for me and i bought a $75 psn card did you get an email with the code?"}
{"product_id": "B00ATF5YYI", "context": "does it work on windows 7?", "response": "Yes. But make sure you have the graphics to support the game."}
{"product_id": "B004EJ0L8E", "context": "Is it usb plugged?", "response": "yes there is a cable and one side is usb and the other side is mircro usb so you plug in the micro usb plug in the usb into the computer put the disk in and set it up....btw greatt keyboard have had it since September and works amazingly"}
{"product_id": "B008M4BNQ6", "context": "Can you use two of these headsets on one Xbox 360 console?", "response": "Yes they work perfectly for the Xbox 360 and they are made for the Xbox"}
{"product_id": "B004RMK4BC", "context": "does it work for Mexican accounts?", "response": "No idea never tried I need north american that's where I'm at that's where my account is at. I'd assume not it was in US currency still"}
{"product_id": "B000O5DY0E", "context": "This game does come with the manual and code, correct? I just want to be sure because most games sold forget to include the manuals.", "response": "Yes. It came with everything."}
{"product_id": "B0090WBXSM", "context": "Does this controller work with a Nexus 7?", "response": "Yes it does,  I use mine with my nexus 7 all the time.  Pops right up with bluetooth pairing."}
{"product_id": "B0002EAA36", "context": "I am assuming, it is analog? Want to us it as an economical substitute for an E-brake on a racing sim.", "response": "USB connection is digital, referencing:https://www.google.com/url?sa=t&rct;=j&q;=&esrc=s&source;=web&cd;=1&cad;=rja&uact;=8&sqi;=2&ved;=0CB4QFjAA&url;=http%3A%2F%2Fwww.edaboard.com%2Fthread8279.html&ei;=qFKCVPrQMYKXNuDrgugD&usg;=AFQjCNE0gLrWjjERuUoAIBzAxj6ztkIaiQ&sig2;=c24tePSveow983avXmeXJA&bvm;=bv.80642063,d.d24and https://www.google.com/url?sa=t&rct;=j&q;=&esrc=s&source;=web&cd;=2&cad;=rja&uact;=8&sqi;=2&ved;=0CCYQFjAB&url;=http%3A%2F%2Fforums.anandtech.com%2Fshowthread.php%3Ft%3D827488&ei;=qFKCVPrQMYKXNuDrgugD&usg;=AFQjCNEoFwOoSMAd4MkcdmJjnIx-Sg4sow&sig2;=2KWgKWGRkKXb1C5jpavUKQ&bvm;=bv.80642063,d.d24Hope this helps.\n\n\n\n    USB connection is digital, referencing:https://www.google.com/url?sa=t&rct;=j&q;=&esrc=s&source;=web&cd;=1&cad;=rja&uact;=8&sqi;=2&ved;=0CB4QFjAA&url;=http%3A%2F%2Fwww.edaboard.com%2Fthread8279.html&ei;=qFKCVPrQMYKXNuDrgugD&usg;=AFQjCNE0gLrWjjERuUoAIBzAxj6ztkIaiQ&sig2;=c24tePSveow983avXmeXJA&bvm;=bv.80642063,d.d24and https://www.google.com/url?sa=t&rct;=j&q;=&esrc=s&source;=web&cd;=2&cad;=rja&uact;=8&sqi;=2&ved;=0CCYQFjAB&url;=http%3A%2F%2Fforums.anandtech.com%2Fshowthread.php%3Ft%3D827488&ei;=qFKCVPrQMYKXNuDrgugD&usg;=AFQjCNEoFw...\n      » \nRead More\n\n\n   USB connection is digital, referencing:https://www.google.com/url?sa=t&rct;=j&q;=&esrc=s&source;=web&cd;=1&cad;=rja&uact;=8&sqi;=2&ved;=0CB4QFjAA&url;=http%3A%2F%2Fwww.edaboard.com%2Fthread8279.html&ei;=qFKCVPrQMYKXNuDrgugD&usg;=AFQjCNE0gLrWjjERuUoAIBzAxj6ztkIaiQ&sig2;=c24tePSveow983avXmeXJA&bvm;=bv.80642063,d.d24and https://www.google.com/url?sa=t&rct;=j&q;=&esrc=s&source;=web&cd;=2&cad;=rja&uact;=8&sqi;=2&ved;=0CCYQFjAB&url;=http%3A%2F%2Fforums.anandtech.com%2Fshowthread.php%3Ft%3D827488&ei;=qFKCVPrQMYKXNuDrgugD&usg;=AFQjCNEoFwOoSMAd4MkcdmJjnIx-Sg4sow&sig2;=2KWgKWGRkKXb1C5jpavUKQ&bvm;=bv.80642063,d.d24Hope this helps.\n      « \n\nShow Less"}
{"product_id": "B004774724", "context": "does this work on windows 8", "response": "I know it works on Windows 7 thats whats on my notebook. Not certain about 8"}
{"product_id": "B003Y5AHPG", "context": "is this system compatible with a newer flat screen tv? or will i need an special hookup", "response": "Yes it's compatible. Has two different types of hook up. Has S-Video or S-AV cable"}
{"product_id": "B003RS1A7Y", "context": "is it compatible with rocksmith guitar game for PS3 ?", "response": "So I haven't tried and my copy of Rocksmith is for XBox but I am like 99% sure it WILL NOT work.  Its a midi guitar and Rocksmith works with strings.  The Rockband Squier should work with Rocksmith though I've never tried it. Squier® by Fender® Stratocaster® Guitar and Controller for Rock Band 3"}
{"product_id": "B0011DCA6W", "context": "Will this program be compatible with XP or windows 8", "response": "Should work with XP but I don't know about windows 8."}
{"product_id": "B00DB9JYFY", "context": "Is this and Dead Rising 3 worth an xbox one?", "response": "I'm not a Dead Rising guy, but Titanfall is one slick game. It will be some time before the decisive winner of the console battle is decided. I've been with M$ since the original Xbox. They have my trust....for now...."}
{"product_id": "B00DWXUYN0", "context": "Is this case compatible with the New 3DS XL?", "response": "Yes it is, I use it for my own 3DS XL."}
{"product_id": "B0081Q58AW", "context": "Is this a physical disc, (for those of us that don't have the fastest dsl, in which the download would take a day)?", "response": "Hi Nathan,   Yes it is a physical disc and there are four of them... It took from 9 to 11 hours, and it came with an activation code.Happy gaming!"}
{"product_id": "B00I5LMSBK", "context": "my copy of the game did not come with a playing manual, is this normal ?", "response": "yes its pretty normal playing manual on training already has manual fighter. i do love it game."}
{"product_id": "B00F27JNGS", "context": "would this work with the version 2000?", "response": "Only in japan! Unless you jailbreak it!"}
{"product_id": "B00FJWNSWQ", "context": "Do you have to have the original game to play this?  Or does this have the original game included? Thanks!", "response": "The ultimate edition is the original game but included is a bunch of additional content such as bonus missions and character costumes for multiplier, as well as 6 new characters for multiplayer"}
{"product_id": "B002BSA298", "context": "Q: Does this work with xbox 360 ELITE 120 GB?", "response": "Yes but I never recieived the Adventues"}
{"product_id": "B0091WIOJ2", "context": "Is Astro support really as bad as many of the reviews on Amazon state?", "response": "I had no issues with support. Sure the fact that its email based is kinda annoying, but they fixed my issue. You just have to be patient, and not some egocentric prick."}
{"product_id": "B009Q8M816", "context": "does it work for call of duty ghosts", "response": "yes it does.Thats what i bought it for.."}
{"product_id": "B00B5QLS4A", "context": "can I set the side buttons as keyboard keys? e.g. side button 1 is \" R \" , so if I press that, I can reload in games", "response": "YES! you can record all kinds of macros, as well as special function operations like copy paste, back, forward, and many others with the Corsair software. You can even control the timing of macros as well as make the action repeat (cheaty for FPS)"}
{"product_id": "B0041RY3W4", "context": "does it plug into a wall outlet or does it have to be pluged into to ps3 station?", "response": "It plugs in to its own outlet. Plus it has a USB port in the back to charge your mic"}
{"product_id": "B00BTOAFXS", "context": "does it make you have a really fast trigger finger in cod black ops 2", "response": "The Answer is it is set to the Sweet spot where one sec makes that much of a difference on a trigger pull ,on a controller that does not have the mod a full trigger pull and reset makes the difference . hope that answer you're question."}
{"product_id": "B00IA2NYT4", "context": "can Ps2 games be palyede in this Ps3", "response": "The only way you can play ps2 games on it is if they are bought digitally from the psn. That collection is rather small though so I wouldn't count on it."}
{"product_id": "B004G5TUJM", "context": "How big is it?", "response": "Hmm let's see it fits well on our TV tray made of wood standard size TV tray that's what we use it in when my daughter and I play driving games. 11 inches wide, 8 inches tall and 9 inches from front to back. It's sturdy too."}
{"product_id": "B00CPKUV7K", "context": "Does this come with the Doom Beta? I thought that was only if you pre-ordered the game", "response": "I ordered this item twice and both times got NO Beta code!!!"}
{"product_id": "B00BI9MDSO", "context": "Can you put the vita in the case along with the trigger grip on it, I bought the sony PS Vita trigger grip.", "response": "No... You cant.I myself own PDP Trigger Grips.You can just place earphones and a cloth within it.Also note that it has 4 slots for games and memory card."}
{"product_id": "B0094X28J0", "context": "There is a '1' and a '2' button, does it have a '3' button like in the Sudan edition?", "response": "It does not, what you see is what is there, the is one other button that is on the back and that is the trigger"}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "It's just like any other Harddrive. Open the hatch where the hard drive is supposed to go and insert the hard drive and you're set."}
{"product_id": "B000QJ1NS8", "context": "Just bought this battery, but does anybody know where I can find an LCD? My original GBA SP's backlight died.", "response": "Depending on what kind it is, you might be able to get it at radio shack or any electronic store."}
{"product_id": "B00FM5IY0Q", "context": "Is this game exclusively for XBox One - or can it be played on an XBox?", "response": "It is the best game. plz play it . I think you satisfaction when you play it."}
{"product_id": "B00GJSUUC0", "context": "Is this entire game just one level?!!!!!", "response": "I guess you could consider it 1 level. It takes place on 1 island. There is 1 main mission and 4-6 side quests. It is a very good game, and alot of territory to explore for this game. Granted its not as big as Skyrim, but I believe you get your money's worth."}
{"product_id": "B000H1V56U", "context": "Does this fan have a four pin connection?", "response": "It has yes a 4 pin connection adapter piece but is a 3 pin where xbox connects"}
{"product_id": "B00D9EPI38", "context": "do you have to pay for internet?", "response": "if you already have internet in your home you can hook it up to that you will need a internet hook up cord they sell that on amazon or Walmart"}
{"product_id": "B00EEMLPR2", "context": "Is the camera for the game or can you use it for anything?", "response": "Anything. It also can be mounted on a bike or on the dash of a car."}
{"product_id": "B007TMFD7C", "context": "Does it come on a CD or how do I load if I don't have a CD Drive?", "response": "It comes in a CD. If you don't have a cd drive I reccomend buying it off amazon or steam (a gaming website) and downloading it directly to your computer from there."}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "It's for the original Vita. It wouldn't fit the Vita Slim or any model of PSP. If it doesn't fit, you've either bought one that isn't this, or you don't have the original Vita."}
{"product_id": "B004FS8LYK", "context": "first or third person perspective", "response": "Third Person. Check out this Gameplay video! http://www.youtube.com/watch?v=NFhLS7DmLlc"}
{"product_id": "B007YLUCME", "context": "How do you turn it on after unplugging the usb?", "response": "you still have to plug in the USB-drive-shape connector, then just push the \"analog\" button in the middle of the gamepad, it will turn on."}
{"product_id": "B0087ZMAUS", "context": "Sorry not to ask again, but, I want to get a good idea before making a purchase. Do these feel sturdy or more flimsy?", "response": "Sturdy and comfortable, you can wear them for hours and they never get uncomfortable. But certainly sturdy and durable."}
{"product_id": "B002I098JE", "context": "Are there bots like in Call of Duty: Black Ops 1 & 2??", "response": "Yes if you don't have online then you can play bots, there are plenty of YouTube videos showing."}
{"product_id": "B00D96BJSO", "context": "Does this headset have mic monitoring?", "response": "No,and as far as I can tell. No one else has it just in case I missed it."}
{"product_id": "B00EZKNT5O", "context": "what am i doing wrong? my computer registers that this controller is present and what it specifically is, but is unresponsive in 2 different games...", "response": "I do not know if i can answer  the question, but check the game settings."}
{"product_id": "B00AXI9WFS", "context": "what is the difference between xbox 360 and xbox one infinity starter packs", "response": "xbox one is the new xbox that just came out this year.  xbox 360 is the older one"}
{"product_id": "B00FM5IY0Q", "context": "Does this game have multiplayer mode?", "response": "Other players can joint your world, or you can join theirs. There is no split screen."}
{"product_id": "B009WGUYIG", "context": "can i play this with 3Ds", "response": "No clue .... I bought all that stuff for my grandson.  Now he is all into Swap Force."}
{"product_id": "B0010WS20W", "context": "Will it play correctly on an Alienware 64 bit operating system?", "response": "I am using the 64-bit version of Windows 7 Professional Edition Service Pack 1 and have no problems with Master Poker.  If you are running the Home Edition you will probably be OK but I would definitely recommend an upgrade to the Professional Edition."}
{"product_id": "B008CP6Q6M", "context": "Is it a free roaming game?", "response": "yes it is and if your into making dissentions like assines creed youll like this game"}
{"product_id": "B000FQ2D5E", "context": "Can you play this on ps4?", "response": "No, its ps3 exclusive currently"}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the -box 360?", "response": "My children tell me that all of the sky landers will work on the Xbox 360 also."}
{"product_id": "B00HNJ4DTA", "context": "Who manufactures this thing?  Where can I find warranty information?", "response": "For one. This isn't what it's going to look like. It's all black like a regular controller. No idea who makes it. Bought one then I got it broken and was never ale to get in contact with anyone to fix my problem. So don't buy. Worst 100$ I've ever spent."}
{"product_id": "B00EZPCWWA", "context": "Can photos taken with the 2DS be downloaded to a computer?", "response": "Yes they can you just insert your 2ds' sd card to your computer"}
{"product_id": "B001PO2BJI", "context": "Can this be used with a Wii remote plus?", "response": "No, I don't think so. The standard Wii remote fits perfect in the steering wheel. Do you see where the circle hole and the button are? That's where your controller fits in the back. It snaps in."}
{"product_id": "B00FB5R3XQ", "context": "Now, I've had many people say that PS3 sticks don't work as well as Xbox 360 sticks for PC, can anyone confirm or deny this?", "response": "I've been using the Rea Arcade on PC for a while and I don't have any problems with it."}
{"product_id": "B002I0GF72", "context": "Does this come with a booklet inside? I ask because I bought it used and there was nothing inside.", "response": "no a new copd has a electronic  manual only"}
{"product_id": "B00FXOP1JI", "context": "Does this come with the ac adapter?", "response": "Yes it does it comes with everything it's supposed to come.I recommend you buy this 3DS i bought one for a present for my nephew and he loved it I also loved it my self."}
{"product_id": "B009JZ04BC", "context": "Can the LEDs be turned off?", "response": "I don't think you can turn of those LED lights. But that's a good good question since ive been using it for a year now, ima try it using the program and will let you know."}
{"product_id": "B000056SPM", "context": "does it works with car simulation game?", "response": "Not sure as it was designed for flight simulator. I would not buy it for car sim though."}
{"product_id": "B00D6PTMSW", "context": "Is there a left mode? I'm left-handed and have been itching to learn guitar but don't know how to go about it.", "response": "Yes, you're asked if you wasn't too play left or right handed. I'm left handed and it works perfectly fine"}
{"product_id": "B0029LJIFG", "context": "if i buy this product today can i use it next year? in other words my xbox member ship has about 6 months left, so can i buy this now and use it later", "response": "I'm not sure, but you can redeem the membership and it will add the 6 months you still have. So you do not have to wait to redeem the code."}
{"product_id": "B00CMSCTA2", "context": "I have the old AoE2, but want to play against my wife. If we put the HD version on her computer will we be able to connect or do we need HD on both?", "response": "No, because you need a hard copy in the CD drive in both computers for the software to run."}
{"product_id": "B0086V5UF0", "context": "Where can the \"just dance 4\" be played? Because I can't play it on DVD/CD player.", "response": "I use it on wii"}
{"product_id": "B0083H4NG4", "context": "I'm very interested but What does [Driver Update] mean? Is this just a driver update purchase? Won't I get the actual Hardware?", "response": "You will receive the actual mouse, the Driver Update means for people who have bought it there is an addition driver update from the one on the disk, on there website. You will receive the mouse, a cd, and a manual. You can then go to there website to download the updated drivers."}
{"product_id": "B007TYC8MI", "context": "the pass online doesn`t work bro :/ the game is in very good conditions but i need the pass online :/ please help i really need this", "response": "What the previous sellers said.. it's 2 years old and used ..you can purchase your own code for yourself ..or you'd most likely have to buy the game new."}
{"product_id": "B00DWXUYN0", "context": "Can you fit the charger in the case as well ?", "response": "nope, just the 3DS and 6 game cards"}
{"product_id": "B00CMSCWGS", "context": "can i gift it", "response": "Yes, you get a code and you can send it."}
{"product_id": "B00ENFVS5Y", "context": "I recently purchased and returned the TX 458, Just wondering if I should give it another chance?", "response": "Absolutely give it another try! I also had to return my original for a defect, but my replacement is doing fine. I just can't race Forza 5 without it. Racing with a controller makes no sense."}
{"product_id": "B00GV0LR64", "context": "How do you take it off the tv after playing? Does it lose its suction when you put it back on?", "response": "I take it off with my fingers, it doesnt lose its suction when i put it back on ��"}
{"product_id": "B00CJD4HD2", "context": "I ordered this G500 mouse and it is making a high pitched tone that is giving me a headache after 4 hours of use.   Return or try to replace?", "response": "Replace it. It's probably a manufacturing defect."}
{"product_id": "B0050SVMYA", "context": "Is the \"virtual console\" or eShop available on this version of the 3DS? I wanna play and download the original Gameboy classics", "response": "Yeah most of em are on there. Nintendo has a full list on their site."}
{"product_id": "B006SVUQNQ", "context": "is this compatible with an xbox 360 S console?", "response": "Yes it is compatible with the Slim edition of the 360."}
{"product_id": "B00FJWNSU8", "context": "Anyone know if this game is still actively played online? I don't want to be waiting too long for a match.", "response": "I play online pretty regularly, normal wait time for me is about a minute. A lot of people play this online, especially on ps4."}
{"product_id": "B003VANOFY", "context": "I've seen a lot of connectivity issues with this headset. Does it have the ability to function plugged in as if it is not wireless?", "response": "I'm not sure what you're asking but ill try to answer your question, You can use it while its connected by wire, and its also wireless i've had it for AWHILE and have had no issue with it.. i recommend it if you're looking for some Headsets."}
{"product_id": "B00KGGJPYA", "context": "will it charge a kidle fire?", "response": "i would not advise to  get this - after using on our trip -  its not  a good choice."}
{"product_id": "B005BLAJ68", "context": "what 20 games does it have?", "response": "poker,hearts,bridge,spades,rummy,euchre,gen,canasta,solitaire,blackjack,pinochle, and crazy 8s and more it says i didnt play all of them"}
{"product_id": "B0096PLB9O", "context": "Is this unit compatible with 64-bit Operating Systems? I have seen some that are not, and I want to be certain before purchase. Using Win7x64..", "response": "I'm currently using it with windows 8 x64. It does require some tweaking no matter which OS you use. (Follow the guide found in the comments for the item) 5 min of driver tweaking and it works perfectly!"}
