{"product_id": "B00HLT0YT0", "context": "Why is this 100 dollars cheaper than a Vita without any games?", "response": "This includes PS vita slim which is new PS vita instead of original PS vita. The PS vita slim is slimmer than the original one."}
{"product_id": "B00E1DMWBM", "context": "Does this player have typical internet access such as facebook?", "response": "No.  It sucks majorly it says you can download other games for it and that's b.s... I wouldn't get this system"}
{"product_id": "B002I0K3CK", "context": "Can I use this game with the GamePad or i need another controller?", "response": "You can play one player with it, but to play four players you need controllers. You can still use the gamepad as a fifth player but cannot use any characters in game."}
{"product_id": "B0002DQUH2", "context": "are the function keys separated in groups of four?  I am blind and that is easier to use", "response": "Yes. Going left to right on the top row, the Esc key is first, then a space the size of a key, then F1 F2 F3 F4, small space, F5 F6 F7 F8, small space, F9 F10 F11 F12, small space, then 3 keys Power, Sleep, Wake Up."}
{"product_id": "B00ECOAX34", "context": "How does the game look on the Wii U compared to the PS4? I have both systems and am having a hard time deciding which to get", "response": "It looks great on Wii U but I'm sure it looks a little better on PS4 so if you have both systems I would suggest PS4."}
{"product_id": "B00DBDPOZ4", "context": "Anyone know how many mAh this battery is? The Energizer battery is 1200 but I do not see it anywhere on the product description for this one.", "response": "would it matter? its made by xbox therefore made for the controller's specs"}
{"product_id": "B002Z7BE24", "context": "I want to know whether it has a slipcover", "response": "I don't think so, I got mine a while ago so, maybe I just don't remember one."}
{"product_id": "B003OZOAKY", "context": "Will Rome Gold Edition work with Windows 8 ?", "response": "I think it works on 8"}
{"product_id": "B002LMX5ZW", "context": "Does the game fill the screen?  The version by another maker that I have does not. My resolution is 1366X758 on a lap top.", "response": "No! It does not fill the screen, and they make it as difficult Each time you want to play, that to go Thur it all , it's not worth it.From now on I will only buy pop cap games!"}
{"product_id": "B00BQWTGIS", "context": "cn you play this game with an xbox 360/pc controller", "response": "Yes , you can."}
{"product_id": "B00DNGQQUQ", "context": "is this in english?", "response": "Yes its in English"}
{"product_id": "B001AH8YSW", "context": "Hi, is this the larger boxed dvd version with mutiple disks, a printed manual, game guide and a map?", "response": "My set has 4 discs: Game disc; Bonus disc; Video DVD Behind the Scenes; MP3 Music Files.  Comes with Game guide which includes maps in it but no separate map."}
{"product_id": "B004RMK4P8", "context": "Is this going to work in Europe", "response": "Works only in U.S. Playstation Store."}
{"product_id": "B00BZOBE78", "context": "Can I use this without redeeming it on steam? Will it still unlock on my local computer?", "response": "Unfortunately, it requires being activated by steam during installation. Once installed, you do not have to have internet access (though it is recommended, as then you'll get the updates), but it will not work or install without talking to steam first."}
{"product_id": "B00EOUL7T0", "context": "Would tritton ax 180", "response": "Mine did not operate/function    Waste of money.   Don't do it."}
{"product_id": "B00DGZDFO4", "context": "How is the online in this game? is it worth it?", "response": "Unfortunately, there is hardly anyone in NA that plays online anymore"}
{"product_id": "B000SOYG8U", "context": "will this work on windows 7 64-bit system", "response": "Yes, I have a Windows 7-64-bit system and it works just fine."}
{"product_id": "B00EM5UFF4", "context": "If my friend has the Xbox 360 version and I have the Xbox One version, can we still play against each other online?", "response": "That would be a negative."}
{"product_id": "B00AAQRNQ8", "context": "Can you program one of the buttons (side button preferably) to drop the DPI to a specified level only while being held then back to normal on release?", "response": "For some reason I got an email of this question, I bought the 4000 dpi version and you can't set it like you asked. I did read the 4000 has less options in the software that comes with it compared to the more expensive higher dpi versions. Probably doesn't help but the best I can do."}
{"product_id": "B008TXMPJE", "context": "Will I be able to add these expansions through Origin if I didn't download my base Sims 3 through Origin? (I downloaded it directly through Amazon.)", "response": "I don't think it matters as long as you have the base game."}
{"product_id": "B00FFL0T46", "context": "Does anyone know who the VA for Bigby is?", "response": "What do you mean with VA? :/"}
{"product_id": "B00HG0B8NA", "context": "didn't download correctly  computer says it is not a correct win 32 product", "response": "My issue as that the games do not seem to have a difficulty scale and are too easy. Would not buy again."}
{"product_id": "B0053B66KE", "context": "Is Pokemon X and y a good entry for someone who has never played any Pokemon game at all but does love to play RPG's?", "response": "Totally yes. The game is very fast paced and easy to learn, you will have zero issues even if you haven't played any of the games released before."}
{"product_id": "B008EZ3PBY", "context": "Will this work with the xbox 360 pro?", "response": "it does not work with xbox 360 E"}
{"product_id": "B00D9FQAM0", "context": "does this come with any cords", "response": "Yes, the system I ordered came with the power cord, but no HD cords."}
{"product_id": "B00B3FIXJQ", "context": "Will this work for Halo 4?", "response": "I asked my son and he said no, that it only works on Call of Duty games."}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "Online multiplayer is its only gamemode. There is a very simple training mode you can do by yourself that involves you fighting a series of one on one  titan battles but thats it."}
{"product_id": "B002CZ7P04", "context": "I have a problem with the contoller.  When I am in the menu for pause/save, etc., the controller arrow floats and I can't control it.  Does anyone else have this problem?", "response": "You may have to use a different controller to see if that one is the problem.  I had to switch controllers as one was broken."}
{"product_id": "B0057WDE8Q", "context": "Is it wireless and would it be good for playing Mz PacMan", "response": "Hi! It is not wireless... but it is good for playing fighting games like street fighter and Mortal Kombat. I never tried Mz PacMan with this but I think it will work well."}
{"product_id": "B00BBUCCKO", "context": "How long is the cord?", "response": "Probably about 5-6 ft."}
{"product_id": "B00IYWV852", "context": "Is the extra 20 buck for the deluxe edition of the game worth it?", "response": "You hve 2 ask urself, is the extra 15 bucks worth a costume u will most likely use a few times and a free hoverboard."}
{"product_id": "B00FVQCFGA", "context": "hook this up via usb?", "response": "There is a small door on the side of the console that pops open. If you don't already have an internal hard drive it will be empty and this one just drops right in."}
{"product_id": "B006PP4136", "context": "Does the screen protector also fit on the ps vita 2000/slim?", "response": "I'm pretty sure. Check the specs to make sure te screen sizes are the same but other wise I think so. The button layouts look to be exactly alike."}
{"product_id": "B009AFLXQQ", "context": "Can this controller be used to play Wii u virtual console games?", "response": "Yes, but some games may not be compatible with it. It depends on the title."}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "It is in English."}
{"product_id": "B002CZ7P04", "context": "We just got the game and are enjoying it, but we can't get mini games to work. When we click on a game icon, nothing happens. Do they need unlocking?", "response": "Sorry, Haven't tried the mini games."}
{"product_id": "B004QRKWKQ", "context": "Does this work with emulators like ZSNES, ePSXe, and such?", "response": "It should since it acts as a native DirectInput device. I know it works in PCSX2."}
{"product_id": "B00BMFIXT2", "context": "Do you need xbox live membership to play it on your own?  Like to play without xbox live.", "response": "You can play through the entire single-player campaign without an Xbox live account or membership"}
{"product_id": "B000IBELZG", "context": "Does this camera work with the PS Vita?", "response": "Yes, I have been having mine for about 9 yrs."}
{"product_id": "B00AK4QB22", "context": "do you have to be on xbox live in order to play these dark souls games online?", "response": "Yes. It will require an Xbox live gold subscription."}
{"product_id": "B00F27JN8Q", "context": "can you put ps vita cartridges in it?", "response": "Yes, but not all games work.    Persona golden works, while final fqntasy x hd wont."}
{"product_id": "B001NT9TK4", "context": "Is the gas pedal realistic? I mean, in real cars, there is a big difference if you floor the gas pedal or only press a little bit.", "response": "Well for drifting it worked well"}
{"product_id": "B00FYMTUQY", "context": "Is the angle of the camera adjustable? Can I adjust it took look lower or higher as I desire? (Use Xbox fitness a lot and need it to see floor level.", "response": "The mount is fixed, bus i have a medium size room so I also had to adjust the angle and I did it on the xbox kinect itself not on the mount, just carefully with one hand hold the base of the kinect and why the other hand change the camera inclination."}
{"product_id": "B000GP8448", "context": "what games does this product work with", "response": "Ive run across very few that dont work with this wheel. By far the best wheel pedal set up Ive ever used."}
{"product_id": "B00FE8WKPQ", "context": "Can I play this on my regular Wii?", "response": "The game disc is definitely not compatible. I'm not so sure about the wii fit board"}
{"product_id": "B00G21VQ2M", "context": "is kenshiro a playable character?", "response": "yes he is playable and a very awesome character to use."}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "I don't know about the \"pro\", but this one is for American games."}
{"product_id": "B00EWEHI5K", "context": "Does anyone know if it comes in the hard-shell briefcase if I purchase it directly from Amazon?", "response": "The one I purchased just came in the standard retail packaging.  No extra cases or anything."}
{"product_id": "B00FENJVOE", "context": "Is this a digital key or will I have to wait for this in the mail?", "response": "If you purchase now the data on the disk is not used expect to load an old version of battle.net client.   Downloading everything was 6 gig."}
{"product_id": "B00519C7JC", "context": "How busy are the servers today?", "response": "Oh I'm sorry, definetly yes! It's addicting from what I see and hear they can't let it go."}
{"product_id": "B001AWBYRA", "context": "can i play this on a standard windows vista?", "response": "Yes, this game came out before windows 7 (one year)"}
{"product_id": "B00CPKUV9I", "context": "Will this game work with a joystick?", "response": "Unfortunately, I never got the game running because it requires a 64 bit operating system. I was very upset that I wasted my time and money which I would not have done if there was a warning about this. I did not return the game because I do want to play it some day."}
{"product_id": "B00GJ2HZ7E", "context": "it doesn't say windows 8.1 compatible but if it's all steam based doesn't it only matter on what OS you can run steam on?", "response": "You should be able to run almost all of your games (that you have installed through Steam) on Windows 8.1. If you have any problems running them, you can just search up the issue on Google, and I am sure there will be someone out there that written up a solution to solve it."}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "Nobody remembers the twin snakes"}
{"product_id": "B0053BCML6", "context": "Can more then one person have a house in New Leaf just like in Animal Crossing City Folks?", "response": "Yes. I'm not sure what the limit is on that but I have two people on my game and they have separate houses."}
{"product_id": "B005Q1YA5O", "context": "I'm wanting to purchase this for my granddaughter.  How many downloads does this give her?", "response": "I couldn't get mine to fully download at all. I'd recommend ordering the actual disk or going to a store that would sell the game disk"}
{"product_id": "B006JSY3MI", "context": "If I buy the download version would I be able to play? Reason I'm asking its because I'm in Japan, and I cannot buy it from Steam. Thank you", "response": "Im guessing yes, because it will be on your computer and not from a pc disk, i dont think it will require Steam. Worth a shot?"}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "You would be able to fit both in the case, but there are not separate compartments so you risk scratching the unit. You also could not carry additional games on the pouch."}
{"product_id": "B00D84DRNC", "context": "I have a question will this fit a 3ds xl and a AC adapter in it?", "response": "Yes, it will. In fact, I have the Monster Hunter 4 Accessory Set cover for 3DS XL and it will still fit even with the adapter and the little game case that comes with the set"}
{"product_id": "B00BGAA3S2", "context": "Is this just an upgraded version of the Playstation Eye? I play the champions game, will this work better than the eye?", "response": "This camera is only for PS4. It has motion control with Move and DualShock 4 and works REALLY well. Has head tracking, facial recognition, and voice commands as well. It works much much better than the PS Eye. The only content for it right now is The Playroom: https://www.youtube.com/watch?v=vv5uI2vlXE8Its great for showing your face when streaming games though."}
{"product_id": "B00F27JE1C", "context": "Is this package with Japanese?", "response": "Can you state your question in more detail. The vita is packaged with an original Japanese box therefore the package does contain Japanese words describing the vita. The only English words on the box are PSVITA, SONY, Lime and Green/White."}
{"product_id": "B002FY0CM0", "context": "Is this cable compatible with the Sega Master System?", "response": "Don't know why somebody told you no, everything I've seen online seems to indicate that the composite cable for the Genesis 1 and Master System are exactly the same."}
{"product_id": "B00DBRM3G8", "context": "is there the slam dunk contest and 3 point shooting contest in this game?", "response": "No, it's not a three point or slam dunk contest  that hasn't been on 2k in about 3 years."}
{"product_id": "B001444IN6", "context": "does it work for windows 7 and 8", "response": "Hi sorry for the late reply..... The sims 2 will work on windows 7 as I was told by an EA employe but it will not work on windows 8. Hope I helped.-Hannah"}
{"product_id": "B00D3RBZHY", "context": "Does this game have a online code inside required for online play?", "response": "No, I rented it through GameFly and there was no code. Just pop the disc in and play :)"}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "No, you have to redeem on Xbox 360, and then when you pop on your Xbox One and go to the gamestore COD Ghosts will be shown as free."}
{"product_id": "B004N7IIQ4", "context": "Is the headset over-the-ear or on-the-ear?", "response": "Very much on ear, do not expect these to go over the ear at all."}
{"product_id": "B0090WBXSM", "context": "Does this work for iPad air and is it compatable with all games", "response": "I could not get this to work on ANY of my devices. Android, Linux, Apple, Windows, you name it I tried it and nothing worked. This is just my experience though, one of my friends did actually get it to work on her rooted phone using another some sort of extra app."}
{"product_id": "B002I0H79C", "context": "are people still playing this game as of june 2014?", "response": "Definitely. Just check out the multiplayer. Even Halo 3 is still running after all these years."}
{"product_id": "B00BFOEY3Y", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "It's toggle-able between smooth and click scroll. Click scroll may be loose depending on your preference. Seems fine for me."}
{"product_id": "B002HH9TUG", "context": "Does it work on a mac?", "response": "Haven't found the driver for it."}
{"product_id": "B008CP6MA2", "context": "im seeing people saying chains of olympus and ghost of sparta are psp games? is this true or are the voucher codes for the ps3 version?", "response": "They're good for ps3 as well."}
{"product_id": "B007JM8ULS", "context": "Can i play Titanfall with this hardrive", "response": "Yes. As a matter of fact, Titanfall requires a hard drive since it needs 1.2 GB of space, and you won't be able to use any internal memory or flash drives."}
{"product_id": "B00GO4PTR0", "context": "could help me please my question is how I sent the code is by email or serious", "response": "I got an actual card as well"}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "It worked for me on Windows 8. Hope you like it!"}
{"product_id": "B000BTBMWA", "context": "will this work with the black xbox 360 the 2 gig hard drive  im also useing a non hd tv", "response": "If you are using a TV with a component video input (Red, Blue, Green) then it will work but if it does not then it will not. This is a component only cable. I would recommend going with a cheaper composite option if your TV doesn't have a component video input."}
{"product_id": "B003VAHYQY", "context": "Anyone know if this is Linux Compatible? Is this controller Linux Compatible? Specifically I would like to use it for the Mupen64Plus emulator on Ubuntu. Thanks for any helpful response.", "response": "Yes it is. Event two at the same time. But buttons need to be mapped in Mupen64. I'm looking for the right configuration !"}
{"product_id": "B001BYMZ5W", "context": "Does this headset come with the USB Dac and also does it have Mic Monitoring?", "response": "No and no.  These headphones only have standard audio jack connectors (3.5mm plug with a 1/4\" adapter).  All the \"smarts\", if any, will come from whatever this is plugged in to."}
{"product_id": "B007FTE2VW", "context": "In the picture you show the Standar version so are you seling the SimCity: Limited Edition or Standar ?", "response": "I got the limited edition. But things change. I got mine months ago."}
{"product_id": "B002VBWIP6", "context": "Will the code work internationally? Like all over the world?", "response": "I'm not sure I have U.S account. You should contact the seller whether it will work internationlly or not"}
{"product_id": "B00E8JZILA", "context": "How does it look on PS VIta slim?", "response": "it looks great! runs smooth just like the console. Ive seen some pretty bad vita ports. (god of war collection and sly cooper: thives in time) but this game and PLaystation all stars are amazing on the vita."}
{"product_id": "B00DJYK9L4", "context": "How much room do I need to move around in? I have a tiny living room area :-) Thx!", "response": "Two square meters will be ok"}
{"product_id": "B009ZDPYKO", "context": "Can this skylander be used with the new skylanders trap team new traptanium portal?", "response": "Yes!  My son received the trap team starter pack for Christmas.  All of his Giants work with the new portal.  I believe all the older figures work with the newer portals but, unfortunately, it does not work the other way around. i.e. Trap Team figures do NOT work with the Swap Force portal."}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes.  It is connected to the keyboard in 4 areas.  On each end of the keyboard there are thumbscrews.  In between the edges of the keyboard - pretty close to the 1/4 and 3/4 marks, there are 2 little plastic clips."}
{"product_id": "B00656HLGO", "context": "It says 320 GB yet only has 293 GB available, what happened to the other 27 GB?", "response": "Every hard drive has his scenerio. Regardless of brand. Btw, this drive only lasted me a few months as it wasnt new and not by Microsoft. It had a label inside that said \"recertified\". Good luck!"}
{"product_id": "B001KMRN0M", "context": "Does this item have a Headphone Jack?....and if so, what size is the Jack? Also does this item have built in speakers?", "response": "The psp 3000 has a 3.5mm headphone jack according to various websites (i can honestly stick in most of my normal headphones/earbuds)The PSP 3000 does have built in speakers.Also note that I believe the psp 3000 does not have internal memory so you will need a memory stick for your files."}
{"product_id": "B0054JGGGY", "context": "How is the mamba's tracking while wired? I don't intend to use the wireless at all. I currently use a 3500 Deathadder", "response": "The Mamba works great while hard wired.  I owned a Death Adder prior to the Mamba and performance is identical. The only difference is that the Mamba has two extra buttons and a little more weight."}
{"product_id": "B00BKF5IXS", "context": "Good day. Does it include also the original PlayStation controller?", "response": "does it have an original HDMI Cable as well ?"}
{"product_id": "B005G4CXPK", "context": "Will the keys activate on steam?", "response": "I have no idea. I bought the physical copy and it is not linked to Steam, but another program called \"Uplay\". It wanted the key codes entered there. And in my review I mentioned that I only received one key code instead of two."}
{"product_id": "B00FE8WKPQ", "context": "How much space do you need to use this effectively? Thanks!", "response": "I would allow yourself about a 6 foot square area to use it properly."}
{"product_id": "B005J37I4Y", "context": "This doesnt work on xbox one right?", "response": "Does not work with Xbox one."}
{"product_id": "B0050SZE2G", "context": "is this a online game only or can be single played", "response": "It is both,story mode and online.....thanks for asking...."}
{"product_id": "B008WZRZJY", "context": "A great game, especially the graphics. Does anybody else have blurry pictures in the strategy guide?", "response": "Its been a while since playing it but I had no trouble.  Great game."}
{"product_id": "B00D96BMV8", "context": "How exactly does the headset connect to the console? What kind of connection is it?", "response": "The headset connects via one cord into the bottom of the controller."}
{"product_id": "B00005NIMB", "context": "does this stick come with usb connection?", "response": "Yes it does !!"}
{"product_id": "B00FXOP1MU", "context": "can you play regular ds games on this unit?", "response": "Yes sir u can :) I asked that same question before I bought mine ;)"}
{"product_id": "B003O6G5TW", "context": "How can I get online game code I got a used game and can't play multiplayer?", "response": "I'm sorry but I'm not sure. I sell any copies I come across as no pass code for online play included. You could try going to EA online and go to the chat support feature and check there with them. I hope that helps. Thanks"}
{"product_id": "B009CEM332", "context": "Does this work for Windows 8?", "response": "Unfortunatley dont have idea. Um on win 7 pro and ill not switch to win8 .....ever ;)"}
{"product_id": "B00002SANH", "context": "This game will not install because I have a 64 bit processor and this game is for a 32 bit processor only. How can I install this game on my computer?", "response": "It's a very old game and just doesn't want to work with newer computers. You might try compatibility mode as suggested by B Slater, but don't hold your breath. Sorry."}
{"product_id": "B00B67ZTUW", "context": "Is there an English strategy guide available? I am only seeing the Japanese guides in searches.", "response": "No there isn't. The only English strategy guide (in English) is for the sequel- Xillia 2. Hope I helped. :P"}
{"product_id": "B004QRKWKQ", "context": "does it work with a mac", "response": "Yes it Does. watch this video  http://www.youtube.com/watch?v=9r98HMtD8xs"}
{"product_id": "B00635N6YI", "context": "i travel alot so the magnet paneling on the side falls off alot and i lost it not the symbol but the whole side of the mouse can just fall off......", "response": "I don't feel this is a question."}
{"product_id": "B00CJD4HD2", "context": "does the button on the side with the red dot do anything on this one? g500 it was just a dead button", "response": "I programmed mine to Alt + Tab. It allows me to switch between programs very easily. I feel severely restricted without it on other computers, now."}
{"product_id": "B0012DPHKW", "context": "Is it compatible with Windows 8.1?", "response": "Sorry... I don't know... I haven't upgraded."}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "no keyboard is hard wired, but awesome!!!"}
{"product_id": "B00ACMM9BO", "context": "does anyone have the paper that came with it?", "response": "Yes I have the paper the controller came with. What do you need?"}
{"product_id": "B00B5GZORW", "context": "Does anyone know how to get past the point of the downed tree in front of the path? I have started 3 times and keep getting stuck here.", "response": "The hint button will give you info about it or you can also google the walk thru for the game and go to that section of instruction."}
{"product_id": "B005UI8V6C", "context": "Do you need internet to download this game?", "response": "No, you can buy this game off of Amazon.Com  You put the disk in your computer and then figure out howactivate it.  If you have an xp computer it wont work, you have to have at least windows 7 or above."}
{"product_id": "B00G0OYHCW", "context": "Does the console play DVD's?", "response": "No, it does nor"}
{"product_id": "B00002SANH", "context": "I cannot get the game to work on my lap top operates windows 7 64 bit pc", "response": "I have this game running on my windows 7 64 bit Gaming PC that can run massively demanding games. You shouldn't have any issues with it. Have you tried running it as Administrator then selecting compatibility mode?"}
{"product_id": "B00BBUCCKO", "context": "How loud is this keyboard?", "response": "It's not very quiet but I've owned louder."}
{"product_id": "B00EZKNT5O", "context": "does it come with a cord", "response": "Yes it does. And it's a real good buy."}
{"product_id": "B00E1L78N6", "context": "Did the controller update with little to no improvement for my mic. Did you guys have the same issue?", "response": "I had the same result. I resorted to using the boom mic that was shipped with it. I don't know who's problem it is but I would assume it's Microsoft's since I have other issues that require constant rebooting."}
{"product_id": "B00CJ7IUGS", "context": "Are the bugs worked out?  Last time I played on the DLC I had duplicate NPCS in my custom house and I'd encounter duplicate mobs", "response": "I haven't had that problem, except in regards to a steam mod. For bugs, I would recommend contact customer tech support via phone number in back of game manual. They helped me."}
{"product_id": "B00F9RGFEY", "context": "Does having the lights on eat the battery?", "response": "Yes,  some other things about it to its that the microphone is way too sensitive, the band on the head already cracked which makes the build quality poor, when I use it online for the Xbox one, hearing the other players is quite difficult even though the chat volume is turned all the way up"}
{"product_id": "B00FM5IY4W", "context": "Are all of the cars that you can buy be earned through playing the game, or are some only available through micro transactions alone ?", "response": "All the cars in the game can be earned by winning races and getting in-game currency that can then be used to purchase cars. However, there are downloadable cars and downloadable content outside of the game that can be purchased and added to your game, via micro-transactions."}
{"product_id": "B0032MM2P4", "context": "Can I use this on Windows 8?", "response": "Don't know.  You will have to check the box it comes in. Sorry. It works on Windows 7 which I have."}
{"product_id": "B00BQWTGIS", "context": "Is the goods use a cd-rom to install or download online?", "response": "It was a download that came with my new Alienware PC with Nvidia card"}
{"product_id": "B000B6MLSM", "context": "Does this remote work with Xbox Live? I need it to work with NetFlix that I'm streaming through my Xbox.", "response": "I've never tried it with netflix, it controls dvd movies and lets you channel threw the xbox live menu, theres a possibility it could work for netflix"}
{"product_id": "B000TGQLYE", "context": "You said you tested this multitap with your own PS2.  Which model version is your PS2?", "response": "It worked at first now it doesn't think the problem is my ps2 it is first generation."}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "This game is \"NOW\" available for release day delivery.  So it will be delivered on the day it comes out if you select the correct shipping speed at checkout."}
{"product_id": "B00DE2W5XG", "context": "is the playstation plus card valid for 33 months or one year", "response": "The card gives a 12 month membership and is issued through amazon as a code i believe the code is valid for 12 months"}
{"product_id": "B00AR1LX9O", "context": "what is the battery life for this product?", "response": "I would agree with \"D\", a good 10 to 15 hours."}
{"product_id": "B0045ZB66I", "context": "Does this game run on windows 7?", "response": "Yes, it does. U should buy it becuz it is fascinating."}
{"product_id": "B001IYR53W", "context": "Does this game have gin rummy included?", "response": "Yes, \"Gin\" and also \"Rummy 500\" are listed in the contents. Have fun! This is an excellent program."}
{"product_id": "B003Y5AHPG", "context": "Will this model play Castevania 3?", "response": "It will play any true NES, SNES or Genesis title, Castlevania included."}
{"product_id": "B008CP6Q6M", "context": "Is it a free roaming game?", "response": "In a way. Its definitely more prominent in Infamous 2."}
{"product_id": "B002I0GF72", "context": "How does it differ from the original  (game cube) game?", "response": "The graphics are in HD, there is a new item called the swift sail which makes sailing much easier and faster, but other than that, it's mostly the same."}
{"product_id": "B002ZS6Y64", "context": "Game sound stopped working with this headset, however chat still works.  Cant seem to figure out why.  Does the optical cable go bad on these?", "response": "Push in the volume on the sound side. It should turn back on."}
{"product_id": "B004N7HSGU", "context": "Are these capable of using USB for a PC hookup or are they the green/pink cables?", "response": "You can use a multitude of different connections. I myself am using my optical port."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "Yes, we have a Wii, not a Wii U, and my son is able to use it with our system."}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "Perhaps. There are GameCube controller adapters such as Mayflash Nintendo GameCube Controller Adapter for Wii/Wii U that supposedly will allow you to play on the Wii U. I haven't tried one.The Wii U does not have GameCube ports, and games released on the Wii U aren't made with the GameCube control scheme in mind."}
{"product_id": "B0045ZB66I", "context": "What are the system requirements?", "response": "intel 2 core 1.6ghz or amd athlon64 2.0ghz or faster, windows xp, vista, 7 32/64bit, 1gb ram or 1.5gb ram for vista/7, dvd 8x, 24gb hd, 128mb xp / 256mb vista/7 video card, sound card dx9c compatible, mouse and keyboard"}
{"product_id": "B0096L2SJ0", "context": "Has anyone tried this on the Galaxy S5??", "response": "I work on a cruise ship and my friends liked my toy and they wanted to test it themselves. Many android devices includimg samsung s5. Works very good. I recomand you to take one. I have 2 so far so i can play in multiplayer with friends :-)"}
{"product_id": "B00C710AT6", "context": "is a controller needed?", "response": "No is not needed, but a cotroller is cheap and i think it enhances the gameplay a lot"}
{"product_id": "B000VRCNLG", "context": "Can this be played with just a mouse?", "response": "As far as I know you need a joystick.it would be pretty hard with a mouse but you could open the options menu and see it you can map controls to a mouse."}
{"product_id": "B00IVJ1M7M", "context": "Does this work with the New 3DS XL?", "response": "This device doesn't have to go into the console at all so as long as you are using a 3ds game it will work fine!"}
{"product_id": "B005VA5D24", "context": "Is this hard drive compatible with the Xbox 360 Original Console?", "response": "No. This hard drive is only compatible with the Xbox 360 Slim or Xbox 360 E. Not the arcade or pro."}
{"product_id": "B00FATRKOK", "context": "Does this come with, or already have inside of it, a wireless adapter or will I need to buy a separate one?", "response": "You must b the sensor separate. And the tomb raiders game has to be downloaded through the internet system. Living out in the country and limited internet I have not been able to download the game. That has been disappointing"}
{"product_id": "B00AJZNUUI", "context": "what include this wii? include a game?", "response": "According to the deal that was running at the time I purchased it, I had to purchase a game to get the eal."}
{"product_id": "B00DC7FWRE", "context": "What controllers are supported?", "response": "The regular wii controllers works great with the wii u party"}
{"product_id": "B000YMQGWU", "context": "it works for connecting a ps2 controller to a windows pc?", "response": "That isn't something that I've tried, sorry."}
{"product_id": "B00BQZ5EWW", "context": "if i buy Total War: Rome 2 will the Imperator Augustus be add or do i have to buy Total War: Rome II - Emperor's Edition to get it ?", "response": "When you install the game, Imperor Augustus will be  automatically installed with the game so you don't have to get emperors edition edition! :-)"}
{"product_id": "B00CRL9TU2", "context": "cAN i USE THIS GAME ON A PLAYSTATION 4?", "response": "No you cannot. No backwards compatibility"}
{"product_id": "B00AJILG1K", "context": "This is labeled as a 901 but does not have the US key layout pictured. If I order it will I receive the proper keyboard?", "response": "Yeah that's how it looks"}
{"product_id": "B00001LDCK", "context": "will this game work on windows 7", "response": "I doubt it. This game was probably compiled for something like WinME or Win98. Perhaps you can find it with people like GOG (Good Old Games), there it would run on Windows 7 etc."}
{"product_id": "B002I090AG", "context": "can games on the ds be played on the3ds", "response": "To the best of my knowledge they can be"}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "No. It is only multiplayer online, there isn't co-op until AC Unity for ps4 and xbox one."}
{"product_id": "B0029LJIFG", "context": "Do I need a Gold starter kit too?  My son had a xbox live account but it expired I want to reactivate so I bought this yesterday, is this all I need?", "response": "I believe so. Even if his account expired you should just be able to reactivate with this card. Kinda like a prepaid phone card would work."}
{"product_id": "B0053B5RGI", "context": "If I were to only get one, Would you recommend X or Y?  I'm new to pokemon and have only played the Yellow Game on the Original Gameboy with Pikachu", "response": "It really does depend on which legendary Pokemon you like better--I liked the Xerneas, so I went with X. One of my sisters has Y, and she likes it just as much as I like X. So, I may recommend X, because that's the one I got, but they're basically the same game :)"}
{"product_id": "B008CP6MA2", "context": "Is this a multplayer game?", "response": "No. It is a single player quest game."}
{"product_id": "B00E88G054", "context": "How loud does the mouse click? Reviews say that they got wireless mouses instead, I will most definitely receive a wired mouse, correct?", "response": "The clicker sound was fine.They just have a reputation for sending the wireless mouses instead of wired ones for the mazer Version 2."}
{"product_id": "B00BT71S4K", "context": "I have a Moto G. It's compatible? Does it have to be rooted?", "response": "It should be able to work perfectly fine."}
{"product_id": "B008BGXYBM", "context": "if you use the mouse with your right hand can you set the pinky forward and back button to different keybinds then the thumb? huge wow pvper***", "response": "Yes they can! All four buttons on both sidesign can be individually reprogrammed to an extent. But in my case, many of the button are not fully reliable. I find myself not clicking as forcefully as I should, thus resulting in the key not registering the action. So no half assed cliclicking!"}
{"product_id": "B001NT9TK4", "context": "Is it possible to remove the leather cover from this wheel?", "response": "I honestly wouldn't think so. However it is with some knowledge possible to replace the wheel altogether. If it's just the leather you don't like, buy a steering wheel cover in an automotive store. It would take some searching to find one the right size, maybe. Be aware that replacing the wheel would most likely void your warranty."}
{"product_id": "B008SBZF4Y", "context": "can this work with the WII?", "response": "Skylanders toys are not console specific, meaning as long as you have the game and portal for the Wii system, it will work."}
{"product_id": "B006IR6NH8", "context": "Can I be able to attach this to my G27, I know that the buttons wont work, but is it attachable?", "response": "http://simulaje.blogspot.com/?m=1 here is what I used. He also sells other wheels"}
{"product_id": "B00E88G054", "context": "how is this mouse compared to the mazer 1 type r? better? worse? improvements?", "response": "Honestly. I love the mouse. Hard to see never using it now."}
{"product_id": "B00BQZ5EWW", "context": "are there black people?", "response": "There are some with a few of the factions."}
{"product_id": "B007VPZR5U", "context": "Can this be used on a laptop and a stationary PC", "response": "Yes for both, but the cord may not be long enough to hook up to the tower on your PC, depending on where you place your tower."}
{"product_id": "B000O5DY0E", "context": "Will this game work with the new Windows 8 computer?", "response": "I believe it will. I have Sim 2 games on my Windows 8 and they play just fine. Just check the back of the game to make sure it will work."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "Hi Sylvia, I run W7 Pro on my 3 computers, so I can not answer your question. I did look at the documentation that came in the box. It does NOT state which OSs are supported. You can email Thomas Warfield at support@goodsol.com. Tom wrote the program. Bill R"}
{"product_id": "B004N7IIQ4", "context": "Is the headset over-the-ear or on-the-ear?", "response": "They are on-the-ear, but really close to over ear."}
{"product_id": "B000096L71", "context": "if I buy the 4 disc used do I need a code to get it to play ???  thank you", "response": "on the flight simulator x you nned a code to get in but not the 2004"}
{"product_id": "B003BKWEHS", "context": "does it work on windows 8, 64 bit?", "response": "I don't know because I have windows 7 and it works fine."}
{"product_id": "B003O6C0V4", "context": "Any secrets or tips on how to get the sensors to sync?", "response": "You have to insert the USB sensor in the back of the console  make the sure the console is off first and when you turn it on it should receive the signal"}
{"product_id": "B007OVHW90", "context": "Will it work for the phantom model?", "response": "NO, it needs phantom model"}
{"product_id": "B003ZMF26W", "context": "is it wireless and does it work with windows 8.1", "response": "It is not wireless and yes it supports all versions of windows XP or later so yes 8.1 to."}
{"product_id": "B00HEX8TA4", "context": "Does your scroll wheel wobble? Mine wobbles significantly. Makes a jittering noise if I shake the mouse.", "response": "I think that is the weights in the mouse"}
{"product_id": "B003NVMEVQ", "context": "When you click the mouse is the sound, soft or loud?  I need one that has as low noise as possible when clicking.", "response": "What up Nestor. Cool name btw. The mouse has a noise as all mice do, however; it is barely noticeable and relatively quiet in my opinion."}
{"product_id": "B00292OW1U", "context": "Is this keyboard wireless.", "response": "No,This keyboard is a wired keyboard.  It receives its power for the lights via USB.  Its cord is quite long and sturdy though.  With all of the buttons you can push and customizing you can do to the keyboard for certain games, it's best to have it remain stationary on a flat surface."}
{"product_id": "B0016897GS", "context": "do you need clips", "response": "no you do not...it came with clips"}
{"product_id": "B009DL2TBA", "context": "does it play ps1 games and ps2 games too?", "response": "It does play PS1 games. The other answers here are wrong when it comes to that, but it WON'T play PS2 games."}
{"product_id": "B00A878J5I", "context": "if I leave the sleeve on, does the remote plus controller still fit?", "response": "That is my only complaint. They shoudl have included that in the description. I have Mario, Luigi, and Peach themed WiiRemote. If it wasn't for the jacket that came with them, it would haev bothered me so much. The battery lid is black so it doesn't match with my controllers."}
{"product_id": "B007LQG9A6", "context": "is this remote fake or really from microsoft?", "response": "Definitely a knockoff. It works okay but sometimes I have to unplug it and plug it back in."}
{"product_id": "B00EADTVL2", "context": "Does this come with multi-voltage support?", "response": "It comes with a standard 120 v US plug. I did not see anything that suggests it can be used at different voltages."}
{"product_id": "B0076HD2W8", "context": "Will this work with Fire TV ?", "response": "Reports from others online suggest that the Microsoft Branded USB Receiver DOES work with the Amazon Fire TV.Has anyone who's bought THIS one had the chance to try it out with the Fire TV?"}
{"product_id": "B000O5DY0E", "context": "how do u get these games to work on windows 7 ...", "response": "Buy the game and follow the download instructions"}
{"product_id": "B004AM5RAW", "context": "Is there a warranty with this mouse?", "response": "There should be the usual warrenty that Razer offers though there shouldn't need to be used. I've never needed to these are really well made and I'm an excessive gamer"}
{"product_id": "B0032MK90E", "context": "Will it run on win8?", "response": "I have windows 8 and it runs fine on mine.  I play almost every day."}
{"product_id": "B0053B5RGI", "context": "Pokémon rookie here. If it get one son X and one Y, can they battle each other?", "response": "Yes they can!  They would each need to have a separate 3DS though."}
{"product_id": "B001TOQ8X4", "context": "Physical copy? If so, can I download the game and play while the game is shipping?", "response": "I'll post the download for client soon."}
{"product_id": "B0017Q4DGI", "context": "I'm having trouble loading this on our WiiU console. It is not letting me get click the \"TV ONLY\" button to play the game on the big screen. Advice?", "response": "Wii U's can play Wii games. just press tv only, you need a sensor bar to do that by the way.sorry this answer is 7 months late"}
{"product_id": "B00D84DRNC", "context": "Which section of the case is best suited to carry the 3DS XL, the large middle pouch or the more snug fitting inner pouch?", "response": "The inner pouch, it wont fall around in there as much. Then you can also put your charger in there! I got this for my girl and she loves it. Hope this helped!"}
{"product_id": "B006JKARP8", "context": "Will this work with the new vita to be released on may 6th?", "response": "It will charge the Vita 2000, however you will need the USB cable from the original Vita 1000 kit to charge the battery. You should be able to buy the original Vita USB cable separately here on Amazon."}
{"product_id": "B001AWBYRA", "context": "can i play this on a standard windows vista?", "response": "Yes, actualy the logo on the game disk is the Windows vista logo."}
{"product_id": "B001ELWMHI", "context": "Does XBOX Console works out of U.S.?", "response": "Well.. I live in Puerto Rico and, even though we are a colony of the US, we are also considered outside US and it works."}
{"product_id": "B00AK4QB22", "context": "Can you play as a female character?", "response": "Yes. You pick gender, hair, features and build."}
{"product_id": "B0050SWBAE", "context": "Can you use the GameCube controller with this game?", "response": "No only wiimotes and wiiu controlers"}
