{"product_id": "B003JVF728", "context": "Is getting stuck in a dark building part of the game ? because i can't get out.", "response": "That's a negative red leader"}
{"product_id": "B0089OBLDO", "context": "Will this also work to convert a plain xbox controller to work on a ps3?", "response": "no I believe the original xbox controller had a round plug similar to gamecube. there may be an additional adapter to convert to usb but the product in question only has a usb port and a ps2 controller port"}
{"product_id": "B000266786", "context": "Will it run on OSX 10.6 without classic?", "response": "no it wont. I bought mine and cant play it on my mac."}
{"product_id": "B00CX9L30W", "context": "Does this come with the game itself?Or do you have to purchase the game and the CE to get it's benefits?", "response": "The CE comes with a copy of the game and the benefits. You donr have to buy the game and the CE to get the benefits.      Hope this helps."}
{"product_id": "B005J37I4Y", "context": "This doesnt work on xbox one right?", "response": "It does not work on the Xbox one."}
{"product_id": "B008TXMPJE", "context": "Will the sims 3 games work on a windows 8 or 8.1 computer? Or will it just work on the windows xp computers?", "response": "I have Windows 7 and it works wonderfully.  I tHink being ahead in the computer makes it work a lot nicer"}
{"product_id": "B00F9RGFEY", "context": "I just want some clarification. Some customers are saying it works on Xbox One. The advertisement does not. So, is it compatible or not?", "response": "Well im not quite familiar with the xbox one hardware, but as long as there is an input for an optical cable for the wireless stand and a usb to connect it then yes it is compatible if anything contact someone at pdp or look up a YouTube video. I hope this helped"}
{"product_id": "B0095P5K8I", "context": "does we need to have a mouse pad or we can us it with out the pad?", "response": "You can use it without a mouse pad, but like I said in my review, I don't really recommend it as it broke in 2 months."}
{"product_id": "B00BT71S4K", "context": "can the galaxy s5 fit in this gamepad?", "response": "it will definetly fit because i have the note 3 and it fits perfectly so you should be fine n_n"}
{"product_id": "B00BHSTXV6", "context": "Can the macro keys activate AutoHotKey scripts?", "response": "If you have them directly set up to activate hotkeys in game or any other app. it will definitely act as a trigger for it.As far as the keyboard goes, I have a brand new yet defective keyboard.I'd recommend you spend a bit more money and get something worth it. 50$ for lots of headaches... not worth it.GL"}
{"product_id": "B00475AYUA", "context": "can anyone tell me why it said it downloaded everything for it then only downloaded colonization? bc everytime i go to open it up it says civ. comple", "response": "It is an supplement, and won't work on Windows 7 or 8. Civ5 better, but only on steam."}
{"product_id": "B0042J7I3C", "context": "Can you hear your own voice when talking?", "response": "No,mic quit working,then earphones went out.same thing on 4 of them."}
{"product_id": "B0083H4NG4", "context": "im quiting razer products they just broke after a few months after use, is this mouse better?", "response": "I can't speak to Razer products since I've never owned any. But, I've had this Perixx mouse for just about a year now with no issue. It still works just as well as the day it arrived. No complaints."}
{"product_id": "B005QUQP94", "context": "Is the wrist rest removable?", "response": "Yes, it is removable."}
{"product_id": "B00F2ENJY8", "context": "can 2 or more people play simultaneously, or do they take turns (e.g., mario kart)", "response": "Up to 4 can play at the same time depending on the game"}
{"product_id": "B0050SYX8W", "context": "Is it 2 player?", "response": "Yes, 2 players Co-op."}
{"product_id": "B00JM3R6M6", "context": "If I'm an adult and I play this game, should I be publicly executed or just shunned from all society?", "response": "Nah, you'll be alright"}
{"product_id": "B00BGGIWZM", "context": "is the pc/mac version be used for mac and pc, is that what this means? or only the mac version be only for mac", "response": "I can be used with either mac or pc"}
{"product_id": "B00DC7G0GG", "context": "does it work on wii", "response": "no.  Only on the Wii U"}
{"product_id": "B0072HYRNK", "context": "Does this come with a USB cable for charging?", "response": "I bought two of these and received them in the mail yesterday. Mine both came with charging cables that you can plug directly into the ps3, or any usb charging device. I recommend doing what I did, and just buy a charge station if you have multiple controllers. So much easier to manage. Hope this helps."}
{"product_id": "B00BGHUS58", "context": "I havnt got this game for my son yet and he wants to know if it's worth it", "response": "My son seems to love it so if he's happy then I'm happy. It was a game he really wanted as well."}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 7? I might as well ask if it works with Windows 8 although I am not a user of that operating system.", "response": "It works with both but youll have to install the driver through a small disk there is no online driver download"}
{"product_id": "B004IK24MU", "context": "Does this work with white Wii remotes?", "response": "i dont know i bought it for my son but it should"}
{"product_id": "B00EZPCX1A", "context": "Does it come with any games?", "response": "Mine did not that I can remember."}
{"product_id": "B00ICWO0ZE", "context": "Can you use a gun to play the game?", "response": "No. You use the control pad for the wiiu."}
{"product_id": "B009CL6LA6", "context": "how is this set chargered?", "response": "Long cord plugged in via usb"}
{"product_id": "B00AEX81SG", "context": "Could someone tell me if this system is the original sony ps3 and  if it comes with full wifi,and netflix capability", "response": "This isn't the original Sony PS3 system that was released in 2006.  It is second re-designed PS3 model, but it does come with wifi, Netflix capability, and other functions the first re-designed model have."}
{"product_id": "B001H4NMNA", "context": "Should I unplug this after my controllers are fully charged or just let the green light sit?I don't use my ps3 often so it kinda seems like a waist?", "response": "That's up to you. We leave ours plugged in all the time because that green light is so tiny. But if you want to unplug it just to be extra conscientious, it certainly can't hurt."}
{"product_id": "B00FYAQUPU", "context": "can you use other swap force figures on the black portal", "response": "Yes, you can use any skylander from that game or past games."}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Yes on underside of the mouse"}
{"product_id": "B00I14395A", "context": "Can the angle of the keyboard be adjusted?", "response": "Similar to most keyboards there are small flip down pegs that elevate the keyboard a little."}
{"product_id": "B001UIG6M2", "context": "Does this Come with a memory card?", "response": "So this comes with a memeory card?"}
{"product_id": "B00E1L786S", "context": "Is this an ok front center speaker for a 7.1 surround sound system?", "response": "I'm not sure. As I use it as my main speaker system, along with a power sub. It is an awesome speaker in its own."}
{"product_id": "B0050SWBAE", "context": "My 5 year old loves the Pikmin mini game in Nintendoland do you think Pikmin 3 would be too advanced for her?", "response": "I don't think so it's a pretty basic game with a fun multiplayer so you could both play together"}
{"product_id": "B0015PHMFU", "context": "So this product will work on PS4? Will this console allow the character like batman on Arkum City to walk forward and run?", "response": "No it will nor work on ps4 but it does work on ps3 and pc!"}
{"product_id": "B008RA5AWS", "context": "how do you know if software processes 0-3 employees versus unlimited ?", "response": "At registration of your QB Payroll subscription, you will either register and subscribe to 0-3 employees or unlimited.  The appropriate fee will be assigned to your subscription based on your needs."}
{"product_id": "B00H7KDNBO", "context": "We have a MacBook Pro 2011.  What version should we purchase (DVD, instant download, PC?)  We want to make sure it's compatible on a Mac.", "response": "Instant download there should be an option for Mac books also I would recommend going to Titan fall website to make sure your Mac will support the requirements for the game"}
{"product_id": "B00B77OKNI", "context": "Since this is Bluetooth, will it work on a pc or laptop with bluetooth?", "response": "I have been unable to do it under both Windows7 64bit and 32bit. Pairing is fine but the regular HID drivers don't work and you will get a yellow triangle under devices. Win drivers seem to exist somewhere but I've been searching the web and have been unable to locate them."}
{"product_id": "B000R9A9JG", "context": "Is this only one battery and cover for one remote? Or two for two remotes?", "response": "yes, 1 battery & 1 cover for a single remote"}
{"product_id": "B00DBRM3G8", "context": "Can I play this game with my cousin on the same screen on the same system? 2 players?", "response": "Yes you can, as long as you have 2 controllers ."}
{"product_id": "B001DNGCN2", "context": "I have the 2nd/3rd gen. \"fat ps3\" my cable ports are spread out on the back of the ps3, how high is this fan connected to the PS3 in the back?", "response": "Isn't that big to cause you problems with the cable. If you can play with AC on and dont buy these, isn't that effective, it works OK but ps3 still get hot in a time.. so it didnt solve the problem, just improve like in a hour and a half ps3 use."}
{"product_id": "B009CL6LA6", "context": "do these work with xbox one", "response": "No. The Afterglow is a 2.5mm cable and the X-box One controller accepts 3.5mm. I bought a 2.5mm - 3.5mm adapter for $5 but even then the chat function did not work."}
{"product_id": "B009DL2TBA", "context": "does it play ps1 games and ps2 games too?", "response": "It does not play Playstion one games. I've heard that some systems will play PlayStation two games however I've never owned a system that played the games. I haven't tried it with that particular system, but I doubt that it'll even read a PlayStation two disc."}
{"product_id": "B001UIG6M2", "context": "is this for European consoles or US consoles?", "response": "This is for US consoles."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "Works like a charm .. ;)"}
{"product_id": "B008HPAXZ2", "context": "How are they applied?", "response": "they are static backed you have to be careful any floating hairs or fibers can get between the screen and filter. It took me 3-4 hours to install them clearly and perfectly. Tip have lens cleaner, scotch magic tape, and plastic dental tips on hand you'll need them."}
{"product_id": "B001E27DLM", "context": "How will I know I will not get one of the pirated copies?", "response": "supposedly when you reach the first portal in the game when you enter the portal, the game freezes that is a sign of a pirated copy"}
{"product_id": "B008EZ3PBY", "context": "Does the xbox reset if you switch your tv to cable or something else with these aftermarket adapters. Do you have that problem with this one?.", "response": "If you switch source from TV to xbox then nothing will happen, but you should pause the game or you would lose say a life. It's like if you switch from any other multimedia device. If you meant hook the cable as it is running then you could very well break it. Power off for sure"}
{"product_id": "B005M0KSIM", "context": "Without expansion packs, does this game includethings like greek gods?", "response": "No..the main game doesn't go into the Gods in detail."}
{"product_id": "B004HYIAPM", "context": "what is steam requirement?", "response": "steam is a game store and downloader and heres a link to steam http://store.steampowered.com/ and you need to make an account and then download the steam client"}
{"product_id": "B00EV4O8VS", "context": "Has the box been opened? If not, is it shrink-wrapped?", "response": "The new ones we're selling have not been opened. However, the outer box of these consoles were never factory shrink-wrapped (I don't know of any consoles, including Xbox, Wii, Nintendo, and PlayStation that ever were)."}
{"product_id": "B00D6PTMHI", "context": "Does the cable plug into USB? My laptop does not have audio-in", "response": "Yes, the cable goes directly from guitar to USB port. It has a small electronic device in the middle of the cable that converts the guitar audio to a USB signal that the computer software understands."}
{"product_id": "B0098EVZZ8", "context": "Which gaming system is this pack compatible with?", "response": "we got it for the Xbox 360. works great"}
{"product_id": "B002P35JMO", "context": "Can this be used simultaneously alongside an HDMI cable? (Can I have this plugged into my Xbox SLIM at the same time as an HDMI cable)", "response": "Yes I'm using it with both so I can use my turtle beach px22 headset"}
{"product_id": "B00E9I1FPI", "context": "Do all the games have Steam keys?", "response": "No. Only Skyrim will need steam. The others do not require anything to play."}
{"product_id": "B00EZAWV6W", "context": "So, is it possible to play against the computer only, or are you always playing against other people online? (I know nothing about shooter games)", "response": "It is possible. Select a match and set it to \"invitation only\" instead of public. That allows you to play solo."}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "Anything playing through the XBox comes through this, including whatever you have on your HDMI input."}
{"product_id": "B00GD962OA", "context": "How many GB capacity has this?", "response": "This is the 8GB set. You may want to have an HDD or flash drive if you buy the 8GB set. Space gets eaten up VERY quickly. After the installation of the huge update you're left with a little over 2GB"}
{"product_id": "B00I9GARIM", "context": "Does anyone know if a gaming mouse will fit into the space between the headphoens in the carrying case? Has anyone tried it?", "response": "The carrying case is extremely spacey. It is only made of felt, not plastic. Unless your gaming mouse is ENOURMOUS, it should work just fine."}
{"product_id": "B003JETPHS", "context": "Did you get Logitech or a knock off brand?", "response": "No, I got a Rock Band Brand one and it works really well."}
{"product_id": "B00E1L78N6", "context": "I use the Xbox One to watch TV, when I use the TV app does it play through the headsets?", "response": "Yes. Everything you do on your xbox can be heard through the headphones. Just remember to turn the volume down on your TV."}
{"product_id": "B00DB9JYFY", "context": "Does this game offer two-person co-op?", "response": "This game does not offer co-op of any kind. You can only play on Xbox Live together from different consoles."}
{"product_id": "B000LQ4HTS", "context": "Can I twist the stick to control yaw in a helicopter  or use it as rudder in a plane?", "response": "The stick's handle DOES rotate left and right, and controls an airplane's rudder.  It's my understanding that it also controls the speed of the tail rotor in a helicopter, so yes, it would control yaw in a whirlybird also.  (The stick itself acts as the 'collective', controlling forward / backward 'tilt' and left / right banking.)"}
{"product_id": "B00EV4O8VS", "context": "does the wii u have  a hdmi port to play instead of the red white an yellow wires", "response": "I don't know about all WiiU's but this model only supports HDMI which was also provided with the system. I hope this helps."}
{"product_id": "B00CD90R4K", "context": "is this game in spanish language?", "response": "No, the audio and text are both in English. There may be a language setting that I am unaware of, but I have not come across any such setting thus far."}
{"product_id": "B00DC7O77A", "context": "Does this game have multiplayer mode?", "response": "If you're asking about playing multiple people at the same time yes. Just like in super Mario but you will have to work together sometimes to use each person's special abilities."}
{"product_id": "B006NU6F28", "context": "This game compatible by using G27 PC Wheel with H-Shifter 6 speed?", "response": "Yes Euro truck simulator 2 is comparable with a G27 steering wheel."}
{"product_id": "B002VBWIP6", "context": "Does this work with xbox one?", "response": "Yes ! It says on the card .  It works for Xbox one and 360. And Xbox live is universal ."}
{"product_id": "B000PT18OS", "context": "What causes burnt out power supplies for xbox 360?", "response": "Did not burn out grandson lost all hookups for Xbox so we gave for Christmas present"}
{"product_id": "B00HGAWFJG", "context": "Does this cause the PS4 to overheat? There is no vent", "response": "I haven't had any issues with overheating. The PS4 actually still breathes quite well."}
{"product_id": "B00B5GZORW", "context": "Does anyone know how to get past the point of the downed tree in front of the path? I have started 3 times and keep getting stuck here.", "response": "Your have to take that rock (really) and brake the hanging crate with it...."}
{"product_id": "B0073QM45I", "context": "Hey, I have a regular xbox 360 wireless controller. The product says \"Charging Cable,\" but if it plays PC too (given the drivers)?", "response": "it will work on your pc But you have to have the adapter to play your games on your pc from your xbox first. then it will allow you to use the controller from pc/laptop"}
{"product_id": "B008J16AH4", "context": "does this game have multiplayer mode?", "response": "you cant play other people online, and no 2 player....but the game is a online game where you try to top other peoples highscores all around the world that play the game, and they rank you the better and better you do, gotta get 3 stars on all levels or play to beat scores...very fun game"}
{"product_id": "B00D96BNGM", "context": "can this unit be substituted for comuter headset", "response": "You can connect via bluetooth, but to get the full use of the set, you'll want to connect to the optical port -- which means your computer (sound card) needs an optical out."}
{"product_id": "B00BQZ5EWW", "context": "if u buy the download can you download it to more than one pc?", "response": "well if u want to waste ur money, it might but, my it guy that does repair said that this program is a pc killr of drive space"}
{"product_id": "B00GJSUUC0", "context": "please can anyone tell me if this is a blue ray CD or PSN code?", "response": "All ps3  games are bluray this game can also be downloaded from the ps store"}
{"product_id": "B00CD1FC6G", "context": "Does mac support this keyboard???", "response": "Corsair's website shows PC only."}
{"product_id": "B00DPJBTM6", "context": "Are these wireless? I read somewhere that there is something to make the A40's wireless", "response": "If you use the MixAmp it's wireless with the base station.  But, the headphones need to be plugged into the MixAmp module.  So, it's sort of wireless."}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "Correct. There's a DLC-for-Sale option in the sign-in menu; a variety of skins, level cap expansion packs and the first four of the five Headhunter packs are offered for download. I used Pay Pal to order a few of the skins."}
{"product_id": "B00ERDGMSA", "context": "does it work with win8 or win 8.1", "response": "Yes. This game works on Windows 8 & 8.1"}
{"product_id": "B00BS520SG", "context": "Will this work while playing Project M?", "response": "It works in any situation where you can use the classic controller. So if you can use the classic controller to play Project M, this will work for you."}
{"product_id": "B00EOUL7T0", "context": "Will this work with Tritton Triggers?", "response": "The puck part fits the controller perfectly I had to buy a adapter from radio shack because the other end was too small for my turtle beach x32i believe they were"}
{"product_id": "B00DC7FWRE", "context": "Is it interactive, meaning can I play with others around the world?", "response": "No, it is only play with your friends."}
{"product_id": "B00CMSCWGS", "context": "does this work for windows 8?", "response": "Yes, it does. I also works on Windows 8.1"}
{"product_id": "B00005B8G3", "context": "Hi,  is their is a batteries charge include or only use a batteries.", "response": "Intec power station rechargeable battery pak for gameboy advance will give you a rechargeable battery compartment and a ac wall outlet adaptor to cannect it to for continous play. This was made for the gameboy advance, pick one up if you like."}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "I'm not sure about hulu, but it works great with netflix and Amazon prime"}
{"product_id": "B0017Q4DGI", "context": "What controllers do I need to have to play this game?", "response": "we did not buy special controllers-we use what we got with our Wii system."}
{"product_id": "B00CHGYUE2", "context": "How many hours is the campaign ? Is this game worth it if I have no intention of playing online ?", "response": "Eh... you could probably knock the campaign out in a day, but it was a very good one. If you have no interest in zombies I would suggest getting this game extremely cheap."}
{"product_id": "B0053BCML6", "context": "can you play this game on the old Nintendo DSi", "response": "Sadly no, you can however get a similar game called Animal Crossing: Wild World."}
{"product_id": "B00009VRG5", "context": "I see these I spy game for sale list \"Older Version\" what is the difference between the old and new version? Somelistings do not mention old or new...", "response": "I think it depends on which operating system you are using. We have the old versions and they still work on our recient up grade to Vista but there are some glitchs showing up that were never there when we were running Windows 98."}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "To cover the cameras.  Some people believe they could be spied on if you the unit powered in stand by mode."}
{"product_id": "B004SJFJUA", "context": "Does it come with back piece and charge base?", "response": "Yes, it comes with both."}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "FN + F6 to muteFN + F7 lowerFN + F8 higher"}
{"product_id": "B001BYMZ5W", "context": "is there a better gaming headphone than this? or this is top of the line?", "response": "I love my MMX300 everyone says that I'm clear and loud when I'm using them. The mic is really high end for a headset plus sound is amazing specially if you pair them with a ASUS PCI-Express x1 Sound Card XONAR ESSENCE STX/90-YAA0C0-0UAN00Z :D"}
{"product_id": "B005J37I4Y", "context": "Is there a mute button on this or do I have to use the one on my headphones?", "response": "This device only connects the Headphone to the Xbox controller through bluetooth. Most of TB's headsets have a mute button. Hope it helps."}
{"product_id": "B00BMFIXZG", "context": "i just got this for my windows 8 toshiba and it is lagging so bad that i cant even get through the tutorial. how can i fix it?", "response": "Make sure your computer meets the minimum requirements. Check to see if you're in power saving mode.  Turn off unnecessary programs using your ram. Turn down game graphics."}
{"product_id": "B0050SZBP6", "context": "Other than activation do I have to have internet?  I mean I don't want to go on line to play.  I prefer to just sit here and take my time doing a solo", "response": "You HAVE to have internet.  You can play solo, but other people will be there and, if offline, you cannot play."}
{"product_id": "B00006B84X", "context": "Does this have a twist access or not? On CH website, it says it has a three way axis, which makes me think it does, but some reviews say it doesn't.", "response": "no... it doesn't have a twist axis... the 3 axis are you normal 2 x and y and then there is a throttle axis along the left side"}
{"product_id": "B0094H8H78", "context": "Where do I find games to download onto the SD card?", "response": "It comes with games already programed inside. It has a lot of games. There is no SD card."}
{"product_id": "B009LGO88E", "context": "is it a real 3ds", "response": "This is not a 3ds, this is an extension for a 3ds XL"}
{"product_id": "B004SJFJUA", "context": "Does it come with back piece and charge base?", "response": "yup, it comes with both"}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "The Festival of Blood dlc was included as a download that goes along with the voucher. It didn't have it's own disc, which might be a downer since there are reviews that state their voucher code expired."}
{"product_id": "B00AAQRNQ8", "context": "Can you program one of the buttons (side button preferably) to drop the DPI to a specified level only while being held then back to normal on release?", "response": "Ok, good luck!  I also purchased a Steel Series mouse pad and the combo of the two has increased my gaming performance dramatically."}
{"product_id": "B00DC7G3Q8", "context": "can this be played on regular DS?", "response": "Yes, I believe so."}
{"product_id": "B003OZOAKY", "context": "Serial key not working ,", "response": "Can't help. the label that has the key is so faint it is blank. The whole thing is useless!!"}
{"product_id": "B00FWWY1V0", "context": "It is for xbox 360 rite", "response": "Yes. Xbox and ps3"}
{"product_id": "B00EOPT5ZS", "context": "can you use more than one stinkyboard on the same computer? y know. cuz i like have two feet last time i checked. wait. yup... two feet.", "response": "Hello Eric, You sure can use 2 Stinkyboards at the same time. You can actually use as many Stinkies as you have USB ports.  Each board can be given a unique name and programmed separately."}
{"product_id": "B00AXI9WFS", "context": "Do you need to have Kinect to play this?", "response": "Nope, you do not need Kinect, actually, the game does not utilize the Kinect at all, as far as I am concerned. No need for the Kinect!"}
{"product_id": "B0086UK7I6", "context": "Why is the white mouse $20 more than the black mouse?", "response": "Can't answer that for sure, but regarding sales, the black one is probably cheaper. The white one is not common, the black one sells better.You should check out other places to see what's the price difference."}
{"product_id": "B004RMK4P8", "context": "hello, the code they send me to my mail? live outside the US, but my account is USA", "response": "It works, I live outside USA and I purchase codes several times and it works. The only you need is a international visa/MasterCard card and an USA psn account."}
{"product_id": "B00A7VK16A", "context": "Does the ps4 fit in the case?", "response": "I have no clue the one Ibought was for my nephew and a xbox!"}
{"product_id": "B005764CWO", "context": "Hello, does this controller have sixaxis support?", "response": "I'm afraid it does not."}
{"product_id": "B0017Q4DGI", "context": "CAn you use this game on the wii u?", "response": "Not sure what is the wii u is"}
{"product_id": "B009AP23NI", "context": "I accidentally ordered this one... will this work alright with an NA console and how difficult is it to feel my way through syncing, since its in JPN?", "response": "Works the same as the U.S. version, except the manual is in Japanese (who needs that anyway?), it is a bit cheaper.  No problems synching to the console.  Your mistake just saved you some $ but I don't think there is anything else that you will sacrifice."}
{"product_id": "B008CP6Q6M", "context": "Hi,Is the \"Festival of blood\" included in this collection? as DVD not on a Voucher?ThanksNaren Turaka.", "response": "I purchased the game a month ago but it says the voucher expired over a year ago"}
{"product_id": "B009GWLSFY", "context": "There is no list of games in the product details. Can I get a list of the games included?", "response": "Im working now but first chance i will get back to you or bring the game up on google they may have the list of games on it there."}
{"product_id": "B00CPKUV98", "context": "is this the full game for this price seems to low of price?", "response": "Yes, it's the full game."}
{"product_id": "B00JM3R6M6", "context": "appropriate for 10 yr old girl?", "response": "From what I've seen so far in a month, yes. It's very G rated."}
{"product_id": "B00726ARTE", "context": "Does it work for ps3?", "response": "No they have 3.5 headjack plus they suck anyways and uncomfortable"}
{"product_id": "B0094H8H7I", "context": "Does it have Castlevania Bloodlines on it!", "response": "no. And even if it did, the game is considered unplayable in some stages due to the game's graphical processing which leads to graphical glitches."}
{"product_id": "B00DPQ6GPO", "context": "I am a black ops 2 player on ps3. I like using single shot guns, like the FAL, and pistols, like the five-seven. Is this a good controller for me?", "response": "Ya u should get its not bad really read the instructions and It can help you out. On snd/ search n destroy I turn on rapid fire and use the Five seven with tac knife it works great. It's awesome on mw2/3"}
{"product_id": "B003O6CB6S", "context": "will the game play on windows 8.1 64bit", "response": "I'm using windows 8.1 pro and the game performed very well no problems. I hope you enjoy the game as much as I did!!Hope this helps."}
{"product_id": "B002YVD3KM", "context": "Just received it.  Nestopia is recognizing it is plugged in, but there's no gaming response to any of the buttons.  What am I doing wrong?  Win7, hp", "response": "Sounds like you need to go in to the settings in nestopia and assign your buttons. It's not automatic."}
{"product_id": "B009NQPGOW", "context": "Is the game also in English?", "response": "No. System and game are Japanese. System can be set to English, game cannot."}
{"product_id": "B00005NIMA", "context": "This joystick is more \"precise\" than thrustmaster T16000 ? need to calibrate when connect ?", "response": "The thrustmaster t16000 is much more precise as it uses magnetic hall sensors.  These are not only more precise but more durable (hall sensors are used in commercial machinery)."}
{"product_id": "B002W8D0EQ", "context": "this gift card work on my PS4", "response": "I don't have a PS4 yet, but the credit is for the network account not an specific console so it should be perfectly usable through a PS4."}
{"product_id": "B00EH5V1IO", "context": "Do the headphones have to plug into a usb port? or can the also plug into an iPhone? ps i don't know why we are called disappointed on here!", "response": "Hi. The headphones are just for the computer for gaming and has two jacks, one for the headphones and one for the microphone. I am not sure on the phone plug. They do not have a USB port cable. I have never used it with my phone, so you may have to check the website for that."}
{"product_id": "B009NQPGOW", "context": "Hello, yes I would like to ask is this a PSP 1000? THANKS !!", "response": "No, it is a PSP 3000"}
{"product_id": "B0086UK7IQ", "context": "Did they iron out the firmware on this mouse, eliminating the weird motion skipping it suffered from?", "response": "I've had no issues with motion skipping since I've had it. I just made sure to download the latest drivers and firmware for the mouse after I plugged it in. I would easily recommend this mouse if that was something holding you back from buying it."}
{"product_id": "B009UCGVZC", "context": "Is this a Wii game", "response": "These are characters to use in the Skylanders giants game which you can buy for the wii, ds, and xbox 360."}
{"product_id": "B0091A3AHA", "context": "is a tv or what ever that screen is included", "response": "this is a portable HD tv it runs 1080i only runs devices with HDMI CABLE comes with small remote Intended for Game consoles like PS3 or PS4 and xbox 360 or xbox one it helped me be able to play my video games without taking over our main tv hope this helps"}
{"product_id": "B00E0H5J8M", "context": "Does the mouse make noise when clicking or is it silent?", "response": "Yes makes noise. What mouse doesn't?"}
{"product_id": "B002672Z80", "context": "is it user friendly?", "response": "Yes. Very much so."}
{"product_id": "B00EWEHI5K", "context": "If I remove the battery, and plug in the USB cable - will it work?", "response": "Yes, it still works"}
{"product_id": "B00H7KDNBO", "context": "What is the difference between instant access and PC?", "response": "They give you a code to immediately redeem on Origin. Then you can download and play."}
{"product_id": "B000WCCURW", "context": "Can you play this on Vista with 64 bit?", "response": "Yes. That is what I play it on. No problems except you have to put the Titan disc in to start game every time you play."}
{"product_id": "B00D9FQAM0", "context": "does this come with any cords", "response": "It comes with the basic cords. If you like games in HD you gotta buy your own"}
{"product_id": "B00BT71S4K", "context": "I have a Moto G. It's compatible? Does it have to be rooted?", "response": "Yes simply hold home,and x on the control pad. Once you have done that,the search light blinks,now turn on your booth,and it should automatically come on."}
{"product_id": "B001COU9I6", "context": "Does it play PS2 games?", "response": "No it does not. I found out the hard way. Don't buy it!!!"}
{"product_id": "B00EOPT5ZS", "context": "Does this work for regular computer/office uses? In other words, not for gaming but for ergonomics when using computer keyboard heavily?", "response": "Yes. You can key bind anything"}
{"product_id": "B00DC9SWWE", "context": "I love campaign modes on other first-person shooters and play offline quite a bit.  This a problem with this game? Description troubles me.", "response": "Definitely.  You cannot play offline and the campaigns are just multiplayer games with a set map progression.  Therefore if you are looking for a 'single player experience' this game does not have it."}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "Yes it does. I still play all my Ace Attorneys and Prof. Layton games fro the Nintendo DS. So getting the 3DS or 3DS XL would be the next step up if you own a Nintendo DS already"}
{"product_id": "B002I0H79C", "context": "Does this work in Colombia?", "response": "how am I supposed to know?never went to Colombia.I don't even play the game"}
{"product_id": "B00DJYK8XS", "context": "does is comes with a belt", "response": "Yes if you get it in new condition"}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "They just plug right into the system. There are no batteries."}
{"product_id": "B003ZSP0WW", "context": "Does it include receiver for PC?", "response": "Microsoft Xbox 360 Wireless Controller for Windows & Xbox 360 Console does but this one does not. It's only a few dollars more (at the time I'm posting) so probably worth just doing that."}
{"product_id": "B0072A4JVW", "context": "I heard about the damage that give the ps vita shoulder trigger. Is that true? I really want to buy this hand grip but the review left me uncertain?", "response": "I have been using mine for a while now and have 0 damage from it."}
{"product_id": "B009D3HSTG", "context": "I ordered two of these and they work great BUT the joysticks keeps coming off on BOTH. Any quick and easy solutions?", "response": "super glue comes in very handy for that. just apply a dab into the plastic part of the joystick and slip it back onto the metal part of the joystick. should hold just fine."}
{"product_id": "B00FB4BXGA", "context": "Does it have media keys? Like Volume control, FFW?", "response": "No, it does not have dedicated keys for what you ask. It has those functions under the F keys  which you need to press  together with the function key."}
{"product_id": "B0058FAEAS", "context": "Does it work on a MacBookPro?  I called Madcatz and they said NO. Do you need to use Parallels so Windows can be installed?", "response": "Sorry I don't know."}
{"product_id": "B000035Y6D", "context": "I WOULD LIKE TO KNOW THIS NITENDO COME WITH 2 Controllers ??", "response": "Hi Mr Reis.  It does not come with 2 controllers unless it specifies.  Your in luck though.  I can sell you a setup like that for a very affordable price.  Would you like me to help you out with that, sir? Thanks!"}
{"product_id": "B00EZAWV6W", "context": "So, is it possible to play against the computer only, or are you always playing against other people online? (I know nothing about shooter games)", "response": "Yes, but only in a mode called Garden Ops  ( you protect your garden from AI zombies) and you still need to be online. ( select private match/ invite only )"}
{"product_id": "B005M2KSLC", "context": "does it have a DPI switch up AND down???", "response": "It has one single button which cycles through the three dpi settings. So no it does not have up and down buttons."}
{"product_id": "B0050SZBP6", "context": "is this the physical game?  or just the serial... Standar Version", "response": "It's a game where you fight the enemies of the side your on along with many monsters."}
{"product_id": "B00F27JDY0", "context": "Please, what contents are bundled with this ps vita?", "response": "one micro usb cable, and the ac wall power brick. you should be able to charge this device with any normal android phone charger in the event that you lose these."}
{"product_id": "B00IVHQ0KI", "context": "Has anyone had any problems with the gas pedal? Ours is not responding. Any tips? I am about to return it. So frustrating.", "response": "Trying contacting he help number provided"}
{"product_id": "B00EZPCX1A", "context": "is the 2ds screen the same size as the 3ds xl", "response": "No its closer to the size of the standard 3ds."}
{"product_id": "B0058FAEAS", "context": "Is  this compatible with windows 8?", "response": "yes. Works very well."}
{"product_id": "B001ELWMHI", "context": "I need a new power brick for my original XBOX.  Does ANYONE know where I can buy one?  I've been looking for days.", "response": "Look up 12052 Recycled Entertainment in Amarillo Texas. They might have one."}
{"product_id": "B002YVD3KM", "context": "what are NES games?", "response": "If you have to ask, then you don't belong on this page. Goodbye."}
{"product_id": "B00JB4WHWU", "context": "Do you have to buy the discs to install in order to play online? Or do you just buy the subscription and play?", "response": "You don't have to buy the discs, you can download it online. You do have to pay an initial cost, but when you do, it comes with 30 days play time included. Afyerwards you just pay the sub."}
{"product_id": "B00EZKNT5O", "context": "does it come with a cord", "response": "I think so but I bought it as a gift and had it sent direct to my grandson. But from the other posts it does come with the cord attached."}
{"product_id": "B0000512IE", "context": "Can I use these with Window 8/8.1?", "response": "Sure can. My Windows 8.1 machine automatically detected the appropriate drivers and installed them for me."}
{"product_id": "B009AP23NI", "context": "Is this compatible with Wii games played on WiiU?", "response": "Unfortunely, it's not possible use the Pro Controller for Wii games."}
{"product_id": "B00F27JDY0", "context": "Can it Play North American game cartridges?", "response": "Yes it can play any game from any region."}
{"product_id": "B00BGA9V2Q", "context": "does this version include the crusader class", "response": "No, that is in the expansion"}
{"product_id": "B000PD0HQE", "context": "Are you able to watch Netflix, Hulu, etc. on this console?", "response": "hi yes im able towatch  netflix i imagine hulu too but i dont have hulu but i do watch netflix though..hope this helps..tammy guskey"}
{"product_id": "B00CERXJNW", "context": "Can you record text macros on the 'G\" keys?", "response": "Yes you can; the macro software available from the Corsair website - http://www.corsair.com/en-us/support/downloads - includes a .pdf manual which shows how to program and edit macros, both on the hardware and software sides."}
{"product_id": "B0089OBLDO", "context": "I have a PS3 arcade stick which is getting detected in Win 8.1 64 bit, but the buttons aren't working due to nodrivers. Will this adapter work for me?", "response": "I use that Adapter mainly for PS2 controllers in Windows 7.  It might help you, but I would first try Motion in Joy and/or SCP DS3"}
{"product_id": "B00EZPCX1A", "context": "is the 2ds screen the same size as the 3ds xl", "response": "a \"red\" 2ds screen is the same size as a DSa \"Blue\" 2ds is an XL screen and worth the extra $"}
{"product_id": "B002TLTBN0", "context": "Do all wii games compatible whit this controller are also compatible whit the game cube controllers?", "response": "Only Wii games r compatible with the Wii Classic Controller, unless the game itself has a label saying it is compatible..."}
{"product_id": "B00IYWV5HS", "context": "I am temporarily living in Europe. If I buy the US version, can I download and play on US servers from Europe?", "response": "In the beta version that I played a few weeks ago, yes You were able to but whether they will keep this for the release version I'm not sure."}
{"product_id": "B009LGO88E", "context": "good I want to know because it says console not included in case it is not a nintendo 3ds xl ??", "response": "Yes this is for the Nintendo 3DS XL. \"LL\" is in Japanese for \"XL\" in English."}
{"product_id": "B008YA9BVC", "context": "What size jack does it have? I've tried every headset in the store with a 3.5mm jack and it doesn't fit my tablet or Nintendo 3ds xl.", "response": "It's a 1/8\" (3.5mm) stereo plug with mic"}
{"product_id": "B00F2ENJY8", "context": "can you play any WII game on this or just what comes with it", "response": "Yes, there old games play on thus as well it doesn't connect to the Internet,  which I was fine with that."}
{"product_id": "B005LUUWL6", "context": "does this work for 3ds xl for cheat code?", "response": "It works in the 3ds XL but only with non 3ds games"}
{"product_id": "B00CD1FC6G", "context": "Does this board still have the LED Issues? (Them dying off after a month or two)", "response": "I just returned my keyboard, less than 4 hours after installing, the left \"ALT\" key became intermittent. Corsair still has a big problem with their backlighting."}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "ah great! thanks for the info"}
{"product_id": "B00BS520SG", "context": "If I buy multiple adapters and plug them all into Wii motes, can me and some friends play brawl simultaneously at the same time?", "response": "Possibly. I only had one but you should be able to"}
{"product_id": "B00ERDGMT4", "context": "Is this the unupdated version of Borderlands 2, meaning no bug fixes/patch updates?  Will I need an internet connection to patch the game if so?", "response": "I have not experienced any bugs and I don't have internet at my house so I wouldn't say that you need internet to fix it but to be honest it could be the bugged version?"}
{"product_id": "B00B1N07QM", "context": "Is this the stealth version? If not, are you going to be offering the stealth version on Amazon?", "response": "This is not the stealth version , but there is little difference between the two"}
{"product_id": "B00ARD5410", "context": "Is it compatible with windows 8?", "response": "Yes it is. Head to corsairs website for more information."}
{"product_id": "B00J128FPA", "context": "If I order this on the PS4, can it be played across platforms online or at least with the PS3 version online; or only with other PS4 owners?", "response": "I know you can play it on the psvita with the ps4 copy an if u had the ps3 one you can transfer the data but I don't know if the other platform servers are linked."}
{"product_id": "B00009ECGK", "context": "Is Warcraft 3 and the expansion still alive and well online?", "response": "Its not as big as it once was but, there is still a lot of people who play this game."}
{"product_id": "B005FMLZQQ", "context": "anyone happen to know if this remote works with windows media center?", "response": "Yes.  It works.  I haven't tried to see how much of it works but I've used it on my Intel NUC before"}
{"product_id": "B00ENFVS5Y", "context": "I recently purchased and returned the TX 458, Just wondering if I should give it another chance?", "response": "I would not get it until it is proven to be more reliable.  If you do not mind dealing with repair once in awhile, then go for it."}
{"product_id": "B00CMSCTA2", "context": "can you download it on two seperate computers and play each other with only one purchase?", "response": "No, it only works on 1"}
{"product_id": "B00H1FCUBE", "context": "Does anyone else feel like the left driver is noticeably louder than the right?", "response": "I have been using them with both the wire but mostly wireless on a daily basis and I haven't noticed it. I just switched ears to see if its me and it sounds the same to me. Maybe you might have a defect."}
