{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "It's not single player, its a multiplayer-campaign something that could've been executed much better."}
{"product_id": "B00C2B355W", "context": "Does this headset work Wirelessly with the xbox one is my question.", "response": "From what i can tell it will work with xbox one. I found this video on youtube explaining how to do it. You seem to need an attachment to get voice chat but the headset will get sound by plugging in the optical to the xbox here is the link. https://www.youtube.com/watch?v=j8uoAkm9u8g"}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "I believe it does.  I actually bought it for my husband to use with his iphone but it should be compatible with any phone that has bluetooth capabilities."}
{"product_id": "B001DPZE84", "context": "Will this run okay on Windows 7 with a 32 bit system?", "response": "It will run but I would lower your graphics all the way down to low you might still get lag but it will still run"}
{"product_id": "B009CL6LA6", "context": "Can this connect directly to an iPhone wirelessly, or is the receiver needed?", "response": "You need the receiver to be able to use it."}
{"product_id": "B008U5ZNIG", "context": "Since it has has individual back light can you customize them individually by color or intensity or does the whole keyboard need to be one color?", "response": "I know it is 2015, but I am posting this so that others know. In 2014 Razer released their Chroma line of products that DO allow you to change the colors quite a bit. Go here to take a look: http://www.razerzone.com/store/razer-blackwidow-chroma-stealth"}
{"product_id": "B00D84DRNC", "context": "How would this fit a normal 3DS? The original, non-XL one. Will it rattle around inside this case?", "response": "It wouldn't rattle around at all in the back part that's a bit snug. There will be room but certainly not dangerous or excessive."}
{"product_id": "B00CMC6HCY", "context": "Is this game easy enough to pick up and play? My son is 6, loves WWE, but I'm not sure if this is too advanced for him.", "response": "Yes it's fairly simple, and there difficulty levels you can adjust as well"}
{"product_id": "B002JVX5V4", "context": "Does this work with Windows 8? We have a not-so powerful desktop running on Windows 8 and have concerns about it working. Any advice?", "response": "Yes, I am using Windows 8."}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "No it will not. That is exactly where i tried to use it. I was using my macbook pro"}
{"product_id": "B00D9EPI38", "context": "So, DOES it have hdmi output? (The Xbod itself is not a monitor so I can't \"watch movies right on it.\" I still have to connect to a screen)", "response": "Must connect to tv"}
{"product_id": "B005OSFUZI", "context": "These cables are 29$ list direct from ubisoft.  Why are they so expensive on amazon, especially if they break so easily?", "response": "Supply and demand, really... IWD"}
{"product_id": "B000ZBZK7C", "context": "which video poker games this Cd has?", "response": "CD has Jacks or Better, Bonus Poker, Double Bonus Poker , Double Double Bonus Poker , Triple Bonus Poker and maybe two others.  I can't remember all.  But a very good CD with tutorial etc."}
{"product_id": "B009RHEBWA", "context": "Does this version include any free files? Can that info be added to the description?", "response": "Has 5 free Federal, no free State files. Can print and mail as many as you like. Russ O."}
{"product_id": "B004RMK4P8", "context": "What do I do if I'm buying the playstation card for someone do you give me a code to give them..I'm older and don't know anything about this.", "response": "Yes, they will give you a code so that you can redeem it for credit that can be used in the PSN store. But these codes only work for a USA PSN account."}
{"product_id": "B00G0OYHCW", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "This bundle has the original GamePad: Model No. WUP-010(USA) and original battery WUP-012...It takes 2.5 hours to charge. Battery life is 3-5 hours. Sorry."}
{"product_id": "B00F27JE1C", "context": "What does this come with?", "response": "Just the system and power cord. I like mine very much!"}
{"product_id": "B00JC9SWSC", "context": "Is the included controller wired or wireless?", "response": "Wireless. Playstation doesn't make wired controllers for the ps3 or ps4.They are blutooth so they have far better range than other console controllers."}
{"product_id": "B00006C2HA", "context": "Has anyone tried this game on Win 7 op system ?", "response": "my old PC and my now newly-built one both have Windows-7 installed, and \"Doom 3\" runs perfectly fine.  Oh, and I'd stick with the 2004-05 versions of this and \"Resurrection of Evil\", and not get the BFG Edition (as they nerfed the hell out of that one)"}
{"product_id": "B00BQZ5EWW", "context": "how do i patch the pc version?", "response": "If you have the game on steam it does automatically"}
{"product_id": "B0050SYX8W", "context": "Can you jump into Halo 4 not having played the other games?", "response": "Yes I'm addicted :)"}
{"product_id": "B0042J7I3C", "context": "Does it hook into the controller or the Xbox?", "response": "hooks right into the controller"}
{"product_id": "B005OSFUZI", "context": "Can this cable be used for software other then Rocksmith/Rocksmith 2014? (like garage band or some other sound recording software)", "response": "Windows sees it as a USB microphone and no drivers were needed. So basically you can use you computer as an amp. Or... you can even plug the guitar and record it using any windows audio recording program. Or... you can plug in a regular mic in at the same time and record yourself singing and playing the guitar."}
{"product_id": "B00EIM3BV6", "context": "For use with Xbox One, how do you connect the 2.5mm chat cable from the new xbox headset adapter? Do you need to run the 2.5mm cable to the mix amp?", "response": "No, the chat cable runs directly into the headset from the controller."}
{"product_id": "B002RYLG4Q", "context": "I heard if you played the original NES this system has a slight delay compared to it, have you noticed this delay (if any) and if so is it noticeable?", "response": "I have not noticed a delay. The controllers that come with this system are not very good, I bought original Nintendo controller to go with this system. It seems to work fine."}
{"product_id": "B00A878J5I", "context": "I am unable to find any replacement batteries for this kit,  Does any one know of another battery type/brand that will charge with this charger?", "response": "seems unlikely, have you emailed energizer?"}
{"product_id": "B003VANOFY", "context": "Can this headset be used while charging?", "response": "Absolutely! And fully charged it lasts for days!"}
{"product_id": "B0050SZ0SY", "context": "Do you need steam to play?", "response": "It actually uses Origin instead of Steam. The Origin client and an origin account are required to play though."}
{"product_id": "B0016897GS", "context": "Can I use this to connect my smart tv to my computer modem? Is this the correct cable? Thanks", "response": "I use it to connect my computer to the router. As long as your smart TV accepts ethernet cords you're good to go."}
{"product_id": "B0054JGGGY", "context": "how long is the battery life?", "response": "it is rechargeable.  i don't know for sure how long it lasts because i just plug it in each night.  i use it at my office at work."}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Hyrule Warriors?", "response": "I have not played that specifically bit can tell you it works perfectly with other Wii U games i own (Tekken Tag, Mario Kart 8, Super Mario 3D World, Donkey Kong:TF). I can't imagine it wouldn't work with Hyrule Warriors unless there is some kind of necessity that you need the game pad for."}
{"product_id": "B0032MK90E", "context": "Will it run on Windows 7?", "response": "I have JQS on my computer and they work just great. Hope they do the same for you."}
{"product_id": "B0061PAZUS", "context": "does this work in Xbox 360 Kinect NTSC-J model?", "response": "No It does not according to some of the forums on the Internet. However I don't know personally. Can you rent the game from a local video store before buying it? The game is so much fun!!!!!"}
{"product_id": "B00HKCKA0G", "context": "Is this a wireless headset? Meaning, is the cord going from the PS4, across the floor to my controller? My cat thinks the cords are a toy.", "response": "The cord can be plugged into your controller.  So, yes, there's a cord.  But, no, it shouldn't be going across your floor because it goes from your headphones straight to your controller; not the PS4 unit."}
{"product_id": "B0076DO5A0", "context": "what are the system requirments on this game?", "response": "From the website: http://us-ci-games.gamesplanet.com/shop/sniper-ghost-warrior-2/OS : Windows XP, Vista or Windows 7, with the latest Service PackCPU: Intel Core 2 Duo at 2Ghz, or AMD Athlon 64 x2 2Ghz, or betterRAM: 2GBVideo Card: NVidia 8800GT with 512MB RAM or betterHDD: 9GBDirectX: 9.0c and a DirectX Compatible Sound Card"}
{"product_id": "B00CMQTVK0", "context": "in the details it said the it doesn't come with the converter do I need that to play to console and what is the converter", "response": "I don't know what convertor it is talking about. Mine doesn't have one unless it's talking about the power block that is inline of the power cord."}
{"product_id": "B008M4BNQG", "context": "My PS3 is connected to my stereo by HDMI so how do I hook the headset up?  What do I do with the red/white connections, once the usb is plugged in?", "response": "Go to settings and set up the head set. And hook the red and white needs to be hooked the tv. Hope this helps"}
{"product_id": "B00BCEK2LU", "context": "How long does the back light stay on? Can you customize it?", "response": "Back light is toggled on/off with a button on the keyboard. As far as I know, there is no way to time it. You can customize the colors and switch them with the profile and macro keys."}
{"product_id": "B00CMSCWGS", "context": "I'm wondering if the instructions are decent.  I'd probably be using an Xbox controller.", "response": "M using the windows compatible version of XBOX 360 controller... it works flawlessly!!!"}
{"product_id": "B00DBCAT3W", "context": "Is Fable Anniversary like the original Fable or is it more like Fable: The Lost Chapters?", "response": "It is exactly the original Fable, just basically remastered with better graphics"}
{"product_id": "B001AI7CF2", "context": "Is there any lag input?", "response": "We have always used extensions otherwise we would be too close to the TV. There does not seem to be any time lag that we have noticed."}
{"product_id": "B006PP404Q", "context": "does this fit the ps vita 2001?", "response": "The ps vita wasn't actually released until 2012. If it's a 2012 and later ps vita, this screen protector will fit it. Otherwise, for psp's or other Playstation handheld devices it will depend and this screen protector may not fit."}
{"product_id": "B00D78Q4UM", "context": "I am hoping to map additional language keys to the G-keys, is this possible? (i.e. I need some additional keys to type in German, like ä, etc.)", "response": "you should be able to do this with this keyboard..."}
{"product_id": "B00FM5IY0Q", "context": "Is this a FPS game?", "response": "No this is a 3rd person. I suggest looking up videos before buying. :)"}
{"product_id": "B0053B5RGI", "context": "Pokémon rookie here. If it get one son X and one Y, can they battle each other?", "response": "Yes, as long as both of them have their own 3DS to play it on, they can battle or trade with each other all they want."}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "Yes, I think you can from what I heard."}
{"product_id": "B003JVF728", "context": "It may be a stupid question, but if I buy the disc version does it still use Steam?", "response": "Yes. COD is managed by Steam."}
{"product_id": "B00D3TRMD8", "context": "Is this the Steam version or not?  Thanks!", "response": "Yes, this version works with Steam. Although right now Don't Starve is on sale on the steam store, this purchase was definitely one I was glad to have made!"}
{"product_id": "B002TLTBN0", "context": "Can you use this controller to play GameCube games on the Wii? Something like Soul Calibur 2?", "response": "Nope, only Wii and virtual console."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "Absolutely not, this is a USB controller for a computer."}
{"product_id": "B0089NVTDM", "context": "Will it work on a Mac?", "response": "Hey man, I was Worried bout the same thing, happy to say that it does. You can't use the windows drivers or whatevs, but it shows up in the dolphin controller set up, and you just have to manually set it up, which is easy"}
{"product_id": "B00EZPCWWA", "context": "Can photos taken with the 2DS be downloaded to a computer?", "response": "Yes, as long as you either have a spot to insert an SD card or you own an SD card reader you should be able to."}
{"product_id": "B00GG4BBUM", "context": "Does the PS4 version support Playstation Move and custom sounds of the show?", "response": "I am curious to know the answer too!  Using the Playstation Move for HR Derby was one of my favorite party games last year when friends came over.  does anyone know if the PS4 version supports it?"}
{"product_id": "B00DC9SWWE", "context": "My son is about to be 11 and is dying for this game.  I've never bought him an M rated game.  How is the violence and language in this game?", "response": "I do not recall there being excessive adult language (if any). The game is a first person shooter so the characters are soldiers gun fighting, but the violence is not over the top or gorey."}
{"product_id": "B00EOI2MRS", "context": "Does this controller come with the cord? I understand from the description it is used only with a wire, just asking if the cable is included.", "response": "It is a wired controller (Not like a USB cord that is used to charge cordless controllers). It is a good controller. I have smaller hands and with the turbo function it works good with fighting games. So again, it is a wired controller that is connected and it is not a wireless controller."}
{"product_id": "B00FEDP968", "context": "can you hear your own voice in the headset while chatting?", "response": "this headset don't have the ability that you ask. but you can do it with some mixing software. so, just find way in Google, not here."}
{"product_id": "B00JB4WHWU", "context": "why do they ship you a physical time card and not just email you the code?", "response": "I don't really know, they have the physical time cards for sale in my local Walmart though. It sucks you have to wait for the card to ship before you can play. I didn't really like Elder Scrolls Online though, it feels too much like a standard MMO, and not at all like a The Elder Scrolls game..."}
{"product_id": "B003O6JLZ2", "context": "How many controllers come with this listing and are ALL cables included?", "response": "I believe you receive one controller and all the cables needed to play."}
{"product_id": "B002RYLG4Q", "context": "Can this play and use every game and controller made for the original nes?", "response": "I am not sure. The games I have are  Mario Bros and Super Mario Bros 2, both cartridges are the original ones for the original NES and they work just fine.  I use the remotes that came with the Retro system."}
{"product_id": "B00FYAQUPU", "context": "Can you buy the dark characters seperate from the starter pack? I have the Swap Force game and portal but want to buy the dark characters?", "response": "Yes however it may be cheaper to get a used set from starter pack rather than buy them a-la-carte!"}
{"product_id": "B003OZOAKY", "context": "Will Rome Gold Edition work with Windows 8 ?", "response": "I have played the game on both Windows 7 and Windows 8 and it works fine on both.  I have not had any issues since switching to Windows 8."}
{"product_id": "B004CFASL0", "context": "Do these games play on Windows 7? It says for XP", "response": "I only played these games on Windows XP and never played them on Windows 7. If it says for XP only, I don't think it will play on 7. Sorry, I can't be more helpful."}
{"product_id": "B009CEM332", "context": "Is this playable with just a keyboard?", "response": "Yes, however if you played the originals on console, a controller would be much more comfortable."}
{"product_id": "B0083H4NG4", "context": "I don't have a disk drive in my computer (iMac) would windows 7 find the drivers automatically? I already bought, it's in the mail.", "response": "You can install the updated drivers on their website --> http://perixx.com/en/driver.html just scroll down to the link where it says \"MX-2000 II Programmable Software\" and you are good to go. To tell you the truth the drivers on the disk are almost always outdated."}
{"product_id": "B003VUO6LU", "context": "I wana play ps1 and 2 games can i", "response": "If you download them from the playstation store, then yes, i believe so. The store may not carry the games you want, however. Otherwise, i do not believe the system is backwards compatible. Therefore it cant play the disks."}
{"product_id": "B006YDPU48", "context": "Do I need to play the first one to understand whats going on?", "response": "If you play DS1 first, youre going to end up being disappointed with DS2"}
{"product_id": "B0053B66KE", "context": "Do they ship the correct version based on ur region? Eg PAL to NZ and Europe, Or do they only ship American NTSC version?", "response": "No, it's not Amazons job to do this. Amazon.com are an American company that stocks NTSC products. As the 3DS is region locked you will need a compatible 3DS/2DS to play. For example this game wouldn't work on a European, New Zealand, Australian 2DS/3DS handhelds because of the Region lock."}
{"product_id": "B002P35JMO", "context": "Someone please tell me where the fat end of this thing plugs in!  PLEASE HELP!", "response": "It will not work on an XBOX 360 E model. Those are the new model since Dec 2013. You have to use a headphone jack (1/8\" plug) which connects in the back next to the HDMI port."}
{"product_id": "B00FNNQREC", "context": "How do you get the chicken eggs? I am trying to help my young son and I can't figure out how to get the eggs or how to pick up the hay to feed the cow", "response": "Just walk over top of them"}
{"product_id": "B00EZKNT18", "context": "does it come in offical packaging?", "response": "No, but it comes in a very professional box beside the control is awesome when u turn the light off, vibration is great, a really good investment I will buy a blue one as I got a green one ;)"}
{"product_id": "B001H4NMNA", "context": "Should I unplug this after my controllers are fully charged or just let the green light sit?I don't use my ps3 often so it kinda seems like a waist?", "response": "I leave mine plugged in all the time and haven't seen and negative effects."}
{"product_id": "B00D96BORK", "context": "Can I listen to in-game sound and my mp3 player simultaneously? Like, if I turn off the in game music and leave on in game sfx and then play my mp3?", "response": "Yes indeed. The inline amp has an input where you can connect any source using a 3.5mm jack. So you can plug in your phone, tablet, or anything else you just need the right cable. Fortunately it also comes with a 3.5mm mobile adapter cord and a 3.5mm to RCA plug adapter cord."}
{"product_id": "B00E6OLJ88", "context": "does it have rapid fire for the ballista and dsr 50 from black ops 2", "response": "Those are bolt action snipers. So it wouldn't work at all. And mods don't work well on BO2 anyways"}
{"product_id": "B002ZS6Y64", "context": "Does this have a cord that will plug into an xbox 360 controller", "response": "I hace the tritton 7.1 and it does have everything you need for the 360"}
{"product_id": "B00286BZ4Y", "context": "Do you have to type in your answers?", "response": "No.  It is multiple choice."}
{"product_id": "B00CX8VY4S", "context": "This is my first time pre-ordering online. I live in Hawaii, will I get my game on the exact date of release or will you ship it on that date?", "response": "Being in Hawaii I do not think you will get it on exact day of release. If you look it only talked about continental US for day of release arrival. You might want to ask Amazon directly because you might be disappointed."}
{"product_id": "B00H45K6KS", "context": "Do I have to play any other Atelier games to understand this one?", "response": "No it's the easiest one to get into."}
{"product_id": "B004N3FGHC", "context": "is this a first party Nintendo remote?", "response": "No this is an aftermarket unit.  It vibrates a lot and does not work well with the rechargeable battery"}
{"product_id": "B002CZ7P04", "context": "I bought wii in 2012 . can I use it with Walk it Out. What other efforts it need to implement it ?", "response": "You should be able to use it. I just put the cd in and followed the instructions. It is a good program and fun."}
{"product_id": "B00GD962OA", "context": "how many GB IT HAS??", "response": "8 GB but is easily expandable with either an external hard drive or an expansion SD card."}
{"product_id": "B00GZ1H07Y", "context": "How good is the flipper action w/ PS4 controller? Does anyone have experience using on other platforms & if so would you say PS4 has the best feel?", "response": "Great action the only thing really missing is the feel of the ball against the flipper. This is a pretty cool game."}
{"product_id": "B00EF1OGOG", "context": "I don't want to charge off a PC, can I charge the Anker off the AC wall charger & cable that came with the iPhone or do I need an extra cable?", "response": "You cannot charge this with the thunderbolt cable that came with your iphone. You need a mirco usb cable to charge this battery pack. But it comes with it, so you should be fine. You can plug that usb cable into the power brick that came with your Iphone instead of your laptop, if you like"}
{"product_id": "B000IBQLOU", "context": "How does this stand up to jumping? I tend to be a jumper when I'm playing, and i was wondering if this is going to slip?", "response": "If it's on carpet you'll be just fine! Jumping is part of DDR, and spinning, jumping while you spin... Never had the mat fly out from under me! The cheap mats with no foam will do that. These mats (I've owned five now, different platforms) are fantastic"}
{"product_id": "B0098F1Y3K", "context": "Is there some way to alter the appearance of the devilish talking head & stop the remarks about my scores?", "response": "As to my knowledge there isn't any way for you to change that. I know it can be annoying but, that's just how the game is."}
{"product_id": "B0053BCML6", "context": "what ages is it for?", "response": "I haven't been playing for long but I reckon its fine for all ages :) hope this helps"}
{"product_id": "B001FBHT34", "context": "Does it work with ps3", "response": "If you're looking for a wireless set, no - I don't think it has the right connections for that either."}
{"product_id": "B00E3667XQ", "context": "Which are the best native games available for the Shield?", "response": "Dead trigger 2, halflife 2, portal, clarc"}
{"product_id": "B00ATF5YYI", "context": "will this play on win8", "response": "It works on my Windows 7, so I think it should"}
{"product_id": "B009D3HSTG", "context": "Can this be used in place of mouse for regular computer use like browsing the internet?", "response": "No, it cannot. Its primary and sole function is to emulate that of a Nintendo 64 Game-pad. I Hope this helps."}
{"product_id": "B00EEMLRTS", "context": "is this worth the price", "response": "Now it does with this new price tag, the pro camera alone, the game is so-so"}
{"product_id": "B0050SXFKE", "context": "This game has subtitles in Spanish?", "response": "Unfortunately, it doesn't...just English as default language."}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "It is made in China, It comes with de charger and stylus."}
{"product_id": "B009IR1SR0", "context": "If I download this game on my current computer and eventually upgrade to a new pc, will I be able to transfer the game ?", "response": "To download the game on your computer you need to download origin (kinda like steam) and then create an account that you can link to the games by using the activation code. From then on, anybody with your origin account on their computer can download any games from your library."}
{"product_id": "B00GJSUUC0", "context": "Is Phantom Pain included? What does unlock bonus MGS V Phantom Pain with Ground Zeroes means?", "response": "Phantom Pain is not included.  That game comes out at the end of the year.  Don't know the answer to the second question.  All I know is that there's unlockables when you have both games."}
{"product_id": "B005J37I4Y", "context": "I have Beats Wireless bluetooth headphones.  With this device, will they output in-game sound and also allow me to chat? The Beats have a microphone.", "response": "I believe you will be able to hear in game sound - but not chat"}
{"product_id": "B005QUQP80", "context": "Which keys are mechanical and which aren't", "response": "Only the main keys, arrows, and numpad. Esc, f keys, home group, and print screen ones are not."}
{"product_id": "B002I0K3CK", "context": "My kids love Super Mario 3D World, is this as good?", "response": "In my opinion yes, but this is not 3d it is a 2d side scroller like new super bros which are updates of super Mario world on the snes. 3d Mario is more like galaxy. If you like awesome 2d platformers then yes it is just as fun if your not into 2d games then no."}
{"product_id": "B000J18SR2", "context": "can it run on windows 7 or 8.1", "response": "yes i use it on windows 8.1"}
{"product_id": "B009IR1SR0", "context": "will it work for mac?", "response": "This is a code for EA Origins to download the games.  Origin only shows it for Windows PC.  Sorry"}
{"product_id": "B00BGAA0SU", "context": "Tomb raider, this or watch dogs", "response": "all three games in my opinion is worth the buy in a big way. i really enjoyed all of them. all 3 has great action, storyline, drama, and graphics. hardest question will be is which to get first. but like i said all 3 is worth being in your game library."}
{"product_id": "B00005B8G1", "context": "what is the difference between  the gba and the gba sp ?", "response": "GBA SP flips open and shut and has a charger cable, regular GBA runs on AA batteries and has no hinge"}
{"product_id": "B00BQZ5EWW", "context": "If I don't have a disc drive and I get the disc version, does it come with a steam activation code in the case so I don't need to use the disc?", "response": "u can down load it on line, but be very careful, it could be tricky, also it still takes days to download rome2 and i mean days"}
{"product_id": "B00GANWVJE", "context": "Does this game work with Nintendo DS?  Or is 3DS required??? buying for gift, not familiar with game systems . . .", "response": "i believe its 3DS required"}
{"product_id": "B005MQ3BSK", "context": "Does this include the Deep Fritz multiprocessor engine on it as well?", "response": "No it does not see Mark coments. You can try Chess Base Store. Hope this helps"}
{"product_id": "B003YC4D9A", "context": "We have a Wii system and got a Zelda game via the wii shop, will this remote work with this Nintendo64 game? Our currentWii remotes aren't compatible.", "response": "probably not because this controller is for use with the regular wii controller it actually plugs into the wii controller.I wouldnt waste money on this controller both of ours have broke with very little use"}
{"product_id": "B00BQMGW4Y", "context": "Is this item only for the original Xbox or is it compatible with the Xbox 360?", "response": "Only the original xbox"}
{"product_id": "B00BMFIXT2", "context": "Is there a 2 player co-op? I want to play split screen, is that possible? thanks", "response": "There is a multi-player option, yet I have not tried it yet."}
{"product_id": "B006IOAHPK", "context": "Can kids play this game or not ?", "response": "Depends on how much you let your kids see.  The game includes cartoon nudity, sex, cursing, adult themes."}
{"product_id": "B00FLLFJE0", "context": "What's better, Rayovac AA rechargeable batteries or this nyko charge base for the xbox one. Which one will last longer?", "response": "This is better as you dont have to worry about batteries dying out on you.  My kids love it!  Thanks"}
{"product_id": "B00JFCA6V2", "context": "What does it mean when this ps vita has been 'factory Recertified'?  Why does it cost less than the others?", "response": "There a difference between recertified and refurbished. Refurbed is sold as is usually, whereas recertified still carries a warranty. Both are used and/or fixed models, which is to the reason for the lower price."}
{"product_id": "B00IRHE892", "context": "Can you change the color of the lights?", "response": "The G502 Proteus core only has blue lightning, and sometimes green lighting on the dpi led only when during configuring mouse surfaces.  However, a refresh model this year called the G502 Proteus \"Spectrum\" has customizable RGB lighting."}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "Just enter the code in on your Xbox. It will add another year to your membership."}
{"product_id": "B002I0K3PM", "context": "Is the game worth the price?", "response": "I bought this game near the release date for full price. I don't regret paying what I did and now that it's much cheaper I wouldn't pass it up. :)"}
{"product_id": "B004HYK8Y8", "context": "Combat seems a bit slow, like old people fighting slow.", "response": "Depends on whats class you choose to be  Some times it is slow but when there are dozens of enemies or when a dragon comes or a troll things get a bit crazy"}
{"product_id": "B000B78F72", "context": "I'm looking for simple games such as Number 10, Coppermine, Buffalo Bill.Does this or any other software have these?", "response": "First two, no. Buffalo Bill, yes. Don't know about other software for those games."}
{"product_id": "B00FATRKLI", "context": "Can I watch amazon streaming videos with this xbox 360 holiday bundle?", "response": "The XBox 360 does have access to Amazon Instant Video if you have an XBox Live account and an Amazon Prime account, however it only lets you watch the free videos or ones you have purchased from the website (it does not have a storefront)."}
{"product_id": "B00B1N07QM", "context": "DOES A GAMING KEYPAD REPLACE A GAMING KEY BOARD?", "response": "Depends. If you don't have a lot of keys you need to push then yes a keypad can replace your full-size board. I'd still recommend getting a full board too though because you can't type on a keypad."}
{"product_id": "B00FJWNSWQ", "context": "what is the difference between the ultimate and standard edition", "response": "Ultimate edition has all the new characters and all alternative costumes already unlocked, plus the challenges are unlocked for the new characters. Standard edition doesn't have any of that unlocked."}
{"product_id": "B007TMFD7C", "context": "Does this work on mac'c OS Yosemite ? And is additional h/w required such as a joystick ?", "response": "I have not tried this on Yosemite yet. But i have had. No luck with this on the mac period to contact surport.with no luck. So I just gave up."}
{"product_id": "B00C2B2Y9A", "context": "How long does the battery last?", "response": "I just used mine for 6 straight hours, and 2 hours the day before, still going strong. I would estimate 10 hours full charge to dead."}
{"product_id": "B009ZDPYKO", "context": "Does he work with swap force?", "response": "Yes, we only have swap force. As I understand it, all past characters work with swap force game,  but the new swap force characters do not work with the old giants or spyro adventure games."}
{"product_id": "B00CX9L30W", "context": "Does this come with the game itself?Or do you have to purchase the game and the CE to get it's benefits?", "response": "The CE version has the extra perks, the regular FF14 game is just the game itself, no extra perks."}
{"product_id": "B009M72E5Q", "context": "We have a Wii that's at least 5 - 6 years old; it has RCA outputs. Does the current model of Wii have HDMI output?", "response": "No Wii model has HDMI output. The Wii U, the next generation console that is not a Wii, has HDMI."}
{"product_id": "B00D6PTMSW", "context": "Can I use the front USB ports for the cables?", "response": "Yes, I've had no problems with the front USB. Haven't tried rear."}
{"product_id": "B0086V5UF0", "context": "Do you have to buy another wii remote if you have another player?", "response": "If you want them to be able to interact with game, you do have to get another controller. But before I bought a second controller my siste would just follow along with the game.  I hope this helps"}
{"product_id": "B00503EAG2", "context": "Does this come with a new product key for activation on Steam? (Physical copy + Product key?)", "response": "Just a disk, haven't played it, wanted for Wii, got computer version, never tried it"}
{"product_id": "B001DNGCN2", "context": "it can help ps3 prevent to get YLOD on 60 GB?", "response": "From what I understand...yes. I got the YLOD and since got my PS3 fixed. I bought this to help exhaust the hot air that can potentially cause YLOD."}
{"product_id": "B004YC4NN0", "context": "hi this controller work with emulators run on a andriod tablet", "response": "Yes, it did for me on my Asus tf300t. I love how tiny it is."}
{"product_id": "B0088MVODO", "context": "I would like to know if there is just 1 CD or if the quantity is different, just because I heard there is a version of 3 CD's", "response": "that version is the japanese version, the only difference that the USA version comes with the main game RE6, the rest are digital copies of re1 to re5"}
{"product_id": "B00BGA9YZK", "context": "is this game couch co op?", "response": "Ugh. No. It's such a shame.."}
{"product_id": "B00ACMM9BO", "context": "So this works for call of duty black ops 2?", "response": "No it works for bo2 and bo1 and IG should work for mw2 and mw3. Hope this helps"}
{"product_id": "B00H45K6KS", "context": "Is the language uesd in the game Japnese or English? I am looking for the Japanese version.", "response": "No it's in English. There is English and Japanese voice overs though. It can be changed on the game options."}
{"product_id": "B00EV7AYAO", "context": "Is there really a difference between a gaming keyboard and a regular keyboard?", "response": "Gaming keyboards have faster reaction times"}
{"product_id": "B00IRHE892", "context": "Is this really a worthy successor to the G500?", "response": "IMHO yes, it's miles better."}
{"product_id": "B007A7UJ4S", "context": "This game is Spanish or subtitled in Spanish?", "response": "I don't think so. My grandson speaks English only and he has been playing it."}
{"product_id": "B001E27DLM", "context": "Will this US version of the game work on a European version of the 3DS?", "response": "It will for sure, but for future reference, it will not be compatable with 3ds or dsi enhancement games from other regions. Fortunately though, any plain ds game is fair game."}
{"product_id": "B00C2B2Y9A", "context": "What's the durability? I am very careful with my electronics. How long do these last?", "response": "Mine have taken a couple falls off the desk and have held up just fine."}
{"product_id": "B005YR1VP2", "context": "Is this XBox 360 compatible with XBox games?", "response": "Most games, yes, but the are a good amount that are either non functional, or not fully functional."}
{"product_id": "B00JFCA6V2", "context": "do the ps vita come with ar cards", "response": "No, you'll have to buy them yourself."}
{"product_id": "B00EIM3BV6", "context": "Is there anything else I need to buy to go with these for them to work on the ps4?", "response": "no u do not they work  perfect just as they are"}
{"product_id": "B00009ECGK", "context": "can I play this on windows 8", "response": "Yes ... I've been playing it in Windows 8 & 8.1 from a long time now ..."}
{"product_id": "B004GZ2RCY", "context": "Which mouse is it? There are 2 different pictures of the mouse.", "response": "Same Mouse just different angles. I recommend it for wow since it has a lot of buttons"}
{"product_id": "B000HZFCT2", "context": "does it work with steam?", "response": "I have several games from steam and yes if the game supports a controller then yes it does."}
{"product_id": "B0095D1CM8", "context": "Is the red aiming button on the left side bothersome to some users?", "response": "no don't even notice"}
{"product_id": "B00DH1KRQQ", "context": "does this controller work with Steam games?", "response": "You might have to configure it to work for games from Steam. I use x260ce app to configure. As 'ian' has mentioned, its a hit or miss. I would recommend xbox controller as well."}
{"product_id": "B00CRL9TU2", "context": "can it be played in offline single player mode??", "response": "Yes,but you'll have more options and races when playing online."}
{"product_id": "B009Q8PP16", "context": "does this controller use sync to change mode or is there a separate button thanks", "response": "No, just the sync button to switch, so there is so extra button. You just hit the sync button to move up one mod and you can hold the right trigger and hit the sync button to return to the previous mod."}
{"product_id": "B00JC9SWSC", "context": "Is the included controller wired or wireless?", "response": "The one I just purchased a month ago was wired."}
{"product_id": "B000056SPM", "context": "does it works with car simulation game?", "response": "I think it should but ive seen a weeled  type somewhere on line"}
{"product_id": "B00H4BBVZQ", "context": "Amazon states that the DLC is \"included\".  Is all of the content on a disc, or is it one of those vouchers?", "response": "The DLCs are on a card with their codes to redeem and download the content."}
{"product_id": "B00ENFVJJO", "context": "does it charge one controller at a time even if you dock both at the same time, and automatically charge the second after the first?", "response": "it charges both at the same time:) and it will stop charging one once it's full."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "Silent,  KB is very nice. Very Comfy wrist fit.   This KB was well worth its price in gold!"}
{"product_id": "B00DBRM3G8", "context": "what difficulty mode is best to play on?", "response": "I played pro for the most part cause i had not played an NBA 2K game in a long time. But i would be aiming for All-Star or even Superstar with 10 minute quarters as i hear that it gets you closer to real life scores."}
{"product_id": "B000I10PY2", "context": "Can the ds lite play any ds game (excluding ones for later models)?", "response": "Yes but not ds2 or later games"}
{"product_id": "B00DLDEKOK", "context": "Where do you plug in the headsets for xbox 360?  To the controller?  I don't see a place for plug in on it.", "response": "The bottom of the controller"}
{"product_id": "B008HPAXZ2", "context": "how many come in the pack?", "response": "Enough for 1 3DS XL."}
{"product_id": "B002I098JE", "context": "Does this game have multiplayer mode", "response": "Yes, but only up to 2"}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "It is a fire button and can be reprogrammed."}
{"product_id": "B005J37I4Y", "context": "Is this battery powered? Does it have a replaceable or rechargeable battery if it dies? Or is it powered by the xbox 360 controller?", "response": "Controller powered. Read the description on the manufacturer website for all details."}
{"product_id": "B005S0KHIC", "context": "does this work with windows 8?", "response": "Yes it works just fine."}
{"product_id": "B00AJXEYOG", "context": "what games are included?", "response": "MY wife plays the games. Best to go to the website and look it up."}
{"product_id": "B002QHDKE8", "context": "Should I play skate 1&2 before Skate 3? I usually like to play games in order but I only have $40 to spend. Thank you in advance if you answer.", "response": "You can go ahead and buy #3 as 1 and 2 are not that good."}
{"product_id": "B008D7F47Q", "context": "can you play it without wifi?", "response": "Yeah, Wifi is internet, and you can play it without an Internet connection. But you won't be able to download updates, and play online."}
{"product_id": "B00G0OYHCW", "context": "Does the console play DVD's?", "response": "No, it does not play DVD or Blu-Ray movies, nor does it play audio CD's. It will only run Wii U and Wii software (including titles downloaded from eShop and virtual console)."}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "This will be out before or on September 26th, 2011. 100% sure."}
{"product_id": "B008O510Y8", "context": "My computer doesn't have a microphone jack, so I'll need an adapter. Any recommendations? Should I be looking at 3.5 mm (female) to USB adapters?", "response": "This is what I bought with the Sennheiser PC 350 headset, they work perfectly together.  Turtle Beach Audio Advantage Amigo II USB Sound Card & Headset Adapter"}
{"product_id": "B006JKARP8", "context": "So I realized that this is an european model, so can I still charge it using my american vita ac adapter? or do I need to get a converter?", "response": "Yes you can. I bought this myself."}
{"product_id": "B00CMQTUY2", "context": "Do we have to have an extra wireless receiver to use on PC like xbox 360 controller", "response": "It plugs into PC with a standard USB phone charging cable, you will have to go to Xbox.com and download the drivers. I am not aware of a way to play on PC wirelessly."}
{"product_id": "B00CPKUV98", "context": "How many hours does the campaign take, ballpark", "response": "Well over 50 hours"}
{"product_id": "B0006PJAZU", "context": "Corel WordPerfect Suite 8 Is this compatible with Windows 7?  I sure hope so.Thank you.", "response": "I also wan to know if it works with windows 7.  I don't want to purchase it if it does not.  Can someone answer please that has tried it."}
{"product_id": "B003O6EDSM", "context": "Which DLC's are included in this trilogy? (I want to know if I need to buy the others or not). I would like to own all of the DLC's as well.", "response": "PlayStation 3, Bring Down the Sky will be included both on disc and on the PSN download, Mass Effect 2 will still have the same DLC on-disc that it was originally shipped with: Cerberus Network; Genesis; Kasumi; Overlord; and Lair of the Shadow Broker. Finally, Mass Effect 3 will also be exactly as it originally shipped."}
{"product_id": "B00E9I1FPI", "context": "Are any of the physical manuals included?", "response": "Sadly, no. You can find digital copies in .pdf format at manuals.bethsoft.com, however."}
{"product_id": "B005T3GSBS", "context": "does this game have English subtitles or is it only in Japanese", "response": "It has English subtitles and Japanese audio"}
{"product_id": "B0002GTXDM", "context": "what does this do?", "response": "It is used with Pokémon FireRed and LeafGreen to trade/battle etc via a wireless connection. It does require proximity though. It is only compatible with the gameboy advance and those specific games."}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "I would say just below that between 40-50 hrs"}
{"product_id": "B004FS8LYK", "context": "How much hard drive space is needed for the ps3 version. It should say at the back of the case.", "response": "It says it requieres 5.2 MB"}
{"product_id": "B001MGNWDI", "context": "Can this stick be used left-handed?", "response": "Yes it can because the handle is twisted for either side.  It's even on both sides and it works for me on both hands.  Take a look here, https://forums.robertsspaceindustries.com/discussion/60979/help-saitek-cyborg-v1-flight-stick-or-thrustmaster-t-flight-hotas-x-joystick"}
{"product_id": "B00006B84X", "context": "Can the ch fighterstick USB be made to work with windows 8?", "response": "Have you checked on the ch web site to see if there is any answers for windows 8?"}
{"product_id": "B000BD1AFA", "context": "What's the difference between the first and second editions?", "response": "I think the second edition is less graphic"}
{"product_id": "B002I0J4VQ", "context": "does it come with power cord to charge controller", "response": "Take a look at pics. This actually comes with a cradle the controllers sit in to charge"}
{"product_id": "B00004XRBB", "context": "Does it work on Windows XP?", "response": "I used xp for this, and it worked flawlessly. if you have xp, get this!"}
{"product_id": "B000YQ639M", "context": "What are the computer specs for this game?", "response": "If your laptop or desktop is no longer than 5 years old, you should be able to run this game with ease. I have a HP Pavilion Elite HPE112, and it runs perfectly on it. The game's still relatively good considering it's age, cut scenes, soldier movement, music, controls on battlefield all work out smoothly. Give it a go!"}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "Not this one, they made a different one for the slim I believe."}
{"product_id": "B00DRKJBC8", "context": "can you use a controller (xbox360) or do you have to use the computer keyboard?", "response": "You can use it with some glitches, but you can solve them using pinnacle game profiler"}
{"product_id": "B008CP6Q6M", "context": "Are the cases cardboard or plastic?", "response": "Typical ps3 plastic case with like an extension cd holder inside. Not cardboard"}
{"product_id": "B001AATQ0Y", "context": "Does this item work with 64bit system like Win7-64bit or Win8-64bit?", "response": "Yes, I've personally used it with Win7 64bit."}
{"product_id": "B0061PAZUS", "context": "can I play this on the xbox one?", "response": "There is a similar Xbox One title, but the Xbox One does not support use or play Xbox 360 game disks.  It also requires a Kinect."}
{"product_id": "B002B9FIUU", "context": "Does this work with the wii?", "response": "This is not meant for use with the Wii.  Only PC/Mac.  Classic Linker N64 for Nintendo Wii and Gamecube - Classic Controller Connector for Wii and GC  This is the item you want for N64 to Wii."}
