{"product_id": "B0056JPS84", "context": "Will it work for my xbox 360 arcade", "response": "I would research the model number and year the console was made. Also if you have had it apart you can match the part number up but be for warned. You will have to do some soldering work to the board."}
{"product_id": "B00FYAQUPU", "context": "Can you buy the dark characters seperate from the starter pack? I have the Swap Force game and portal but want to buy the dark characters?", "response": "Dark characters are only available with the starter pack."}
{"product_id": "B0080RAT42", "context": "Anyone know if this works on a Raspberry Pi? Or try this out running Linux?", "response": "It works on Linux. But about Raspberry Pi, I don't know."}
{"product_id": "B00001LDCK", "context": "does it work on Windows 7?", "response": "I've had no problems with it working on my Dell lap top using windows 7."}
{"product_id": "B00FQFFQ2Q", "context": "Do you need 2.0 gb of free space on your Xbox to play it? But practically what are the requirements", "response": "No,but the game I believe is corrupt on my game every race is ok untill you play Pocono race."}
{"product_id": "B00GANWVJE", "context": "does thiws game work for the 3ds xl model?", "response": "Yep!  That's the model we have, my husband loves it.  LOVES IT."}
{"product_id": "B00E8JZILA", "context": "Any download codes included with this game or is the entire experience in the cartridge?", "response": "Hello there, sorry for taking so long to respond. I actually had to find the case to see about the DLC, there is none to answer your question, all info is stored on the cartridge. Hope this helps. I did notice a neat mini poster on the reverse side of the cover art too. Colin."}
{"product_id": "B00ECOAX34", "context": "is this a 2 players simultaneous game?", "response": "yes two players play together at the same time. It is just like any other lego game"}
{"product_id": "B0090WBXSM", "context": "How do you get this device in pairing mode?  My android box doesn't see it at all?", "response": "Hold the Power button + the X button and the LED 1 will flash rapidly. Then search for it on your android device. Here is a link to a video to help you. https://www.youtube.com/watch?v=MsPmzsapVkk"}
{"product_id": "B0083H4NG4", "context": "I don't have a disk drive in my computer (iMac) would windows 7 find the drivers automatically? I already bought, it's in the mail.", "response": "The mouse includes the disk, but I do believe that the mouse will find the drivers automatically if not installed manually. If not, you can find them on the Perixx website. Enjoy the mouse, it's a great pick."}
{"product_id": "B003YC4D9A", "context": "does it have a usb", "response": "No but it plugs into your wii control"}
{"product_id": "B00178630A", "context": "What i get if i buy this product? The game or the key?", "response": "You get both. The saved games are on line and every time you play it starts exactly where you left off. Great game glad I bought it"}
{"product_id": "B00BI9MDSO", "context": "why do half of the people say the vita 2000 fits, and the other half say it doesn't?", "response": "You may get it to technically fit inside, but not without putting some pressure on it and endangering your system."}
{"product_id": "B0000CNUUP", "context": "Does the physical copy of the game come with a map insert?", "response": "No mine didn't and that makes playing a little hard.  You have to wonder all over to find things.  Check out the Morrowind help site The Elder Scrolls III Morrowind Quest FAQ by Mikael Romberg. It is a great help.  Jim"}
{"product_id": "B00IIHU44E", "context": "does it have blu ray", "response": "Yes it does,you just have to install it first ,but it does and it is nice and it comes with another game called killer instinct that you just need to download"}
{"product_id": "B00A378L10", "context": "Can the LED lights be turned off?", "response": "It can be by the FN commands, but even if you turn it off, the arrow keys on the numpad (0, 00, 2, .) buttons still light up. All other lights can be turned off though."}
{"product_id": "B00CBQO930", "context": "Does the Scroll Wheel also act as a button when you click it?", "response": "Yes it does, but not as a right click or left click ... You can change it and set what you want that click to be"}
{"product_id": "B002L93F0A", "context": "Am I right when I see that there are two (2) controlers for $12.50 price?", "response": "Yup! And they are in great condition :) they were still I those cases and fit in the wii slots just like it says"}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "I would active or before using it so it's already in your account. Think it should work as Playstation isn't region locked"}
{"product_id": "B00BCEK2LA", "context": "Can the \"+\" and \"-\" buttons be programmed", "response": "The + and - are only used to change the sensetivity of the mouse."}
{"product_id": "B004SJFJUA", "context": "Can this be used for a DSi?", "response": "No, this one is for the regular 3DS.I'm pretty sure there are some alternatives for the DSi though."}
{"product_id": "B002I090AG", "context": "Does it come with a charging cradle?", "response": "Yes, you plug the charger cord into the back of the cradle then you can just insert the player."}
{"product_id": "B001B5U80K", "context": "is this compatable with the xbox 360?", "response": "If there is an X-Box 360 version yes.  But this one is for PC's only."}
{"product_id": "B00EM5UFF4", "context": "Two Xbox live accounts needed to split screen for two players for online gameplay?", "response": "No you don't need two xbox live accounts to play split screen.  Split screen is the only way for 2 players to play on the same console but is it only one of many available game modes."}
{"product_id": "B00E0H5J8M", "context": "Does the scroll wheel click to intervals, or is it completely smooth?", "response": "It has a very very light click feel to it but it is very subtle , also the scroll wheel lacks any side clicking,only down for middle mouse button or what ever you wish to assign it to be."}
{"product_id": "B00C710AQO", "context": "does anyone has this problem: when i play it and then turn off the ps3... and then i try to play it again it doesnt work! it gets stuck. Any help?", "response": "no it work fine.. the kids play that game all damn day"}
{"product_id": "B0065NP6NC", "context": "Which one is better fallout 3 or new Vegas", "response": "New vegas by far!!"}
{"product_id": "B008X73CE8", "context": "Where's the manual?  I purchased/downloaded the game, but no user's guide?", "response": "Most digital games don't come with the manual.Use the link below for a PDF version of it.https://www.google.com/url?sa=t&source;=web&rct;=j&ei;=CLyEU9-mJpCjqAaX-YFo&url;=http://mypdfmanuals.com/user-manual,GAMES%2BPC,SILENT%2BHUNTER%2B4,602056.pdf&cd;=1&ved;=0CCQQFjAA&usg;=AFQjCNFV8O1WEi34883ajt3DDPsn9207vw"}
{"product_id": "B008TP1OKI", "context": "Can i download my Xbox deals and Games with Gold Deals from the marketplace in this hardrive?", "response": "I am sure you can, just use the Xbox like a computer when it ask you where to save it you will have the option to either use either storage area's. Hope this was helpful."}
{"product_id": "B009GWLSFY", "context": "Does this include the Arcade version of Smash TV?Not the rated G SNES version right?", "response": "Yeah its the arcade version"}
{"product_id": "B00B1OK3TC", "context": "does it work on xbox", "response": "Yes, my son bought it for his xbox and it works great!"}
{"product_id": "B004HYK8Y8", "context": "is it first person or third?", "response": "It can be both! It starts off in first person, but if you press the r3 button it switches to 3rd person, and can switch between both modes at will."}
{"product_id": "B000VTQ3LU", "context": "Does this come in a Retail Package as shown? Because I received it in Bulk packaging.", "response": "I believe mine came in original package. If you bought one cheaper it may have been used and would come in whatever they shipped it in."}
{"product_id": "B00JFCA6V2", "context": "do the ps vita come with ar cards", "response": "I believe they do if you buy it bundled but its a selling point they should say it"}
{"product_id": "B00CX7FQ4I", "context": "is this the one with Bruce Lee?", "response": "Yes, downloadable at various weights such as Feather, Light and Welterweight."}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "my son uses all the equip made by this company,I will have him respond to you tonite after 3:00pm 1/2/14"}
{"product_id": "B000PD0HQE", "context": "Does this come with a xbox live 1 month code and a standard xbox 360 headset?", "response": "Probably not. You must read the individual sellers item information.  Most are for the console only and nothing else."}
{"product_id": "B00D6PTMB4", "context": "is it lead only or can it teach me bass aswell?", "response": "You can play lead, rhythm and bass guitar on it. It's up to you and what type of guitar you've got."}
{"product_id": "B003NVMEVQ", "context": "Does this have good grip when your hand sweats? Or should I go for the original Razer Abyssus?", "response": "I found this version to be exactly identicle to theoriginal abyssus except the buttons are MUCH stiffer- painfully so. But the grip is the same as far as I can tell. Personally I prefer the original"}
{"product_id": "B001FBHT34", "context": "Does it work with a ps3? Does this work with a ps3? I know I'd have to get the adapter for the usb and mic so I'm just wondering if it'd work then.", "response": "Can you hear in game sound and not just microphones with the adapter?"}
{"product_id": "B003N3HEU0", "context": "When this game broke the Wii was that online only?? From what I have read on the net it only happened after going online for others.", "response": "Nintendo discontinued any live gaming for the wii shortly after the wii u came out.they do have playback but I am not quite sure if it can be played live on the wii u.but it yes it has offline play mode"}
{"product_id": "B000VTQ3LU", "context": "How long is the USB Cable?", "response": "2 m (6.6 ft)"}
{"product_id": "B00EH5V1IO", "context": "Do these work with an XBOX 360?", "response": "Hi. No these do not work with the XBOX 306 just for Macs, PC's, tablets and phones. I hope this helps."}
{"product_id": "B00FNKMVUO", "context": "How easy is it to switch profiles?  (And how quickly?)  I sometimes have to switch strategies quickly, meaning a whole new set of macros.  Thanks!", "response": "I have my switch accounts on my 10 key (side key) so I click it and it changes quickly."}
{"product_id": "B00B0QONB0", "context": "My Xbox 360 4GB will not recognize it. What do I do??", "response": "You need to return it. It's not a Microsoft HDD and sometimes the xbox wont reconize non-Microsoft branded products. Return and have them send you a replacement"}
{"product_id": "B000AOJ7FK", "context": "Does this actually work with Windows 7?  It says on the back of the disk case \"O.S. - Windows 98/2000/ME/XP.", "response": "You need to have steam. Mine works with steam. Steam will update it. You dont need the disks just the key on steam and steam will do the rest"}
{"product_id": "B00GANWVJE", "context": "what is the age cut off? My son is 5 & really wants a Zelda game. I jus want to make sure he is able to play the game on his own & not having to watch dad play it to enjoy it.", "response": "The game is for everyone."}
{"product_id": "B0002EAA36", "context": "Is it usable in the left hsnd?", "response": "No.  It is molded to fit a right hand.  I never even thought how a lefty would have to use it....."}
{"product_id": "B006IOAHPK", "context": "Can kids play this game or not ?", "response": "No. Definitely not. Very long sex seen you maneuver around. You fight aborted babies Swear words. Etc. Southpark at its finest"}
{"product_id": "B004N7HSGU", "context": "Does this really weigh 2.2 pounds? I ordered these and I might cancel my order....", "response": "The headset itself doesn't weigh that much. The entire package comes in a fancy box with the amplifier (for lack of a better term) and a bunch of cables."}
{"product_id": "B00B3PDHBU", "context": "Is it possible to use one set of headphones with an XBox 360, PS3, PS4, and XBox 1?", "response": "We use ours on the xbox 360.  Not sure about PS3, PS4 or Xbox1."}
{"product_id": "B00DGZDFLW", "context": "does it require a steam aqqount?", "response": "For the PC version, yes you do."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "Yes. I've run it on XP & Windows 7."}
{"product_id": "B003O6N64Y", "context": "is it work with PC ? with surround sound and evrything like PS4 or xbox 360", "response": "Yes, the headphones work with all systems including the XBOX360, PS4, and PC. The surround sound is adjustable with the software from steam so that you can have certain functions such as footstep detection on Call of Duty."}
{"product_id": "B001GIOGBY", "context": "Are the dimensions above correct ? 29x18x13 inches seem very big.", "response": "I measured mine, about 14\" front to back on the yoke and stem shaft.  12\" side to side, and about 8\" high."}
{"product_id": "B008TXMPJE", "context": "I have the base game & dlc on disk with Origin. Will amazon dlc work with it? Steam ones do not, so I worry", "response": "Yes I bough some from orgin and amazon and they work fine !"}
{"product_id": "B00J6DLPLK", "context": "Are the voices in english", "response": "Yes but you can buy the Japanese voices as DLC."}
{"product_id": "B00FFL0T46", "context": "Does anyone know who the VA for Bigby is?", "response": "Adam Harrington.  Source: http://www.imdb.com/title/tt3186880/?ref_=nv_sr_1PS no idea who he is"}
{"product_id": "B004S5TDUQ", "context": "does it come with cable and will work on PC/ Windows  7 ?", "response": "It does come with a cable and it does work with windows but I have had serious problems with audio/video lag. It's almost impossible to play along. It may be my computer but I really don't think so it's only a couple years old."}
{"product_id": "B0016897GS", "context": "does this work for the ps3 ?", "response": "Yes, it should work for your PS3."}
{"product_id": "B00D3RBZHY", "context": "Is this game open world?", "response": "It is, but it does a very poor job at it."}
{"product_id": "B00ECOBFA4", "context": "does this game have access to all the characters?", "response": "Yes but by each game u play u unlock characters pants etc.."}
{"product_id": "B00IJQJYHC", "context": "Does it have a good key response? I know it's not a mechanical one, but I like the mechanical, how does this compare?\"", "response": "It has good key response!  No problems with this keyboard at all!"}
{"product_id": "B008TP1OKI", "context": "My xbox 360 S hard drive has a model number --1451. Is that what this product is also? Model 1451?", "response": "I purchased the one I got from amazon to go into my son's machine. If it is the same one I purchased then it should work. The seller that bought the drive from was sold by HAUSBELL I hope that this helps."}
{"product_id": "B00CD90R4K", "context": "I ordered this item, and received the Central/South America version (with Messi, Vidal and Falcao on the cover). Will this work on PAL?", "response": "The Central/South America version is PAL and will work as long as your Xbox is also PAL."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "it is rubber dome."}
{"product_id": "B0002XJBGE", "context": "Can this gamepad play emulators? Just wondereingif this Gamepad could play emulators! Thanks!", "response": "Yes it will, and it has the best PC D-pad in existence."}
{"product_id": "B00HHAIY72", "context": "Is the primary trigger one or two stage?", "response": "Ive mostly been using the stick for flight sim and star citizen and Ive only found it to be single stage."}
{"product_id": "B0017KIBAI", "context": "Is this controller compatible with Wii U also?", "response": "To my knowledge, currently there is not an adapter or port for this controller type on the Wii U. At least, not an officially licensed one. Considering the competitive scene for smash, however, I would not be surprised if there is a homemade connector out/on its way. Hope this helps!"}
{"product_id": "B00GLZQR96", "context": "Is there a monthly fee?", "response": "ignore those who says no... you need to pay for playstation plus to play online... confirmed for ps3 as well which playstation plus not needed for playstation 3 console."}
{"product_id": "B00B15EXJC", "context": "does the home button work on this contoller with the PS3? i know it wont turn it on and off but can i still go through the PS menu??", "response": "It actually doesn't turn it on but all the other functions work for it"}
{"product_id": "B008FHL56S", "context": "Just a quick question. Does this work on the regular xbox 360? I bought Titanfall and didnt know I needed a harddrive for it, So would this work?", "response": "By \"regular xbox 360\" do you mean the original XBox?  This drive is only for the newer 360 S (Slim).  This page explains the different storage options depending on the type of XBox you have:  http://support.xbox.com/en-US/xbox-360/accessories/storage"}
{"product_id": "B00CMSCTA2", "context": "I have the old AoE2, but want to play against my wife. If we put the HD version on her computer will we be able to connect or do we need HD on both?", "response": "You should be able to connect, Ive played online and I doubt everyone one the people have the HD version"}
{"product_id": "B00CXI0BPG", "context": "Can you remap the DPI buttons to something else?  I don't have a need for DPI switching.", "response": "no, but they are not in the way.  I've used this mouse for months and dont use this feature frequently and I hardly ever 'accidentally' hit the dpi button."}
{"product_id": "B00DBRM3G8", "context": "is there the slam dunk contest and 3 point shooting contest in this game?", "response": "The dunk contest and three point shootout are in the myCareer and myGM modes. In myCareer you can only do the shootout because of some weird glitch. Not sure about myGM."}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "It's just the DLC. You have to buy the base game separately."}
{"product_id": "B002BRZ79E", "context": "Registration info? I tried to play this game I bought but it's impossible without a valid registration.. Can someone help?", "response": "If you bought the game second hand then you're probably out of luck."}
{"product_id": "B0010WS20W", "context": "Do you need an internet connection to play this game?", "response": "No, you do not need an Internet connection to play this game.  Master Poker comes to you, full and complete, on a CD, which you install on your computer.  All the information your computer needs in order to fully display and run Master Poker is contained on the CD; therefore, no Internet connection is required."}
{"product_id": "B00E4MQODC", "context": "Is there a slot in the battery compartment to store the USB nano-receiver when on the road, as with other Logitech gaming mice?", "response": "Yes, there is an small slot in the battery area."}
{"product_id": "B0015PHMFU", "context": "does this work with mame?", "response": "Yes it will. you may need to use the tab menu to map the inputs to the stick, but it will work. Here are details on tab setup. https://www.youtube.com/watch?v=s4dNttZbCHE&list;=PL0CABFEF11F175A7A"}
{"product_id": "B00D3RBYM0", "context": "Are there more bugs with the Xbox One version Vs PS4 for the price to be cheaper? If nothing is wrong I will of course get the Xbox One version.", "response": "Works great for me no problems"}
{"product_id": "B00D96BMV8", "context": "Does it play game sound through the headset?", "response": "Yes but it plays volume through TV also, have not figured out a way to mute TV sound and keep sound only in headset. It's a great headset though!"}
{"product_id": "B000IBQLOU", "context": "How does this stand up to jumping? I tend to be a jumper when I'm playing, and i was wondering if this is going to slip?", "response": "This will likely depend on the surface upon which you place the pad. I use mine on a low-pile carpet and although the cheap (no foam, very thin) versions tend to slip a bit, these are pretty solid. Even after a very energetic song, the pads have seldom moved more than an inch or two from their original location."}
{"product_id": "B006QRMR4S", "context": "Can I play Japanese games on this? Because the Japanese version can only play games from Japan... So I don't know if it's the same with this.", "response": "It depends on the console format. If it has a Japanese region code, then yes, otherwise most U.S. region code 3ds consoles only play U.S. games."}
{"product_id": "B004IK24MU", "context": "Does this work with any and all wii controllers? How?", "response": "i bought it for my daughter for christmas, she just charges the hand held controllers says it works good for them."}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "You will need a internet connection, type in the activation code located in the CD case. This is a one time thing, and you must have the CD in your computer to play. It's a great game so enjoy."}
{"product_id": "B00BCEK2LA", "context": "Is the G 400 S the same size as the G400?", "response": "It's 1:1 the exact same shape and size.  The only thing different is the color and the internals."}
{"product_id": "B00D4WTO1M", "context": "Is this ps4 game supported or compatible on a 720 HD LCD TV???", "response": "Yes, mine is 720"}
{"product_id": "B00BGA9X9W", "context": "Can this be charged with a microUSB phone charger (wall charger) or does it have to be plugged in through a usb?", "response": "Yes! I do it so I wont be wasting energy using the console to charge the controller"}
{"product_id": "B00HVBPRUO", "context": "Can you watch movies on gold wireless headset on the ps 4 if I put blue-ray movies in the ps4", "response": "Yes indeed..  If the sound is transmitted through the ps4, then they'll work just fine"}
{"product_id": "B0099OZR9W", "context": "Just bought an xbox 360, it says it is xbox 360 E console but is E the same as the slim model?? If so will this Hard Drive fit in that xbox 360?", "response": "Sorry it took so long. This hard drive is ONLY for the slim model. Go figure, just another way to control our gaming. Lol."}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "some of the newer wiis dont have the slots"}
{"product_id": "B00012YI14", "context": "Will this adapter allow the use of Gamecube and xBox controllers on the PS2?", "response": "No. This is meant to go from ps2 to GCN or xbox. The ps2 port is female and I doubt it would work the other way around. Btw, my unit just plain didn't work. Look elsewhere."}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "can i use fire tv controller"}
{"product_id": "B000YQ639M", "context": "What are the computer specs for this game?", "response": "Not exactly sure. Should be able to check if your computer can run it by choosing the game at: http://www.systemrequirementslab.com/cyri If you do not want to use the applet when you choose a game it should give you the option of simply showing specs needed."}
{"product_id": "B0000C7GHG", "context": "good afternoon could tell me if it comes with controls?", "response": "Mine came with one"}
{"product_id": "B00BGD6LMG", "context": "My bf likes Assasins creed, gta5, red dead redemption, kinda COD, would he like this?", "response": "I'm just like your bf and I love those games as well. I think he would like this game because its similar to those games mentioned.  He'll like the game but he wont love it"}
{"product_id": "B001CC8UBG", "context": "This have prop hunt or can you get prop hunt?", "response": "It is available for download ."}
{"product_id": "B00BQMGW4Y", "context": "Is this item only for the original Xbox or is it compatible with the Xbox 360?", "response": "I ordered this item recently. It's not the original controller from XBOX but it works. The cord is shorter than the original controller."}
{"product_id": "B00GV0LR64", "context": "So I'm guessing if the game is designed for higher accuracy WHEN aiming, this isn't going to help much. Is that right?", "response": "A person aims and fires accurately when they aim down the sight.The device helps you fire better under the hip and helps you quick scope.And it helps a bit when aiming down the sight, when you gave an awkward gun sight."}
{"product_id": "B007MM9E42", "context": "Can it be played in Spanish?", "response": "yes i think you can find Spanish in the settings."}
{"product_id": "B0079V29EI", "context": "What do you recomend to me to use the portable charger of ps vita or this grip? I play ps vita at home most of the time.", "response": "If you're mostly at home the portable charger is probably best. Grip is great for mobile use, traveling etc."}
{"product_id": "B00B3PDH5G", "context": "If connected to PS4 with a cable, can you control chat volume and Mute by button which on the headset?", "response": "Actually, if you use a cord for PS4 chat you should purchase the PS4 Talkback cable, it has mic mute and mic volume control on the cord itself. The mute and chat volume buttons on the headset only work with wireless bluetooth to the PS3."}
{"product_id": "B009AP23NI", "context": "Is this an official Nintendo product?", "response": "Yes. This is the official Japanese controller; other than the packaging and instructions being in Japanese everything else is exactly like the US version of the controller."}
{"product_id": "B00IVHQ0KI", "context": "Does this product work with Xbox ONE and does it support the game Project CARS", "response": "Yes it does both of those things. I am using it with Project Cars right now on the xbox one. Just make sure if you get it to go in the menu on project cars and calibrate it."}
{"product_id": "B00030GSJY", "context": "i have windows 8.1 will this system work with my system?", "response": "While there are drivers on the Saitek site for windows 7 and XP64, I have not tried them. I only use it on an XP system that my flight simulator is installed on...Hope that helps."}
{"product_id": "B008M4BNQG", "context": "Does this headset just hook up to your USB slot or does this have to hook up to the audio/video jacks also (red,white,yelliow) in back of your tv?", "response": "It uses both and as far as the av jacks it's a male and female plug so you can plug your original av plugs into the headset."}
{"product_id": "B0085P7U0U", "context": "Does this really work with OSX 10.9.5?  I bought games recently and they wouldn't work on this operating system.  It was a pain to try to get my money", "response": "I had the same trouble, contacted Amazon, and I was given a phone number to call for assistance.  I never got through, never received a refund.  When it comes to this kind of service Amazon Stinks."}
{"product_id": "B009JZ04BC", "context": "Where do you install the application for the mouse? To change colors?", "response": "http://www.cmstorm.com/en/products/peripherals/recon/copy and paste to that website software should be there and once installed its called recon and you should beable to customize the whole mouse"}
{"product_id": "B00B1VJZO4", "context": "it says that i must download sims 3 do i have to?", "response": "yes university life is a expansion"}
{"product_id": "B00B1MXGDO", "context": "can i use this for pc gaming?", "response": "yes it can work and be programmed just like it was on an xbox"}
{"product_id": "B00EFFVZP0", "context": "Im planning to purchase this game CD in US amazon store, will it work on an asian console? i also have an american account BTW", "response": "I am not 100% positive, but I am pretty sure it will work on any PS3 console."}
{"product_id": "B0050SYILE", "context": "Is it safe to order a used one or better to buy a new one?", "response": "You can buy a used one like At gamestop and if it doesnt work they'll give you another used one if its within its time period."}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "Not sure. I run mac."}
{"product_id": "B00I4BGNVM", "context": "What MMO can the game world be compared too? I like big open worlds with little zoning. Vanguard did a good job at this. Rift is 2nd I think.", "response": "I stopped playing the game because it was boring... I do not recommend playing it..."}
{"product_id": "B00AJZNUUI", "context": "Can you play wii fit with this?", "response": "Yes, it's functional w/ all existing Wii accessories and software."}
{"product_id": "B00B23MO9Y", "context": "i have the 2008 version which does not have the 6 add-ons and the this expansion, if I buy this expansion and the 6 add-on codes what disc will need to be inserted?", "response": "once you have uploaded the seekers of adoulin expansion to your game you must use that disk in order to play ffxi."}
{"product_id": "B005J37I4Y", "context": "Is there a mute button on this or do I have to use the one on my headphones?", "response": "Headphones, unless you just unplug the thing."}
{"product_id": "B0081GA50U", "context": "Does this work for the PS Vita 1000 series?", "response": "Yes it work very well"}
{"product_id": "B003ESDQW4", "context": "Is Black cat in this game?", "response": "No she isn't. I don't think she is even mentioned."}
{"product_id": "B001AH8YSW", "context": "will this work with windows 7", "response": "Jenna,Yes.  It runs for me without an issue."}
{"product_id": "B00DJYK9L4", "context": "What controllers are supported?", "response": "Both the wii u game pad and the wii remote but it's mainly for the wii remote because it goes in the belt while you use the game."}
{"product_id": "B004NRN5EO", "context": "Does this require an internet connection to play? (not update/install)", "response": "It does not require an internet connection to play,  but you will not be able to participate in PVP battles where you can invade other players worlds and they can invade yours."}
{"product_id": "B0099OZR9W", "context": "can it be install on a xbox 360 model # 1439", "response": "My grandson installed this on his xBox 360.  I am not sure what the model number is."}
{"product_id": "B00BGAA3S2", "context": "Does the camera come with a mount? I've read and watched reviews and they show a mount included. I just want to make sure it comes with one or not.", "response": "Yes it is included �"}
{"product_id": "B000FQ2D5E", "context": "What region is this game?", "response": "I don't think the game is region locked. If that's what you mean."}
{"product_id": "B000056SPM", "context": "Does it use external power or just the usb? If it does use external power does it work on 240V?", "response": "It just hooks up to the USB - no other power and installed very quickly on my Windows 7 system."}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "2014 Update, it does NOT come with a USB receiver. It just arrived and I am furious that I have to purchase a separate adapter now. UPDATE THE DESCRIPTION PLEASE."}
{"product_id": "B00F27JDY0", "context": "I've heard the x and o button are backwards, is that true and then is it possible to change it and have x as enter and o as back?", "response": "Sadly no but it is more convenient imo"}
{"product_id": "B00DJYTGYU", "context": "How long is the wire?", "response": "It should be wireless but it is 10th"}
{"product_id": "B000FRU1UM", "context": "does this come with the game and instaltion disc or is it jist the game", "response": "Their Is No Installation Disc With Any GTA IV (4) Game."}
{"product_id": "B003EUPCZG", "context": "do the mouse wheel and logo light up?", "response": "the logo definitely does not sure about the wheel as it is my sons mouse."}
{"product_id": "B004W1IX1G", "context": "Does it work for a wii mini?", "response": "It looks like it takes the same games.. It should be able to.. My niece has a wii u and my wii resorts game works just fine :)"}
{"product_id": "B00F27JN8Q", "context": "can you put ps vita cartridges in it?", "response": "Yes, both game and memory cards"}
{"product_id": "B00HHAIY72", "context": "It looks like the theres backlighting on the throttle controller. Is this device backlit?", "response": "Yes there is. And it has adjustable brightness."}
{"product_id": "B009WI7V9E", "context": "I'm wondering about sexual content because I have younger kids in the house.", "response": "This game does not contain any sexual content so your kids should be fine as far as that goes."}
{"product_id": "B00DC7FWRE", "context": "Will the wii u pro controller work with this game?", "response": "No, unfortunately. To prove that, you can just look at the back of the game box. It tells you at the bottom the controllers that can be used for the game."}
{"product_id": "B00CJ7IUI6", "context": "If I already have Skyrim and just wanted to add the expansions, would I be able to continue with my game if I got this or have to start over?", "response": "Yes you should be able to keep what you have. You download the dlc's form the disk (which is under skyrim DLC) and it should not affect the data you have saved."}
{"product_id": "B009RXUOD4", "context": "how long is the wire?", "response": "Its about 2 ft but you can replace it with any size cable you want. I believe its a 3.5mm male connection on both sides."}
{"product_id": "B002YVD3KM", "context": "What kind of emulators does this controller work with?", "response": "It works on all NES emulators, just make sure you set up the controller before you select a game or it won't read it's use."}
{"product_id": "B001444IN6", "context": "I got the game today and when i opened it had no booklet in it so i cant get the product code. What do i do?", "response": "Google product codes for it, that's how I used to get them when I didn't want to register my code when I was a kid."}
{"product_id": "B003VAHYQY", "context": "DOES IT WORKS WITH A MAC???", "response": "The Logitech website only lists Windows, so I don't believe it works with a Mac."}
{"product_id": "B009UCGVZC", "context": "does ur set contain the cards?", "response": "Yes it contains the cards sticker and online code. Everything you normally get with your skylander is included."}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "I researched these a lot and there are some pretty good vids on YouTube about them. You only have to plug them into the controller and they need no batteries. Heck you could use them in your cellphone or pc also.:)"}
{"product_id": "B00B3PDHBU", "context": "Do they work with the ps4", "response": "Yes they are fully compatible with the ps4. You have to update the headset and when you do. There is a preset button you hold down for the ps4 setting so yes it is fully compatible"}
{"product_id": "B00005NIMA", "context": "Need a good joystick to play old game. Microsoft combat flight simulator. Any suggestions?", "response": "Sidewinder is the best joystick I tried.  I have 4 of them.  I even had the force feedback version which does NOT have Win XP nor Win7 drivers.  The USB sidewinders last forever.  Also - Flight Simulator 1 2 and 3 do NOT work in Win7 - you have to stop at WinXP for those."}
{"product_id": "B00BXONG7G", "context": "Played BF3 all the time, and never picked up BF4.  What's the best deal to get 'everything'?  Looks like $49 + $49 - looking for a better deal", "response": "get Battlefield 4 [Online Game Code] + Battlefield 4 Premium Service [Online Game Code]all for a total of $93.98"}
{"product_id": "B00CTKHXFO", "context": "I see it has MGS 3 HD. Is that snake eater or subsistence?", "response": "Its Snake Eater! So damn amazing ��"}
{"product_id": "B009Q5XGO2", "context": "How long does this last with the extended battery installed?", "response": "It doubled my playing time with the pad before I have to recharge it."}
{"product_id": "B005YR1VP2", "context": "Is this XBox 360 compatible with XBox games?", "response": "Some but not all."}
{"product_id": "B00BHSTXV6", "context": "Can the macro keys activate AutoHotKey scripts?", "response": "I'm sure they can"}
{"product_id": "B00D6PTMB4", "context": "Could someone suggest a good guitar to use this with? Something cheap yet not horrible and sold on Amazon? Thanks!", "response": "Just my opinion, but Epiphone Les Paul Standard is awesome."}
{"product_id": "B00D9EPI38", "context": "if all I want is to play games, is 4GB good enough, I dont need or want all the bells and whistles, just gameplay", "response": "Yea 4 is fine"}
{"product_id": "B004W1IX1G", "context": "is Wii motion required?", "response": "I bought this for our grandson and his parents said that it was, so I bought both.  I'm sorry, but I personally don't know, just going by what they said."}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "They show both with the palm rest attached and the other without"}
{"product_id": "B00CBQO930", "context": "The mouse information says 5 user profiles bound to specific games but i don't see the list of games. Will this mouse work with World of Warcraft?", "response": "Hi Sandra361,Yes, it can work with World of Warcraft. However, we do not have specific profiles for certain game, you could program and set your own file for different games. Thanks.-AnkerDirect1-800-988-7973support@ianker.comMon-Fri 9am to 5pm(pst)"}
{"product_id": "B00BCEK2LA", "context": "How big is the mouse.  I don't care about the size of packaging.", "response": "youtube is awesome for your question. You can SEE the size."}
{"product_id": "B00GD962OA", "context": "can you tell me Max of  Flash Memory Cards  .tks", "response": "how do I find out?"}
{"product_id": "B0072A4JVW", "context": "Does it come with l2/r2 buttons because I am trying to play ff8", "response": "It does not, you will still need to use the touchpad on the back of the device."}
{"product_id": "B00I5LMSBK", "context": "For the North America pre-order of the game, was amazon supposed to give both the Shigechi & Kira DLC? I only received an email for Shigechi", "response": "The Amazon pre-order unfortunately only gives you Shigechi. In order to have gotten Kira DLC you would have had to prs-order from namco bandais website."}
{"product_id": "B00CMQTUY2", "context": "Can you use the battery pack from an Xbox 360 controller in the Xbox One controller?", "response": "no you cannot. it has a different set up."}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine.", "response": "Not sure. If you downloaded & installed,  try deleting the download."}
{"product_id": "B003ZMF26W", "context": "What's the lowest dpi this mouse can be set at?", "response": "lowest is 500 highest is 4000 here is a picture of the dpi   http://tinypic.com/?t=postupload"}
{"product_id": "B007JM8ULS", "context": "I been using this hard drive for a couple of days, however the Xbox now freezes I pull the hard drive out notice it runs very hot, it is temp problem?", "response": "My son hasn't had any problems with his.  Especially since we learned you are supposed to keep the Xbox on its side not up and down!"}
{"product_id": "B00I14395A", "context": "Do the rechargeable batteries 'really' only last 48-hours? (if so, then it's not 'really' wireless)", "response": "With moderate to heavy use, I get at least 5 or 6 days out of the mouse before I recharge it. The keyboard will go two weeks or more. Both would surely last much longer if I turned them off when I'm not using them; but I don't. Recharging takes about 20 minutes using the supplied usb cable."}
{"product_id": "B003O6E986", "context": "would this be appropriate for younger kids too? Does it use trashy animation or bikini girls in the game? I am looking for a fun family friendly game", "response": "Yes it is appropriate for all ages. It's all about the cars. Great game. You can play it on all levels. Supper fun for the whole family."}
{"product_id": "B001DNGCN2", "context": "does this work with the ps3 fat boyalso does actually works there are so many mix reviews about this product", "response": "Fyi people, if your system is already overheating this isn't going to stop it! You need to open it up, clean it and inspect to ensure your internal fans still work."}
{"product_id": "B0057S9SYY", "context": "do these headsets drop the sound every few seconds like the turtle beach x32's??", "response": "They never seemed to \"drop the sound\" for me or lose any connectivity, but I've also used a pair of TB's x32's and didn't seem to have that problem either."}
{"product_id": "B004C34D2M", "context": "I bought this for my grandson's Wii.  IT WILL NOT SYNC!!!!!I tried to sync it to two other Wii units and IT WILL NOT SYNC!!!!What do I do?", "response": "Nothing. Mine doesnt sync either. The price paid might aswell buy the actual controller instead of a 3rd party company product."}
{"product_id": "B004X56PWK", "context": "Can we use it in Spain?", "response": "..If you have a ps3..I don't see why not"}
{"product_id": "B009WGUYIG", "context": "My grandsons told me that I sent them the wrong giants. They want the ones that are physically larger. How can I tell by the package.", "response": "Where the phrase Skylanders giants is on the package. For the \"Giant\" characters the name \"Skylanders Giants\" is towards the bottom of the package on the plastic.While on the smaller packages it's on the cardboard backing above the figure."}
{"product_id": "B00AKIPBNS", "context": "does a poster come with the game i see it in the images lol", "response": "Nope, I wish it did though!"}
{"product_id": "B00FJWNSWQ", "context": "Do you have to have the original game to play this?  Or does this have the original game included? Thanks!", "response": "I don't know from personal experience but my brother says the original game and this game are the same so i hope that helps"}
{"product_id": "B00BGAA29M", "context": "I´ve got two kids. Can they play it together?", "response": "Yes.  One can play as Knack and the other can play as the little side kick.  I played it on super easy mode with my daughter and it was really fun.  Not too hard or frustrating."}
{"product_id": "B00EHBKUTE", "context": "The \"Synapse 2.0\" feature implys that keypad won't work if my Internet is down. Is this true?", "response": "You will need an internet connection to download the drivers when you first instal the device, but afterwards you can use it offline with no trouble!"}
{"product_id": "B00H1FCUBE", "context": "I just got mine today and I tried to use it for ps3 and it says I need a pass key. do you no the pass key", "response": "Normally,Bluetooth keys are 0000"}
{"product_id": "B00886XQO0", "context": "Will this Headset work with Xbox One if I have the Microsoft headset adapter? I already have the adapter so it wouldn't be a problem.", "response": "yes it should work! i use mine with xbox one but without the adapter."}
{"product_id": "B008UQWX0Q", "context": "does this have a camera?", "response": "Yes. Both a front and back camera."}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "Yep it'll work no problem."}
{"product_id": "B00FOHP8XI", "context": "can this be hooked up via hdmi to home theatre  system///or does it just have rca plugs tks cj", "response": "Yes it can be hooked up by hdmi to a home theater system. No problem."}
{"product_id": "B000056SPM", "context": "Not stable. how do you mount it? How do you mount this device? I have tried on tables and it is not stable, no matter how tight I get it the entire think wigles on the table.", "response": "You might try using a piece of 1\" X 2\" strip of wood about 11\" long as a shim between claps and the bottom of the table and/or desk. It worked great for me."}
{"product_id": "B00BFOEY3Y", "context": "Is the scroll wheel free-spinning, has click stops, or switchable (like the MX Revolution)?", "response": "It is switchable, similar to the MX Revolution. To switch you press the button just below the wheel instead of pressing the wheel."}
{"product_id": "B005S0KHIC", "context": "does this work with windows 8?", "response": "Yes, it is just a plug and play. Set the weights for you, and have fun!"}
{"product_id": "B00HN9LS48", "context": "Can this be used to mount the Kinect to the bottom of the TV?", "response": "I bought $1.99 Velcro 2 way tape works great, You can put it any were on the tv"}
{"product_id": "B008O510Y8", "context": "Is it comfortable even if I wear glasses?", "response": "My son wears glasses and has had no trouble at all."}
{"product_id": "B00BGA9X9W", "context": "CAN BE THE PS4 CONTROLLER USED FOR PS3?", "response": "It depends on the game. Borderlands 2 worked flawlessly"}
{"product_id": "B00DE2W4PK", "context": "Friend apology, which contains the box exactly? playstation plus come with box or purchase, you send the code of playstation plus inside the box?", "response": "playstation plus will not be included"}
{"product_id": "B006RJ373K", "context": "system requirements for mac and pc?", "response": "The Minimum system requirement t run on x-plane area : a 2 ghz processor, iGB of Ram, and 128 MB VRAM on an independent {non integrated Video card.   The recommended specification are : a GHZ processor, 2 GB of RAM, and 256 MB of VRAM"}
{"product_id": "B003N3HEU0", "context": "Does this game have robots to play with in an offline mode? I do not plan to go online with my wii.", "response": "Yes it does have a regular offline mode to enjoy,playing against automated enemies"}
