{"product_id": "B00D6NPFDK", "context": "Can you use the Swap force with the Trap team?", "response": "No.   However the Giants figures will work on Swap force."}
{"product_id": "B00F9RGFEY", "context": "Is it possible to listen to my mobile device without the aux cable? via bluetooth?", "response": "No, I don't think so."}
{"product_id": "B003CP0BHM", "context": "What are the dimensions of the mouse? The listed dimensions cannot possible be right claiming that, presumably the length, is over 8 inches.", "response": "This mouse has a weird structure.So, I will give you the dimensions for the grip. Length: 11cm, Width: 7cm, height: 3.5cm.These dimensions were taken from the mouse from above, when taking the dimensions from under the mouse it will give different numbers."}
{"product_id": "B00GU4F4OM", "context": "What does the \"power button\" activate? and can the \"power button\" be programmed specifically to certain tasks?", "response": "Yes.  By default it is a rapid fire button but can be programed for any normal macro."}
{"product_id": "B009SJR278", "context": "Do I need to buy a splitter for pc gaming?", "response": "No, it comes with a splitter for pc"}
{"product_id": "B002CZ7P04", "context": "is is appropriate for children?", "response": "Yes, you have to walk on the mat using your controller and it plays music and you have different degrees that you can open up the more you walk. I thought it was fun but I'm older. Sometimes it's hard to keep kids attention but they may like it. Hope this helps."}
{"product_id": "B005S0KH7I", "context": "is it a mechanical keyboard", "response": "it's not sadly. but it is still a great keyboard rest assured. Mechanicals can get a bit complicated if something goes wrong with it"}
{"product_id": "B0007U2CX6", "context": "is this original sony psp charger ? the picture dosn't show", "response": "not an original but works just as good. It was for my grandson and he puts a lot of wear and tear and it has held up. I recommend this to anyone."}
{"product_id": "B001AWBYRA", "context": "compatible with windows 8?", "response": "Yes, I bought it for my son ans it works fine"}
{"product_id": "B00GJSUXLS", "context": "Does anyone know if the Full version will be available for Xbox 360?", "response": "Metal Gear Solid V: Phantom Pain is expected to come out early 2015, although some sources say the first release will be Dec 31, 2014. Phantom Pain will be released early 2015 for Xbox 360, Xbox One, PS3 and PS4."}
{"product_id": "B00A878J5I", "context": "Will the game pad fit in the dock station if you have a silicone cover on it and does it charge ok with it on it.", "response": "Ya it will sit and charge just fine.. i was the same way thinking it wouldnt and gave it a shot and worked out good and this charges the pad super fast i love it"}
{"product_id": "B00EI4V3FU", "context": "How come I just bought this headset and it does not work on my PS4?", "response": "You need to enable it within settings under devices I believe. Look through PS4 settings menu. You may need to reboot PS4 afterwards too. Set it to output to headset."}
{"product_id": "B000QJ1NS8", "context": "Does this come with the tri point screw driver? I ordered one that came w/ a Philips that doesn't fit.", "response": "It comes with a phillips screw driver and should fit. I don't know if all gameboy sps have a phillip screw. Sometimes where it is made it might have different screws. If it doesn't fot you should try and return it."}
{"product_id": "B00DGZDFO4", "context": "Can you gift the PC download version? If so how?", "response": "Yes. U will get code for activation on STEAM. Just give someone this code."}
{"product_id": "B005QUQP80", "context": "I just got the K60, I plug it in but no lights come on and no plug and play happens? whats the matter", "response": "I guess the first question is do you have both plugs for the kb in.  If so try plugging them into known working usb ports"}
{"product_id": "B005BLAJRC", "context": "Do we need a \"joystick\" type device or will the games work with just a mouse?", "response": "Will work with just a mouse. That's all."}
{"product_id": "B00E88G054", "context": "How is the packaging? does it come in the original box and would it look presentable as a gift?", "response": "Yes comes in original box."}
{"product_id": "B0098W4ZD4", "context": "Is the Precision Aim Mode button programmable, or can it only be used to drop the DPI?", "response": "It can be programmed using the software, but in all honesty this mouse is not worth it.  The tracking on it cuts out quite frequently. It just sits in a drawer now because it is too frustrating to use."}
{"product_id": "B002AQNT96", "context": "Can I get this delivered to Australia", "response": "Hi, I'm sorry Amazon does not allow me to ship internationally.Thank you for asking."}
{"product_id": "B00CD1FCAC", "context": "Why is there two usb cords?", "response": "The Vengeance has a USB port to connect another USB peripheral like a mouse or headset. But powering the second device requires connecting the second USB cord (called the USB pass-through, I think). However, this mainly makes the second USB port only useful if the second device has too short a cord to connect to the computer directly."}
{"product_id": "B00DBCAT3W", "context": "does this game have multiplayer mode?", "response": "It does not. Strictly single player."}
{"product_id": "B00178630A", "context": "What i get if i buy this product? The game or the key?", "response": "You get the key and Battle net setup. You will still have to download the game"}
{"product_id": "B00D96BMV8", "context": "Does it play game sound through the headset?", "response": "Yea and you can use them for mp3 type devices"}
{"product_id": "B00DLDEKOK", "context": "Can this be used with the Xbox 360 wireless controller?", "response": "Yes, they do. I wouldn't recommend buying this set though. They came packaged and everything and didn't work, cheaply made."}
{"product_id": "B000H1V56U", "context": "Does this work on the xbox 360 slim?", "response": "No this is for the original \"fat\" system"}
{"product_id": "B0091WIOJ2", "context": "Is Astro support really as bad as many of the reviews on Amazon state?", "response": "Honestly, I have not had a single problem form this headset. I found it to be very user friendly. As far as support from Astro, I can't say.But, what I can tell you is I purchased my Directly from Astro. Astrogaming.com on their websight they have a great chat support."}
{"product_id": "B00CD1FC6G", "context": "The only thought that I have for this keyboard is how are the LEDs?", "response": "Mine arrived with 3 of the keys having no functioning backlight (5, c, and Insert)"}
{"product_id": "B000UHE8YM", "context": "Does this keyboard work with WIN7?", "response": "yes, and its a great keyboard. you will probably never use anything but this type again! i love it as it lights up and the layout seems perfect. i hope you like it as much as i do!good luck!!"}
{"product_id": "B000QJ1NS8", "context": "Does it increase the stock battery life?", "response": "It should, given that it's 850 vs the original's 600 mah, but who knows.  Maybe this battery underperforms so ends up just giving the same performance of a new, official 600 mah battery."}
{"product_id": "B00D78Q4UM", "context": "Is the palm rest removeable?", "response": "Yes. I forgot it even had one as I never used it."}
{"product_id": "B004C34D2M", "context": "I bought this for my grandson's Wii.  IT WILL NOT SYNC!!!!!I tried to sync it to two other Wii units and IT WILL NOT SYNC!!!!What do I do?", "response": "I'm not sure, because mine stopped working and there is no way to return it."}
{"product_id": "B004RMK4BC", "context": "Do i have to have a real  US address to purchase this item ?  Thank you ..", "response": "You can purchase it without a US address I think so, but you cannot use it without a US address I think."}
{"product_id": "B00BGAA3S2", "context": "Is this similar to the Kinnect for the Xbox? How or how not?", "response": "can this be used on a pc as well?"}
{"product_id": "B00FEDP968", "context": "can you hear your own voice in the headset while chatting?", "response": "You can set it up either way in the settings."}
{"product_id": "B00DE2W5XG", "context": "Hi, is the PS4  for 110 V or mutivolt 100 to 240V?", "response": "yes you can use it on 110v and 240v Source:https://www.ifixit.com/Teardown/PlayStation+4+Teardown/19493"}
{"product_id": "B00DE2W4PK", "context": "Friend apology, which contains the box exactly? playstation plus come with box or purchase, you send the code of playstation plus inside the box?", "response": "Hi - the code inside the box"}
{"product_id": "B002XLR0JI", "context": "Does this mouse create loud clicking noise?", "response": "This mouse creates the same amount of noise as any other mouse. It isn't loud and is kind of softer sounding. No sharp clicks"}
{"product_id": "B00DGZDFO4", "context": "How is the online in this game? is it worth it?", "response": "No. Online never work on this game!"}
{"product_id": "B0002GTXDM", "context": "what does this do?", "response": "This GBA wireless adapter is for the Gameboy Advance and Gameboy Advance systems (not compatible with the GBA Micro), and replaces the GBA link cable for games that support it, most commonly Pokemon Emerald, Pokemon Fire Red, and Pokemon Leaf Green."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "You have to download it to your xbox 360 first. Then it will be available for free on your xbox one. If your consoles share the same xbox live account."}
{"product_id": "B009AFLXJS", "context": "How does the pro controller connect to the gamepad", "response": "The Wii U Pro Controller does not connect to anything but the console through the special mini-USB controller adapter, and that's mainly if you want to recharge the controller and use it while it's recharging. When it's fully recharged, it can be used wirelessly if it's properly synced with the Wii U game system."}
{"product_id": "B00001IVRD", "context": "is it strictly online game?", "response": "No, there are all of the campaign modes which are against NPC's or you can play against the Computer in random matches."}
{"product_id": "B00HVBPRUO", "context": "Has anyone tried it on the xbox?", "response": "One yes, one maybe and two no... Would love an update from any of the previous answerers to this question. (If you could include details/accesories of what you used or tried using to make it work that'd also be appreciated)"}
{"product_id": "B000OPOCFU", "context": "Where on the DVD is the product key.I tried entering and it still wont take it", "response": "did you find a instruction pamplet in your case, if you did the 16 diget code is on the back cover"}
{"product_id": "B00JC9SWSC", "context": "hello, its the fat version or slim version?", "response": "This is the slim version."}
{"product_id": "B007VFHIHA", "context": "can you play this game without the internet and do you get disc & software package for disc?", "response": "Like most software you need internet to activate the game, but to play multiplayer and to world competitions you have to have internet."}
{"product_id": "B00B98HF1O", "context": "can 3 people play this game together", "response": "No... only 1 or 2 people. Bummer."}
{"product_id": "B002CZ7P04", "context": "Do you get a real workout from this game, can you loose weight?", "response": "I have been losing weight. The more you walk, the more you build your city up. I think it's fun."}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "Wii u games cannot be used on the wii but wii games can be played on the wii u"}
{"product_id": "B0089NVTDM", "context": "Does this work on a Wii U to play the newest Smash Brothers? Can someone Confirm yes or no?", "response": "I used on a friend's Wii U and it works perfectly"}
{"product_id": "B008XHCLFO", "context": "does this fit the new 3ds xl?", "response": "NO.This WILL NOT fit the New 3DS XL that released in Feb 2015. The NEW model has extra buttons, has the stylus and cartridge slot in different spots and is slightly bigger. I contacted the manufacturer and they responded saying there will be a new one for the NEW 3DS XL sometime around April 2015. No exact date though."}
{"product_id": "B009CEM332", "context": "Does this work for Windows 8?", "response": "I don't see why it wouldn't. I installed it a while ago when I bought it for Steam. Windows 8 has the same folder structure as Windows 7 and Vista, but only a different Start menu. There should be no reason this doesn't work."}
{"product_id": "B00A0EPNPI", "context": "Is this gaming keyboard wirless?", "response": "No it is not"}
{"product_id": "B005CELN8W", "context": "So this game does not work on Windows 8, I presume?", "response": "We have Windows 7, and it works fine on this. I am afraid I cannot answer for Windows 8, sorry, and good luck!"}
{"product_id": "B00B67ZTUW", "context": "Is this the official US release? Also, there's 3 different sellers and this one is significantly cheaper. Is this legit? Thanks! :)", "response": "Yes is official and legit and works perfect l"}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "I do not believe you can."}
{"product_id": "B00GHTP7SS", "context": "Does this game have multiplayer mode?", "response": "My son said that yes...it did :)  He was the expert!"}
{"product_id": "B00CXI0BPG", "context": "does it work for windows 8?", "response": "No reason it shouldn't."}
{"product_id": "B0065NP6NC", "context": "Can I play a previous save from the original Fallout New Vegas or will I have to start over from the beginning?", "response": "Yes u can use other save files from prevouse fallout nv games"}
{"product_id": "B001IYR53W", "context": "Will it work on Windows 7?", "response": "it will work on 7. However its not an interesting poker game, ckeck this out with others, the older  hoyles were better with sound abd selections but it is hard to find one of the older ones. I have bought 2 and I am still not satisfied. Lots of luck. Bob"}
{"product_id": "B007WWW2C8", "context": "Where do I put in the game code?", "response": "Once you get your game code you need to create a steam account. Go to https://store.steampowered.com to create your account then go to activate a product on steam and input the code and you should be all set!"}
{"product_id": "B00CMSCTA2", "context": "Is there a way that I can play offline, against just the computer?", "response": "There is a setting on Steam, that allows you to play offline. I think if you choose the game and Polk around on Steam's settings you can find it, plus Steam has that question and answer on their website."}
{"product_id": "B005YR1VP2", "context": "have it all cable which connect on tv?", "response": "No cables, you can get them from the game store for 20 bucks"}
{"product_id": "B0009SUW4W", "context": "will this work on windows 2007", "response": "Yes, I have it on my machine which runs on Windows 7"}
{"product_id": "B00BMFIXOW", "context": "Do I need internet connection to play this in single player mode?Thanks in advance", "response": "you DO not need internet to play this game in single. only if you choose to add DLC content and or multiplayer. other than that! pirate, lute, stab, plunder your brains out my friend. ps: forgive the delay."}
{"product_id": "B000QJ1NS8", "context": "My GBA SP won't charge. Time to change the battery?", "response": "Time to buy another battery"}
{"product_id": "B004N7IIQ4", "context": "Compatible with Playstation 4??", "response": "Yes. And it sounds amazing on my ps4 and Xbox one. I even use it for my 3ds"}
{"product_id": "B00ERDGMT4", "context": "Is this the unupdated version of Borderlands 2, meaning no bug fixes/patch updates?  Will I need an internet connection to patch the game if so?", "response": "No. This game comes with all the latest updates, patches and DLCs. The DLC's for the game though you will need a hard drive for since they take up 4.5 space of storage."}
{"product_id": "B007XVTR12", "context": "Is this played on Uplay and/or linked with Steam?", "response": "The only possible way to play, is on Steam."}
{"product_id": "B00H45K6KS", "context": "Do I have to play any other Atelier games to understand this one?", "response": "No. This is the sequel to Atelier Ayesha, but you don't need to have played it to play this one."}
{"product_id": "B0041RR0TW", "context": "Do I have to set the buttons to play games like assassin creed 3 will this controller have already default setting just like consoles style", "response": "No you don't have to set key bindings to play assassins creed or most games that have gampad support. There is a default setting that is akin to console versions. you can also find key binding settings online that you can download and set with logitech gamepad, but you may also create and use your won custom settings."}
{"product_id": "B00FXOP1MU", "context": "Is this dual voltage, or do you need a voltage converter if you need to charge it outside the US?", "response": "The charger is rated for 120 volts and 110 volts at 60hz. It has the standard two flat parallel prongs, but one is not bigger than the other."}
{"product_id": "B00AFYAUYW", "context": "Are the game cube ports included on this unit? I see them in the pictures, but then at least one reviewer says that they are missing.", "response": "There is no game cube ports included on this unit, because this item is the newest version."}
{"product_id": "B00A9HA52W", "context": "Anyone else having trouble getting the customizer software to recognize the controller?", "response": "Yes I am I haven't been able to fix the problem either"}
{"product_id": "B0000AFQRR", "context": "Will it work on Windows 7?", "response": "I have it on windows 7, it works perfectly;I have it on windows 8, it sometimes works or not."}
{"product_id": "B002TLTBN0", "context": "is this controller wireless", "response": "Yes and no. It's wireless to the console, but you have to have a Wii Mote attached to it for power."}
{"product_id": "B00I4C2EKA", "context": "Can I buy this as a gift for a friend or will it automatically try to download to my PC?  I want to give the code to someone else.", "response": "Yeah pretty sure anyone can redeem the code on steam."}
{"product_id": "B001MGNWDI", "context": "Is this stick durable? Can it tolerate stressful actions  like, trigger pulls under duress or a high anxiety turn?", "response": "I think I understand what you are saying.  I can say I have an xx large hand.  I have a tight grip with that big hand and mine still works after at least 40 hours of game play."}
{"product_id": "B00475AYUA", "context": "can more than one unit occupy the same space of land at a time?", "response": "Yes, you can stack units in Civ IV."}
{"product_id": "B001EYU1WS", "context": "Is it as complex as the picture?", "response": "Nothing is complex about it...it is simple and completely true to function.  In other words...it works great.  It is however oversized and toy-like in feel and appearance as is the other panels."}
{"product_id": "B00GU4F4OM", "context": "can someone please link me driver download, my cd reader is broken.", "response": "I don't think amazon allows to post links, but I do believe you can either check their website or google it lol. Sorry if this isn't much help."}
{"product_id": "B003O6G5TW", "context": "What Dose Wrong Disc Region Mean??", "response": "No idea!  Certainly haven't received that message before.  Exchange product & try another disk or try another xBox!"}
{"product_id": "B000BU0F5Y", "context": "Is it a analog stick or a 4/8 way hat. also do you know what type of keyboard switches do it use Mx, alps or membrane. thanks", "response": "It is an analog sick and the switches are membrane"}
{"product_id": "B0038MVFYC", "context": "Can you play this with the Nintendo 3DS?", "response": "dsl ds 3ds 2ds and 3dxl dsi all systems work"}
{"product_id": "B0079V29EI", "context": "I have read lots of complaints about people receiving the wrong model for their vita. I have the original vita, will this grip work for that model?", "response": "Yes I also have the original Vita"}
{"product_id": "B0057S9SYY", "context": "does it work with the xbox one console?", "response": "yes but not on his xbox360 which is only a year old"}
{"product_id": "B000B78F72", "context": "1) does the freecell have a timer?  If so, can it be turned off?", "response": "Sorry I just play Double Solitaire"}
{"product_id": "B00DRKJBC8", "context": "can you use a controller (xbox360) or do you have to use the computer keyboard?", "response": "Hello Matthew, i use a genius controller with a 360 controller emulator to play this game, so i suppose that is possible that you can use yours. Hope my answer help you and happy gaming"}
{"product_id": "B0058GMO0A", "context": "will this work on windows 7.1", "response": "yes i use it on windows 7 every day"}
{"product_id": "B002YVD3KM", "context": "Does this work on a Mac?", "response": "I honestly don't know.  I tried on a PC and it did work, but not the greatest.  The D-pad was spotty at best.  Sorry can't help you much further."}
{"product_id": "B00F9RGFEY", "context": "I have two game systems. PS3 and PS4. This team works for both?", "response": "Same for me, it's the perfect device for both. Anyway, that's written in the title and on the box."}
{"product_id": "B0072A4JVW", "context": "I heard about the damage that give the ps vita shoulder trigger. Is that true? I really want to buy this hand grip but the review left me uncertain?", "response": "I don't use my Vita a ton but I found the grip very nice for racing games. There is play in the triggers so it's not great for a FPS but I loved it for NFS."}
{"product_id": "B008VQ68C4", "context": "Would this headset be compatible with an Astro Mix Amp? Would it be suggested to buy an Amp with this headset?", "response": "It should be. IMO I don't think you need the amp. But everyone games differently and has different needs. The standard functions of the headset allow you to adjust gameplay and voice, so, it's up to you. I've never owned an amp, so I don't know."}
{"product_id": "B002I0JJ2U", "context": "how good are the graphics? will it take full advantage of my HD 7870 ghz 2gb?", "response": "No this game does not function. It is an online game and there are no game servers you can not play this game. It is a rip off"}
{"product_id": "B004IK24MU", "context": "can someone help me im trying to get them to sync", "response": "There is a tiny hole in the back of the battery pack.  Poke something into it and it will press the red button.  Sync as u normally would."}
{"product_id": "B000OYMYZQ", "context": "How many charge-and-play kits can be plugged in at the same time to the Xbox 360 250gb console?", "response": "You can plug two into the front of your console."}
{"product_id": "B0088MVPFQ", "context": "Is it 3D games ???", "response": "It is a 2D platformer, but you can slide your 3D up on the 3DS and get added depth in your backgrounds."}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "Yes it is a Slim Playstation.  Hope this helps, otherwise, let me know and will assist you."}
{"product_id": "B002CJ8Z04", "context": "you can play this on the gameboy color right?", "response": "You can play it on the gameboy advance, gameboy advance SP, nintendo DS, or nintendo DS light"}
{"product_id": "B005F1ZUU4", "context": "Does this include a disc needed to be used?", "response": "it does but I suggest you download the official microsoft xbox accessories driversyou will need to manually select the driver either way but the official download is more reliable than the ones on the disc"}
{"product_id": "B008O510Y8", "context": "Is it comfortable even if I wear glasses?", "response": "Yes they are. I had Steel-series Siberias before getting this headset. The earpieces to my glasses are somewhat thick, and they were really uncomfortable when I wore the Siberias. When I got the PC 350s I didn't have that problem anymore. So to answer your question, yes they are comfortable even if you wear glasses."}
{"product_id": "B0058GMO0A", "context": "will it run on windows 8?", "response": "Just checked with the back and it says windows 7, vista, xp. so I would say now"}
{"product_id": "B00BXE4W4C", "context": "How do I get the pic axe in the shed....it won't open...is there a patch for this game?  Someone else has the same problem!", "response": "I cant remember it has been i while since i completed the game. Did you try googling a walkthrough?"}
{"product_id": "B005UI8V6C", "context": "How do you get all three games to download only the Traitor Soul will download?", "response": "Start the game.  When you come to the alter, you choose which version to play."}
{"product_id": "B002I0H2G0", "context": "can it play two players", "response": "It says it is a 1 player game"}
{"product_id": "B00H45K6KS", "context": "I have never played any games in the Atelier series, does this game provide tutorials for newcomers to the alchemy system?", "response": "Yes, there is tutorials for newcomers and I suggest you read it careful too plus don't speed through it."}
{"product_id": "B002VBWIP6", "context": "People, I am from URUGUAY and i was wondering if ONLINE GAME CODE (GOLD MEMBERSHIP) would work properly in my country.  Thanks", "response": "you would have to make an out of region Billing account since Uruguay isn't an xbox live supported country and match codes accordingly."}
{"product_id": "B00BMFIXEW", "context": "So, to clarify, this has online gaming with friends, right?", "response": "Yes.  Also there are achievements and missions that can only be completed online."}
{"product_id": "B00AEX81SG", "context": "does this slim design still have wireless internet and bluetooth", "response": "It does have wireless internet.  I'm not sure about bluetooth."}
{"product_id": "B00AKIPBNS", "context": "My son purchased 3ds in usa but found that the 3ds games purchased here in Australia are not compatible . What 3ds  does this game work on?", "response": "This one should work then. Because it ships out from American, its probably going to work since your son's 3ds is region locked to games from the US."}
{"product_id": "B004J6KRD6", "context": "This is listed as a PS3 peripheral.  I know they make a PC version too.  Will this wheel work with my PC?", "response": "Yes, and it works well with both PC and ps3."}
{"product_id": "B004J6KRD6", "context": "What are the list of games for the racing wheel for playstation?", "response": "All answers to these types of questions can be found right on Thrustmaster's website:http://ts.thrustmaster.com/eng/index.php?pg=view_files&gid;=3&fid;=15&pid;=317&cid;=12"}
{"product_id": "B00D7UHT0E", "context": "Are the lyrics appropriate for kids?", "response": "I'm shocked people answered yes. Check out the lyrics to \"blurred lines\" and \"c'mon\" just to name 2. They are both very sexual...I wouldn't consider that appropriate for kids."}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "No you can not unfortunately.. Thx"}
{"product_id": "B00BZOBE78", "context": "Can I use this without redeeming it on steam? Will it still unlock on my local computer?", "response": "You can't play the game without Steam."}
{"product_id": "B008YRITPO", "context": "What key type is this? I'm guessing rubber dome?", "response": "From what I've read, it uses something called 'Scissor Switches' which, while not as responsive as mechanical keys, they have a much better response than standard rubber dome keys."}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "Nope you do not need batteries. Its connected to your controller."}
{"product_id": "B00I9GZZGG", "context": "im gonna get this for a friend if it works on xbox 360 theres like 4 usb slots on it and he really needs a new mic so does it work with 360?", "response": "Unfortunately it won't work the 360. The mic for the 360 works through the controller with a small cable that plugs in the bottom. You won't be able to hear either so it won't work with the 360 at all. The 360 lacks the necessary software drivers to run the sound."}
{"product_id": "B00CPKUV98", "context": "is this 1 or 2 player", "response": "Dude...I don't know...I only play one person.."}
{"product_id": "B0058GMO0A", "context": "will it run on windows 8?", "response": "I am not sure, we have XPERIA, and after having installed for a year or so, it has disappeared! Need to check it out."}
{"product_id": "B00HN9LS48", "context": "I want to play my kinect on my old LCD tv which is 3 inches wide. Does this fit on it?? Does it have enough width so that the back flap works?", "response": "Yes it will. And if you need really need get the Velcro straps that are for hanging pictures frame and use them on the back brace from ever moving."}
{"product_id": "B0050SZBP6", "context": "does this come with the lvl 90 boost?", "response": "It does.  Your character can now reach level 90 and there is leveled equipment, areas, and instances for your level 90 characters to exploit."}
{"product_id": "B008TP1OKI", "context": "do you need to have the transfer cable for this hard drive?", "response": "no, its just like the one microsoft sells, just pop it into your system and its good to go"}
{"product_id": "B00B5QLS4A", "context": "is it compatible with windows 8.1", "response": "Box says it is compatible with Windows 8 so I believe it is"}
{"product_id": "B0018YXM3Y", "context": "do you have to download the game of the disk.", "response": "when i pc downloaded the game it requires a product code where can i find that"}
{"product_id": "B00I9GARIM", "context": "Is this headset comfortable for wearer of glasses?", "response": "Yes, I wear glasses/have worn glasses my entire life and the headset is more comfortable than any other headphones/headset I've had."}
{"product_id": "B001DPZE84", "context": "will this program work on Windows 8.1?", "response": "Works for me just fine in Windows 8.1 64 bit OS.May not work for you since officially Microsoft's webpage says it's not compatible but solution available whatever that means?http://www.microsoft.com/en-us/windows/compatibility/CompatCenter/ProductDetailsViewer?Type=Software&Name;=Microsoft+Flight+Simulator+X%3A+Acceleration&ModelOrVersio;n=10&Vendor;=Microsoft&Locale;=1033&LastSea;rchTerm=&BreadcrumbPath;=fsx&TempOsid;=Windows+8.1"}
{"product_id": "B000ZHMRTA", "context": "what about windows 8.1", "response": "Not sure. Perhaps the game's official website might have some information."}
{"product_id": "B0016897GS", "context": "do you need clips", "response": "Nothing is needed but the cable. It hooks into your Playstation and router.  Works very well."}
{"product_id": "B000BIZR72", "context": "The images show menus in a different language. Will the game appear as such or will text be in English?", "response": "To my knowledge, it is in English. Most games will ask you to pick a language dont they? My daughter hasn't said anything about it not being in English.  Hope this helps!"}
{"product_id": "B003JVF728", "context": "if i buy used will it still work with steam?", "response": "I don't see why not as long as you have steam on your computer."}
{"product_id": "B0038MVFYC", "context": "I want to know if this is the original ds game that came out in 2010?", "response": "yes it is the original"}
{"product_id": "B00AJZNUUI", "context": "do the regular wii controllers work with the mini?", "response": "Yes. Technician at best buy told me."}
{"product_id": "B002I0KP4G", "context": "Is there a way to redeem this through battle.net after I order so I can DL and start playing or do I have to wait for the physical copy to arrive?", "response": "You have to wait for it to arrive.The code for the battle net online version is in the case."}
{"product_id": "B00BGAA3S2", "context": "Which the contents of the pack? Comes with the support?", "response": "Comes with a small swivel support, and is very easy to assemble"}
{"product_id": "B0085VIILY", "context": "does this flight stick work with all other flying games on xbox 360?", "response": "yes they will gives list of flying games works w and modes"}
{"product_id": "B001NT9TK4", "context": "Does this wheel turn all the way around like a real car, or is it basically just the 190 degree rotation?", "response": "It has up to 900 degress of rotation."}
{"product_id": "B001AI7CF2", "context": "where do the gamecube controllers connect to the wii", "response": "There are two flip open doors on one side for the controller ports and memory card slots."}
{"product_id": "B006PP404Q", "context": "Would this fit a Vita slim?", "response": "Yes but it won't cover the whole border around the screen."}
{"product_id": "B004H7P0B6", "context": "Does this include the grey cap?", "response": "Yes the grey and yellow!"}
{"product_id": "B001ELWMHI", "context": "So does this play KOTOR and all the other original xbox games?", "response": "So far I've no problems it playing any original xbox games"}
{"product_id": "B00BS520SG", "context": "Does this work with the Wireless Wavebird controller? I've seen some ppl say yes, others say no. If you have TRIED YOURSELF, let me know the answer.", "response": "it did not worked with my wavebird.... also takes some time (5-8 minutes) to \"sync\" everytime i plug it in"}
{"product_id": "B009GWLSFY", "context": "No Galaga!! Know where I can get it?", "response": "the only classic compilations with galaga are for ps1 and ps2. i have yet to see it for the ps3"}
{"product_id": "B00D3TRMD8", "context": "can you download onto android tablet", "response": "No. You can not. Unless you download on your computer then use team viewer on your tablet, then you can play it on the tablet for you can't download it."}
{"product_id": "B00CD1FCAC", "context": "Why is there two usb cords?", "response": "one is for the keyboard and the other one is for the USB port it has in the back"}
{"product_id": "B0016897GS", "context": "do you need clips", "response": "Sure clips are fine"}
{"product_id": "B003VUNWG0", "context": "Will it actually work with Windows 7 now?", "response": "no, I have tried several times to download it."}
{"product_id": "B00B98HBTA", "context": "is it two player", "response": "Yes it is it has two player"}
{"product_id": "B001AWBYRA", "context": "Can u play with people from steam ?", "response": "You should be able to just add game in steam"}
{"product_id": "B00DC7G0GG", "context": "Can I use the wheel accessory in this game?", "response": "Yes absolutely! Almost everything that was used with the original Wii can be used with the Wii U"}
{"product_id": "B00DPJBTM6", "context": "Does it come with everything? mixamp and all?", "response": "No, the mixamp is not included with this one. A good deal more expensive for the both of them."}
{"product_id": "B00I4C2EKA", "context": "Once you download the game, can't you just delete steam and continue to play Civ V? You download the whole game onto your computer", "response": "No you have to have steam"}
{"product_id": "B00BGA9YZK", "context": "Is the game a disc or just a digital download", "response": "This one is a disc. That is up to you, your personal preference.  I like both physical and digital. Hope that helps. Let me know if you have any other questions."}
{"product_id": "B004UJNN5G", "context": "can a 11 year old play it?", "response": "As long as you don't have a problem with \"woohoo\" and an 11 yr. old.  I believe all the sims3 games have \"woohoo\" option."}
{"product_id": "B00FM5IY4W", "context": "why can't you make it for xbox 360", "response": "Because the Xbox One is the new flagship system and will feature more games, the 360 is now a low end option"}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "Its a super-slim.Its a lot more compact than a slim.Its 500gb"}
{"product_id": "B0096L2SJ0", "context": "Can I use a an rechargable batteries and does it fit an Galaxy Note II? Because its near 3.2 inch (81 mm) limit?", "response": "Idk about the rechargeable batteries but it definitely fits the g-note 2. That's the same phone I use with it."}
{"product_id": "B0016897GS", "context": "i have saterlite internet, i was told to hook up my xbox to the router  and mine connecetion will work better  dose anyone know if this is true", "response": "Yes, a wired connection will always be stronger than a wireless one."}
{"product_id": "B0036WTVNG", "context": "How to make rumble feature work? Windows 8.1", "response": "No, they quit making drivers after Win 7. Sadly you will find it hard to find one that will work with Win 8.1"}
{"product_id": "B00IU3MSF4", "context": "Can I connect it to my regular, old flat screen tv? I'm not exactly sure, but most prob it does not have HDMI", "response": "I would check the back of the TV or the sides, for any HDMI slots.If it has HDMI slots, you can connect your XBOX 360 E using an HDMI cable.If your TV does not have any HDMI slots, this bundle actually includes a 'regular, non HDMI' cable.  Neither PS3s or Xbox360s come with HDMI cables included.  :)"}
{"product_id": "B0050SX9I2", "context": "does anyone know if it works with vudu app?", "response": "It should work with all apps on the PS3. If you are trying to use the app on a machine other than the PS3, than this controller will not work for it."}
{"product_id": "B001TOQ8X4", "context": "I'm confused - what' GW1, GW2 and the deluxe versions. Can I play with GW2 or do I need other things to play?", "response": "You can play Guild Wars 2 with the basic edition of the game. The previous game is not required to play, nor is the deluxe edition. The deluxe is just stuff that you get at the beginning of the game that is useful/unique as you go through the game."}
{"product_id": "B005MQ3BSK", "context": "Does it work on Windows 64bit?", "response": "I am using Fritz 13 with Windows 7, 64 bit. No problems."}
{"product_id": "B00G0OYHCW", "context": "What is its storage size?", "response": "i dont know sorry"}
{"product_id": "B00EV4O8VS", "context": "does the wii u have  a hdmi port to play instead of the red white an yellow wires", "response": "Yes, it has both ports, hdmi and component"}
{"product_id": "B00ACMM9BO", "context": "i dont know how to program my controller it never came with instructions", "response": "there should have been a white sheet of paper in the box with codes on it"}
{"product_id": "B00CORA9GC", "context": "Is a joystick needed?", "response": "No, I use a Thrustmaster Top Gun Joystick and throttle."}
{"product_id": "B003Q55Y5C", "context": "Will the game support a Logitech F310 gamepad, combined with a 2Ghz/Win7/D-Core/4Gb ram/Directx-11 environment? 2nd: Plz confirm NO \"Steam\".", "response": "Make sure your D-Core is at least 2.4 GHz. That's part of the requirements to run it."}
{"product_id": "B0076HD2W8", "context": "Does this connect more than 1 controller or do I need to buy multiple one?", "response": "Confirmed 4 controllers connected last night."}
{"product_id": "B00B5QLS4A", "context": "is it compatible with windows 8.1", "response": "Im not sure because im running windows 7, I don't use mine though because when I received it, it did not work so I ended up buying the Razor Naga and im extremely happy with it."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "Yes, ive down load it before on xp and it works fine as long as you have enough RAM and the video card can support gaming."}
{"product_id": "B003OZOAKY", "context": "can you play this game solo?", "response": "yep.  it's a building game.  meant to be played solo.  need a middle scroll wheel though.  the idiot designers didn't allow for any other type of zoom control and you can't even get past the tutorial without using it."}
{"product_id": "B00BMFIXZG", "context": "online multi player training works good but regular game play is slooooow motion whats wrong?", "response": "We don't play it online, but sometimes it is really slow. Sorry, I don't have a clue. Perhaps your internet speed slowed down? Good luck finding the answer."}
{"product_id": "B00FQFFPZO", "context": "Can you list the track locations -- other than the Daytona, Sonoma, Talladega?", "response": "All the racetracks that the races take place are in the game. Phoenix, Bristol, Indianapolis, etc."}
{"product_id": "B001AI7CF2", "context": "where do the gamecube controllers connect to the wii", "response": "On one of the narrow sides there is a flap that swings open. It has four Gamecube controller ports and two memory card ports.Example Image Link:http://www.product-reviews.net/wp-content/uploads/new-nintendo-wii-confirmed-slimmer-and-smaller-not-all-good-news-2.jpg"}
{"product_id": "B008YA9BVC", "context": "What size jack does it have? I've tried every headset in the store with a 3.5mm jack and it doesn't fit my tablet or Nintendo 3ds xl.", "response": "I'm pretty sure this has a 3.5 jack too"}
{"product_id": "B001AWBYRA", "context": "does it already have all the update patches", "response": "I don't know. If you get an older copy, you will need to DL patches. If you get a newer made disk, you may not."}
{"product_id": "B009CEM332", "context": "Is this game compatible with an Xbox 360 controller? Many PC games are.", "response": "I actually think it's required. Not 100% sure on that, but I can confirm I use a controller with it."}
{"product_id": "B0094X28J0", "context": "I noticed that one reviewer mentioned the battery pack also needs to be purchased. Doesn't this take AA batteries like the old controllers?", "response": "Yes, it comes with batteries like the old one....the other reviewer probably was talking about the rechargeable pack that is sold separately."}
{"product_id": "B002RRLQIO", "context": "Is this made in China?", "response": "Yes, it is. But the quality is much better than the typical made in china stuff that falls apart in days. In comparison, i recently ordered an ipad mini, which was backordered. When i finally got shipping details it was coming from china. The keyboard has been working flawlesly for me and feels like it will last years."}
{"product_id": "B00FYMTUQY", "context": "What's the privacy cover for?", "response": "So that if you wish for the camera on the kinect not be able to see you you can put it on. The camera is always on if the kinect is on and sees the whole room."}
{"product_id": "B00519C7CE", "context": "is this a digital download for xbox 360? i wanna play today, but i dont wanna wait for shipping.", "response": "No this was not a digital download."}
{"product_id": "B00BGAA0SU", "context": "Is this game 3rd person only?", "response": "It is only 3rd person."}
{"product_id": "B00GJ2HZ7E", "context": "Do you need wifi to play?  I know you need it to download... But is it needed to actually play the games?", "response": "The pack is played through steam so you'll need to have an account with them first before downloading the game. All of this requires an internet connection but to actually play the games there should be an offline mode in steam's settings."}
{"product_id": "B0002XJBGE", "context": "rumble pad work on 64 bit vista???? Can these things work on the 64 bit vista program, and if not, which game pad does?????", "response": "It works fine with Win7 x64, and I've found that most drivers are compatible between Vista & 7, so... probably."}
{"product_id": "B001O3066U", "context": "can i download this edition", "response": "yup = insert c d start and presto your allset for a battle with your choice of difficulty. GoodluckGene in Minnesota"}
{"product_id": "B0029M6VKA", "context": "What is the shipping weight and size?", "response": "I can't give you exact figures as I trashed the packaging years ago, but the Size is about as big as a Large paperback book but Much Lighter."}
{"product_id": "B008L3UUPS", "context": "will it take a rumble pack?", "response": "No, it will not."}
{"product_id": "B004QRKWKQ", "context": "Does it work well with the XBOX 360?", "response": "It's actually an XBOX 360 controller that simply comes with a Wireless adapter to work with your PC. It will function as normal with a 360."}
