{"product_id": "B008YRITPO", "context": "How long is the wire on this keyboard?", "response": "Probably about 3ft if not more."}
{"product_id": "B001AH8YSW", "context": "at launch game.    box pops saying I must be administrator to play first time. I am the administrator. Any help would be appreciated I am running windows 8", "response": "Even if you are administrator, try right clicking on the game and choosing \"run as administrator\". You may also have to run it in a compatibility mode for Windows 8. I have Windows 7, so I'm not sure:/"}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "It charges the same way as any other ps3 controller. No batteries necessary. It also has to switches on the backside. One that makes the controller light up and the other activates or deactivates the rumble."}
{"product_id": "B0050SVHZO", "context": "exactly what comes with the console?", "response": "Console, controller, hdmi cord, power cable, sensor bar.  No games."}
{"product_id": "B000GCJ6MK", "context": "I bought a \"used\" one and just realized it requires a product key. Will it work with with a product key that's been used before?", "response": "No product key is assigned to each software it will either not complete the installation or crash upon use sorry have tried with other products"}
{"product_id": "B000FQ2D5E", "context": "What region is this game?", "response": "I think it's not locked. Must work in everywhere"}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "It does not light up unless Flight Simulator is running. But you should really plug this into a powered USB for best performance as the LED's use power and make sure to install the software drivers first."}
{"product_id": "B008GEH9HO", "context": "Can you turn the connectivity off, similar to putting a phone in \"airplane mode\"?", "response": "Yes you don't have to be connected to wifi, unless the game you're playing requires it"}
{"product_id": "B0061PAZUS", "context": "What's the difference between this one and Zumba Fitness Core?", "response": "The biggest difference that I noticed is that the songs seem faster paced in Zumba Rush."}
{"product_id": "B006IR6NH8", "context": "Can I be able to attach this to my G27, I know that the buttons wont work, but is it attachable?", "response": "Not easily. You can fabricate a mod to the G27 (youtube for specific directions). There is a mounting screw in the back of the SRW-S1 if you want to build your own mount for it."}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "Yes, mine worked just fine."}
{"product_id": "B00C71034I", "context": "Do I lose any content if I buy this game used?", "response": "The Deadstroke map... But actually is not that good... so, No... you don't lose anything."}
{"product_id": "B00IP0H4GA", "context": "Is this game compatible with a United States model 1 PS3?", "response": "Yes sir it is :)"}
{"product_id": "B00HN9LS48", "context": "Can this be used to mount the Kinect to the bottom of the TV?", "response": "No.  It's for top mount only."}
{"product_id": "B00BGA9V2Q", "context": "Can I continue where I left off in the demo if I buy the physical copy, or do I have to start all over again?", "response": "I believe you start over but i would be happy to help you level if you would like my email is jjjwhitefoot@gmail.com"}
{"product_id": "B001V9PTVE", "context": "Is this version of fallout censored?", "response": "The version I received is in fact the edited/censored European version. The US version is not edited."}
{"product_id": "B00EI4V3FU", "context": "Can you hear game sound through this headset, or do I still have to have my TV volume turned up?", "response": "You still need to have the TV Volume up. Plus its only one ear."}
{"product_id": "B0072A4JVW", "context": "is this for the 1000 or 2000 series vita? i just tried to buy same brand from game stop and did not fit my original vita.", "response": "Image has 1k buttons. Here the model for the 2kPS Vita 2000 Trigger Grip - Black"}
{"product_id": "B0041G5SD8", "context": "I HATE STEAM - it is as bad as YELP - is this the only way?", "response": "yes sir. I read I line that you could disconnect your internet and then play. Haven't tried it yet."}
{"product_id": "B004G5TUJM", "context": "does this work with NASCAR 14?", "response": "Am not sure, but if you're looking for a really good racing wheel, look elsewhere  - mediocre at best. Not a good turning radius and squeaky"}
{"product_id": "B007A7UJ4S", "context": "This game is Spanish or subtitled in Spanish?", "response": "You can select the language in which the text will display and spanish is an option. The game audio can be chosen as well english or Japanese."}
{"product_id": "B00FE8WKMO", "context": "does this include the balance board?", "response": "The answer to your question is no it doesn't include the balance board only the game itself and the fit meter."}
{"product_id": "B0086UK7I6", "context": "I'm curious about the buttons behind the scroll wheel. In some images one of them is raised and in others they're not. Are they normal buttons?", "response": "the first one is not raised, that changes modes or profiles you create with the logitech software. The second button is raised and it is programed to shift + b on default. And in other mode that button is to change the dpi of the mouse. It all depends on how you want to program the buttons."}
{"product_id": "B003JETPHS", "context": "does this work with lips on xbox 360? thanks.", "response": "No, you have to get the custom mic for Lips. I just purchased this mic and it didn't work with Lips. It's a good mic though."}
{"product_id": "B005Q1YA5O", "context": "does this download come with the game code/ serial number? i have the base game and have origin.", "response": "Yes it does. It comes in your email."}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "All you need is to plug it in to the controller. No batteries required"}
{"product_id": "B00IAVDQCK", "context": "Does this require batteries or is it rechareable through the Xbox One?", "response": "It does not require batteries. It will work with any aux port. I would suggest buying the adapter that connects to your X1 controller."}
{"product_id": "B00E1L786S", "context": "will this work on a lg smart tv? thanks", "response": "I got a LG too and yes it works good :)"}
{"product_id": "B004IK24MU", "context": "Can I charge the the batteries alone? (without placing the whole wiimote on the charger)", "response": "No you need the remotes"}
{"product_id": "B0000512IE", "context": "I bought the it  but I don't know how to use it?", "response": "Can you elaborate? If you have Windows XP or newer it should just install automatically."}
{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "It will 99 percent work in win 8 I have x plane and u had to download a plugin but it works great"}
{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "Yes it does, not in english however but knowledge of Japanese isn't really necessary."}
{"product_id": "B00DLDEKOK", "context": "Can you hear the game sounds rather than using tv volume? I am new to this and hope gran kids can play quietly", "response": "Only using Tv volume, but my kids still love the headsets"}
{"product_id": "B00EZKNSTQ", "context": "how long is the cord on the Microsoft Xbox 360 Wired Controller", "response": "A little over 10 feet counting to the tip of the usb plug-in."}
{"product_id": "B00EF1OGOG", "context": "How do you recharge", "response": "Using an Micro-USB cable (included) connected to any USB power resource like your Phone charger or PC USB port."}
{"product_id": "B00EWEHI5K", "context": "Is it compatible with mac ?", "response": "Yes I use it on my Mac and pc"}
{"product_id": "B0032MM2P4", "context": "I want this to work on my laptop. Will it?", "response": "It will as long as you have Windows XP or Vista.  Won't work with Windows 7 or 8."}
{"product_id": "B00A1Y2STQ", "context": "how many colors does it has?", "response": "The one I received has three colors, blue red, and purple. Changeable by pressing the fn key and the number pad 5."}
{"product_id": "B009XZ1CTQ", "context": "Will the physical CD version work for Windows 8?", "response": "Who knows? It won't work for me with Windows 7. Steam refuses to load so you can't play the game. Do you feel lucky?"}
{"product_id": "B00BCEK2LU", "context": "One picture shows a big palm rest, another shows a little one. Which is it?", "response": "I use the palm rest all the time and it leaves me with plenty of room to rest my palms. It's an attachment so you can also use this keyboard without it if you prefered. I believe it would be considered a large palm rest rather than a little one. Hope that helps."}
{"product_id": "B005BLAJRC", "context": "Will these PC games work on a 64 bit PC?  Many games I had stopped working when I upgraded my PC from 32 bit to 64 bit.", "response": "My 2012 Hoyle I play on a 64 bit Windows 7, so I can say with certainty that this particular game will play on a 64 bit."}
{"product_id": "B00F27JDY0", "context": "I've heard the x and o button are backwards, is that true and then is it possible to change it and have x as enter and o as back?", "response": "They are backwards for this Japanese model. I have not found any way of changing it back. But it's not a big deal and it is easy to get used to. And when you start a game up, it is back to normal for the X and O buttons."}
{"product_id": "B00CMQTUSS", "context": "Is it possible to use this controller in a PC using the microsoft receptor as previous xbox controller?", "response": "Not yet, I assume in the future"}
{"product_id": "B008BGXYBM", "context": "Can you change the color of the lights on this, or is it only green?", "response": "No, this model is only green, but if you look at other Razer products, such as the Death Adder, they can come in red, blue, and green."}
{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "No, it has a campaign, but it still ports in other players."}
{"product_id": "B00E1L78N6", "context": "Does this come with boom mic", "response": "It has a mic built it in. It comes down from the left earphone when it is pushed. It hangs down less than an inch. The mic does not extend all the way to the mouth. You can still talk and hear people clearly"}
{"product_id": "B004IK24MU", "context": "How long does it take to fully charge the batteries? Also is there an indicator to let you knowthey're charged?", "response": "one side never charged. It was the worst charger I've ever had."}
{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "Jackie It work on my win8 computer. However!!! it is not Plug and Play You need to find the right driver for it on x-plane.org"}
{"product_id": "B00CJ7IUGS", "context": "do i need internet connection to download dlc content onto my xbox?", "response": "If you're just purchasing this disc version, you would need to either download the content or buy the Legendary disc set."}
{"product_id": "B004RMK4BC", "context": "can i use this code to pay for ps plus without registering a credit card", "response": "Yes you can and paypal will work aswell."}
{"product_id": "B000ZBZK7C", "context": "Has this been upgraded to run on Windows 8....64 bit  ?", "response": "Yes.  I have windows 8 and it runs great.  Wonderful software.  It is exactly like playing the video poker slot machines in the casinos."}
{"product_id": "B00CD1FC6G", "context": "Does this board still have the LED Issues? (Them dying off after a month or two)", "response": "I too read the reports and was concerned about this. I'm happy to report that after 6 months of use all is still working well. Corsair was aware of the issue and it appears they have adjusted their manufacturing accordingly."}
{"product_id": "B004TTNTYW", "context": "Does this actually work for Nintendo 3DS? Because I brought this for a replacement charger because I lost my previous one.", "response": "I'm not sure about for the 3DS.  But it did not work for the DSI XL"}
{"product_id": "B00F68LBE0", "context": "How long is the included cable?", "response": "A little over 8 ft, but the controller itself is wireless. It just uses a USB drive and the cable is just used for charging."}
{"product_id": "B003EUPCZG", "context": "do the mouse wheel and logo light up?", "response": "Nope, just the Wheel.And the cord disconnects for bluetooth ability.And the side buttons are smallerIt's a wonderful mouse...just the wrong one."}
{"product_id": "B00821ME4O", "context": "Is this a recharge remote controller or does it use like regular batteries???", "response": "It charges just like how a regular ps3 controller charges."}
{"product_id": "B00HVBPRUO", "context": "Can you watch movies on gold wireless headset on the ps 4 if I put blue-ray movies in the ps4", "response": "Yes you can..it works also on other devices such as music players and mobile phones by using the 3.5 mm cable...its included in the package"}
{"product_id": "B008KH7NZA", "context": "Is this headset durable?", "response": "I didn't have any problems by now, i'm with it for 3 months, but until now no problems"}
{"product_id": "B00B5QLS4A", "context": "Does this mouse have a middle-click function on the scroll wheel separate from the button below it?", "response": "yes, the wheel is clickable"}
{"product_id": "B005D5M1P4", "context": "Should I get it? I have the wireless mic I use but I mean is this worth the money? Is it wireless?", "response": "It is not cheap plastic per say but what do you want, steel. I want non heavy and comfy headphones. I have the Delta and they cost me a lot but they are so worth it. Incredible playing BF3"}
{"product_id": "B00CX9L30W", "context": "What does the PC Download Collector's Edition come with? I purchased it and I don't see any of the in-game exclusives, nor do I see anything sent .", "response": "cat mount helm of light good til level 10 gives extra exp behemoth minion fat chocobo mount"}
{"product_id": "B005DKZSVS", "context": "I bought one but the software can not run correctly. It doesnt work now. Where can I get help? I have visited the website of mad catz and ambx", "response": "The manufacture site is the ultimate soure, but having said that I had issues with getting these to work with Windows Vista.What O/S are you using.  If you aren't already, I think Windows 7 is the O/S of choice right now for gaming.  You can get an OEM version on newegg for less than $100 ..."}
{"product_id": "B002B9FIUU", "context": "Can you use two of these for 4 player games; IE Mario Party?", "response": "Yep but on emulator default graphics on PJ64. Minor Graphical errors on most games when using as 4 players like in Perfect Dark. Varies game to game but Mario Party Works when I tested it"}
{"product_id": "B0080CE2WC", "context": "mine blinks red when I plug in any controllers.  What does this mean.", "response": "Mine doesn't blink ... it's either steady read (charging) or steady blue (charged)."}
{"product_id": "B00FC1UH82", "context": "Is the default gate for the stick square or octagonal?", "response": "It's a square gate."}
{"product_id": "B001NT9TK4", "context": "Does this wheel turn all the way around like a real car, or is it basically just the 190 degree rotation?", "response": "Up to 900 degrees, just like a real car. Love this wheel so much. Pedals feel great."}
{"product_id": "B0010WS20W", "context": "Does the software provide training insight into a players leaks or habits?", "response": "Not that I am aware."}
{"product_id": "B00EW6QT76", "context": "Does this include Playstation Plus?", "response": "It includes 30 days of Playstation Plus"}
{"product_id": "B00HVBPRUO", "context": "Can you watch movies on gold wireless headset on the ps 4 if I put blue-ray movies in the ps4", "response": "Sorry don't know about PS4 and bluray."}
{"product_id": "B00BTOAFXS", "context": "Will it make me have a faster trigger finger then now? People say I have a mod?", "response": "These are very usefull for cod or other fps games and help you shoot alot faster.  Though ive had to remove them for racing games or any game u use the trigers for speed controll"}
{"product_id": "B00GU4F4OM", "context": "Will this mouse work with Windows 8.1? I have been seeing some reviews of some that have issues with 8.1 for some reason...", "response": "This mouse is really good.I use it for World of Warcraft and league of Legends.Works with windows 8.1. very comfortable.I would challenge it against Razor Brand any time."}
{"product_id": "B00H8NS1K8", "context": "What systems do these work with? or just PC?", "response": "Mine works great with my Mac laptop"}
{"product_id": "B00EPZ8POY", "context": "I was wondering does this game has two players that you can play with a friend?", "response": "Yes it does , its an amazing game , you could also do a set of multiple characters and arrange them into fights to get to the top"}
{"product_id": "B0073J8BYS", "context": "Are all PS3 games compatable with this?", "response": "Sorry, I gave it as a gift, I dont know"}
{"product_id": "B00GJXMRX0", "context": "if I have widows 8 will it still work?", "response": "Yes, it works seamlessly on windows 8 64 bit. No issues at all."}
{"product_id": "B0050SXFKE", "context": "If I buy this, will the case come in a regular clear case or will it be those ugly greatest hits red cases?", "response": "NO.It Will Be The Regular Case."}
{"product_id": "B008BT80O0", "context": "Is this the English (U.S.) version of the game or an import?", "response": "Is the English version of the game ."}
{"product_id": "B00H72EMP8", "context": "How long is the regular 3.5 mm headphone jack before being attached to the in-line controls?", "response": "Looks to be 3 feet long."}
{"product_id": "B006YDPU48", "context": "How is the pvp combat system compared to Dark Souls? I was obsessed with Dark Souls but Dark Souls 2 looks a bit sluggish and unresponsive.", "response": "I felt like it was faster paced and smoother. They did take away the kick and added some stupid shield break which is almost useless. If you where obsessed with DS1 then you should definitely play DS2. It's for sure an upgrade."}
{"product_id": "B00CJD4HD2", "context": "I ordered this G500 mouse and it is making a high pitched tone that is giving me a headache after 4 hours of use.   Return or try to replace?", "response": "replace That sounds like a capacitor"}
{"product_id": "B00G42KO0Y", "context": "Does it work on Iphone?", "response": "Hello, yes it does work with iPhone or any device with Bluetooth"}
{"product_id": "B00D3RBYM0", "context": "Are there more bugs with the Xbox One version Vs PS4 for the price to be cheaper? If nothing is wrong I will of course get the Xbox One version.", "response": "Hmmm I can't say anything for the ps4 version cause I only have the xbone, but the only bug I've encountered that's rather annoying is the start menu opening by itself while I'm free driving or in a race, other than that it's been pretty good and fun!"}
{"product_id": "B008M4BNQ6", "context": "Can these be plugged into the actual controller or do they HAVE to be connected via the console?", "response": "According to my son who uses it it gets plugged into the tv and into the controller.   If you just want game volume it doesn't need to be plugged into the controller but if your talking to friends then it needs to be plugged into the controller."}
{"product_id": "B002CZ7P04", "context": "Can I use the wii walk it out video game with the wii u", "response": "I don't have a wii u so I don't know for sure.  If the wii u can use a standard disk size game, I would think so.  It is a great game."}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "Yes, I have Plants VS Zombies  and Windows 7 and I have no problems."}
{"product_id": "B004RMK57U", "context": "if i purchase the digital code, do i log in on amazon with my email or the one for the playstation", "response": "If you do this, you're gonna receive the code on your email, from Amazon.Then, you just have to write the code on PS."}
{"product_id": "B0089OBLDO", "context": "I have a PS3 arcade stick which is getting detected in Win 8.1 64 bit, but the buttons aren't working due to nodrivers. Will this adapter work for me?", "response": "U prob is conflict between nvidia chipset and you madcazt stick, but this adapter is fine to solve you problem, or any pci usb2-3 card.."}
{"product_id": "B004W1IX1G", "context": "is it good to buy used wii games or not?", "response": "I've bought many used games...these were Christmas presents so I bought new.  Never bought a bad used game."}
{"product_id": "B00IRHE892", "context": "If anybody plays CS:GO with this mouse ---- When flick-sniping or playing scoutzknives, is the scroll-wheel accurate? Does 1 notch switch ONE weapon?", "response": "Yes, when the scroll wheel is locked, it will switch your weapon per scroll. However, maybe once out of 1000 scrolls, the scroll will lose its positioning and you will have to switch with numbers (1-4) in order to reset its position."}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "yes it still goes through steam."}
{"product_id": "B002XLR0JI", "context": "Does this mouse create loud clicking noise?", "response": "It maybe a bit louder than most common mouses honestly."}
{"product_id": "B00EZKNT5O", "context": "Is  this controller compatible  with 8.1 window deskttop pc", "response": "Sorry I don't know It works great on Xbox 360"}
{"product_id": "B00DWXUYN0", "context": "Is this made to hold the 3ds XL during gameplay or is it just a storage case? Thanks in advance!", "response": "It's just a storage case. It has a fold inside for games but not a place to hold during game play."}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "Sorry, its just for the downloadable contents.  You're going to have to purchase the actual game."}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "So what happens is you get a code from buying here that you enter in the PlayStation network on the ps3 , under redeem code section. Then it downloads that and ur set"}
{"product_id": "B00A378L4C", "context": "are the leds very bright?", "response": "On, they highest setting they are pretty bright, but they can be dimmed down quite a bit too.  I like the breathing mode and I don't find it too bright even in a dark room while gaming.  This is the best back lit keyboard I have ever owned."}
{"product_id": "B002BRZ9G0", "context": "Do you need nunchuks to play this game or just the remote?", "response": "You can play with just the remote"}
{"product_id": "B003JVF728", "context": "Does this game have bad reviews because of physical problems, or are people just one starring this because they don't  like the in game features?", "response": "Either those Two. I believe because there are bad internet service or hacks, but still I enjoy it is very fun game"}
{"product_id": "B00F8W9SWQ", "context": "how many keys can you press simultaneously and have the correct response? I ask this specifically for gaming.", "response": "I have only tried 4 at once and it worked fine, but game was mapped to use this sequence of key press. Results may vary"}
{"product_id": "B009LGO88E", "context": "I have the Newest 3DS XL with the new tiny right joystick that seems useless at its size. Will this device work as a supplement for that?", "response": "No it will not. The device is slightly larger than the previous 3DS XL and it will not operate because of the size difference. I learned that as soon as I got mine, and I just started to use the c stick. It is a little bit awkward at first, but with some practice, it will feel just fine."}
{"product_id": "B0000CNUUP", "context": "If I don't want to install through the dvd, can I just redeem the code on steam?", "response": "I never installed the game...didn't want to play it on the internet on steam. Sorry!"}
{"product_id": "B0002DQUH2", "context": "What are the electrical ratings for the keyboard?On the back it will tell you the rated Voltage and Current.Please tell me what the ratings.", "response": "As usual, amazon is wrong. I don't own this keyboard. Sorry."}
{"product_id": "B00EM5UFF4", "context": "I have Xbox Gold. My kids have accounts on the Xbox but never played live. Is it possible for my family members to play XBL since I have gold?", "response": "Absolutely they can play live."}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yes, we use the balance board from our old Wii. It works great with the Wii U."}
{"product_id": "B00B70WKUK", "context": "can i redeem this on steam", "response": "Yes you can. It is what I did."}
{"product_id": "B00CPKUV98", "context": "How many dics this game has? Heard X-Box 360 has four. Just wondering. . .", "response": "I had it for the Playstation 3 only had one disc wad fun game"}
{"product_id": "B005M2KSLC", "context": "does it have a DPI switch up AND down???", "response": "I am not sure what that is."}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "My tracking has been updated to :Your new estimated delivery date is: Friday, May 30, 2014"}
{"product_id": "B001NXDBI6", "context": "Can the keys on the keyboard be set to individual colors or does the entire keyboard have to change at the same time?", "response": "Fairly confident that all the keys color will change as the keys are not individually lit with their own led."}
{"product_id": "B003VUO6H4", "context": "Is this a ps3 fat or a slim", "response": "It's the first PS3 Slim. It's not the superslim or phat"}
{"product_id": "B00BHSTXV6", "context": "I hit the space bar and it double space. Any fix for this? Thanks", "response": "Never had a problem like that. The keys are sensitive, you may have touched it lightly and caused it to double click. Try hitting more firmly. This has been the best gaming keyboard I've ever owned!! Of course I own the Deluxe Apex, not the raw."}
{"product_id": "B00FENJVOE", "context": "can we have more than one account or username", "response": "Yes, but you would have to buy another copy of the game."}
{"product_id": "B0072A4JVW", "context": "Will the grips still fit on the vita if it has a case on it? I have the eForCity snap on crystal case", "response": "Probably not because this case doesnt not leave any space"}
{"product_id": "B000096L71", "context": "will it run properly on window 7", "response": "My FS 2004 ran very well on XP 64 Pro, but I upgraded to FSX.  FSX ran very poorly for on Win 7 64 Pro.  So, I reinstalled in on XP 64 Pro and works very well."}
{"product_id": "B001EIA2LY", "context": "Is this a good beginner simulator?My 10 yr old son has been wanting a flight sim for a long time.  He obviously knows nothing about flying.Thanks!", "response": "I think in the beginning someone should show him how to fly with the easy airplane and then he must memorize the control keys to fly it in his own."}
{"product_id": "B007SO6USW", "context": "Does it work with the ps3 slim?", "response": "It works on USB. ..I don't even hook mine to the playstation"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game", "response": "Only if you have the play sets that require certain figures."}
{"product_id": "B00965WK8K", "context": "How is this mouse for fingertip grip? Isn't the thumb area too narrow of a space with the buttons and the rest taking too much space?", "response": "I thought the same thing until I bought it and it's actually bigger than you would think. It's a comfortable fit and the features are great. I wouldn't use any other type of mouse."}
{"product_id": "B00FATRKWM", "context": "I ordered the Xbox 360 4GB Kinect bundle.Do I need extra memory -flash drive(s) or an external memory drive?  What is the best way to achieve this?", "response": "Yes (hard drive) if you download games and a lot of apps. Just connect an empty hard drive with usb."}
{"product_id": "B00FLZ4FS2", "context": "If I want to put this on my 360 can my friend put it on HIS Xbox 1..?", "response": "No. Not unless your profiles on his xbox 1. The first code must go on the xbox 360 before the the xbox one because the code is a 360 code. Kind of annoying"}
{"product_id": "B00BDS415I", "context": "How durable is this headset? I want one that can last me a few years.", "response": "Mine broke between ear cup and head band as it did for others. Only lasted about a year under very casual use. Kinda disappointed in them."}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "I use keyboard. Not sure if a PS3 controller works."}
{"product_id": "B0091WIOJ2", "context": "Is Astro support really as bad as many of the reviews on Amazon state?", "response": "Support can be found in the forums. They could use some work  though on the interface on the webpage. Youtube folks have inquired about replacement and been satisfied with the results if unit defective."}
{"product_id": "B00166N6SA", "context": "Is this the original base game for the sims 3? I can't download it I need to buy a dvd. Thanks!", "response": "No this is in addition to the original."}
{"product_id": "B0057WDBHA", "context": "Will this work with the Disney Infinity games? I bought a different one specifically to use with those and for some reason it won't work.", "response": "I tried this controller with several games and I did not find anything wrong with it. Shooting games, racing games, games that I wouldn't use this controller to play with and it worked every time. Hope this helps."}
{"product_id": "B0000CNUUP", "context": "Does this have to be installed through steam?  I don not have internet on my gaming computer.", "response": "Yes, the DVD version I received required that you start the installation through Steam.  I also own the much older CD version which does not require steam.   The files are read from the DVD after the installation is started, but you still have to have an internet connection to do it."}
{"product_id": "B00HVBPRUO", "context": "Is it worth trying if I wear glasses? I tried a few headsets before and almost every of them was uncomfortable.", "response": "Hi, I wear the Oakley Crosslinks, which have the wraparound style arms.  I won't say it doesn;t affect the fit but its fine, you get used to it."}
{"product_id": "B00GV0LR64", "context": "How do you take it off the tv after playing? Does it lose its suction when you put it back on?", "response": "Just gently pull up an edge to break suction. The product works really well however my led went out after limited use in 2-3 months. I actually just bought a 2nd and hope same doesn't happen as led's tend to have a long lifespan"}
{"product_id": "B008SBZF4Y", "context": "can this figure be played with other skylander games or just the skylander giants game only?", "response": "It can be used with Skylander Giants, Swap Force, or Trap Team....just not Spyro's Adventure."}
{"product_id": "B002B9FIUU", "context": "I have a Win 7 notebook, will this adapter work on my computer?", "response": "Yeah you just have to calibrate it with your windows 7. Look it up on YouTube if you have to or google."}
{"product_id": "B00CMQTVUA", "context": "Does this come with a controller?", "response": "i would hope so. but you nvr know with microsoft anymore"}
{"product_id": "B004FS8LYK", "context": "Hi, is this compatible with ps4 console?", "response": "No it is for the PS3"}
{"product_id": "B00F27JDY0", "context": "can you change language to english and have everything like us version and can you use your us psn account?", "response": "Yes, If you launch PlayStation store it only uses the language of the account depending if it is a UK account and etc."}
{"product_id": "B00519C7JC", "context": "Is the sever either for multiplayer or zombie still working???", "response": "Yes everything still works:). Do to it being loveable and popular.:) hope this helps."}
{"product_id": "B002CZ7P04", "context": "Do you get a real workout from this game, can you loose weight?", "response": "I would say yes. It's like walking on a treadmill. I get more exercise off this game than wii fit."}
{"product_id": "B00DE2W4PK", "context": "DOES THE PS4 PLAY THE PS3 GAMES?", "response": "No, but there is a streaming service being implemented that will allow you to play ps1, ps2 and ps3 games. There is also an update coming that gives the ps4 a ps1 and ps2 emulator."}
{"product_id": "B004TTNTYW", "context": "When you say it's good for travel does that mean it is a car charger? I don't need that.", "response": "It is not a car charger. It plugs in to a regular outlet. It's just easy to carry with you."}
{"product_id": "B003O6E986", "context": "We don't have connect but I was thinking about getting this game for my son for his birthday. Can he still play with a regular controller?", "response": "yes you can play with a  regular controller."}
{"product_id": "B00FENJVOE", "context": "Do I need an original diablo 3 before I installed this expansion?", "response": "Yes. You need to have the original diablo"}
{"product_id": "B0049B2FP4", "context": "Will this game work on the Windows 8 operating system?", "response": "Yes. I use Windows 8. Keep in mind the LA PD mod. It adds a nice Los Angeles feel to the game."}
{"product_id": "B00GANWVJE", "context": "does thiws game work for the 3ds xl model?", "response": "Yes. All 3ds games are compatible with the 3ds xl and 2ds models."}
{"product_id": "B00FE8WKPQ", "context": "Does the balance board work well on carpet?", "response": "Yes ... but if you have the rechargeable battery pack you'll need to extend the extenders because of the charging-plug-box that sits under the deck. But the answer is yes it does."}
{"product_id": "B003O6E986", "context": "is it the regular or essentials edition ???", "response": "Need to ask the seller because some are not the regular edition."}
{"product_id": "B000BD1AFA", "context": "Does this work on windows vista?", "response": "The game can work anything over Windows.XP. and it does work on vista. I had it installed on my vista"}
{"product_id": "B000056SPM", "context": "does it work with mac 10.8.5", "response": "Good news.  I live close to CH products here in California so I gave them a phone call.  I was informed that the Flight Sim yoke will work fine with a mac 10.8.5.  The stated, \"Just plug it in and it will recognize the Mac.\""}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "Hi Christine!  I love this game and have been playing it for years.  Matter of fact I have used itso much that I had to buy a new one for my latest laptop which runs on Windows 7.  But yes it works on Windows 7.  Happy hunting and God bless!  Troy W"}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "Yes you can hear different apps and tv through headset"}
{"product_id": "B0009VXBAQ", "context": "Does this Wii console have the ports to insert the Dance Revolution (DDR) mats like the original Wii console?", "response": "Its has gamecube controller ports and usb ports"}
{"product_id": "B007C3E5WM", "context": "Is the light bright and should I buy this product?", "response": "The light isn't a problem for me, although I don't game in the dark, I still I don't think it would be problem. It is very responsive; key binding the 2 side buttons are game specific; and I've never had any double click issues. Worth every penny. Plus when surfing the web side buttons fwd & back page."}
{"product_id": "B0089OBLDO", "context": "can i use this so i can use a wii u pro controller on a ps3?", "response": "no just xbox and ps3 on pc"}
{"product_id": "B00BMFIXKQ", "context": "I played the first assassins creed and stopped because it was so repetitious. Are the later assassins creed games the same way?", "response": "My son says the later games are less repetitious and more fleshed out. Hope that helps."}
{"product_id": "B00ECOAX34", "context": "is this a 2 players simultaneous game?", "response": "Unknown.  Purchased for newphews and it has not yet arrived."}
{"product_id": "B00BKF5IXS", "context": "Does this bundle have everything needed to play regular ps 3 games. Not just move games. Or do I need another console?", "response": "This is the complete bundle. The only thing you might need is to purchase another regular controller, a move controller and a charger for the controllers. But these are just if you want to play multiplayer games."}
{"product_id": "B00EZPCWWA", "context": "Can the DS2 link to a Nintendo DSI or just another DS2? I have two sons and I would love for them to play  simultaneously on one game.", "response": "To my knowledge the 2ds can only link to another 2ds or a 3ds since they are basically the same device."}
{"product_id": "B008FHL56S", "context": "Does this product play Titan Falls?", "response": "Idont know I bought it for my niece I know nothing about gaming sorry I couldn't help you"}
{"product_id": "B00GU4F4OM", "context": "What does it mean by \"selective DPI?\" For instance, are you able to have 2500 DPI? Or just 1,000, 2,000, 4,000 etc..", "response": "Yeah, it's adjustable, using it at the moment it allows for you to fine tune the DPI to get it exactly to the level ya want it. So like, you have get 2,578 dpi if you wanted."}
{"product_id": "B0099OZR9W", "context": "does anyone know if this will work in the xbox 360 E", "response": "I bought one for my 360 and it works fine"}
{"product_id": "B00FEDP968", "context": "Can I listen to music on my phone without it being plugged into the USB port?", "response": "For what you are apparently looking for, you want a Bluetooth (and battery powered) Headset.  These are designed for computer use, and even act as a 5.1 USB sound card. So short answer: No."}
{"product_id": "B00B5QLS4A", "context": "Does this mouse have a middle-click function on the scroll wheel separate from the button below it?", "response": "Yes. The week scrolls and clicks"}
{"product_id": "B00DHUUTEM", "context": "How can I get the backlights to turn on? Fn + ESC does not do it?", "response": "They should turn on by themselves... you might have a faulty keyboard..."}
{"product_id": "B004H7P0B6", "context": "Does this include the grey cap?", "response": "You get one grey joystick and one yellow c stick. The picture is the top and bottom of the sticks."}
{"product_id": "B006RJ373K", "context": "it didn't say about that how much Ram or vga  do I need on my pc", "response": "Minimum 2.5 Ghz Dual Core, 2GB ram, 500 mb Vram.  I'm using on my MacBook Pro 2.5 Ghz Core i5, 8GB ram with 1.5 GB Vram.  It works fine."}
{"product_id": "B009K7OFSC", "context": "what kind of surface does it do good on?", "response": "I ended up buying the gaming surface made by the same company but I tried it on a standard mouse pad. Works fine either way. I just bought theirs b/c it gave me a lot more real estate to work with."}
{"product_id": "B008O510Y8", "context": "does this have a usb connection", "response": "No, Its only dual 3.5mm Headphone/Mic In.   May require good motherboard onboard audio or a sound card to get the most out of them.  Try them out first before buying anything additional for them."}
{"product_id": "B0053BCO00", "context": "Could a 5 yo play this?", "response": "5 year old these days I would say yes. My kid is 10 now but at 5 she had a DS and was playing games like this so depends on the child I think."}
{"product_id": "B004QRKWKQ", "context": "how does it recharge?", "response": "Xbox Controllers use AA Batteries, rechargeable battery pack kits are available (http://www.amazon.com/Xbox-360-Rechargeable-Battery-2-Pack/dp/B0069EB9CY) but I haven't found the need to upgrade to such personally"}
{"product_id": "B00005B8G3", "context": "Does this include with charger?", "response": "The unit I bought did not have a charger."}
{"product_id": "B00D6PTMHI", "context": "When you use Rocksmith, is the guitar plugged into the amp at all, or just the computere?", "response": "You plug it into the computer with the special cable. No amp involved."}
{"product_id": "B00H1FCUBE", "context": "Can they connect wireless with PS4", "response": "I did not tried that, but I would reccomend you to try another product since the blue tooth stop working within a month"}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "Sadly it doesn't. The main campaign is single player. I'm not sure about the online co-op. I haven't setup my Xbox live account yet. Hope this helps."}
{"product_id": "B00CMSCTA2", "context": "can i play on mac", "response": "No, this is for Windows. Although I am running Windows on my Mac through Parallels"}
{"product_id": "B002JVX5V4", "context": "will it work on laptop windows 8", "response": "I don't know, but usually a game of this type explains the minimum system requirement for use.  If anything it might work better for you than for me."}
{"product_id": "B00005NIMA", "context": "Can you use this with a laptop?", "response": "You can use it with any computer with a USB port.  Windows XP or Windows 7"}
{"product_id": "B004N7IIQ4", "context": "Is the Mixamp the 2011 ed. (pictured) or 2013 w the eq presets (as described in item) ?", "response": "I got the newer one with my order so 2013"}
{"product_id": "B00ATHFLZS", "context": "does it work for minecraft", "response": "I don't play minecraft but it works great for world of warcraft"}
{"product_id": "B0080CE2WC", "context": "does this come with the rechargable batteris?", "response": "No just station and power cord. Works great."}
{"product_id": "B0088MVODO", "context": "if I buy the anthology on ps3 does it work on ps4?", "response": "PS3 games are not backwards compatible with the PS4. In other words, PS3 game discs do not work on the PS4 system. However, you may be able to buy and download it to the PS4 via the Playstation Store."}
{"product_id": "B009DL2TBA", "context": "does hookup to analog tv? also, can get pandora and netflix?", "response": "Yes it can hook up to an analog tv and is capable of accessing Netflix."}
{"product_id": "B009AFLXQQ", "context": "Can this controller be used to play Wii u virtual console games?", "response": "thats a very good question... i know that you cant play any wii games, only wii u... but outside of that i dont really know"}
{"product_id": "B00BCEK2LA", "context": "Does this work with Windows XP?", "response": "This mouse does not have native software support for Windows XP; although--aside from possibly the Logitech gaming software--this mouse should still plug and play. This is a best guess based on experiences, but not a guarantee."}
{"product_id": "B007TYC8MI", "context": "Is this a digital version? or a hard copy?", "response": "This is a hard copy man"}
{"product_id": "B0094X28J0", "context": "Does it come with the wrist strap?", "response": "All Wii remotes come with a wrist strap, standard."}
{"product_id": "B000FRU1UM", "context": "does this come with the game and instaltion disc or is it jist the game", "response": "Yes, it comes with both the intsaltion disc and the game disc!!!!!!"}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "Mine shipped in English"}
{"product_id": "B0050SY77E", "context": "How long is this  campaign?", "response": "Cant remember the amount of hours. Probably 9-10 hours or so, although I like to explore all areas of the map and kill everything possible.  I do remember it being somewhat of a challenge (in an enjoyable way) on the regular setting."}
{"product_id": "B004W1IX1G", "context": "Does this deal come with the \"Wii Motion Plus Adapter?\"", "response": "No, it did not come with the adaptor."}
{"product_id": "B00B15EXJC", "context": "How big is the USB dongle?", "response": "About 1 3/16 L x 11/16  W by 3/8 high"}
{"product_id": "B002MRUROI", "context": "will this work on XBox 360 Kinect'???", "response": "It hooks to the back of your xbox 360 only"}
