{"product_id": "B00BTOAFXS", "context": "in the halo games you cant charge your weapon. Do you know how to fix it?", "response": "It's meant for games like black ops, it doesn't let you charge your weapons cause of the trigger stops stops from you pushing the button all the way down when you play just unscrew them"}
{"product_id": "B00EFFVZP0", "context": "Greetings, I bought this game with you, but I want to know if it brings the Spanish language?", "response": "No, it's English only."}
{"product_id": "B007SO6USW", "context": "Can you charge the controllers with the skin on them? I have a glow in the dark skin cover on one of my controllers and its a pain to have to take off", "response": "I'm not sure about that. I never used any skins. It plugs into the controller receptical and wraps over the top enough to cover the words \"sony\" on the top. If the skin covers the words \"sony\" it probably won't work. Hope this helps, sorry I don't have a definately answer for you"}
{"product_id": "B001FBHT34", "context": "Does this work with a Mackbook pro?", "response": "With an adapter like this one - Sabrent USB 2.0 Virtual External 7.1 Surround Sound Adapter (USB-AUDD)It has poor reviews, but it works just fine for me at 1/3 of the cost of the other linked item.  I have a MacBook Air without even as many inputs as the Pro."}
{"product_id": "B00D4WTO1M", "context": "Is this ps4 game supported or compatible on a 720 HD LCD TV???", "response": "Yes but it don't look as good"}
{"product_id": "B00HG0B8NA", "context": "can you make the cards VERY LARGE?", "response": "The cards cannot be sized. They will only be as large as your screen. If you haven't already done it-toggle to the full screen mode."}
{"product_id": "B00CD1FC6G", "context": "Anyone using it on Linux (specifically, ubuntu)? If so, maybe you can mention how compatible it is", "response": "It uses the standard XF86* media keys, so most configurations should work either out of the box or with minimal editing. I have gotten it to work on Arch Linux using both XFCE and i3."}
{"product_id": "B007FTE2VW", "context": "Does this game have a product code? You need one to play it.", "response": "Yes I believe so and its linked to one email and password."}
{"product_id": "B009WGUYIG", "context": "Can this be used on the wii?", "response": "Yes I believe so.  I purchased all of the Skylanders Giants only for my son to play on the Wii.  Hopes this helps."}
{"product_id": "B007FVVXXA", "context": "should I tape it to the ps3 if it wont stay or is there somthing I can use something else? will it help to put my ps3 vertically", "response": "The only time I have a problem with it slipping out is when I remove cable as long as you hole the unit when removing cables you will be fine"}
{"product_id": "B00503EAG2", "context": "Will this work with windows vista", "response": "According to Steam, under support, Windows Vista is listed as compatible OS"}
{"product_id": "B003O6CBIG", "context": "Hello, can anyone please tell me if I can play as Michael Myers in this COD? or is it only the ps4 version? Thank You!", "response": "He is also in the PS3 version.  But you have to buy the DLC Onslaught."}
{"product_id": "B001IYR53W", "context": "Will it run on windows 8?", "response": "Yes it runs in Windows 8, the newer version of Hoyle is not as user friendly, so I like the old version better."}
{"product_id": "B00E1L786S", "context": "how do you change the modes?", "response": "Mine normally picks up what ever device is on. But you can switch using he remote. There 4 buttons across the remote, 1 for each device hooked up to the speaker"}
{"product_id": "B00GZ1GUSY", "context": "Do you have to have internet to play this?", "response": "You don't need internet access to play the single player story mode, but there are patches that have been pushed out that will greatly increase stability, fix bugs, and add additional features. These patches will require just hopping online briefly with the game."}
{"product_id": "B00DE2W4PK", "context": "The playstation plus comes in the box?", "response": "Yes it comes in the box good for 1 year."}
{"product_id": "B00DJYK8XS", "context": "does is comes with a belt", "response": "Yes and you put the control in the belt so it can tell what you are doing.  Have fun. :-)"}
{"product_id": "B000PD0HQE", "context": "Does this come with a xbox live 1 month code and a standard xbox 360 headset?", "response": "Unfortunately not! I am certain tho if you make a new profile from the start, you automatically get a free month of live. And for the headset, i lost it a while back when I first got it. It's best off to buy a pair of turtle beaches or not the Xbox headsets because they're very fragile and unreliable."}
{"product_id": "B008YRITPO", "context": "How long is the wire on this keyboard?", "response": "about 10 to 15 ft"}
{"product_id": "B00F27JDY0", "context": "can you change language to english and have everything like us version and can you use your us psn account?", "response": "Yes all settings are changeable and the ps account is a US account as well."}
{"product_id": "B00DBDPOZ4", "context": "Is this product essentially the same as putting 2 aa rechargeable batteries into the controller and just plugging a micro usb until charged?", "response": "Well in theory yes but its not 2 separate batteries, its one rechargable compact battery."}
{"product_id": "B002J9GDXI", "context": "How long is the cable? Is it braided?", "response": "The cable is rather long and very sturdy braid, I have never had a mouse with a chord like this one, so I was surprised.  I have had this mouse for a couple of months now, as a daily gamer I would definitely recommend it!"}
{"product_id": "B0027AP5S8", "context": "is it Jtaged for copy games? and can European/PAL games work on it?", "response": "This is NOT a Jtagged console, this is just a case for the console."}
{"product_id": "B0002FGFHU", "context": "Hi, I am from Germany. Is this the US Version? I have the German an UK version, but theres no Honda Civic. Is here on this the Honda?", "response": "you can download a mod for the US or UK version. Just search mods for NFS U2 and you should find it."}
{"product_id": "B002J9GDXI", "context": "Does this mouse have volume control?", "response": "If you mean controlling the volume of your computer through the mouse, I don't believe so. Though it does have a programmable buttons, so possibly."}
{"product_id": "B00F27JDUY", "context": "does the ac adapter that comes with japanese model work in USA?", "response": "It is the same plug you use in usa"}
{"product_id": "B00DC9SWWE", "context": "The rating says it has \"strong language\" is there anyway to turn that off?", "response": "No, not that I am aware of"}
{"product_id": "B00ATF5YYI", "context": "Does this have the nazi zombies on it?", "response": "Yes. 4 levels. Awesome."}
{"product_id": "B00CMC6HZ6", "context": "Can you take the fight outside of the wresting ring area into the stands?", "response": "You can take the fight outside the wrestling ring but not into the stands."}
{"product_id": "B00GU4F4OM", "context": "How loud is the sound when clicking? Right and Left, if there's a difference. Thanks,", "response": "The left button click is semi-loud in a quiet environment. Nothing crazy though. The right button is quieter. On a 1-10 scale, 10 being VERY LOUD, id give this mouse a 6-7 overall."}
{"product_id": "B006W41X1S", "context": "does the mic work good", "response": "we have had nothing but quality all around from our head set, mic works great and sound quality is fantastic."}
{"product_id": "B0050SY77E", "context": "Is this the Hunter Edition like on the picture used?", "response": "Yes if you switch to the arrow position."}
{"product_id": "B0009VXBAQ", "context": "Is this just the regular Wii?  I had one but my daughter took it when she left and now I can't watch Netflix or use the Wii fit.  I have the disks.", "response": "Yes I believe so."}
{"product_id": "B0095P5K8I", "context": "Has anyone had any trouble with it randomly double clicking and selecting stuff behine open windows or drop down tabs?  I have had mine for 1yr.", "response": "I had the double clicking happen, then it decided to just quit on me one day. quality is not goof."}
{"product_id": "B00CBNV7UQ", "context": "Is it 2 player", "response": "Yes Local Co op is available. Lots of fun with two people."}
{"product_id": "B000035Y6D", "context": "Does this include the original box?", "response": "My did not come in the original box, just a regular box with peanut foam to keep it from getting damaged."}
{"product_id": "B00DE2W5XG", "context": "Does the used version come with the card?", "response": "I would not know. I did not buy mine used. If its the PS+ card, you might be able to find some one who didn't use it"}
{"product_id": "B00CJ7IUGS", "context": "How much space do the DLCs take up on the hard drive once they've been installed?", "response": "I really don't know, All I have left on memory is 64.8 left to play with memory wise for the xbox...Hit up you tube to find out how much exactly."}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "There used to be release day shipping, but it's disappearing and everyone is saying that they can't get it delivered on release day."}
{"product_id": "B0000512IE", "context": "Can I use these with Window 8/8.1?", "response": "Yes, you will need to go to their website to download version 4.55 or above of the CH Control Manager program, then you'll be all set. Find it here: http://www.chproducts.com/13-29170-Downloads-and-Community.php"}
{"product_id": "B00DBKSN8M", "context": "is the game a download or a disk, and does it need internet to play the game.", "response": "It comes with a disc yes n yes n no for the internet u dnt need internet to play the story mode but the online u do"}
{"product_id": "B0041G5SD8", "context": "I HATE STEAM - it is as bad as YELP - is this the only way?", "response": "When I bought my copy half of the so-called included dlc wasn't available so had to contact sega - who gave me a new steam key to download it correctly. So if my experience is anything to go by, it's vital you have steam."}
{"product_id": "B00DC7FWRE", "context": "Is it interactive, meaning can I play with others around the world?", "response": "it is only for local multiplayer. This does not connect to the internet and allow you to play with other people around the world."}
{"product_id": "B006JSY3MI", "context": "Can it run on any version of Windows after Windows 2000?", "response": "I ran the game on Windows 7, so I would imagine it would run on Vista as well. I know it runs on Windows 8, too. I don't know about Windows XP, but my guess would be that it would. Most games that run on Windows 7 can also run on Windows XP."}
{"product_id": "B005L38QK2", "context": "My mouse stopped working. How can I return this product and replace it with another ?", "response": "As one of the other responders said time is the key and if it has been too long only calling steelseries and hoping they will be able to do something is all I can say. If not you shouldn't have too much trouble."}
{"product_id": "B001L5TIR4", "context": "Is the Rise of Atlantis compatible with Windows 7?", "response": "Yes, I am running it on both Windows Vista and Windows 7"}
{"product_id": "B009GSX0A4", "context": "Does it have english", "response": "No it dosent but the menus and controls are easy to learn, plus there are translation guides on google search if you dont read Japanese"}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "No. You have to redeem the code on 360 and then it just shows up on the XB one."}
{"product_id": "B00D9EPI38", "context": "if all I want is to play games, is 4GB good enough, I dont need or want all the bells and whistles, just gameplay", "response": "As long as you're going to play games of the actual discs, then yes 4 gigabytes is plenty good. If you are wanting to download games from xbox live and run them off a hard drive, then 4 gigs will not get you very far."}
{"product_id": "B00F27JDY0", "context": "Can you change it to American or is it only in japanese?", "response": "Yes you can change it to any langue and it is compatible anywhere, I'm personally located in California"}
{"product_id": "B005EQE0YM", "context": "Are these very comfortable?", "response": "I have 2 teenage sons who say they are very comfortable, unfortunately the mic went out on them after about 10 months so they no longer use them."}
{"product_id": "B00D84DRNC", "context": "Is this real leather?", "response": "No, it's not. But the material is very reliable and safe for any 3ds. Good quality."}
{"product_id": "B001AI7CF2", "context": "which wii has gamecube controller connections", "response": "I believe they all do, but I have the black wii and it does. These work great to extend them."}
{"product_id": "B00AAQRNQ8", "context": "How long is the cable?", "response": "Honestly dont know the exact measurements, and I am too lazy to measure it myself. But I assure you it is long enough for your needs. Probably about 8 ft. But I am purely guessing."}
{"product_id": "B00A378L4C", "context": "I just recently received this keyboard. My F5 key is not lit up when I have it fully lit.  Do I have a dead led?", "response": "All the keys light up for me.  None of the different lighting modes just dim the F5 key.  I think you should return it."}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "Standard or collector's edition, the first 30 days is free upon register. The subscription only start after that.If you are play, can come and join me in Tonberry server. IN game name: Aser I will guide you."}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "As far as I could see, it supports all major languages. The first thing you do when you turn it on is choose the language."}
{"product_id": "B00IIHU44E", "context": "How large is the internal hard drive?", "response": "500 gigabytes but is really annoying is you have to download all your games before you play them only thing I dont really like about it"}
{"product_id": "B007YLUCME", "context": "I am confused of plug and play. If the controller cannot turn on without having it plugged in, what's the point of having a rechargeable battery?", "response": "Hi.The controller can be turned on without having it plugged in the USB cable. The rechargeable battery allows independent operation. Regards"}
{"product_id": "B000VRCNLG", "context": "Will it work on windows 7", "response": "Google will now answer questions like this by just typing question.The answer came up:To run the Program Compatibility troubleshooterOpen the Program Compatibility troubleshooter by clicking the Start button Picture of the Start button, and then clicking Control Panel. In the search box, type troubleshooter, and then click Troubleshooting. Under Programs, click Run programs made for previous versions of Windows."}
{"product_id": "B000OPOCFU", "context": "Where on the DVD is the product key.I tried entering and it still wont take it", "response": "I got a case with mine that had a paper on the tiger woods golf inside and on the back of that paper is thecode number...I hope this helps let me know"}
{"product_id": "B00656HLGO", "context": "Will this work on xbox 360 Pro??", "response": "I dont think so. The pro had a 250 gb hard drive that could be found at one time. Search amazon specifically for xbox 360 pro 250 gb hard drive."}
{"product_id": "B00BDS415I", "context": "How long is the cable, is there any way to lengthen it?", "response": "The length of unit is over 17.5 feet long. You can extend the length on the headphone side of amp with a male/female 3.5 mm 4-pole extension cable. (Sorry for delay in answer, I was on vacation and just caught up on email)"}
{"product_id": "B00005QEFD", "context": "Does the system come with the game where the bunny chases carrots?", "response": "Don't know that game, but mi e was just a console, no games included."}
{"product_id": "B00ANHBJBY", "context": "Controller only works when plugged in. Is there a color that indicates when the thing is fully charged? Or did I just receive a bad unit?", "response": "Bad controller. On mine the charger port broke"}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "bruh, this controller isnt even a controller... its practically a dorito dust holder GOD (also I like potatoes)"}
{"product_id": "B000A2R54M", "context": "Is this a 3ds game", "response": "No but their is a 3DS counter part called Mario Kart 7 for Nintendo 3DSAmazon Product: Mario Kart 7"}
{"product_id": "B0065NP6NC", "context": "Is this version more, or less buggy then the regular edition? Less crash/freeze prone?", "response": "I've never played on the regular version, this is the only one I've played"}
{"product_id": "B005764CWO", "context": "I have this controller and was wondering if anyone had the same problem with the left analog stick not responding, if so, what do i do to fix it?", "response": "you cant do anything about it which sucks i have a problem with the controller not working on my ps3 this controller over all is junk"}
{"product_id": "B004NRN5DU", "context": "The Game Has Spanish Language", "response": "mmm no entiendo si viene en español ? disculpen mi estupides"}
{"product_id": "B001FBHT34", "context": "are these headsets adjustable and suitable for an 8yr old for 360 xbox live", "response": "These headsets aren't for xbox or ps3 unless you have 3.5mm jack for both sound and mic and if you did yes it would be adjustable"}
{"product_id": "B007XVTR3K", "context": "does it have offline multiplayer", "response": "Yeah go to local and play with bots"}
{"product_id": "B00HEX8TA4", "context": "The lights come on, but the mouse and buttons won't move or work?", "response": "Did you install the software?"}
{"product_id": "B00F27JN8Q", "context": "Can the Japanese Vita TV's AC adapter plug into a US wall socket without problems?", "response": "Yes, you can. No problem, but I'll recommend you to buy PSVITA because some game softs cannot be acceptable with this device."}
{"product_id": "B0038PBF1W", "context": "is this just a simulator or does it have arcade play options", "response": "There aré 3 options arcade , realistic And simulation"}
{"product_id": "B00B70WKUK", "context": "is this like a CD and you put it in the computer and all good will be able to play  or i have to install program and be online .?thanks", "response": "well its easy you only just put it on your computer and Install the game probably it will update something if you have internet connection at the installation process but its easy to install. XD good luck"}
{"product_id": "B00292OW1U", "context": "The keypad to the left, can we use it to move the character about similar to the arrow keys?", "response": "Yes the keypad to the left is designed as a gamers left hand paradise. It works perfectly, allowing a far greater maneuverability and capability when gaming."}
{"product_id": "B003ZSP0WW", "context": "Will this work on Amazon fire TV games", "response": "Nope, it only works for xbox 360 console."}
{"product_id": "B00FA6YFTQ", "context": "it has a metro 2033 key or is just the download?? because i want it on steam", "response": "Any game on Amazon that says \"DRM: Steam\" means you get the Steam key. :)"}
{"product_id": "B00CX8VYM0", "context": "Is this a digital code or the actual game disk?", "response": "It's the auctal disk not a digital code."}
{"product_id": "B00CMQTVK0", "context": "can it be turned on its side like the xbox 360 can. or does it have to be kept flat like in th pictures", "response": "Has to be flat"}
{"product_id": "B00EZKNSTQ", "context": "does it come with a cord", "response": "yes it does when my grandson got it he love it and i love it no batterys"}
{"product_id": "B008X73CE8", "context": "Is this playable without being online to Internet? Somewhere I get the idea that his is an online only game.", "response": "I play it off line at home on my Desktop and at work on my laptop all the time"}
{"product_id": "B004HYK8Y8", "context": "is it first person or third?", "response": "Both. You can switch between 1st or 3rd person view points."}
{"product_id": "B00CMQTVUA", "context": "How large is the Hard drive  for xbox standard system?", "response": "Not a clue, sorry."}
{"product_id": "B005Q1YA5O", "context": "Is this the one that includes the base game sims 3 and sims 3 pets? I saw a cover just like this but this doesn't say it includes both", "response": "No it doesn't have the base game the only ep that come with the base game is the starter pack one that also include late night and a stuff pack"}
{"product_id": "B004J6KRD6", "context": "is it better than t300rs ?", "response": "If the 300 came with these pedals, I would have bought it.  Another major deciding factor was that I got this one around Christmas for only $50 more than the 300.  Had it been full price i would have bought the 300 and purchased these pedals(if that's possible)..  Hope this helped"}
{"product_id": "B00726ARTE", "context": "is this 4 xbox 360 or ps", "response": "Pc mobile xbone one and ps4"}
{"product_id": "B000WCCURW", "context": "DRM, no internet or phone registration required?", "response": "I've never need that to play?"}
{"product_id": "B00166N6SA", "context": "Will this work on a windows 8.1 computer?", "response": "hi. yes, it will work as long as you have the latest version of the sims 3. so update the game first before playing."}
{"product_id": "B00CX9L30W", "context": "Does this come with the game itself?Or do you have to purchase the game and the CE to get it's benefits?", "response": "Yes it's a digital download"}
{"product_id": "B0000A2TPE", "context": "Can this work on Windows 7?", "response": "Yes! It also works on Windows 8"}
{"product_id": "B000096L71", "context": "if I buy the 4 disc used do I need a code to get it to play ???  thank you", "response": "No, but you do need disk 4 in the cd/dvd drive."}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "Yes, and it's fantastic (especially with an oculus rift dk2)."}
{"product_id": "B0061PAZUS", "context": "does this work in Xbox 360 Kinect NTSC-J model?", "response": "I works with any xbox kinect successfully attached to your console"}
{"product_id": "B00FENJVOE", "context": "Is the entire \"expansion\" really just one additional Act V?", "response": "Essentially yes and no. One new act is added which is the majority of the new content. There is also a new class, the crusader. But importantly, you get a new system to play Diablo III, Adventure Mode. Adventure mode is only available with this expansion. So technically you get 3 new things."}
{"product_id": "B002TLTBN0", "context": "Can you use this controller to play GameCube games on the Wii? Something like Soul Calibur 2?", "response": "Nope. You'll need a Gamecube controller along with a GameCube memory card to play GameCube games. You mostly use the classic controller for Virtual Console games"}
{"product_id": "B0072A4JVW", "context": "Does this get rid of having to use the rear touch pad?", "response": "No, it does not get rid of having to use the rear touch pad."}
{"product_id": "B000ND3XXA", "context": "does this work with Mac OS X too?", "response": "Yesjust plug and play"}
{"product_id": "B007SRM5U6", "context": "Is this an Internet game only or can you just play it on  PS3?", "response": "It's mostly for the ps3, but you can go online for some content"}
{"product_id": "B00FEOR4MY", "context": "Is this only for 2DS?  Will it work for DSI XL??", "response": "it fits the DS2 perfectly. im not sure how it would work for DSI. but its well work the money."}
{"product_id": "B00006C2HA", "context": "Are there only 3 discs in this game?", "response": "The case has 4 slots for disks but that is only because 3 disk cases don't exist.  There were already 4 disk cases so they just used that.  The 4th disk place is for the serial number you input to install the game on a PC.  So there should only be 3 disks."}
{"product_id": "B004HYIAPM", "context": "As a new player what should I know going into this game? Any recommendations or suggestions?", "response": "Be warned: you're going to lose a lot of hours playing this game. You might never see the people living in your house for the next few weeks."}
{"product_id": "B0086UK7I6", "context": "Are the buttons fully programmable for things besides games? ie copy/paste ctrl+w etc", "response": "They are prgramable with the ability to do more then one button at a time so you could program Ctrl+c to copy as a button. Only problem I had was making the shift key function as a programble button such as Ctrl but you can program the shift functions and it works with shift key then."}
{"product_id": "B0079V29EI", "context": "I have the PS Vita Model 1001 that was part of the Assassins Creed Liberation bundle. Will this work with that model?", "response": "Yes it will. I´ve got the same PS Vita model as you and it works flawlessly =D"}
{"product_id": "B000FP0K0U", "context": "Will this work with Windows 7?", "response": "I am using it with windows 7. So, Yes."}
{"product_id": "B0050SXKU4", "context": "Is this US version? like will it work on a ps3 from usa?", "response": "My son plays it on his ps3, it should work on yours"}
{"product_id": "B00HN9LS48", "context": "Regarding the critical comments, do you think attaching a simple velcro strip would solve the problem of is not staying attached?", "response": "It does not fix properly an as the device is so expensive and fragile, may be one day I will find a use to this clip. Don´t forget the maid during the cleaning ... it will be fatal to our beloved Kinect."}
{"product_id": "B0050SWBAE", "context": "Why is this listed at $75?", "response": "It's because there is not a supply of them in the U.S. It's a very rare to find one new at a store anywhere."}
{"product_id": "B0057WDBHA", "context": "is it wireless or wired?", "response": "its wired and it started malfunctioning after a while"}
{"product_id": "B008L3UUPS", "context": "will it take a rumble pack?", "response": "No. The slot is there, but only for aesthetic purposes."}
{"product_id": "B005BLAJ68", "context": "does this game have the characters that talk to you like capt. scurvy the pirate parrott", "response": "Yes, but I dson't use this setting."}
{"product_id": "B002YVD3KM", "context": "Does this work on a Mac?", "response": "I have heard that it does but I don't have a mac. Sorry I can't really answer."}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "can it play ps2 games? I noticed there's ps2 system update on play station store online,so it does?"}
{"product_id": "B0095P5K8I", "context": "Compatible with Os X?", "response": "Not sure but I wouldn't recommend it because the clicker will break within 1 - 3 weeks. My left-click doesn't work anymore and its REALLY REALLY hard to click it."}
{"product_id": "B00EPZ8POY", "context": "is this like a story mode or it's your standard fighting game?", "response": "There is a story mode, it is how you unlock the rest of the cast"}
{"product_id": "B00HHAIY72", "context": "It looks like the theres backlighting on the throttle controller. Is this device backlit?", "response": "Yes, it's backlit with green lights."}
{"product_id": "B00BS520SG", "context": "If I buy multiple adapters and plug them all into Wii motes, can me and some friends play brawl simultaneously at the same time?", "response": "Yes, up to 4 adapters can be used. I would suggest waiting for the official Nintendo adapter that will include 4 ports."}
{"product_id": "B008B3AVPC", "context": "Is this really worth it? I heard this was the second worst CoD out there! And should I just get the Standard Edition or with 1st DLC collection?", "response": "It is the best one"}
{"product_id": "B003ZJ1VD8", "context": "is this the blue LED Razer blackwidow?", "response": "Uhm. By blue, only the insignia at the bottom lights up blue. If you want a keyboard where there is a light behind the keys that lights blue then this isnt it. Just a good old mechanical keyboard with the razer symbol at the bottom pulsating blue"}
{"product_id": "B001EYU1WS", "context": "Is this product compatable with windows 8", "response": "I can't give you a definitive answer.  I believe that it is but I am not real sure.  I am using Windows 7.  Sorry I couldn't have been more help."}
{"product_id": "B0009WPZOA", "context": "Is this the same as the other need for speed most wanted", "response": "This is the original most wanted that came out back in '05 not the remake that came out in 2012. You may know this, but the '05 and '12 versions are way different."}
{"product_id": "B00JM3R6M6", "context": "If I buy used, will I able to create a new game or I am stuck with the previous saved game?", "response": "Yup! Just go to the Town Hall on your map, click options, and there should be an option to \"delete saved data\"."}
{"product_id": "B002RRLQIO", "context": "Does this keyboard use Cherry MX keys and if so which color?", "response": "No, it doesn't. The only mechanical keyboard Logitech makes is the g710+."}
{"product_id": "B0096PLB9O", "context": "Is this unit compatible with 64-bit Operating Systems? I have seen some that are not, and I want to be certain before purchase. Using Win7x64..", "response": "Yes, just be sure to download the 64 bit drivers."}
{"product_id": "B00ENFVS5Y", "context": "How is this wheel mounted? Example I have the  Microsoft 360 Wheel & it has a clamp to attach it to a desk.", "response": "Yes it has a clamp"}
{"product_id": "B00A378L4C", "context": "I just recently received this keyboard. My F5 key is not lit up when I have it fully lit.  Do I have a dead led?", "response": "I believe so. I messed with different lighting modes and could not produce what you are describing."}
{"product_id": "B00HVBPRUO", "context": "Can you watch movies on gold wireless headset on the ps 4 if I put blue-ray movies in the ps4", "response": "Anything going through your PS4 should go through this headset. I like how it automatically 'mutes' your HDTV."}
{"product_id": "B0061PAZUS", "context": "I currently have the Zumba Core DVD, does this DVD (Zumba Rush) have workouts that are different from Zumba Core?", "response": "This isn't a DVD it's an XBox game and all of them are different...at least the ones I have are all different. I don't have the Core one though."}
{"product_id": "B000IBELZG", "context": "does this camera work on psp e1004", "response": "I remember using one of these cameras on the series 1000 I had.  So, I am sure its a go."}
{"product_id": "B00FLLFJE0", "context": "I tend to leave my items charging, does this have an tickle charge or auto shut off?", "response": "No just stays charging"}
{"product_id": "B006IR6NH8", "context": "Does it work with any driving or racing game, even simulators?", "response": "Yes it works with other games, it functions just like a game pad would."}
{"product_id": "B00BGAA3S2", "context": "Is this similar to the Kinnect for the Xbox? How or how not?", "response": "in some ways yes in others no. kinect has more voice commands. (for now) also in the future give or take a few years Sony will come out with a VR headset the works with the camera"}
{"product_id": "B00DUARBTA", "context": "Does this game have multiplayer mode?", "response": "the whole game is playable with 2 people. I'm not sure about 3+. but it's super fun with 2!"}
{"product_id": "B003Y5AHPG", "context": "Do I need to buy any additional controllers to play any particular gaming system of the three", "response": "The controllers that came with the system are alright, but I still ordered the old school controllers gives me the complete old school feelings, enjoy"}
{"product_id": "B006YDPU48", "context": "Do I need to play the first one to understand whats going on?", "response": "No I don't think.but the first one was great I would give it a shot"}
{"product_id": "B0095D1CM8", "context": "Does it has all its accesories?", "response": "Yes, it comes with a few parts that you're able to swap out. All the weights are on by default."}
{"product_id": "B003O6JKLC", "context": "Is everything here to start playing (other than a game)?  Would I have to purchase anything else?", "response": "What I have is just the console w/o cords cuz I already had them."}
{"product_id": "B00G0OYHCW", "context": "Are the games Physical or Digital?", "response": "Both....varies by the game. Mario and luigi just uses the buttons."}
{"product_id": "B005S0KHIC", "context": "does this work with windows 8?", "response": "not well at all, will try soon again"}
{"product_id": "B003O6C0V4", "context": "So does it come with everything?", "response": "Yes it comes with everything"}
{"product_id": "B005BLAJRC", "context": "what games are included on the cd?", "response": "backgammon, checkers, chess, dominoes, reversi, crosswords, Chinese checkers, battling ships, anagrams, tile games, master match, rummy squares"}
{"product_id": "B0050SVHZO", "context": "exactly what comes with the console?", "response": "Exactly as Jun97299 said except mine came with one game. Depending on the seller sometimes it might come with an added bonus"}
{"product_id": "B0088MVODO", "context": "How are the graphics for Resident Evil 1-3? Did Capcom make them better or do they look like the PS1 versions?", "response": "No they were not remastered.  You just receive a download code for the game on PSN"}
{"product_id": "B00EWEHI5K", "context": "Is there basic support in linux?", "response": "There is through a custom tool developed outside of Razer: https://wiki.archlinux.org/index.php/razer#Compatibility"}
{"product_id": "B00B1MXGDO", "context": "can i plug this directly into a computer and still use it successfully?", "response": "that's how your supposed to use it."}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "YES - It is Not Fully independent"}
{"product_id": "B0053BCML6", "context": "I've never played any of the Animal Crossing games before. Do you have to have played the previous games for this one to make sense?", "response": "No, the game is pretty much self-teaching. This animal crossing game was my first . Now, I understand it and it's loads of fun!"}
{"product_id": "B00KAI3KW2", "context": "Are the Xbox One games online only?", "response": "No, online & offline. But Titanfall & PVZ  it's online only no single player."}
{"product_id": "B005CELN8W", "context": "I'm Looking For Life Of Luxury made by WMS , is it available on PC or Mac ? Thanks you", "response": "I have the rel'm in game and I play it on my laptop that I got at best buy"}
{"product_id": "B00CJ7IUGS", "context": "What is the difference between the Legendary Edition and the other one?", "response": "The legendary edition comes with all of the dlc included like Dawngaurd, Dragonborn, and Hearthfire.  The other one does not."}
{"product_id": "B00HLT0YT0", "context": "Will this bundle arrive on release day? Or will we need to wait for it ship after the release date?", "response": "Ordered mine on April 1st, still getting it May 8th."}
{"product_id": "B00DJYK8XS", "context": "Is the zumba fitness belt required for this game?  If so, does this game come with the belt or is it an additional purchase?", "response": "Belt did not come with game"}
{"product_id": "B00H72EMP8", "context": "is this PS3 friendly", "response": "Yes they  are"}
{"product_id": "B0087OZ5FG", "context": "Pulse elite or gold?", "response": "These are the higher-end Pulse Elite."}
{"product_id": "B009DL2TBA", "context": "does it play ps1 games and ps2 games too?", "response": "Don't worry about that keep pressing on to evalution it's not a learning curve."}
{"product_id": "B00009W5WB", "context": "Do they offer this product for XBOX 360?Thanks,John.", "response": "I don't know I am not the seller. I purchase this item for the original x-Box"}
{"product_id": "B004N7IIQ4", "context": "Compatible with Playstation 4??", "response": "Yes, I believe it is. Use the optical audio cable to connect the mixamp to the console."}
{"product_id": "B000NJBD90", "context": "does this adapter work with the newer ps3 slims?", "response": "Yes it does it works on every ps3"}
{"product_id": "B00BHSTXV6", "context": "I hit the space bar and it double space. Any fix for this? Thanks", "response": "check for firmware update if not rma or return it for a replacement"}
{"product_id": "B00KGGJPYA", "context": "What are the dimensions of this product?", "response": "It's 4 x 1 3/4 and less than an inch wide.  Fits into the palm of your hand.  Weight is only a few ounces.  I have had it one day and tried it out after charging it and it worked like a charm."}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "Indeed it does. Download the drivers from microsoft, they are newer than the version on the included CD.If you by the xpadder program you can use the controller as a Mouse or with old programs as well."}
{"product_id": "B00D3TRMD8", "context": "is this compatable with windows 8", "response": "Yes. I purchased it and download it to my Win 8. My son plays with it every now and again. He has a wide choice og games to choose from."}
{"product_id": "B0010WS20W", "context": "I have Master Poker  Ver 2.01 is this a later version ?", "response": "Not sure.When I bought the product there was an Email address from the developer.Hope this helps."}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "It doesnt come with that one, here is a list of what it has.   Captain Scarlett and her Pirates Booty, Mr. Torgues Campaign of Carnage, Sir Hammerlocks Big Game Hunt, Tiny Tinas Assault on Dragon Keep, Creature Slaughter Dome"}
{"product_id": "B00A1AQJAO", "context": "does the action replay stop working in 3 months???", "response": "surprisingly i got mine from a friend who had it for about 6 months and i've had it over a year now and it still works but i have the old ds one"}
{"product_id": "B00BGAA0SU", "context": "Tomb raider, this or watch dogs", "response": "Man, i think they're all good games, but its difficulty to choose cause they're very different from each other. I zeroed Infamous twice and i liked it a lot...Its amazing. Watch Dogs i'll play now, but my brother said its awesome. Tomb Raider cant speak to much, but i think its a good game too."}
{"product_id": "B00I9UVY7G", "context": "This game include also clubs or just national teams?", "response": "Just national teams because it is a World Cup video game"}
{"product_id": "B00006B84X", "context": "Does this have a twist access or not? On CH website, it says it has a three way axis, which makes me think it does, but some reviews say it doesn't.", "response": "No twist axis. It's a great joystick, rugged and reliable but a twist axis would be nice. Software is easy to use."}
{"product_id": "B007LQG9A6", "context": "is it compatable with pc games?", "response": "Yeah it is, that's the reason I got it, I use it with steam all the time. Might be a bit stiff untill you us just the sesitivy settings, works great after."}
{"product_id": "B005M0KSIM", "context": "Does this come with a online game code?", "response": "Yes but the first code I got didn't work but the company quickly fixed it"}
{"product_id": "B00DC9T2J6", "context": "Is this for Digital Download?", "response": "Yes there is that option.  I have gotten a physical copy though."}
{"product_id": "B004JKZUJI", "context": "Does this controller work for normal wii", "response": "Yes it does.... the only thing is that you have to plug it into your wii remote... I was kind of hoping it would plug into the wii itself so I wouldn't have to worry about battery life though, ya know? All in all it is a good controller bud. Hope this helps...."}
{"product_id": "B002XLR0JI", "context": "How many volts and Ma does it use? *Is noted on the back :)", "response": "Says here 5V and 150mA"}
{"product_id": "B00B5QLS4A", "context": "I have a SteelSeries 4HD mouse pad,would this work well with a plastic coated pad? I currently have a Naos 5000 that's getting worn out.", "response": "It's a laser mouse, so it should work well on just about any surface."}
{"product_id": "B00B5QLS4A", "context": "Is this mouse comfortable with large hands, i currently have a g600 and it just isn't comfortable for my meaty hands anymore....", "response": "We'll I have rather small hands and feel that accessing the buttons (all of them) would be easier with larger hands.  That being said, I'd say the mouse is larger in size than my Naga Razr which felt just about right in my little hand."}
{"product_id": "B001O3066U", "context": "does scrabble champion edition by encore work with windows 8.1?", "response": "are windows 8.1 and windowa8,the same?"}
{"product_id": "B00F9RGFEY", "context": "Is this headset durable?", "response": "yes.  i wouldn't bash it around but I've rarely used the stand and everything seems great."}
{"product_id": "B009SJR278", "context": "Does it work on the ps4?", "response": "The Audio does, the microphone requires a strange workaround for no particular reason. Razer support insists that it's \"not compatible with the PS4\" despite the product description \"The Razer Kraken's 3.5mm combined audio jack is compatible with any device that accepts a 3.5mm input, allowing use across multiple devices.\", but they also directed me to this customer-created workaround: https://www.youtube.com/watch?v=zMiHbMWjF2E"}
{"product_id": "B009D3HSTG", "context": "Does this have a \"rumble pak\" built into it?", "response": "No, there is no rumble functionality"}
{"product_id": "B001UIG6M2", "context": "help when i use this it corrupts my data and i have to format how do i use this without that happening", "response": "1. delete your file & create a new one (this usually works pretty good).2. try using fewer codes (if you use to many codes they start to do weird things).3. spend the extra money & invest in a gameshark (it's a much better product overall)."}
{"product_id": "B004C4U1VI", "context": "It seems like the other 1 in 1 PS2 component cables don't play PS1 games if hooked up to a HDTV.  So does this one do the job?", "response": "This works for the PS2 no matter what game you play on it. Unless you are asking if this hooks up to a PS1, it does not."}
{"product_id": "B00BS520SG", "context": "I just got a game with a DANCE MAT, and I want to make sure I am able to connect it to my Wii U. Will this work as well?", "response": "The mayflash allows you to play the Gamecube controller with the Wii U. Yes it will work for the Wii U. It was the only adapter out there I could find that would let u play the Gamecube controller with the Wii U. Until Nintendo came out with the new adapter. I hope this help's U"}
{"product_id": "B002LMX5ZW", "context": "Will this run on Windows XP?", "response": "This game will run on XP. I installed it on my XP machine when I had it. It however will not run on Windows 7"}
{"product_id": "B002L93F0A", "context": "When I plugged my controllers into the sockets on my Wii I still can't navigate the menu or click anything. Anybody know what is wrong?", "response": "Maybe the controller doesn't work,  and need to be replace!"}
{"product_id": "B00D96BMV8", "context": "Can you hear your voice in the headphones during chat, so you do not begin to shout?", "response": "According to the Turtle Beach website, these headsets do include their Mic Monitoring feature, so you should be able to mix in your voice to hear it."}
{"product_id": "B002I0JZIS", "context": "does it come with changer and usb", "response": "It came with a charger, ubs cord, wall connection, the game, psp vita and also a 8gb memory card"}
{"product_id": "B00IAVDPSA", "context": "do you need a kinect to use any of the remotes funtions?", "response": "It seems like the remote uses the infrared technology in the Kinect. I would say, yes."}
{"product_id": "B00AAQRNQ8", "context": "Does the mouse have a free scroll (logitech G500 calls it hyper scroll) mode on the scroll wheel, a mode where there is no clicking/resistance?", "response": "No it does not."}
