{"product_id": "B008U5ZNIG", "context": "Since it has has individual back light can you customize them individually by color or intensity or does the whole keyboard need to be one color?", "response": "It is always green but you can change the brightness."}
{"product_id": "B00FAN4LRA", "context": "How sturdy are these headsets?", "response": "They are pretty beefy! That being said left can had a rattle and returned but cable and headset itself very sturdy and comfortable"}
{"product_id": "B004RMK4P8", "context": "Venezuelan'm good if I buy the psn card would send me the code my email", "response": "Sadly, I cant buy this online code if I am outside of USA anymore. And I need pay my Plus suscription. :("}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "There is a model specific to the slim. This is not that version."}
{"product_id": "B000096L71", "context": "can I run on windows 7", "response": "yes,but it doesn't work on 8-8.1"}
{"product_id": "B00ANHBJBY", "context": "Will this controller work with the new Super Smash Bros. Wii U game? Does it register as a pro controller?", "response": "Yes, my son has used the controller with the new Super Smash Bros. Wii U game and enjoys it a lot. Plan on getting another for my other son."}
{"product_id": "B008UQWX0Q", "context": "what is the age group of this?", "response": "between 4 and 30 years"}
{"product_id": "B00IAVDPSA", "context": "Does it uses battery or is rechargeable???", "response": "No it's battery only"}
{"product_id": "B00562O8U0", "context": "I have a Sony BRAVIA XBRHX929 TV and wondering if I need a 3d Synch xmitter along w/ these glasses or will it synch/work directly with the TV ?", "response": "3D Features2D to 3D Conversion : Yes3D : Yes3D Sync Transmitter Integrated : YesSimulated 3D : Yeshttp://store.sony.com/p/XBR-Full-HD-LCD-3DTV/en/p/XBR65HX929#specifications"}
{"product_id": "B00006C2HA", "context": "Has anyone tried this game on Win 7 op system ?", "response": "I have it on my windows 7 machine and it looks gorgeous. I had to look around a little though for making it widescreen my resolution is 1920x1080 so, I was pleased it worked so well. I play it on an ASUS G73 and it looks really awesome and runs smoothly."}
{"product_id": "B0050SXKU4", "context": "do it comes with art work and map", "response": "No art work,  but the map is there"}
{"product_id": "B007JDMPOK", "context": "Is the Regal Frostlion Mount available for all the characters in the account or can only use it on one character?", "response": "It is account bound. All your characters can use it."}
{"product_id": "B00I14395A", "context": "Is there two charging cables?", "response": "that is 1 charging cable do 1 at a time"}
{"product_id": "B003NVMEVQ", "context": "Does this mouse have hardware/software acceleration enabled? Can it be disabled?", "response": "The mouse comes with software controlled acceleration via a razer client, and a couple hardwired sensitivity settings on the base. You can disable the software accel, I dont know offhand what the default is but the client is easy to use."}
{"product_id": "B008TP1OKI", "context": "do you need to have the transfer cable for this hard drive?", "response": "yes if you want to transfer your old info off of your old hard drive.  in my case, my old hard drive was completely broke.  so i couldn't transfer any info if i wanted to."}
{"product_id": "B004RMK5QG", "context": "How do I receive the code? Will be via email or snail mail to my billing address? Cos the address belongs to my friend not mine.", "response": "Hi W.W. Chuen!! I received mine after I have purchased on my screen at Amazon and by e-mail.Regards,Nelson"}
{"product_id": "B008YRITPO", "context": "What is the size (Length and Width)? I was wondering if It could fit in the pull-out tray of my desk.", "response": "It is a bit longer than your standard run if the mill keyboard. Maybe by two to three inches."}
{"product_id": "B00JB4WHWU", "context": "Is this a physical package that is actually shipped or just the code that will be received via the downloads tab or email?", "response": "you get a traditional dvd plastic case with a code on a slip of paper inside"}
{"product_id": "B00GG4BBUM", "context": "Can i play this against a friend if he is playing the game on a PS3? I would be using a PS4?", "response": "I haven't tried that yet because my friends with PS3's don't have The Show. And the ones that have the PS4, play The Show. Try inviting him to a game and see how it goes."}
{"product_id": "B00FLLFGO8", "context": "I have Sony Z3 since its a clip is it going to hit the power and volume buttons?", "response": "It sure does. But it rests lightly enough on them that it hasn't been a major issue for me."}
{"product_id": "B00GV0LR64", "context": "How do you take it off the tv after playing? Does it lose its suction when you put it back on?", "response": "No, it's a silicone suction cup you can take it off and put it on as many times as you want and it won't damage your TV"}
{"product_id": "B001AWBYRA", "context": "If I buy the physical copy of the game will that redeem on steam?", "response": "No it won't; you would have to buy the Steam version. I bought the DVD version on purpose though just so I wouldn't be dependent on Steam (I do that with any game that is actually available on actual media)."}
{"product_id": "B009IR1SR0", "context": "Does this game download work on Windows XP too?", "response": "Windows XP Service Pack 3 should run with it according to http://www.gamersgate.com/DD-CCUC/command-and-conquer-ultimate-collection"}
{"product_id": "B002I0F5I2", "context": "Is it in a box which includes the manual and the offer code", "response": "Yeah mine had a code to access all the bonus multi-player stuff because it was game of the year edition."}
{"product_id": "B00IRHE892", "context": "Does the middle mouse button (scroll wheel) depress easily? That's the one thing I didn't like about my MX518, it felt mushy at times.", "response": "It doesn't feel mushy, but it wouldn't feel comfortable to use the middle click as something you press extremely often during gameplay due to its bulkyness.  It also isn't so easily depressed for extremely frequent use."}
{"product_id": "B00DNGQTFI", "context": "Can this CD work in Playstation 4", "response": "I do not have a PS4, but you should probably wait until DragonBall Xenoverse comes out. It will be released next year and will be for both playstation consoles. Yo will have to ask Sony that question."}
{"product_id": "B009DYOPK0", "context": "How big is this mouse? Full grip? I have big hands and don't like having to use claw grip when mice are too small.", "response": "Yes it is suitable for big hands; actually thats why i am not using it anymore :) .  I am looking for a small mouse cuurently, may trade this for steelseries mlg ed"}
{"product_id": "B00AK4QB22", "context": "So are there small villages, towns or cities in this game that you can trade, buy potions, etc.? Ex: Oblivion, Skyrim", "response": "There is a main hub that people you meet along your journey will also travel to and you can fast travel there from any bonfire you have lit to trade or level up."}
{"product_id": "B00EW6QT76", "context": "can it charge both controllers at the same time?", "response": "It has two USB ports, so if you have two USB-to-USB Micro cables it can charge them both.  You can also adjust the settings so that it can charge the controllers even when the PS4 is turned off."}
{"product_id": "B000RT2868", "context": "Will this work with the Street Fighter Anniversary Arcade Stick (Original Xbox) to Xbox 360?", "response": "To PC, it might.. to Xbox 360 definitely no."}
{"product_id": "B003ZSN600", "context": "Can I plug a head set, in this case turtle beaches, in the controller itself?", "response": "You need an adapter."}
{"product_id": "B00DE2W4PK", "context": "The playstation plus comes in the box?", "response": "Yes it comes with ps plus. I can't remember if it comes in the box, I think amazon emailed the ps plus code. It defiantly comes with ps plus."}
{"product_id": "B004QRKWLA", "context": "Hi, those any one know if it will work with Mac computer?", "response": "I can confirm it works with OSX 10.9 using the \"tattiebogle\" drivers. Feels just as responsive as when playing on the 360."}
{"product_id": "B00DC9SWWE", "context": "What's the price of the season pass on the 360 version?", "response": "It's $24.99. source: http://www.titanfall.com/news/season-pass-and-digital-deluxe"}
{"product_id": "B00FB4BXGA", "context": "Is the red one actually fully red LED or is it blue LED? Because the picture shows blue LED.", "response": "I tried Corsair's and Razer's mech keyboards, and in my opinion this one is a lot more comfortable. The extra wrist space being built-in rather than attached allows for use of the keyboard on en-even surfaces, like your lap, etc. Software also works as it should and isn't overly complex."}
{"product_id": "B001AATQ0Y", "context": "Does this work with Windows 8.1?", "response": "I am sure it can. It run's as simple as plugging in a mouse the issue is finding a game it's compatible with. I'm not sure if the this was aimed towards people who use simulators.. but it doesn't work with a lot of online games."}
{"product_id": "B0053BCO00", "context": "Could a 5 yo play this?", "response": "Oh yea. Most definitely! My Son is 4yrs old and he got the hang of it quick. Lol"}
{"product_id": "B008X73CE8", "context": "What's the DRM on this?  Does this redeem on Steam?", "response": "no I don't think so. It does not come with a key. I haven't tried to contact steam about one."}
{"product_id": "B00EADTVL2", "context": "will this work with a controller that has a silicone skin around it?", "response": "I think not. From what I saw, the silicone cases involving the back of the control, and it is precisely there that the control fits."}
{"product_id": "B005VA5D24", "context": "Do you need a cable to plug it in to the Xbox, or does it plug in directly?", "response": "No you don't have to have a cable to plug it in, it plugs inside the xbox console. So it plugs in directly."}
{"product_id": "B002Z7BE24", "context": "I want to know whether it has a slipcover", "response": "Can you be more Pacific"}
{"product_id": "B00BDS415I", "context": "Will these work for the Xbox ONE?", "response": "No it does not work without the Xbox One Stereo Headset Adapter. Which will run you about another $30 bucks"}
{"product_id": "B00FXOP1JI", "context": "Does the 3ds XL play regular ds games as well--obviously without the 3d effect.", "response": "Yes, its reverse compatible. And yeah, I didn't try it myself, but I assume little if anything would change if you toggled the 3d on in a DS game."}
{"product_id": "B000ZHMRTA", "context": "Does this monopoly game play fine in Windows 8 pro and RT?", "response": "It works fine with Windows 8 pro. I haven't tried it on RT."}
{"product_id": "B00IYWV852", "context": "I was thinking about buying a couple of this game as gifts, it won't be an issue will it? The recipients won't have any problem using the game codes?", "response": "Nope. That is exactly why I purchased a copy through amazon. I wanted to give the code to a friend. Worked great."}
{"product_id": "B009SJR28W", "context": "The keyboard is new sealed 100%? is guaranteed everything ok? never bought on amazon ...", "response": "Mine came in perfect."}
{"product_id": "B00E1DMWBM", "context": "does this model have Megaman willey wars ?", "response": "No, unfortunately it does not. :("}
{"product_id": "B00HHUSNPU", "context": "Will I be able to keep this case on while using this charging kit?", "response": "Yes you will be able to change and play at the same time."}
{"product_id": "B003CP0BHM", "context": "What are the dimensions of the mouse? The listed dimensions cannot possible be right claiming that, presumably the length, is over 8 inches.", "response": "The dimensions are, and these are not exact: 4.5 inches from front to back (length), 3 inches from side to side (width), and 1.25 inches tall.The palm rest extends to make it almost 5 inches long but does not affect mouse to desk contact length."}
{"product_id": "B000056SPM", "context": "does it works with car simulation game?", "response": "i would not say it would work for car driving sims because of the turn radius 45 degree turn is all you can get with the flight yoke."}
{"product_id": "B00GU4F4OM", "context": "How loud is the sound when clicking? Right and Left, if there's a difference. Thanks,", "response": "The click sounds are uniform across all the buttons, and are a little quieter than most mice I've used, but the buttons sound solid."}
{"product_id": "B00ECOBFA4", "context": "- Does this game have multiplayer mode?", "response": "Yes it supports 1-2 players."}
{"product_id": "B00DJYK9L4", "context": "Does this include the belt?", "response": "Yes the belt is included."}
{"product_id": "B0050SZ0SY", "context": "will it work with windows 8.1 ?", "response": "works on my system that is 8.1 no problem."}
{"product_id": "B0099OZR9W", "context": "I have a 4GB xbox 360 slim and am unable to install battlefield 4. Can I use this HDD and install it?", "response": "You should be able to"}
{"product_id": "B005HN5LKY", "context": "Does it come with all the parts to plug into the wall and the xbox?? Like does it come with the part that plugs into the xbox to the brick then from the brick to the wall??", "response": "Yes it does though mine had the wrong cord to the wall it had a 3 prong female end which connects to the brick the brick is only a 2 prong... and as my review says this is obviously a refurbished model that is not refurbished properly...."}
{"product_id": "B0012DPHKW", "context": "Does this game work on a laptop that has window's 8", "response": "Yea it actually does and this game is really good if your a animal person. You can build almost any exhibit for any animal you want. There's about a good 90 animals but I wish they would have included more in the game."}
{"product_id": "B008BGXYBM", "context": "size? how is this mouse for profile i like my mice simple High DPI low and flat", "response": "It's a very flat mouse. Low profile and long."}
{"product_id": "B0079V29EI", "context": "Does this come with a charging cable as well? I lost mine and was hoping for a two for one.", "response": "Nope sorry its just that unit but it is compatible with the usual charger"}
{"product_id": "B001GIOGBY", "context": "Has anyone tried it with Windows 8? Does it work like in Windows 7?", "response": "Yes, it works with windows 8."}
{"product_id": "B003S9WJ9A", "context": "Is this the official cable pictured or another copy from Asia?", "response": "It's the official cable, but didn't come in the official box. If I remember correctly"}
{"product_id": "B005J37I4Y", "context": "This doesnt work on xbox one right?", "response": "Yeah it only works on the 360"}
{"product_id": "B00BGHUS58", "context": "Why was The Signature Shot Pack not included in my copy?", "response": "Check your email, the code should have been sent when the game was sent out."}
{"product_id": "B00FENJVOE", "context": "Do I need an original diablo 3 before I installed this expansion?", "response": "Yes, you can currently get it as a bundle through Blizzard and I highly recommend it!"}
{"product_id": "B004C4U1VI", "context": "Are new cables supposed to come in a box or just in a plastic bag? I just got them in a plastic bag and wanted to make sure they aren't used.", "response": "I received then in a plastic bag, if you have any doubts check the connections for scratch marks or discolorations."}
{"product_id": "B004JKZUJI", "context": "Does it work with wii u?", "response": "Not exactly. It won't work with Wiiu games. This is intended for either the Wii or the Wii virtual console that is built within the Wiiu."}
{"product_id": "B0096L2SJ0", "context": "Does this fit with the phone, when it has a case on?", "response": "Depends on the case. I have an HTC One in a relatively thin TPU case and there's still a bit of room."}
{"product_id": "B009AFLXZM", "context": "does it work with just dance2015", "response": "We hooked it up yesterday and it seemed to work with the game.  It was a little quiet but that was probably user error."}
{"product_id": "B00886XQO0", "context": "Can I use another power source is the usb cable ? i mean use Power adapter supply ?  plz fast answer ^^", "response": "The Transmitter uses a DC 5v input for power. The USB is used to recharge the battery in the headset, and it is the only way to recharge it that I am aware of. Can you explain your concerns regarding the USB recharging cable?"}
{"product_id": "B00H45K6KS", "context": "Is the language uesd in the game Japnese or English? I am looking for the Japanese version.", "response": "This one is in English. The one in Japanese is under Atelier Escha & Logy: Tasogare no Sora no Renkin Jutsushi, but you'd need a japanese formatted system to play it."}
{"product_id": "B008VXCPRY", "context": "can we downloAD IT for xbox?", "response": "no, this is PC ONLY,.. sorry."}
{"product_id": "B00GJXMRX0", "context": "can i download it again if i erase it", "response": "Robert, if you purchased the game from Amazon as a digital download, your game will be in Amazon's archives and available for download at your convenience. This has been my experience with this company, and I have purchased several games from them - almost all digital downloads. I hope this allays your fears."}
{"product_id": "B00CHYOP80", "context": "is the material on the earcups synthetic leather?", "response": "Yes, it is some sort of man made leather. The product is worth the price, much better than same priced TB's. Although they can be bothersome to wear for a long period. I hope this helps."}
{"product_id": "B00GOOSORM", "context": "if i baught this for friend in Canada(BC) would it work? i tried a psn points card once didnt work cuz of currency issues", "response": "Yes it would. It a a time card for that's international"}
{"product_id": "B000IZAQD8", "context": "can it play ps1 games", "response": "Yes, final fantasy 7, 9, and tactics all worked. You just need a ps1 memory card. Also psn controller analog does sticks do not work for those games."}
{"product_id": "B008M4BNQG", "context": "How long is the Cord on this Headset, I sit about 10 feet away from My TV ..is it long enough to reach 10ft??", "response": "I have the P11, and it measures 9' 10\" to the chat and volume control box, then another 2 1/2' from this control box to the headset"}
{"product_id": "B00CD1FC6G", "context": "Does this keyboard have the ability to toggle the Windows Key on and off?", "response": "Yes it is the third key on the top right"}
{"product_id": "B00BQZ5EWW", "context": "if u buy the download can you download it to more than one pc?", "response": "Normally you can't. There's a feature called Steam Family Sharing that will authorize users to access your games. I don't know the details, but that should point you in the right direction.And in response to Jim, all big games like this require a good amount of disk space."}
{"product_id": "B000ZBZK7C", "context": "will this run on mac", "response": "I don't know the answer, Cynthia, but you could ask Zamzow Software in Austin, TX (email: support@zamzone.com). They were very helpful to me when I had an initial problem loading the program."}
{"product_id": "B00I4A751U", "context": "What's the difference of the Prepare to Die Edition and US release Dark Souls?", "response": "The prepare to die edition contain the additional content not included with the original release and has an easier system of leveling and player vs player online battles due to enemies dropping more souls. Prepare to die is more than worth the extra dollars. Good day"}
{"product_id": "B00CJD4HD2", "context": "Can the scroll wheel move left and right?", "response": "The wheel clicks left and right so I suppose you could program it to the arrows."}
{"product_id": "B00BMFIXT2", "context": "The game comes in multilanguage? I want it in Spanish??  El juego viene en multilenguaje? lo quiero en español", "response": "yes, in the options you can set language."}
{"product_id": "B00GU8W5AE", "context": "Can I program the keys to enter passwords?", "response": "not really only combo keys like press tu button at the same time, but not a full password"}
{"product_id": "B00B70WKUK", "context": "How is the game play with using a keyboard and mouse? Does it feel like CoD or MoH?", "response": "it's like any shooter at 3rd person, it's a very cool game."}
{"product_id": "B008YA9BVC", "context": "does the headset work on the Wii? or does it work on just the Wii u?", "response": "We bought it for wii u. Not sure about wii. But i doubt. My son connects it to wii u pad."}
{"product_id": "B003V4AK8E", "context": "Does it work on ps4?", "response": "I never tried it on a PS4, but given the fact that its connection is with the USB stick that comes with it and not the console itself, and given the fact that I tried it on my computer and it ran, I don't see why it shouldn't run on a PS4. Buy this at your own discretion, though."}
{"product_id": "B00D3TRMD8", "context": "is this game multiplayer on pc? i know its not ps4 right now.", "response": "The multiplayer is in beta right now.  You can buy the beta separately to access online now, or wait until it's released for free to everyone."}
{"product_id": "B004J6KRD6", "context": "Will this work with the Playstation 4 without any sort of adapters?", "response": "I don't a PS4 but it works fine with the PS3. It should work just fine."}
{"product_id": "B00GV0LR64", "context": "Is there any way to use these and not cheat?", "response": "It's not cheating to use this item. It doesn't modify or do anything additional to the game itself. It merely gives you the ability to use 1 additional perk over an optical sight on all your weapons. It it aids you by always giving you the center point on your screen."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "Not sure about xbox (I'm a playstation fan boy so I am in familiar) but it attaches by one regular headphone jack. It's not very loud if you run game sound and chat through it but works well if you do game sound via tv and chat only through the head set. Hope this helps. Game On!!"}
{"product_id": "B00ENFVS5Y", "context": "Why my alienware said it can not recognize this device? somebody please help me. How to get this work on pc.", "response": "start by installing the thrustmaster program off their website if things still act up after trying by resetting things on the wheel and the pc you might have a bad wheel like I did."}
{"product_id": "B006IOAHPK", "context": "Does this game contain a printed manual? Does it have any insert in the box?", "response": "It doesn't come with a manual. You learn everything you need to know to play the game while playing. (there might be a digital manual on the disc) It does come with a code insert for extra outfits."}
{"product_id": "B00F27JGVA", "context": "is it a good idea to format the mamory card 64 gb when you get it new?", "response": "no just put it in and the psvita will do the rest. The card is already formatted you will just lose gigs on when reinstall your backup it should be 60gb at the start."}
{"product_id": "B007VPZR5U", "context": "can you program the buttons to be used as any key? or just numbers?", "response": "All buttons other than the Left Click may be programmed as any key or combination of Keys (Macros)"}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "Yes it does, the only thing you'd need is the Controller Adapter for the Wii U for it to work."}
{"product_id": "B00562O78S", "context": "Resistance 3???? Does it still come with Resistance 3???", "response": "I contacted Amazon customer service and rep forwarded questions regarding the pre-order bonus to marketing. Will get an answer one way or another in 1-2 business days. Let's hope the Resistance 3 bonus comes back to Amazon!"}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "Not a big difference.  One is physical that you'd get in the mail. Same function without the copy and paste."}
{"product_id": "B002I0K6X6", "context": "Does the stick have a input for pressing in?", "response": "I really do not understand that question, but I would like to say I do not know what the stick is for yet. I cannot compare the stick to the dualshock controller."}
{"product_id": "B00DUARBTA", "context": "is it like in the indiana jones lego or star wars when you push L2 or R2 it can switch between characters?", "response": "Yup. Plays like all lego games but with dialog... Cool story line, tons of playable marvel characters."}
{"product_id": "B00BT9B2LC", "context": "Is the Japanese 3DS compatible with an American 3DS charger?", "response": "Yes, the only difference is the games, and the region."}
{"product_id": "B00FMNNQCY", "context": "Is this controller made by Sony?", "response": "This item product  Sony Conputer Entertainment."}
{"product_id": "B00DE2W4PK", "context": "is this American  version  ? or Europe or middle east ? and this is 500GB ?", "response": "Came from america but the PS4 isn't region locked so it shouldn't matter."}
{"product_id": "B00ENFVJJO", "context": "Does anyone feel it charges to fast causing the controller to NOT hold a charge as long as it may have before using this charger?", "response": "This charger is made by Power A  Not by Sony. People have said it has a quick charge and I have seen a few post stating their controller doesnt hold a charge as long. Would like others to respond if they have noticed this also?"}
{"product_id": "B00886XQO0", "context": "I have the Headset Adapter that came with another set of Turtle Beach headphones, can I plug these into that for my Xbox One?", "response": "Should be able to realize this is an older set using a USB mini adapter to charge but they are bluetooth"}
{"product_id": "B0058GMO0A", "context": "I want a dvd that instruct how to play western traditional mah jong", "response": "I will pull the game and check it in the morning.  Thank you Million Sold"}
{"product_id": "B00IAVDQCK", "context": "Can you use two of these at the same time with the same Xbox One console?", "response": "You can actually use as many as you have controls. The headset plugs directly into the control so it uses the same signal."}
{"product_id": "B00FKV8AK6", "context": "is this game mature, if is tell me why", "response": "Yes, this game is mature. Anytime you are killing anything or anyone, in my book it should be rated mature!"}
{"product_id": "B000PD0HQE", "context": "will this console come with all cords like the red, yellow, and white cord that connects to the older tv's?", "response": "Yes it comes with everything required to use the console"}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "I have windows 7 & 8 and the game i have works on both"}
{"product_id": "B00CHGYUE2", "context": "Okay what is the difference between the map pack version and the regular black ops two?", "response": "Nothing the map pack didint work"}
{"product_id": "B00EI4V3FU", "context": "can you really hear surround sound with only one ear covered any problems with this headset ???", "response": "Yes you can still hear sound (from your home surround sound system), they are vented so that they are not sealing out the outside sound. These are just for voice, work well"}
{"product_id": "B00CPKUV9I", "context": "What are the controller options? Will the Xbox 360 Controller for PC control it properly?", "response": "that is what I have and it works beautifully. Just remember the system requirements for this including i7, big graphics card, etc."}
{"product_id": "B00E0H5J8M", "context": "Can you adjust the polling rates?", "response": "Of course, you can"}
{"product_id": "B00I4A751U", "context": "can i play this on my ps3 in the usa", "response": "Yes, mine worked just fine!"}
{"product_id": "B000KA5T6A", "context": "Does this product include wireless receiver? I think yes. but then why amazon suggests to buy this controller with wireless receiver altogether in 'Frequently Bought Together' section?", "response": "Does anyone know if the receiver support's 4 360 controllers?"}
{"product_id": "B009WI7V9E", "context": "Is this NTSC version of  Bioshock Ultimate Rapture playable on a PAL system (Australian xbox 360)?", "response": "I really do not know sorry but if interested in game go all out. I would try it out but understand the money watsted if it doesn't work but I'm sure a refund order would be allowed. Hope this helps. :-)"}
{"product_id": "B009AFLXZM", "context": "Does this work with a regular wii system as well as wii u?", "response": "No, only Wii u"}
{"product_id": "B0010WS20W", "context": "Does it work on Windows 8?", "response": "A note from the developer:Master Poker is written in a Microsoft programming language. This means it works properly with all current versions of Microsoft Windows up to and including Win8. This is regardless of the name brand of your computer (ie. Alienware) or whether or not it is 64 bit or 32 bit."}
{"product_id": "B009GZX49Y", "context": "does revelations come with the 3 DLC's???? and does brotherhood come with da vinci disapperance??", "response": "No. Only AC2 comes with DLC."}
{"product_id": "B00D8S4GNS", "context": "Do I need Kinect to use this game?", "response": "Yes, You do need it."}
{"product_id": "B00EF1OGOG", "context": "How many times will it charge my Galaxy S4?", "response": "Charges my iPhone 6 about 1 1/2 times. Hope this helps."}
{"product_id": "B00AAQRNQ8", "context": "How does this feel in the hand? Cheap? Sturdy?", "response": "I feel the mouse comfortable and big enough for my hand. Good price."}
{"product_id": "B009OYUFMG", "context": "Does this product work on World at War?", "response": "Have not tried, but it seems to function well as a general mouse. Has a better scroll wheel for gaming."}
{"product_id": "B002I0GF72", "context": "How does it differ from the original  (game cube) game?", "response": "Eh graphics are amazing... But it's eeehhh"}
{"product_id": "B00CBNV7UQ", "context": "Is it Chinese subtitle or English?", "response": "It is fully voiced in English. The voice acting is actually pretty good this time around compared to the earlier entries to the series."}
{"product_id": "B009XZ1CTQ", "context": "Does the game already have the pick up trucks in them or is that an added mod?", "response": "you have to download them"}
{"product_id": "B00ANHBJBY", "context": "Hey guys I'm having trouble with this controller in Wii Mode. Able to sync but the battery is always 0% in Wii Mode after charging. Can anyone help?", "response": "Kristin nailed it. Its for the Wii U only. It won't act like a classic controller"}
{"product_id": "B00292OW1U", "context": "Does the keyboard blue led so you can see it at night?", "response": "it has red, blue and purple. each at three different levels of brightness or off. it is bright enough to see easily, yet not too bright as to be a distraction."}
{"product_id": "B0098EVZZ8", "context": "My grandson asked for these figures and I'm really confused. Do you have to have a game system to play with these?", "response": "Yes-you need the Skylanders portal and game and system such as Wii, Playstation or Xbox.  Make sure you know if Skylanders Giants or Trapteam or Swap Force is actual game he has, as figures only work on certain games.   Hope this helps."}
{"product_id": "B00CMSCTA2", "context": "The old version back in 2000s had some graphic noises in seas and water if it runs on XP or Windows 7 or above. Is this issue solved in the new one?", "response": "Yes, Im running it on 8.1 without problems."}
{"product_id": "B0050SX9I2", "context": "will this remote control a regular sony blu ray player? a bpd-s5100 to be exact?", "response": "No, it´s for a play station 3"}
{"product_id": "B00BM7NXMW", "context": "does it need batteries? Mine just \"Went off\" and I don't know what to do", "response": "It doesn't need batteries. Mine too inexplicably stopped working after a short while. I had to return it."}
{"product_id": "B000ND3XXA", "context": "Will this work with Windows 8.1  ?", "response": "sorry man im stuck in the past still using windows 7 probably skip 8 and wait for something else. seems to work on xbox 360,ps3 and windows 7 although each of them have the same problem they all got a slight delay and sensitivity issues. you might need a mapping controller app like xpadder to change some settings."}
{"product_id": "B00919RM1Q", "context": "Does this game work with Windows 7?", "response": "yesi   I liked the old Hoyle casino games"}
{"product_id": "B0016897GS", "context": "the router to connect 30 ft. away .http://www.amazon.com/gp/product/B00NR2VMNC/ref=ox_sc_act_title_1?ie=UTF8&psc=1&smid=ATVPDKIKX0DER", "response": "Do you mean \"Is the router within 30 feet away?\""}
{"product_id": "B00BT71S4K", "context": "I have a Moto G. It's compatible? Does it have to be rooted?", "response": "There Is A Opintion For Motorola , Simply Push \" X \" Then The \" Home \" Button Then You Should See It In The Bluetooth Menu . If Not Look At The ipega Guide That Came With The Controller And There It Will Tell You The Modes For Different Phones"}
{"product_id": "B00HN9LS48", "context": "I have a wall mount tv.  How far back does the mount extend?", "response": "I would say you need about 3\" from the back side of the tv to the wall. That should do it."}
{"product_id": "B00B98HDNO", "context": "Any chance I could get this to work in Linux?", "response": "I honestly don't know for sure.  If you google this game and Linux, it looks like some people have done so?  Thanks."}
{"product_id": "B003O6E986", "context": "Can I use 1 Kinnect (xBox 360) on 2 players with split screen simultaneously? Thanks", "response": "Sorry I can't help you there, I dont have a Kinect.Try cheat code central, there are a ton of experienced users there."}
{"product_id": "B002DUCF8A", "context": "Can this panel work with X-Plane 10?", "response": "Yes, you must download the Saitek plugins from X-plane.org and put them in your plugins folder in X-plane.  You may have to turn the plugins on."}
{"product_id": "B00AWEMODK", "context": "Can I add the key to Steam?", "response": "Keys are not required for the game directly. I don't know how this works with steam- but you can install the game with no keys normally. The keys are put into your square-enix account via the account website. https://secure.square-enix.com/account/app/svc/Login?cont=account"}
{"product_id": "B00FEDP968", "context": "Does anyone know if this headset works with the ps4 either through Blutooth or by the cable?", "response": "PC only, you need to have the ROCCAT Kave XTD drivers to run correctly."}
{"product_id": "B002AQNT96", "context": "will this game work on windows 7?", "response": "Yes! I have seen it work on Vista, 7, and 8.1. The computer I play it on is 64-bit Windows 7."}
{"product_id": "B00AYBKQRW", "context": "I have a LW1011ER (10,000 BTU) and I'm unsure if this remote is compatible. Can anyone confirm?", "response": "Apparently it will work. I have a 10000 btu and a 15000 btu AC and it works with both of them. Hope this helps."}
{"product_id": "B008D7F47Q", "context": "I bought the game and downloaded it today. I created an origin account. When I start the game the icon comes and then goes off. I cannot play the game", "response": "Make sure you have media player enabled under windows programs."}
{"product_id": "B000TLU67W", "context": "will this work with my PS1 games as well as my PS2?", "response": "Yes you can play ps1 games or at least most ps1 games but you will need a ps1 memory card to save the ps1 games."}
{"product_id": "B00GO4PTR0", "context": "I wanted to know if you can send me the code to my email because I would need to use it as soon as possible. Thanks.", "response": "Sadly no, it's only the physical card that is sent to you via mail."}
{"product_id": "B00HWMP0OU", "context": "Will this work on 2DS?", "response": "All 3DS games work on the 2DS.  So yes, this one does work."}
{"product_id": "B00DLDEKOK", "context": "Does the volume box move up so its not so close to where ya plug it ino the controller??", "response": "You control the volume from the connection to the controller, it's on the plug."}
{"product_id": "B00F27JGVA", "context": "Does this card works correctly with USA's PS Vita systems?", "response": "Yes it does, it's region free."}
{"product_id": "B007OVHW90", "context": "Does it work with the turtle beach X32s?", "response": "it should but I am not 100% sure"}
{"product_id": "B00EV7AYAO", "context": "How loud is this keyboard when you press the keys? My keyboard is a very OBNOXIOUSLY loud razer that's key presses can be heard through closed doors.", "response": "It's not to loud. There is a clicking sound though."}
{"product_id": "B00HK74G2E", "context": "Can you play PS2 games w/ this PS3?", "response": "My son has this exact system and he's unable to play any of his ps2 games on it."}
{"product_id": "B00EADTVL2", "context": "do the lights turn off when no controller is attached, or are they constantly on when the unit is plugged into the wall?", "response": "They do turn off when no controller is attached. and they stay on when it does."}
{"product_id": "B00IYWV5HS", "context": "Is this just a code or will any portion of the game files be downloadable from amazon? I am having a great deal of trouble using NCsofts client.", "response": "It's is just a registration code to give you access to the game. You use the code on the WildStar website and then download the game."}
{"product_id": "B00F8W9SWQ", "context": "Can you see the keys clearly with the back light off?", "response": "Yes the letters have a silver color when turned off.  Also the lights are very easy to turn off and on."}
{"product_id": "B002I0IIPY", "context": "I have the Wii mini, can this game still be played on it with no wi-fi connectivity?", "response": "I do not know what a WII mini - but we do not have wi fi connected to ours"}
{"product_id": "B00ATF5YZM", "context": "I downloaded the game COD 4 MW but steam isnt working and i cant get to my game!!!!", "response": "You don't have to download this game from Amazon. Download steam from steampowered.com and open your games library then click the \"Games\" menu then click \"Activate a Product on Steam\". Follow the wizard to add your product key which you would have received in email from Amazon and the game will work."}
{"product_id": "B00HHUSNPU", "context": "Where do you ship from?", "response": "We ship the item from Miami, FL.Thanks"}
{"product_id": "B009S4JZKK", "context": "does this program work on windows 8 .1", "response": "I wouldn't know.  It works with Windows 7.  I have not gone to 8."}
{"product_id": "B00EVWZHLK", "context": "includes subtitles in spanish ???", "response": "yes, you can play it in spanish!! an excellent product!"}
{"product_id": "B002I0F5I2", "context": "Is it in a box which includes the manual and the offer code", "response": "This game includes a full color manual and a code to download the extra content. There is no expiration date for the code so if you buy this game today you can download the extra content."}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "It is! I own a 3DS XL. All Nintendo DS games are compatible with the 3DS. :)"}
{"product_id": "B003ZSP0WW", "context": "the controllers come with the battery and charging cable? and come in black color?", "response": "No, they come with 2 double A (AA) alkaline batteries. The rechargeable battery pack and charging cable is an additional $20. That's for any controller, old or new."}
{"product_id": "B0049B2FP4", "context": "Will this game work on the Windows 8 operating system?", "response": "How do you install the game in windows 8?"}
{"product_id": "B00EZAWV6W", "context": "How long did it take you to download onto PC (Windows 8)?  I have DSL and it is saying it's going to take 9 hours for download!", "response": "I believe it took me about an hour using cable connection (Win 7)."}
{"product_id": "B002I090AG", "context": "can nintendo dsl 3d games be played on the nintendo 3d system?", "response": "No, there is a tab on the 3 DSL"}
{"product_id": "B0086V5UF0", "context": "Does this game requires video controller or the Active floor Mat?", "response": "It require the Wii remote controller does not need a mat. Just a good set of space to move."}
{"product_id": "B009RXUOD4", "context": "how long is the wire?", "response": "The cords are lengthy. The one from the controller to the headset is plenty long and the others that plug into the TV are almost too long"}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "Sorry Eric I really can't answer that question cause the only uncharted I've played was the one on vita but I still do think this game is great if you play the last of us from naughty dog then you will also like this game"}
{"product_id": "B005J37I4Y", "context": "I have Beats Wireless bluetooth headphones.  With this device, will they output in-game sound and also allow me to chat? The Beats have a microphone.", "response": "Chat only. No game sound."}
{"product_id": "B009DZTXR4", "context": "Does this game has two disks or codes for the DLCs?", "response": "Yes, bonus content is on one disc and the game in on the other disc. Two discs. (:"}
{"product_id": "B00GU8W5AE", "context": "Just got this mouse and reprogrammed the side keys in the mouse utility, but for some reason they're not working when i try to use them in WoW. Help?", "response": "Did you program it in game? That could be the problem. ..do it in game from there options"}
{"product_id": "B00CX7FQ4I", "context": "So I preordered this game but I never received a code or anything to unlock Bruce Lee. Any suggestions??", "response": "check your email that you gave amazon. I just got mine earlier."}
{"product_id": "B007VTVRFA", "context": "So I should buy Cities: Skylines instead?", "response": "I would wait to see the reviews of it after it's released then compare to Simcity."}
{"product_id": "B0057WDE8Q", "context": "Is it wireless and would it be good for playing Mz PacMan", "response": "It is not wireless but the stick has a nice feel and clicks in a most satisfying way. I use it for fighting games but see no reason why it would not work well for mz pacman or any other classic game."}
{"product_id": "B00HG0B8NA", "context": "is this the same freecell on my windows seven computer", "response": "No it is not. I found the All-in-One Solitaire really disappointing. I deleted it from my computer."}
{"product_id": "B00005NIMB", "context": "Work fine in Win7 64bits ? to Il2 saga ... Thanks", "response": "Last I heard (couple years ago) there was no driver for Win 7.  I would think someone would have come up with one by now, though.  Google around for a driver before you buy."}
{"product_id": "B00EHBKUTE", "context": "Does this work well under Windows 8.1?", "response": "Yes I am currently running it on Windows 8.1"}
{"product_id": "B00B5QLS4A", "context": "is it compatible with windows 8.1", "response": "Not sure I only use windows 7. You could try contacting corsair"}
{"product_id": "B009AFLXQQ", "context": "Does the Charging Cable connect to the system and acts like a wired controller? Having the responsiveness of a wired one, or is it just a charging cab", "response": "I have not done responsive test with controller connected to system."}
{"product_id": "B00475AYUA", "context": "How come it says it has 4 games but when i download I only have 1?", "response": "Open My Documents and look in the My Games folder"}
{"product_id": "B00GLZQR96", "context": "Is there a monthly fee?", "response": "No, this is not an MMO!  You only have to pay for PS+ if you want to play with other gamers online, so the actual game does not have a fee!  However, you should be able to play for free with up to 4-player splitscreen!"}
{"product_id": "B008HPAXZ2", "context": "Will it work with a New Nintendo 3DS XL?", "response": "Yes it should. I don't believe there's been a change in screen size, and this article says so too. http://www.kotaku.com.au/2014/12/nintendo-new-3ds-xl-australian-review/"}
{"product_id": "B00AWEMODK", "context": "I already have the game and part of the expansions on my computer, if I bought this just for the extra expansions, will it install on top ok?", "response": "Yes, and toy week get the codes for the rafts items as well, just Dave the activation codes for the Parts you already have because they'll still be usable be SOMEONE."}
{"product_id": "B001DNGCN2", "context": "I have the 2nd/3rd gen. \"fat ps3\" my cable ports are spread out on the back of the ps3, how high is this fan connected to the PS3 in the back?", "response": "It'll fit fine, but I retuned mine because it didn't stop the overheating at all."}
{"product_id": "B0036VO4XO", "context": "After you install this, Under Control Panel - Sound - RecordingDoes - \"Stereo Mix\" show as an option?Thanks", "response": "No, the sound card only shows up as a Microphone In (under recording) and as \"Speakers\" (under Playback). Sorry, this doesn't sound like the the sound card you're looking for it seems."}
{"product_id": "B003O6EDSM", "context": "For how many players is this game?", "response": "The mass effect trilogy is mostly a single player experience although mass effect 3 does have a multiplayer survival that is up to 4 players."}
{"product_id": "B001GROEEO", "context": "May I use it in Guatemala?", "response": "Yes, you can use it anywhere in the world, however only on the US playstation store."}
