{"product_id": "B001UIG6M2", "context": "is this for European consoles or US consoles?", "response": "It.s both. Why it works on the us so I am sure that it will work in European and US."}
{"product_id": "B0050SY77E", "context": "do you need a code like most EA games to play the multiplayer", "response": "No thank you code were valid. They work, thank you anyway."}
{"product_id": "B00D78Q4UM", "context": "do the different color WASD keys, and directional keys have different textures than the other keys?", "response": "No, the WSAD keys have the same texture as the rest of the keys."}
{"product_id": "B0086V5V8G", "context": "how much of the game is stealth  or can you go in guns a blazeing", "response": "Hello, the games has three ways of playing, i mean. if you like, you can be \"like a ghost, lethal as a panther or brutal in assault\" (thats what the case says) And believe me, being a ghost is a real challenge, this game is really awesome, for me is 10/10. Resume: you can choose your own way."}
{"product_id": "B00D6NPFDK", "context": "Does the portal & the usb connection cable come with the starter pack?", "response": "Yes, the portal comes with the USB cable attached. Then you just plug the cabe to the usb port in the back side of the wii"}
{"product_id": "B00DHUUTEM", "context": "Does it come with software to configure the programmable keys? If not what software did you use to configure them, and was it easy?", "response": "No software required. Feature built into keyboard. Works great."}
{"product_id": "B00ATF5YYI", "context": "will this play on win8", "response": "Yes, 8.1 I'm unsure of but i run it on 8."}
{"product_id": "B008RA5DIY", "context": "If we purchase Quickbooks from Amazon, does Intuit still provide support?  They tell me that you may not get their actual product.  Is this true?", "response": "We called when we had trouble installing and got support. We did the download version and no hard copy on the disk -- I'm quite sure it's the real thing."}
{"product_id": "B00E1DMWBM", "context": "Can this system emulate games other than Genesis, like SNES?", "response": "No, if u want multi system emulation get the JXD-S5110b. Just type it into Amazon and you'll see the PS4 clone that emulates multiple systems from the 8 and 16 bit eras, I think it does N64 also"}
{"product_id": "B00DC9SWWE", "context": "The rating says it has \"strong language\" is there anyway to turn that off?", "response": "My 17 yr old son said is there is no real strong language on the game. It is the other players that can use it. The only cuss word he has heard so far is d***. Hope this helps"}
{"product_id": "B00BS520SG", "context": "I cannot get the turbo light to stop blinking. This device is useless in Wii U mode. Tried tapping the button twice to erase settings but it wont?", "response": "Honestly, the device is wonky sometimes and typically takes a minute to work. Afterwards it'll work without a hitch, though!"}
{"product_id": "B00AR1LX9O", "context": "are these headsets good for FPS games like Call of Duty and Battlefield", "response": "These work extremely well with those types of games. You can hear things in the distance...things coming up from behind you...explosions and gun fire sound great also!"}
{"product_id": "B008RA5DIY", "context": "We recently bought Quickbooks Pro 2013 3-user. Can we buy single user version and have all 4 people working in the same company file at the same time?", "response": "No, it is not possible for the 4 users to work at the same time. You definitely would need a multi user version."}
{"product_id": "B00CQ9L1Z6", "context": "Can you get legendary pokemon like mew in Pokemon y", "response": "I'm not 100 percent sure but you can get diance and unlimited rare candies and stuff like that."}
{"product_id": "B006W41X36", "context": "What is the difference between the DSS2 and the DSS1?", "response": "Head over to the turtle beach website and all the spec diff will be explained."}
{"product_id": "B002I0K3PM", "context": "Is the story line or jobs any different compared to the version that is out for the Nintendo DS 3D?", "response": "Yes. The story in the 3DS game is a prequel to the Wii U game."}
{"product_id": "B00ANHBJBY", "context": "About how long is the battery life (those of you who got actually functioning units)? Does it compare to the WiiU Pro's 50+ hours?", "response": "Mine didn't come with a battery life timer with it but I can say it lasts a long time. You'll probably forget where you put the charging chord by the time you need to use it again. This is by far the best 3rd party controller I've ever used."}
{"product_id": "B00G0OYHCW", "context": "in the wii u can i play with that games of the wii and gamecube like in the wii?", "response": "The wii u is a new console. not a add on to the wii. you can play wii games on it however, you can not use the gamepad to play them."}
{"product_id": "B00D6PTMHI", "context": "Can I install the PC version on multiple computers ?  I spend weekdays at my home and weekends at my girlfriends.   Will I have to buy a separate licence to run on my pc and also on hers ?", "response": "It links to your steam account, so as long as you have that on both computers you should be fine."}
{"product_id": "B00DYAQHTQ", "context": "Does this game have multiplayer mode?", "response": "Multiple multiplayer modes! (https://www.youtube.com/watch?v=Q8sryFIcank)Also from what I've heard it sounds all multiplayer will be optional, so nobody jumping in your game and griefing your single player stuff if you don't want them to."}
{"product_id": "B009O8HH3M", "context": "What are the headphone cushion material made of? Some photos make it look like it's made of a cheap foam and the others make it look like fabric.", "response": "I say some cheap foam because after wearing them for 2 or 3 hours it starts to hurt your ears. I know it's not fabric."}
{"product_id": "B005YR308S", "context": "Are there a lot of complicated button combinations to push? Is this at all similar to Diablo? Apologize for the simple terms. I'm new to the PS3.", "response": "You should know your way around the controller for sure but the base of the game is very user friendly and plays more like a movie than a video game.  Actually allot of fun for a new gamer."}
{"product_id": "B00F27JDUY", "context": "Hello :) , i recently ordered a vita from another seller but it was a 2006 model (asia). can you guarantee if i buy yours it will be a japanese model", "response": "My is a Japanese import but I'm not planning to sell my if you like go check out seller japan premium that where I bought my"}
{"product_id": "B002I0H09Y", "context": "Does this still come with the voucher to download the PSP version of Call of Duty?", "response": "No it did not."}
{"product_id": "B007CM0K86", "context": "What is the difference between the Standard and Survival Edition?", "response": "Survival Edition is a collector's item. (I'm pretty sure) it comes with a statuette and the Pandemic Edition also comes with \"The Art of The Last of Us\". Hope I helped!"}
{"product_id": "B00001IVRD", "context": "My current Starcraft and Starcraft expansion look grainy on my Windows 7 -  is this updated to work properly?", "response": "On my wondows 7 it doesn't, but there are a couple of glitches like it won't save the game you are playing. Not the senarios"}
{"product_id": "B00DC7O3K6", "context": "Is this game 2 player?", "response": "Yes, it can be played with more than 2 people also in some games."}
{"product_id": "B005THAX5Q", "context": "this game is the spanish ?", "response": "Maybe.  I don't want to look at it again though so I'm unsure."}
{"product_id": "B008VQ68C4", "context": "Im guessing pc definitely has the 7.1 surround sound, but is the audio the same on consoles? Or is it only default stereo sound for my PS4?", "response": "It's default stereo for Ps4"}
{"product_id": "B009SJR28W", "context": "Are the keys noisy", "response": "No they are very quiet, their like laptop keys"}
{"product_id": "B00006HYLN", "context": "Does it clamp to the edge of a desk?", "response": "Yes it does. It has a main screw-down from underneath, and 2 side clamps that are operated from on top."}
{"product_id": "B005VO5ZVY", "context": "Will this work with a DS3 XL?", "response": "No.. This one would be too small for your game system.."}
{"product_id": "B000VRCNLG", "context": "Is this program compatible with Windows Vista?", "response": "How would I know I hove not the foggest idea about windows vista."}
{"product_id": "B007TMFD7C", "context": "Obviously for adults but what age would you recommend in youth?", "response": "Good for youth very realistic I have an 11 year old who now knows how a real airplane flys and  has been inspired to learn how to fly. Highly recomend"}
{"product_id": "B0018YXM3Y", "context": "What are the requriements for this game and does it require STEAM to play simple campaign mode?", "response": "I dont know, it required steam to even boot up."}
{"product_id": "B00BU3ZLJQ", "context": "can this game and others be played without signing up for xbox live?", "response": "Yes. I have an 8-year old son who plays offline, all the time. No problems."}
{"product_id": "B009AP23NI", "context": "Is this controller compatible with Mario Kart 8? And Bayonetta?", "response": "Yes it is compatible with both, the back of any Wii U game box will also give you this info"}
{"product_id": "B000266786", "context": "is it    a c.d or        dvd", "response": "I don't know.  It doesn't say on the disk.  But I can no longer load it on my computer since I upgraded Windows.  I love Reader Rabbit but I'm sorry I bought this."}
{"product_id": "B00F27JDUY", "context": "Hello :) , i recently ordered a vita from another seller but it was a 2006 model (asia). can you guarantee if i buy yours it will be a japanese model", "response": "Yes I can.It is Japan model I sell"}
{"product_id": "B00DC7O77A", "context": "Would you recommend for a 9yr, 7yr, & 4yr who love Skylanders, Infinity, & Smash Bros? Someone said it would be too frustrating?!", "response": "I have a 4 & 8 years old who love the same games and they love this game!! We play together and we teach them to never give up!!!!"}
{"product_id": "B0088MVODO", "context": "How are the graphics for Resident Evil 1-3? Did Capcom make them better or do they look like the PS1 versions?", "response": "I can't tell you because the Anthology version that I've bought, came without the others RE 1-5... the codes to download was already used when I've tried."}
{"product_id": "B003VAHYQY", "context": "using controller with steam games?", "response": "Yes, but it is the most uncomfortable thing I have ever used in my entire life"}
{"product_id": "B00D96BORK", "context": "do you have to get the xbox 360 adaptor or whatever", "response": "I bought this to get him a new head set, he says he used the adapter off his old turtle beach pair for the new pair."}
{"product_id": "B000LQ4HTS", "context": "Is there preset button mapping for Elite Dangerous available? Has anyone used this particular HOTAS in Elite Dangerous, and how well does it function?", "response": "Not only is it already set up to jump right in, re-mapping is available and quite simple. Some of the mouse features do not work in E:D by default, but you can simply un-map them in the software and they become usable in E:D. Myself, and a bunch of others are really enjoying this stick for E:D."}
{"product_id": "B008VQ68C4", "context": "Is this a good headset maybe for game recording or capturing, I am really depending on the microphone the most.", "response": "I personally have done neither but for the most part my friends have commended the quality of the mic and it does not pick up to much background noise."}
{"product_id": "B0099OZR9W", "context": "When I put in this hdd, will my xbox 360 slim recognize it?", "response": "Yes mine did and I've been using this hard drive for a while now and it still works fine."}
{"product_id": "B00C7103DO", "context": "Can you use remote play with the playstation 3 to the playstation vita slim", "response": "I don't know, I bought this as a gift for my father."}
{"product_id": "B00CJD4HD2", "context": "I ordered this G500 mouse and it is making a high pitched tone that is giving me a headache after 4 hours of use.   Return or try to replace?", "response": "I'd replace it. If had one for several weeks which I use for about 10 hours per day. It's been great so far with no humming noise!"}
{"product_id": "B00576U8CC", "context": "Does this game force you into PvP scenarios, or are you mainly fighting WITH or AROUND other players, but AGAINST AI enemies?", "response": "You are not forced into pvp you need to join a match for that."}
{"product_id": "B00I4BGNVM", "context": "does this game works on windows 7 or 8?", "response": "I'm running it on Windows 7 with no problems."}
{"product_id": "B00HG0B8NA", "context": "does this game have undo option?", "response": "No. But it will not let you make an illegal move."}
{"product_id": "B007TFOO6K", "context": "is this keyboard audible? like, can i hear the key when i type? (getting the cherry mx blue)", "response": "I have the cherry MX Blue version, typing on it write now, and yes... very much so. I recommend not getting the KB though because it uses a miniUSB interface to connect to the KB itself and for me that comes unpluggled a lot... I want my money back and want a new keyboard."}
{"product_id": "B00CJ7IUI6", "context": "i have regular skyrim i want to know if you buy it will you get to keep your save?", "response": "It sure will. As long as you keep the same platform."}
{"product_id": "B005VA5D24", "context": "does this hard drive is compatible with the xbox 360 s console dont know if is first or second generation how do I find out", "response": "It fit in my Xbox 360 slim. I don't know which others it's compatible with."}
{"product_id": "B00B3PDH5G", "context": "What exactly do you need to make this compatible w/ Xbox One (of note--you are talking to a video-game ignorant mom here)?  Thanks!", "response": "Hope i'm not too late for your question. You actually need an adapter, check http://www.turtlebeach.com/console-compatibility and click on the model."}
{"product_id": "B00ANHBJBY", "context": "Does this controller work on all Wii U & Wii games? Does it do the job for Mario Kart? Mario Bros.? or Donkey kong? etc.", "response": "Yes it does nolan I have both games and it works fine"}
{"product_id": "B0002XJBG4", "context": "Can this be used to play games on a Mac Pro?", "response": "I believe so,you should try contacting Logitech themselves or check forums."}
{"product_id": "B00562O78S", "context": "normal tv functions? for example, can i also have my xbox360/wii hooked up to this?", "response": "Sony's product specs list 2x HDMI and 1x component video input.http://us.playstation.com/ps3/accessories/sony-playstation-3d-display-ps3.html"}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "As a owner of the collectors edition I can safely tell you that you DO get the first month free however to tell you the truth I think that's the case with all copies of the game but don't quote me on that, call your local gamestop for that one. Hope this helps.-Nate"}
{"product_id": "B00B1OK3TC", "context": "How good of quality?", "response": "Wen I set it up to my computer it says no device"}
{"product_id": "B00EZKNT18", "context": "Can you turn the rumble feature off?", "response": "I don't think so."}
{"product_id": "B00BY0G0YU", "context": "Does this game work outside of the US", "response": "Yea it should since the ps3 isn't region coded."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "It should work with windows 8. I run windows 7 so im not 100% confident but from what I have heard no one has complained about it not working on 8."}
{"product_id": "B00CJD4HD2", "context": "Can the scroll wheel move left and right?", "response": "Yes that's right brother...!"}
{"product_id": "B002I0J5CO", "context": "How long is the cord?", "response": "It's a decent length, about 12 feet."}
{"product_id": "B008M4BNQ6", "context": "Can you use two of these headsets on one Xbox 360 console?", "response": "So that's 2 yes and 1 no.  What is it???"}
{"product_id": "B0000695GX", "context": "What about Windows 8?", "response": "Yes. I am running the Triple Thrill Pack on Windows 8.1 Update 1 and it works great!"}
{"product_id": "B00BMFIXZG", "context": "do you have to have internet", "response": "Not obligatory, just you can play without conection but if you conect to internet can unblock some facilities."}
{"product_id": "B009RXUNGM", "context": "does it work on xbxo one", "response": "No they only work on the 360 xbox . I have both and use both.."}
{"product_id": "B00H72EMP8", "context": "How long is the regular 3.5 mm headphone jack before being attached to the in-line controls?", "response": "I want to say 4 to 5 inches. Its plenty long enough to reach the front of your mouth"}
{"product_id": "B00F27JE1C", "context": "can it play american games?", "response": "Yes you just change the language to English."}
{"product_id": "B002CJ8Z04", "context": "does this have the same plot as ruby/sapphire?", "response": "For the most part yes. There are some minor changes along the way and at one point a new section was added."}
{"product_id": "B0094X28J0", "context": "Does this come with the nunchuk as well?", "response": "the nunchuk comes by it self.R.W."}
{"product_id": "B0079V29EI", "context": "is it possible to change the battery of the nyko?", "response": "unlikely! even if you could get to the battery! its likely its a custom made battery!"}
{"product_id": "B00EZKNT18", "context": "does it come in offical packaging?", "response": "I got mine in official packaging. I got it just like you see it in a best buy or Walmart if that's what you mean."}
{"product_id": "B00ENFVS5Y", "context": "Is there a version of this wheel to avoid?  I heard some of the earlier batches had problems.", "response": "First release versions had issues but the newer ones may not have been out long enough to know yet"}
{"product_id": "B00E3667XQ", "context": "is it any good", "response": "Yes, especially if you like playing older game consoles. It handles everything up to playstation 1 and dreamcast just fine. It also handles pretty much any android game out right now."}
{"product_id": "B00AFYAUYW", "context": "what is the voltage specification? I need the one with 240 volts", "response": "Well, we have 110 and you have 240, I think the unit will use the electricity it needs, so that won't matter.  I am not an electrician or anything, but pretty sure that makes no difference at all. J"}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "it works just fine via steam. buying the game digitally or \"dvd\" is up to you."}
{"product_id": "B00FEOR4MY", "context": "Will the DS fit in this?", "response": "Mrs B, just checked with my grandson, and yes, the DS fits \"perfectly\" in the carrying case.  Pamm"}
{"product_id": "B002I096AA", "context": "Is the 3DS an American DS, or otherwise?  Thanks~", "response": "The one I received is an American DS, although to be fair, half the buttons are broken, and the system is almost unplayable. I would be very careful about who you purchase from."}
{"product_id": "B00HEX8TA4", "context": "Does your scroll wheel wobble? Mine wobbles significantly. Makes a jittering noise if I shake the mouse.", "response": "sorry for the late answer didn't pay attention email Anyways, No the scroll wheel does not wobble with me it might be a manufacturer defect"}
{"product_id": "B00D3TRMD8", "context": "can you download onto android tablet", "response": "no it is only a steam code, and i do not believe the have released a android version of the game yet anyway."}
{"product_id": "B00BGAA3S2", "context": "Is there any extention cable available ? The cable cannot reach the playstation. It is too short...", "response": "Idk if an extention cable is available. You might want to check with your local Game store or check online"}
{"product_id": "B00HKCKA0G", "context": "can you use this as a pc headset?", "response": "Yes it can be used as a Pc headset"}
{"product_id": "B000A2R54M", "context": "is this game compatible with nintendo 2ds?", "response": "Yes the DS2 will play along with all 3DS games."}
{"product_id": "B002RYLG4Q", "context": "How long are the cables? The distance from my TV to couch is 8 feet. I know I won't have a problem with the Original NES, not sure about this one.", "response": "With all the cables stretched to the Max  it probably will still fall short. My biggest concern is the contacts in the game pack ."}
{"product_id": "B007SRM5U6", "context": "Thist game have spanish sub?", "response": "The game does have spanish sub, you just have to put your system settings in spanish. Only subtitles in spanish, not audio; however it would be a shame to play these game without hearing the original voices, both Kevin Conroy and Mark Hamill are perfect playing Batman and Joker's voices"}
{"product_id": "B00FATRKOK", "context": "Does this come with, or already have inside of it, a wireless adapter or will I need to buy a separate one?", "response": "The power supply adapter and cable have already inside of the box. It is not a wireless a adapter, it is a regular power supply. I need to change the power adapter to 120W\\220V. But I do not find a service in my country. I strongly recommend not to buy one if use outside of US."}
{"product_id": "B00919RM1Q", "context": "can this version be loaded on both my lap top and desk top?", "response": "it should be okay I have mine on my laptop"}
{"product_id": "B0098EVZZ8", "context": "will these work with the Wii game", "response": "Yes the characters will work with any system"}
{"product_id": "B00FFL0T46", "context": "Is this for the whole series or just for the first 2 episodes?", "response": "This is definately a code for the season pass. The first three episodes are out already and this pass will also encompass the other two episodes once they come out."}
{"product_id": "B009K7QB8O", "context": "Someone said that the CD is a mini CD. I have an HP TouchSmart 300. The CD not have a tray, the CD's slide into a CD slot. Will I be able to use the mini CD?", "response": "You could make a dick image on a computer that has mini cd reading put that on a flash drive and plug it into your computer and run the iso file. Heres how to do it- http://pcsupport.about.com/od/software-tools/a/create-iso-image-file.htm"}
{"product_id": "B000OYMYZQ", "context": "Is the included battery just a standard rechargeable battery that I can use with the MS dual recharging station?", "response": "Yes. It is the normal xbox 360 rechargeable battery."}
{"product_id": "B00CD1FC6G", "context": "Is this worth it? I've never even considered getting a $100 keyboard before.", "response": "Yes, most tech youtubers highly recommend it. Here are some reviews please watch, and chose for yourself. https://www.youtube.com/watch?v=ceihRAKmqcg or https://www.youtube.com/watch?v=Ymfd-GkBm6o"}
{"product_id": "B00F47ZNP6", "context": "Can I remap the buttons?", "response": "to be honest thats not something i have tried to do. sorry i couldnt be more help. but i really like the mouse, if remapping is a deal breaker maybe look at something else just to be safe, but if its not this mouse is very cool"}
{"product_id": "B008TP1OKI", "context": "Can this hard drive recognize original xbox games, most aftermarket HDD's don't", "response": "So, if my son is trying to play something like Destiny, an original game, this won't work?  He has the 360e."}
{"product_id": "B00E88G054", "context": "is this item wired or wireless?", "response": "It is wired. Braided cable btw"}
{"product_id": "B00FC1UH82", "context": "Is this wired or wireless?", "response": "The fight stick is wired"}
{"product_id": "B00B98HBTA", "context": "how many players is this game", "response": "There is 2 players on this game!"}
{"product_id": "B00B1MXGDO", "context": "can i plug this directly into a computer and still use it successfully?", "response": "Yes, the controller is wired and has a USB. I use my controller for my desktop to okay games on Steam."}
{"product_id": "B009DYOPK0", "context": "What is the difference between this and the kone pure?", "response": "The Pure is smaller, lighter (no weights), lights are different, $10-20 cheaper, one less button and I think the Pure does not have a tilt wheel.The internals (laser sensor, DPI) are the same."}
{"product_id": "B00CX8VYM0", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "Nada, just online multiplayer...campaign is single player only"}
{"product_id": "B00DGZDFO4", "context": "Can this game can be run Locally on my Pc? I dont like to play online, I prefer play against myself.", "response": "If you mean, can you play against the computer?  Yes. I don't think you need an Internet connection at all, except to download the game."}
{"product_id": "B00EOPT5ZS", "context": "Can you press 2 buttons at the same time?, for instance up + left?", "response": "This does NOT work on Mac. It accepts only 1 key at a time. If you are using a mac, this makes the product an extreme waste of money as often times you might want to Move forward + strafe or forward + left/right. Stick to WASD"}
{"product_id": "B00B3PDHBU", "context": "Was the packaging already opened upon arrival?", "response": "Not for me. Brand new"}
{"product_id": "B00G21VQ2M", "context": "Will this work on a US vita? Or does it have to be a Japan vita?", "response": "It works on the US vita."}
{"product_id": "B004L5SJ4Y", "context": "It just goes repeatedly through first time set up.  I'm guessing that there is a patch out there that will solve my problem.", "response": "The previous post by Klem is spot on...  CLOD is installed by Steam and it will download the last official version.  Then head over to the link provided and download the Team Fusion updates. And yes don't let Steam update the game once you get everything up to speed.  I hope this helps"}
{"product_id": "B00FBV6V56", "context": "Does this come with the Mix amp ? and any issues connecting to ps3 or ps4 ?", "response": "Yes it comes with the Mix Amp. I had to follow instructions on a YouTube video because I had issues setting it up. It did not come with instructions."}
{"product_id": "B00DJYK8XS", "context": "How does this game compare to the Zumba workout DVDs? If you're a total beginner, which would you recommend trying first?", "response": "From what I've found, most games are the same if your a beginner. I wouldn't say one is easier than the other"}
{"product_id": "B003O6E986", "context": "is this 2 disc version? full version?", "response": "Yes it is 2 disc"}
{"product_id": "B004HYK8Y8", "context": "Does this game come patched out of the box? Im hoping to exploit a few glitches.", "response": "I bought the game about six months after it was released, and there was a large patch available as soon as I installed it.  I would imagine that several years later, that's still true and probably a lot more to download."}
{"product_id": "B007MM9E42", "context": "What is the age group for this game", "response": "At least 10 years and older"}
{"product_id": "B00IYWV5HS", "context": "So in order to gift this, I just email the person the code? That's it?", "response": "Yes, just make sure they make an NCSoft account on the Wildstar website to redeem the code with."}
{"product_id": "B002VBWIP6", "context": "Do these expire?  That sounds like a stupid question, but I just got an Xbox Live membership card in December, so I won't need to update until next yr", "response": "I needed to update this I called xbox they got everything taking care mess up on there end"}
{"product_id": "B0041RY3W4", "context": "It shows that it can charge one motion controller and one navigation controller.  Do 2 motion controllers fit?", "response": "yes all motion controller fit"}
{"product_id": "B002I0H2AG", "context": "I played Gears of War 3 and liked the campaign.  Should I give this game a try?  Is it a must play for 360 owners?  I am only interested in single player.", "response": "It's nothing like gears of war 3. Save your money! Gears 3 campaign was amazing compared to this garbage."}
{"product_id": "B00C7103DO", "context": "Can you play this on PS4?", "response": "No.  It's only available for PS3, PC, and XBox 360, to my knowledge."}
{"product_id": "B00005NIMA", "context": "Work in win7 64bits?", "response": "I've used it just fine on Windows 7 64-bit."}
{"product_id": "B005EQE0YM", "context": "If I buy this product itself do I need anything else to buy for it to work?", "response": "No just plugged it in to the xbox"}
{"product_id": "B004NRN5DU", "context": "Is this Free region game, so i can start it on my PAL xbox ?", "response": "No, this is a U.S. region game. Sorry"}
{"product_id": "B0098W4ZD4", "context": "does this work with mac", "response": "Yes it does very well too you just have to download the software it is free"}
{"product_id": "B00FNNQREC", "context": "What is a good age for this game?  Can younger kids play it?", "response": "I wouldnt recommend it for anyone under 10 or 12."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "You get it immediately. They send it to you via email and it even shows you what the code so you don't even have to check your email."}
{"product_id": "B00BY0G0YU", "context": "I see that there is special strategy guide for FFX. Now is that because the game has new content or does the guide itself have something extra?", "response": "There is some new stuff in the game you need the guide for"}
{"product_id": "B00FOGFP0A", "context": "If this is a UK release what are the downsides of playing it in other country? i mean codes, or is it even playable outside UK?", "response": "The only downside is if you want to download additional content, you'll have to do it from the UK playststion store.  Everything works perfectly on a US PS3."}
{"product_id": "B002CZ7P04", "context": "I have a problem with the contoller.  When I am in the menu for pause/save, etc., the controller arrow floats and I can't control it.  Does anyone else have this problem?", "response": "I had a similar problem during the game when my controller batteries were low. Change your batteries and see if that helps."}
{"product_id": "B002I0H79C", "context": "iS iT 3 pLAYER", "response": "The campaign is playable from 1 up to 4 players. An AI will play the fourth character. Enjoy!"}
{"product_id": "B00EZKNSTQ", "context": "how long is the cord on the Microsoft Xbox 360 Wired Controller", "response": "I bought it for my Grandson. It is approx 6 feet long. He dances around & jumps up & down in front of the Big-Screen. Plenty of room for that."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "When using those \"channels\" from the ps3, yes.  This remote controls your ps3 just like your dualshock controller does.  Also can act as a universal remote for surround sound and TVs."}
{"product_id": "B00HGAWFJG", "context": "Can you turn the light off? Or, does it turn off while in stand-by mode?", "response": "As to the answer I am sorry you cannot turn it off and it does stay on in stand-by mode.  If you want it off unplug the usb."}
{"product_id": "B00CD90R72", "context": "Is there a 2-player mode where my wife and I play on the same screen?", "response": "Hi mkirn887, first you're a lucky man! How did you get your wife to play FIFA!? Now there is a 1 vs. 1 and also you can both play on the same team against the COM. Just switch both controllers to the same side at the chose your side screen. Good luck!"}
{"product_id": "B00BMFIXZG", "context": "Does this work at all with windows 8?", "response": "I don't know I have 7"}
{"product_id": "B005DKZSVS", "context": "I bought one but the software can not run correctly. It doesnt work now. Where can I get help? I have visited the website of mad catz and ambx", "response": "Well.... Chances are it could Just be broken? One of mine broke, at first I thought it was just a software problem but eventfully determined it was faulty hardware, I returned them and got my my money back! Shortly after I discovered the adalight mod, in in love with it, recommend 100% worth the hard work"}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "They fit perfectly with my controllers. The light flashes to load then it turns on like normal."}
{"product_id": "B0091A3AHA", "context": "Will it work with the Xbox One, PS3 & PC? Does it have speakers & HDMI? How is it powered?", "response": "I use  mine with my Xbox One. Yes it has speakers,  HDMI in and headphone jack. It comes with it's own power brick."}
{"product_id": "B000VBFWAG", "context": "Do you have to have this disc in the computer to play it", "response": "Yes it needs disc 1 to play"}
{"product_id": "B004C4U1VI", "context": "We have an xbox one and these cables do not work?", "response": "That doesn't surprise me. I bought them thinking they would work for my xbox 360 because of the way they were advertised. They may work for older xbox 360's, but I think they're mainly for the regular xbox & not anything newer."}
{"product_id": "B003Q9RGRW", "context": "can you plug in both at the same time", "response": "yea i have all of them connected at the same time at all times"}
{"product_id": "B009RXUNZI", "context": "will it work with xbox one", "response": "Yes I use mine with Xbox one but you need the adapter from xbox"}
{"product_id": "B0095D1CM8", "context": "How long of a cord does it have?", "response": "Pretty long, I don't have it now, but i was about 3 1/2 feel I think"}
{"product_id": "B00ATHFLZS", "context": "does it work for minecraft", "response": "It works well with any game, really."}
{"product_id": "B008J16AH4", "context": "can 2 players play at once?", "response": "Sorry, no. 1 player at a time but you can take turns. It's still great fun.E-8"}
{"product_id": "B006JSY3MI", "context": "DVD vs Download difference? Since they both use Steam, is there really any difference? Does the DVD still download from Steam to install?", "response": "I don't think there is any game-play difference.  Some people like to own the box art but generally just buying it on Steam is faster."}
{"product_id": "B00DHUUTEM", "context": "Does it come with software to configure the programmable keys? If not what software did you use to configure them, and was it easy?", "response": "Does anyone know where i can get the directions on how to setup the macro's i cant seem to remember if i even got a directions book with it."}
{"product_id": "B0087ZMATE", "context": "is this a good headset if i need to hear people calling my name?", "response": "Absolutely. It is not a soundproof headset meaning you can still hear people and sounds (doorbells!) that are away from you."}
{"product_id": "B000H67DDY", "context": "Will the Saitek Pro Flight Rudder Pedals work with Windows 8?", "response": "I have a windows 8.1 and it is perfectly compitible"}
{"product_id": "B00IP0H4GA", "context": "so it definitely plays on us ps3's?", "response": "Yep it plays perfect"}
{"product_id": "B007VTVRFA", "context": "If i buy this off of Amazon can I play multiplayer with friends who buy it through EA?", "response": "That is my understanding. I didn't do it, but I believe that is built into the game."}
{"product_id": "B00D9EPI38", "context": "Can i play dvds from it?", "response": "Yes it plays DVDs"}
{"product_id": "B006JSY3MI", "context": "Do you need internet when using this game?", "response": "It installs through Steam, so yes, at least for the original setup."}
{"product_id": "B00BCEK2LU", "context": "Can you change the color and/or turn off the key lights for specific keys or is it all or nothing? ie. only light up WASD and a few others in games?", "response": "All or Nothing.  One color, all the same, on or off."}
{"product_id": "B0096L2SJ0", "context": "Can you use this as a gamepad for your PC or Mac as well?", "response": "It is possible, but it is not plug and play. If you look around online you can easily find plug-ins and patches to make it happen, but it may take a little work."}
{"product_id": "B00BRA9T5Y", "context": "How big is the USB dongle?", "response": "It's a usb 3.0 so it fits most if not all computer ports"}
{"product_id": "B00CJ7IUI6", "context": "What is the biggest difference between this legendary edition and the greatest hits version? if I just want to play the game, which version is best?", "response": "Legendary gets the 3 expansion (worth 50$) if you buy from psn store.  Greatest hits is only the original game at a reduce price."}
{"product_id": "B00BGAA0SU", "context": "Is this game 3rd person only?", "response": "Yes, it is a 3rd person open world adventure game."}
{"product_id": "B009JZ04BC", "context": "Is this the product is retail packing or bulk?", "response": "Its nice retail packaging. Nice and sturdy with no wear or discoloration."}
{"product_id": "B003O6CBIG", "context": "Can I Change the language???for example spanish?", "response": "I have never tried but I think u can."}
{"product_id": "B002RYLG4Q", "context": "how well would it work on a samsung flat screen tv?", "response": "does the zapper gun work with this system so you can play Duck Hunt?"}
{"product_id": "B00D7UHT0E", "context": "will this play on a Wii mini?", "response": "No it is not compatible."}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "Yes it sure does!"}
{"product_id": "B00EPZ8POY", "context": "Hello, I want to know if if the cover looks like the one in the picture? also, does it have spanish subtitles? thanks", "response": "Yes, that's the cover picture, and no, it doesn't have spanish subtitles, only english subtitles and menu."}
{"product_id": "B0083H4NG4", "context": "Hi, i dont understood if thisa mouse had wheel tilting or not, i rly hope there is no tilt wheel function. i hate it on my precision mx.. if i need to", "response": "The scroll wheel can be clicked (like a middle button), but has no tilt functionality."}
{"product_id": "B005THAX5Q", "context": "Why is this game is this game so horrible", "response": "Its ok it depents I rather enjoyed it but I'm also a hardcore aliens fan so I like almost any alienss game but the graphics are kinda crappy the gameplay is kinda like call of duty I would give it 5 out of ten"}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "Yeah. If you don't have online or internet connection you can still play the story mode"}
{"product_id": "B00002SANH", "context": "does it read to the player or does the player have to do reading on each page to understand what to do next? My child is not proficient enough to read", "response": "The player has to do the reading.  Not sure how old your child is but I would say this game is geared towards 4th grade and up. Actually my kids took no interest in this game as it is very dated... ie. graphics etc.  Idea behind the game is neat but too dated. Wouldn't recommend"}
{"product_id": "B003O6N64Y", "context": "Are all accessories included? Like the wireless tower and or mix amp?", "response": "Yes, a tower/headset holder."}
{"product_id": "B001DU25UO", "context": "Does this work on Windows 8?", "response": "Yes it works fine with Windows 8."}
{"product_id": "B00F4GSAYI", "context": "How long is campaign", "response": "First time through... roughly 18 - 20 hours long."}
{"product_id": "B0050SZE2G", "context": "Do you need steam to play?", "response": "Probably not for the disk version. There's a steam version but I think it's digital only. For the disk version you'll get to use uplay. Yay!"}
{"product_id": "B000TT2D2A", "context": "can you use theese with rock band 5", "response": "You mean Guitar Hero 5?"}
{"product_id": "B002I090AG", "context": "Does it work with ds games?", "response": "Sorry, I'm not sure. This is the first handheld I've had since original game boy. You can probably find out on the factory website."}
{"product_id": "B000B78F72", "context": "I want a cd that I can download to my pc and not have to interact with other sites and don't have ads - just a icon my husband can click on & play?", "response": "I found that Pretty Good Solitaire was just what my wife and I were looking for.  Lots of games and no ads.  We got the CD just in case something goes wrong with the computer and I have to reload it.  But the game package itself is totally reliable and fun."}
{"product_id": "B00DBCAT3W", "context": "A question - is gameplay for Fable Anniversary similar to games like Oblivion, with first-person perspective and all?", "response": "you don't get to look through eyes just from behind"}
{"product_id": "B00BV72X1U", "context": "Is this compatible with mac?", "response": "Yes that is what I bought mine for"}
{"product_id": "B00F27JE1C", "context": "Does this model come with a memory card?", "response": "no!.... It does NOT come with a memory card!.... still a very cool item!.... I just purchased a memory card apart! :)"}
{"product_id": "B00CX8VYM0", "context": "Is this a digital code or the actual game disk?", "response": "When I ordered it I received a brand new disc. Factory packaging unopened."}
{"product_id": "B003O6CB6S", "context": "does this include multiplayer?", "response": "Yes. It a great game even playing single player"}
{"product_id": "B00007JNFE", "context": "Is this a bagpipe?", "response": "No it's a mouse like accessory. I think it's cool but not worth the time to get used to it"}
{"product_id": "B003Y5AHPG", "context": "Do I need to buy any additional controllers to play any particular gaming system of the three", "response": "No, but.... I recommend buying other controllers because I feel like the ones that come with it are cheap"}
{"product_id": "B0050SXKU4", "context": "Is this game at all appropriate for a 13 yo boy? My son is begging me for this, and it doesnt seem appropriate IMO.", "response": "No mam it's not but they is completely up to the parent"}
{"product_id": "B004RMK57U", "context": "i have redeem the code in my ps3 system,can i use it again in my ps4 system?", "response": "It only works one time but if it's the same account on both systems then it's automatically added to your ps4."}
{"product_id": "B00EFFVZP0", "context": "Im planning to purchase this game CD in US amazon store, will it work on an asian console? i also have an american account BTW", "response": "I would check the region regarding your console and compare it to the disc's. It won't play if the region for the disc doesn't match your console's. The disc regions can also vary regarding the seller."}
{"product_id": "B00GPH7Y8S", "context": "will this run on windows 8?", "response": "yes I have it on 8"}
{"product_id": "B0009VXBAQ", "context": "what games go with it", "response": "It all depends on the buyer if it comes with games. Mine didn't come with any games but I already had games for it."}
{"product_id": "B006PP4136", "context": "Would a ps vita slim fit in this case?", "response": "I have the first generation PS Vita, it looks good; for the second generation I think it would be a great thing because that version is a little thinner but you should have no problem using it."}
{"product_id": "B005J37I4Y", "context": "IS XP500 THIS COMPATIBLE", "response": "As long as the xp500 can sync to a bluetooth source yes,"}
{"product_id": "B00GLG2D4I", "context": "Is this compatible with a the PS3?", "response": "Just Because it is blue tooth does not mean it will work with the PS3.  Even Sony itself says on their website that.  I have bought Sony Products that are bluetooth that DO NOT work. you have to ask the corporation to make sure it will.https://support.us.playstation.com/app/answers/detail/a_id/245/~/ps3-compatible-headsets"}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine.", "response": "You should have an xbox 360 for it to recognize the game you wanna play remember it has to be an xbox 360"}
