{"product_id": "B000BT4CF4", "context": "compatible with vista 64bit? Can someone tell me if this will work with vista 64bit?", "response": "Yes it is.  Here is the link for the drivers:http://download.microsoft.com/download/6/9/4/69446ACF-E625-4CCF-8F56-58B589934CD3/Xbox360_64Eng.exe"}
{"product_id": "B009RHEBWA", "context": "Is there a limit on how many people can file their tax using it?", "response": "Yes, there is a limit of five people who can file their tax using it. There is alos five free Federal e-files included.I file my taxes and my daughter's every year with the software."}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "Yes you can :) you can link both together"}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "It is just the dlc but you can probably pick up the game at walmart for $15. But it would probably be cheaper to buy the legendary edition that comes with dlcs"}
{"product_id": "B0072G4LB4", "context": "Does it works on win 8?", "response": "Yes! I am using it every day on a Windows 8 computer and it works great!"}
{"product_id": "B0033WFJFS", "context": "how do I get the instructions to use this control", "response": "there isn't any instructions, its just a plug and play controller. I don't recommend it for purchase."}
{"product_id": "B00A2WP4UC", "context": "What is included with this.  Does it play all WII games just like regular WII?", "response": "Yes, this plays all Wii games.  It has the console, antenna, controller and nunchuck.  This one also includes the skylander's start up figures and the game.  The blue color is specific for this skylander bundle."}
{"product_id": "B005YR308S", "context": "Are there a lot of complicated button combinations to push? Is this at all similar to Diablo? Apologize for the simple terms. I'm new to the PS3.", "response": "The quick answer is No, but depending of the difficulty and if you want to Platinum the game (have all the trophies) there are a few complicated parts like making a correct sequence 100% perfect, but if you want to just to play and enjoy it shouldn't be difficult is just another point and click game like walking dead."}
{"product_id": "B0094H8H78", "context": "can it be plugged to tv?", "response": "I don't think so, but you can get the arcade master and that can be plugged in. The arcade master has a joystick and buttons like arcade machines and it has all games like the ultimate portable"}
{"product_id": "B00ENFVJJO", "context": "How do you know when it's done charging is there like some light or something", "response": "A light will be on while it is charging, and then turn off when it is done charging."}
{"product_id": "B00CJ7IUGS", "context": "do i need internet connection to download dlc content onto my xbox?", "response": "No. With disk 2 (included on this version) you install."}
{"product_id": "B001GROEEO", "context": "This works for the ps4?", "response": "yes, it works perfect for the PS4!!!"}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "What's the out one for?"}
{"product_id": "B00BGGIWZM", "context": "Do you need sims 3 to play expansion packs", "response": "Yes but it is so worth it!:)"}
{"product_id": "B00FXOP1JI", "context": "CAn you transfer the pre installed game to a bigger sd card?", "response": "Yes, although it'll only work for that nintendo 3DS system. You can't use the card on other system"}
{"product_id": "B00726ARTE", "context": "Does it require separate ports for the headphones & mike, or will a single headphone jack for remote phone or cell allow hearing AND speaking Thanks!", "response": "On a cell phone the single port works for both speaking and listening but on a PC it requires a splitter which is included in the packaging."}
{"product_id": "B004CFASL0", "context": "will they play on Windows 7?", "response": "So far, yes. They are playing on an HP ProBook i5 first generation laptop. I'm not sure about newer processors but I wouldn't think you would have any problems."}
{"product_id": "B003CP0BHM", "context": "So, where is it already? I've had my order in for months, anyone have any better idea of a release date?  No answer from them.", "response": "Not sure about you, but Q2 for me ends on Jun 30.  ;-)"}
{"product_id": "B001NXDBI6", "context": "Is there anyway to use the usb 2.0 ports to make this a wireless keyboard?", "response": "No, the usb ports are basically a usb hub so you have to plug the keyboard into the computer to make the usb ports active."}
{"product_id": "B003O6EE4U", "context": "do you ship this item in its original box?", "response": "original yes new in the box"}
{"product_id": "B00A378L10", "context": "Will this keyboard work with a Mac?", "response": "It should work as a basic keyboard but I don't think the media keys/shortcuts will work"}
{"product_id": "B00FJWNSU8", "context": "Does this version come with all the DLC's?", "response": "Yes, all dlc incluided in the game"}
{"product_id": "B0088MVODO", "context": "are these the games?", "response": "The one i got was only 6 didnt have any other game with it"}
{"product_id": "B007C3E5WM", "context": "does it work for windows 7", "response": "Yes, you just plug it in and give it a few seconds and it will work"}
{"product_id": "B007C3E5WM", "context": "Is this mouse compatible with a macbook pro?", "response": "Yes, I use it with my macbook"}
{"product_id": "B001GIOGBY", "context": "my brother has had this yoke for a few years and it has worked fine.  recently it has begun \"pullling\" the plane to the left.  any ideas?", "response": "Other than re-calibrating/centering - sorry no."}
{"product_id": "B009SJR278", "context": "Could this be used on Xbox 360? If not, can I buy an adapter?", "response": "With an adapter yes but you life would be easier withhttp://www.razerzone.com/gaming-audio/razer-tiamat-71 or http://www.razerzone.com/gaming-audio/razer-carcharias-for-xbox-pc but there not as good quality wise"}
{"product_id": "B005LUUWL6", "context": "Does this work for 3DS games, or is it just a ARDS that works on the 3DS?", "response": "It depends because many 3ds games don't have codes for them but some do"}
{"product_id": "B006LVZEN0", "context": "It looks like there is a giant screw sticking out the bottom of the mouse that would jam into my wrist if I tried to palm the mouse.  Why doesn't it?", "response": "With the palm rest all the way in, like in the photo (and the way I have it), your hand is angled above it.  With the palm rest slid farther out, it's actually covered over."}
{"product_id": "B003O6C0V4", "context": "I just got mine today in the mail and the leg sensor WILL NOT SYNC AT ALL!! I used 10 different batteries, and stood there for 30 minutes pressing the", "response": "I would return. I never got mine to work."}
{"product_id": "B00HS5FETM", "context": "I have px3. I hooked it up where my game in sound on the transmitter is connected to my headphone Jack on TV. why do I need this cable??", "response": "This cable is for PS4 connected from the audio jack of the PS4 controller to the TB PX4 headset to do online voice."}
{"product_id": "B002CJ8Z04", "context": "how do you know if it is a fake or real game, thanks.", "response": "The case is green. If the case isn't green, it's not a Pokemon Emerald game."}
{"product_id": "B0009SUW4W", "context": "will this work on windows 2007", "response": "yes, I have windows 7, and had this game over 4 or 5yrs, lots of fun"}
{"product_id": "B00CH923NE", "context": "is it  Japanese version or American version？", "response": "I received the Japanese version. I am trying to get that worked out now."}
{"product_id": "B0009WPZOA", "context": "Is it okay for an eight year old? I worry about language.", "response": "Yes. There a few cuss words in there, but not many and they're few and far between. Most Need For Speeds are fine because they're racing games so there's not much talking."}
{"product_id": "B00H8NS1K8", "context": "If you take the 3.5mm TRRS jack at the end of the short cable and plug it into an iPhone instead of to the extension cable, what happens?", "response": "It works perfectly fine without the extension cable.  I have tried it using FaceTime and cellphone calls.  Audio and voice come through clearly on my end and the other end."}
{"product_id": "B006RJ373K", "context": "Can I use it with Windows Vista?", "response": "I use Windows Vista and finally got it to run.  It was extremely slow to load, in fact, so slow that I thought it hung up.  Go to their website and see if your PC has the minimum requirements to run."}
{"product_id": "B00EV7AYAO", "context": "can this be connected to a laptop?", "response": "If your lap top can take USB than yes"}
{"product_id": "B00FXOP1JI", "context": "Does bundled 3DS come with dc charger, or does the dsi car charger fit the 3ds? thanks", "response": "Yes, it comes with its own charger, original for 3ds as any other bundle...  About the dsi car charger I don't know if it works...  You could try thou. Greetings"}
{"product_id": "B009WGUYIG", "context": "can i play this with 3Ds", "response": "Yes. You will need to buy the Skylanders Giants or SwapForce starter kit for the 3DS, and  you will be able to use all your Giants action figures."}
{"product_id": "B00FC1UH82", "context": "Is it wireless? or you have to plug it via usb?", "response": "It needs to be plugged in via USB. It can also be used on the PC if you have a joypad configuration program on the PC."}
{"product_id": "B00FENJVOE", "context": "Do I need an original diablo 3 before I installed this expansion?", "response": "Of course. This is a DLC."}
{"product_id": "B00AXI9WFS", "context": "Will the figures and the stories work with 2.0 since this is 1.0 stuff?", "response": "The 1.0 figures will work on 2.0.  The 1.0 playsets will not."}
{"product_id": "B00G6MW5CC", "context": "can single person play game", "response": "Yes and I also recommend it if you like FPS"}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "No single player. There is campaign, but that's just multiplayer matches with story"}
{"product_id": "B000LQ4HTS", "context": "Does the throttle work on it's own, since I'll be using a different stick?Thanks in advance.", "response": "I think so, the throttle is it's own unit so in theory it should work."}
{"product_id": "B0002EAA36", "context": "Is this windows 8.1 compatible?", "response": "P&P; on Windows 8.X, no other drivers needed,"}
{"product_id": "B00B1VJZO4", "context": "The installation is not working !!!!!!! It says that you have to have sims 3 installed before? WASTE OF MONEY", "response": "Maybe you should install The Sims 3...That's how The Sims works."}
{"product_id": "B0053B66KE", "context": "does it play on a new 2ds?", "response": "It should considering 2ds can play 3ds games. Pokemon X & Y don't really use the 3D feature anyways."}
{"product_id": "B00CX8VYM0", "context": "Should i buy this game? I honestly suck at games, I give up easily on timed stuff or too difficult, but this game looks interesting", "response": "Definitely a button Masher friendly game. Lots of free world time you can just run around and explore too."}
{"product_id": "B00J128FPA", "context": "I own the standard edition, but a friend of mine is ordering the collector's edition. Is there a way for him to give me the extra content?", "response": "Yes, The extra content which i believe is the In game bonuses that you are referring to are redeemable through playstation store. anybody can redeem it."}
{"product_id": "B00IIHU44E", "context": "does it have blu ray", "response": "Yes it does. It does require an Internet connection to download the blu ray app, which gives you that ability. So you could do that when you do the mandatory day one update of your console, which requires Internet connection as well."}
{"product_id": "B00EEMLRTS", "context": "If I bought this and bought a xbox one later, can it be transferred later? I had read somewhere that it was possible.", "response": "http://www.callofduty.com/ghosts/dlc/season-passThe season pass should follow you for free if you bought it before May 31, 2014, but I don't believe the game is available for a free upgrade anymore."}
{"product_id": "B00D5WDI3G", "context": "Can I install the software in several computers ?", "response": "A leaflet that came with my Chess King 2 states \"You have the right to install the program on a maximum of 4 computers.\""}
{"product_id": "B004J6KRD6", "context": "is it better than t300rs ?", "response": "The pedals on the t500 are WAY better, but the wheel deck is probably a little better on the t300. Not much. I would take the T500 all day long."}
{"product_id": "B003V4AK8E", "context": "Is there anything we can do if a brand-new controller won't charge (i.e. if the controller can't operate unless it's plugged in)", "response": "It's a faulty battery. Needs a new battery. In the case of this controller where the battery is built in, you're probably better off returning it and getting a new one. If that's not possible, I guess you can try taking the back off and looking for a similar battery on amazon or something."}
{"product_id": "B000PT18OS", "context": "How do I know which one I need? I had two 360's and one got stolen.  Apparently I had the bricks switched because the one I have left wont plug in.", "response": "Look at the back of your xbox where the power plugs in see if it looks like the plug on this brick will fit it.  If your xbox is white this brick will work."}
{"product_id": "B006W41X1S", "context": "do these head phones actually allow you to hear the game play audio or just voice chat ?", "response": "It lets hear both and u can hear music too"}
{"product_id": "B00ANHBJBY", "context": "Hey guys I'm having trouble with this controller in Wii Mode. Able to sync but the battery is always 0% in Wii Mode after charging. Can anyone help?", "response": "This controller can't be used in Wii Mode. (It's basically just like the Wii U Pro controller, only with a different design.)"}
{"product_id": "B00AWEMODK", "context": "I already have the game and part of the expansions on my computer, if I bought this just for the extra expansions, will it install on top ok?", "response": "Existing users missing even so much as one or even all of the expansions will find they get all of them when using the code from this, also don't forget you get some items when you check your inbox in game."}
{"product_id": "B002RYLG4Q", "context": "I heard if you played the original NES this system has a slight delay compared to it, have you noticed this delay (if any) and if so is it noticeable?", "response": "i haven't noticed any noticeable delay.this system is very glitchy, keep in mind that the games have age as well. this system is cool but very, very poor quality."}
{"product_id": "B000035Y6D", "context": "Does it come in the original box?", "response": "No.  And the console didn't work.  I used the cords that came to hook up to a previous console I already had."}
{"product_id": "B005HN5LKY", "context": "Does it come with all the parts to plug into the wall and the xbox?? Like does it come with the part that plugs into the xbox to the brick then from the brick to the wall??", "response": "Yes it does, it comes with all the parts. It is in great condition."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "I tried it on Netflix and had to use the regular PS3 controller :( my flat screen isn't smart but I'm sure it would work for that Netflix etc because it controls all of my Samsung TVs menus etc.."}
{"product_id": "B00FJWNSWQ", "context": "Is there an actual story line or just fighting tournament style?", "response": "Yes there is an actual story line, but all combat is tournament style similar to a mortal kombat game."}
{"product_id": "B00CJ7IUGS", "context": "What is the difference between the Legendary Edition and the other one?", "response": "Legendary edition has all the DLC content with the game"}
{"product_id": "B007R9PWLY", "context": "I am buying a laptop with a 1 tb hard drive and 8gb solid state. In this configuration is the OS put on the HDD or SSD?", "response": "The OS is probably on the SSD for fast boot up.  Otherwise, why have an SSD. Hope this helps."}
{"product_id": "B00EZKNSTQ", "context": "Does it come with a usb breakaway cable?", "response": "Yes  Nathen it does I HAVE THIS controler for 3 weeks now and its still the best one ever"}
{"product_id": "B007OVHW90", "context": "Will it work for X42's?", "response": "It should work as far as I know."}
{"product_id": "B003VUO6H4", "context": "how many controllers can it handle?", "response": "Goes up to 7 players"}
{"product_id": "B00HKCKA0G", "context": "We plugged in theadset to controller for ps4 but in Settings, then Sound and Screen, then audio output settings, no \"output to headphones\"...help?", "response": "The options should be \"Chat Only\", which only sends the chat talk, or \"All\" which sends chat plus all game sounds."}
{"product_id": "B009WI7V9E", "context": "Just asking, if the DLC's are on a disc, does this mean that if I get this used I can still get them?", "response": "Yes! They come on a disk, so I'm sure you'd be able to grab em' if you go to gamestop or anywhere they may sell it. It's pretty rad"}
{"product_id": "B00ENFVS5Y", "context": "Does this have the most recent update? And did they fix all of the earlier batch problems?", "response": "From my experience I would say no.....mine came with old software and even when it broke and I had to send it to Montreal to be fixed it came back with the old software....this was 6 weeks ago."}
{"product_id": "B00B15EXJC", "context": "Does this controller work well with call of duty games", "response": "It works well overall. However dont use turbo on full auto weapon since full auto weapon is going to turn to semi auto. But weapon that's originally burst or semi auto, it fires quite fast like M8A1 or S12."}
{"product_id": "B00BGA9X9W", "context": "CAN BE THE PS4 CONTROLLER USED FOR PS3?", "response": "This can now be used wirelessly as of today! http://www.ign.com/articles/2014/07/02/ps4-controllers-now-work-wirelessly-with-ps3-consoles"}
{"product_id": "B004C4U1VI", "context": "Are new cables supposed to come in a box or just in a plastic bag? I just got them in a plastic bag and wanted to make sure they aren't used.", "response": "They aren't used.  Ours came in a bag and work fine."}
{"product_id": "B00I9GARIM", "context": "Does anyone know if a gaming mouse will fit into the space between the headphoens in the carrying case? Has anyone tried it?", "response": "I have a small Logitech cordless mouse that fits nicely with mine. Depending on how big the mouse is I'm sure you won't have a problem."}
{"product_id": "B00D2EGWDA", "context": "Is nuke town map and extra zombie map included on the standard version or is it only on the other versions like the hardened or deluxe pack?", "response": "Nuke town and zombie only come with map packs, or versions like the revolution pack which gives you lots of stuff along with a season pass"}
{"product_id": "B00CJ7IUGS", "context": "It says \"Better with Kinect Sensor\" but is it really necessary?", "response": "Kinect is problematic, and you do not actually need it."}
{"product_id": "B00F4GSAYI", "context": "I know there is a second disc for the dlc's. Do I need to install the second disc and play them with the first disc?", "response": "No you can play the first disc...or install the dlc from the 2nd...once you install it...it goes to your hard drive...both are not needed...hope this helps."}
{"product_id": "B0097CUREG", "context": "will this work on a mac?", "response": "Don't know for sure, but I didn't see anything on the packaging to indicate that it does.   Sorry for the late response. Just got out of hospital after 9 day stay.        Hope you get an answer that you want............   AL"}
{"product_id": "B004S5TDUQ", "context": "The description says it comes with the cable, but does it?  I already got burned by another seller where the description said it came with the cable.", "response": "Mine had the cable and was ready to use.  Love it."}
{"product_id": "B00562O8U0", "context": "would they work with the sony VPL-HW40ES", "response": "These glasses will work with this projector.  It has a built in IR transmitter."}
{"product_id": "B0053BCO00", "context": "Works in the 2ds?", "response": "Yes! All 3ds games work great in the 2ds."}
{"product_id": "B004FS8LYK", "context": "why is it rated m for mature", "response": "Graphic Violence and Language"}
{"product_id": "B0045FEEAS", "context": "Is this internet accessable for Netflix download and movies?", "response": "I watch Netflix and Hulu on this with no problems."}
{"product_id": "B00FYMTUQY", "context": "Will the mount scratch the front of your tv?", "response": "I haven't noticed any scratches on mine.   It basically rests on top of the TV bezel and has a slight overhang so that it grips the top and then it has a piece that helps it grip the back of the TV.It is held in place well, but it's not super tight."}
{"product_id": "B007JM8ULS", "context": "Can i play Titanfall with this hardrive", "response": "don't know about titanfall but I have tiger woods 13 and black ops in it with no problems at all."}
{"product_id": "B0050SYILE", "context": "Is Assassin's Creed 4 a better choice than Grand Auto Theft V?", "response": "It depends on what your looking for. Personally I would get v because its got a selection of characters you can play as, as well as an interesting story line.  Plus the online game play is fun."}
{"product_id": "B0007MZWQS", "context": "Would you please provide the FCC ID on the bottom of the system?", "response": "FJ8USASEGA i bought new cords including av cord just to make sure. Unit is no good. worst experience ever"}
{"product_id": "B00H4BBVZQ", "context": "Is it worth it to get the GOTY edition or is the regular one ok?", "response": "my personal choice is the regular one"}
{"product_id": "B001AWBYRA", "context": "If I buy the physical copy of the game will that redeem on steam?", "response": "Steam is a client for digital downloads. It uses digital product codes for redemption, not any disc."}
{"product_id": "B00B1MXGDO", "context": "i have a wireless adapter for my pc. would this controller sync to it so i can play wirelessly on my pc??", "response": "No. It needs to be plugged in since there is no battery pack on the controller."}
{"product_id": "B001NXDBI6", "context": "will the LCD work with iTunes, or do you have to use windows media player?Is having the LCD panel worth it?", "response": "As far as I know, the LCD serves only to show computer functions, principally keyboard functions within games. It's not a mini-monitor to the outside world. I'll know the answer for sure when Logitech gets around to sending me a replacement keyboard for the defective one I bought."}
{"product_id": "B00EZPCWWA", "context": "Do you need wifi to operate the ds", "response": "Yes..if you want to play multlayer online game or download digital contents from eshop."}
{"product_id": "B006YDPU48", "context": "Does this game have an online co-op mode where you can play private with a friend?", "response": "Yes it does. Your friend can use and item called the \"White Sign Soapstone\" to put down a white \"Sign\", which you can then activate to summon them into your world, and so on. There is also a PVP element in which people can invade you, so be careful."}
{"product_id": "B006NU6HAS", "context": "Is the shipped version English or French ? The photos show the box in French", "response": "The version I received was (shipped) out of Florida... in English"}
{"product_id": "B00DBRM3G8", "context": "what difficulty mode is best to play on?", "response": "Depends on how good you are?"}
{"product_id": "B006JSY3MI", "context": "Are the controls for the PC version easy to use?", "response": "Yes. controls are the mouse, the space bar, and keys s, d, f, e, and g."}
{"product_id": "B00F8W9SWQ", "context": "Does this keyboard have feet, to elevate the back of it?", "response": "Yes. There are two feet at the back that you can flick in or out. They also have rubber over the plastic at the tip of each foot to keep the keyboard from slipping around."}
{"product_id": "B00FEOR4MY", "context": "The description says it holds 6 games, but it looks like it holds 12 in the photo.  Which is correct?", "response": "The one I received from this company has 12. There are 3 rows of 4 in the case I bought for my son."}
{"product_id": "B005FMLZQQ", "context": "does it works on DVR?", "response": "Depends on your application works with mine but I have a El cheapo. Look on the Microsoft site for the codes and brands it covers."}
{"product_id": "B00B1VJZO4", "context": "-_- I can't get to it! WOW, what a waste of money.", "response": "Can't get to what?"}
{"product_id": "B004S5PBM0", "context": "Does it support a left hand string guitar", "response": "Yes, it does, however I would recommend getting Rocksmith 2014 and this title them importing the songs."}
{"product_id": "B002BSA298", "context": "This items comes with the power supply cable for the old console?", "response": "It had both the traditional Kinect-to-Xbox 360 cable and an additional PC adapter."}
{"product_id": "B00DNGQQUQ", "context": "Is Tapion in the game?", "response": "I don't know , I gave this DVD to someone for gift."}
{"product_id": "B000H1V56U", "context": "Does this fan have a four pin connection?", "response": "Yes, it has the 4 pin connection for the old xenon motherboards."}
{"product_id": "B00503EAG2", "context": "Does this come with a new product key for activation on Steam? (Physical copy + Product key?)", "response": "Yes, when you put the disc in it registers through steam."}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "I bought two, 1 for my normal us released one, and one for my girl friends slim (also us released) and it works fine in both. Sony made there products region free just for this instance. (long story short Yes it does work with them)"}
{"product_id": "B004W1IX1G", "context": "is Wii motion required?", "response": "Yes, it is required."}
{"product_id": "B009DYOPK0", "context": "What is the longest you have used this mouse (not just owning) without having any problems (espeically in the scroll wheel department)?", "response": "The longest I have used the mouse without problems was 6 months. At that point, I would get an error message saying that the Win 7 can no longer detect the USB device. Only rebooting would fix this. Don't recommend for intense gaming situations."}
{"product_id": "B002I0KP4G", "context": "I have a Mac Mini i5 2.3. It's ok to play it?", "response": "prob not as the grahhics are very demanding"}
{"product_id": "B004JQK2E0", "context": "do i have to be on the internet to install port royale 3 pc game", "response": "You have to have a klypso account to play so I would say yes"}
{"product_id": "B00CMC6HZ6", "context": "The game worked at the beginning, then I had to update my xbox for xbox and the game is unrecognized disk. please help other games work fine.", "response": "It work good you have a bad disc"}
{"product_id": "B00DB9JYFY", "context": "Does anyone play this game online anymore?", "response": "I don't anymore. And I don't see a lot of people play it anymore. So I don't think so"}
{"product_id": "B001V9PTVE", "context": "Fallout Tactics does not run, cannot find the CD. Has anyone found a real solution? Win7", "response": "http://www.neoseeker.com/forums/492/t371942-insert-fallout-tactics-cd-error/ this will help. http://www.fileplanet.com/59152/download/Fallout-Tactics-BOS-patch-1.27 heres the patch.http://m0002.gamecopyworld.com/games/pc_fallout_tactics.shtml#Fallout heres the nocd patch.http://www.nma-fallout.com/forum/dload.php?action=file&file;_id=1241 high resolution patch. And this could help toohttps://answers.yahoo.com/question/index?qid=20101229133858AAO2qzv"}
{"product_id": "B003O6JJKY", "context": "is it working good?", "response": "Yes, it works perfectly fine. I have had no problems with it what so ever."}
{"product_id": "B00DBDPOZ4", "context": "How long is the cable?", "response": "Its just as long as the 360's play n charge kit. Worth it!"}
{"product_id": "B005J2LW6A", "context": "Does this game support English (Menu)?", "response": "No.  It's in Japanese language."}
{"product_id": "B00GY4OAM0", "context": "Forgive me if this seems a stupid question, but how do you get it into two player mode on the PS3? I don't see any options anywhere!", "response": "Sorry but I have the wii u version. I have no clue how to help you :("}
{"product_id": "B007CM0K86", "context": "Can you play the girl as the main character? or do you have to play the man?", "response": "You have to play the man"}
{"product_id": "B00002SANH", "context": "I have Windows 8 on my computer. will this work?", "response": "Windows 8 I'm not sure I have 7 & it wouldn't work i luckily have a laptop that has XP on it so that's how I found out it worked on XP"}
{"product_id": "B0058FAEAS", "context": "Does it have changing resistance/ different feel based on airspeed in order to mimic the pressure required to apply control inputs in a real aircraft.", "response": "Not that I could discern."}
{"product_id": "B004QRKWKQ", "context": "Does this work with emulators like ZSNES, ePSXe, and such?", "response": "I apologize for no response, however, I am not familiar with what you are referencing."}
{"product_id": "B00I9GARIM", "context": "Does this headset with the PS4 or Xbox One?", "response": "I really don't know. My daughter uses hers on her PC and laptop. It has a USB plug-in, does the PS4? I assume that if the PS4 has a USB port, this would work but I just don't know."}
{"product_id": "B00A1Y2STQ", "context": "how many colors does it has?", "response": "These keyboards display one color.  They are available with blue backlight or red."}
{"product_id": "B00ARCWQOO", "context": "We live in the UK and have bought our x-box here, but this game isn't available in the UK.  Will it work on our UK X-box?", "response": "Yes it should Xbox should be a universal thing."}
{"product_id": "B001EYU1WS", "context": "X Plane 10 compatible? Without downlaoding any drivers and things. Look Im a rookie and i just want to plug it in set my controls and fly in xlpane 1l", "response": "Its almost always necessary download drivers"}
{"product_id": "B009DL2TBA", "context": "can this play Blu ray video?", "response": "Yes plays Blu ray and DVD and burn DVDs"}
{"product_id": "B00DPQ6GPO", "context": "i am a call of dutty ghost on ps3 i like using shot guns., like fal pistol and sniper is the controller good for me in call of dutty ghost?", "response": "Yea its pretty sick run the bulldog with rapid fire it's hilarious...for snipers ehh too much recoil..but use marksman rifles there beast with this controller"}
{"product_id": "B001BZ2F56", "context": "Is this a digital download or a disk download?", "response": "Its disks there are 3 of them"}
{"product_id": "B002P35JMO", "context": "Can this be used simultaneously alongside an HDMI cable? (Can I have this plugged into my Xbox SLIM at the same time as an HDMI cable)", "response": "Yes, I had my Xbox setup with the HDMI cable originally, then plugged in this adapter when I got a headset."}
{"product_id": "B003RS1A7Y", "context": "Is this guitar compatible with Band Hero featuring Taylor Swift?", "response": "yes it is, but remember just in PS3, not in xbox 360, this has its own guitar"}
{"product_id": "B00I5LMSBK", "context": "A weird question but did anyone get a game manual in their case....It dumb but it always bothers me when I get a new game and there's just the disc", "response": "the EU copies had manuals but sadly... the american release did not."}
{"product_id": "B00F8W9SWQ", "context": "Does it have programmable keys? I want a pause/play key for my media", "response": "It doesn't have any media keys but I'm sure you can map any button using a program to use as your media keys."}
{"product_id": "B00BQWTGIS", "context": "Is the goods use a cd-rom to install or download online?", "response": "if your internet is slow is better to get the DVD disk version.if your internet download speed is about 5Mb/s or above then get the digital copy.my internet is pretty fast but I'm old fashion so i wanna have a copy on my shelf is all up to you want to have a disk copy or digital copy."}
{"product_id": "B000O5DY0E", "context": "Will this game work with the new Windows 8 computer?", "response": "It didn't work on my windows 8. So I don't think so."}
{"product_id": "B0038MVFYC", "context": "Does this come with a Nintendo DS?", "response": "No.  As far as I know, it is rare that a game also comes with a console."}
{"product_id": "B00BGA9V2Q", "context": "does this version include the crusader class", "response": "It does not.  You need to look for the \"Ultimate Evil Edition\" to play the expansion.  The UEE version includes the original D3 and is a stand alone game and does not require this version of the game."}
{"product_id": "B00656HLGO", "context": "Will this work on xbox 360 Pro??", "response": "It will not work on any 360.. It's a crappy generic HDD & shouldn't even be on amazon. DO NOT BUY IT. You should just pay extra for a Microsoft brand."}
{"product_id": "B00CX9L30W", "context": "Does buying this come with a subscription?", "response": "it comes with the first 30 days free, obviously you have to sign up on the game site and create an account after you have the game installed."}
{"product_id": "B002AQNT96", "context": "will this game operate on windows 8, also does the pc version support LAN?", "response": "I'm running it on Windows 8.1, and on Windows 10 Technical preview. It supports LAN, split screen, and online play."}
{"product_id": "B00CTKHXFO", "context": "which to buy, Legacy or HD Collection? do I need both? differences? thanks in advance ~ from: a noob.", "response": "I think the Legacy Collection is the way to go. It's essentially the Hd Collection with extra games. Just read the product description."}
{"product_id": "B0050SX4CI", "context": "Need for speed most wanted", "response": "It works with Need for Speed Most Wanted on PS3"}
{"product_id": "B00F27JE1C", "context": "I know that it comes with 1gb on internal storage can I play english games without the use of a memory card?", "response": "Yes u can play all english games, and save all your game saves on the 1gb storage without a memory card. If u decide to buy a memory card later on all saves will transfer over to new memory card."}
{"product_id": "B00E1L786S", "context": "Will this work ok as a center speaker for a 7.1 surround sound system? I already have a Polk subwoofer and other speakers for the system.", "response": "I don't believe it will work as part of a surround sound setup. The input is optical and so I don't believe you can setup the amp to output via the optical port  the centre speaker."}
{"product_id": "B001H4NMNA", "context": "Is there a risk of over charging the batteries and shortening their lifespan?", "response": "Not sure never paid any attention to that but I guess cause I haven't had any problems with my controllers so far."}
{"product_id": "B00002SANH", "context": "This game will not install because I have a 64 bit processor and this game is for a 32 bit processor only. How can I install this game on my computer?", "response": "You can't. This program is for much older computer and won't install on newer models. I had the same issue."}
{"product_id": "B002Q4U5DK", "context": "Does the LED light always stay on? Is there a way to turn it off?", "response": "This WARNING is true. Box and mouse design are excellent counterfeits but not real product at all. Had it been real and detected the legacy config program and synapse have an option to turn the 2 LED off or on."}
{"product_id": "B00286BZ4Y", "context": "can it be used on a regular pc", "response": "It can be uploaded to a desktop or a laptop."}
{"product_id": "B00CMSCTA2", "context": "Is there a suggested resolution at which to play the game?", "response": "I run it at 1360 X 768."}
{"product_id": "B00FOHP8XI", "context": "Is this PS3 Console only a vertical stand or can it be horizontal stand?", "response": "It can be both its ambidextrous like that"}
{"product_id": "B00B1MXGDO", "context": "The additional buttons on this controller act like the Scuf Gaming's paddles right?", "response": "Yes, but they grip your fingers in a perfect way, and are very satisfying to click, plus the dual motion they have make them a 4 paddle system. :)"}
{"product_id": "B00DPJBTM6", "context": "Are these wireless? I read somewhere that there is something to make the A40's wireless", "response": "No they are not wireless and cannot be made wireless. They have a cable that attaches to one of the earcups ."}
{"product_id": "B0018YXM3Y", "context": "why do I have to use steam?", "response": "The game auto downloads to the stam interface, there are probably other buying options that aren't connected to steam though."}
{"product_id": "B00GZ9ESEE", "context": "is the kinect capable", "response": "Yes you can purchase them from walmart I have also seen them at Amazon. I hope I helped."}
{"product_id": "B00178630A", "context": "can you play 2 people at the same time", "response": "No unfortunately it's a single player game.  But you can play online with friends."}
{"product_id": "B007TFOO6K", "context": "Per answer 3, description says blue switches & fully LED back lit. Are the keys back lit  BLUE?  THE DESCRIPTION SAYS YES", "response": "The backlight is red."}
{"product_id": "B000QJ1NS8", "context": "When I turn on my gameboy sp it says the internal battery has run dry and clock-based events will no longer occur.  will this fix my problem?", "response": "No. That message is referring to the battery inside of the game cartridge, not the battery of the system itself."}
{"product_id": "B005MQ3BSK", "context": "Does it have an opening trainer database?", "response": "Truthfully this software is so user unfriendly for me that I never did get the hang of it. I bought it to improve my chess game. Spent so much time trying to learn the software there was no time for chess. If you are not a geek you might want to try something else."}
{"product_id": "B00JFCA6V2", "context": "Which memory card should I get for this if I want to download one or two games, but still have a bunch of save files?", "response": "I got the 16G it's perfect for me, I downloaded a few games(4) and still have plenty of space."}
{"product_id": "B005UI8V6C", "context": "could it be used on multiple computers?", "response": "We just have it loaded on 1 laptop."}
{"product_id": "B00H1FCUBY", "context": "How is the battery life on these headphones?", "response": "The battery life is about 12 hours as it says on the package yet i know personally that they have lasted 10, so that is the maximum that i have tried it."}
{"product_id": "B00EHBKUTE", "context": "Does the Tartarus gamepad have the glue issue horror stories on the palm rest that I've heard about the Orbweaver?", "response": "I have had my tartarus for about a year and used it moderately in that time frame. I have not had any issues with mine. I have a fairly large hand and tend to break cheaper made pc perephials but have had no issues with any of my razer brand equipment."}
{"product_id": "B008M4BNQG", "context": "How is the bass if you want to listen to music on your pc? I want it for gaming but since it can also connect to PC i was just curious.", "response": "The bass on the pla headphones is very clear and clean."}
{"product_id": "B00635N6YI", "context": "Does the mouse work on a Mac?", "response": "The Razer SWTOR products are not listed as supported in the Mac Razer drivers.  So it looks like the answer is no. (Source : http://www.razersupport.com/index.php?_m=downloads&_a=view)"}
{"product_id": "B00FRESQYG", "context": "What does this come with? Is this the same as the digital download of WoW on Blizzard's website?", "response": "I'm not sure how this comes frome the websit, but the box came with discs to download games, and the access codes"}
{"product_id": "B000TKH6H6", "context": "what games are included?", "response": "sorry, I don't remember; I just played solitaire and I no longer use the Hoyle card games"}
{"product_id": "B00009WAUO", "context": "Is SMB 3 more difficult than SMB 2 in your opinion?", "response": "SMB 3 is easier."}
{"product_id": "B003RS1A7Y", "context": "is it compatible with rocksmith guitar game for PS3 ?", "response": "No.  The Rocksmith interface is a glorified microphone.  It converts your guitar's audio into something the game can use.  The Mustang-PRO guitar has no audio output and therefore is incompatible."}
{"product_id": "B004RMK5QG", "context": "what is the different between ps plus code and the code which included with the cd ??", "response": "Not too quite sure what you're asking but from my understanding, game CDs provide codes for bonus in-game content or online game features whereas PSN plus code allows for a user to gain access to playstation's network for online multiplayer gaming as well as other multimedia content"}
{"product_id": "B00D96BNGM", "context": "What cables do I need if I want them to work on ps4", "response": "All you need to do is download a program from turtle beach on your pc and then do the update to make it compatible with ps4."}
{"product_id": "B00IYWV5HS", "context": "So in order to gift this, I just email the person the code? That's it?", "response": "I would assume so. they email you the code. Then your friend should be able to make their own account w/ their email."}
{"product_id": "B00FQFFQ2Q", "context": "What if my disc is scratched when I get it?", "response": "Contact amazon. Their customer service is second to nome"}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "Yes, it works on XP SP3."}
{"product_id": "B0009PRCNO", "context": "Is it backwards compatible?", "response": "I would ask the seller you are considering buying from"}
{"product_id": "B00KGGJPYA", "context": "Does this work with an ipod touch 5??", "response": "Yes it does work with the new generation of the iPods."}
{"product_id": "B00DPQ6GPO", "context": "I did comment earlier but I would also like to ask: Is this controller good for quick scoping?", "response": "Honestly No it isn't  my younger brother is better then me at it and  he didn't find it any help ful, so no it isn't at all. And it's tooo expensive"}
{"product_id": "B004FS8LYK", "context": "how does it compare to Naughty dogs Uncharted trilogy?", "response": "it is just as good as uncharted .  very enjoyable& fun to play."}
{"product_id": "B003O6JJKY", "context": "is it working good?", "response": "I bought it around June. Maybe July. Can't remember the exact date. But I have yet to have a problem with it."}
{"product_id": "B0086UK7I6", "context": "Does it have any clicking issues that happen to it?", "response": "The left click stopped working on the second day of use.  I've uninstalled and reinstalled the logitec software multiple times only to receive the same symptoms.  Also Linux mint running in virtual box was acting up and freezing until I kept the software uninstalled."}
{"product_id": "B001NT9TK4", "context": "Can the gears be moved to the left side of the wheel, or is it fixed on the right side?", "response": "Yes the gear lever is a separate part that can be placed wherever you like."}
{"product_id": "B007YLUCME", "context": "how can I make the gamepad vibrate, I do not get into settings", "response": "as far as i have noticed, it isn't the gamepad that is the problem, it is the game being played. some work and some don't."}
{"product_id": "B00B312UDU", "context": "is the mouse a silent click mouse ?", "response": "No it is not.  There is a quiet click when any of the buttons are pressed."}
{"product_id": "B00ECOAX34", "context": "is this a 2 players simultaneous game?", "response": "Yes, but no more than two."}
{"product_id": "B00B312UDU", "context": "Can someone please tell me the battery life on this mouse before I buy? (I use the comp 6-8 hrs a day with some Diablo 2 and 3)", "response": "Mines still running after a few months so I'd say it's good enough for that"}
{"product_id": "B0000CNUUP", "context": "Do you have to buy the game discs (currently $6.93) and the game code (currently $19.99) both separately? Is that how it works?", "response": "Lemme revise that, just looked at the item linked.  You just buy it, the price will depend on the day to day shift here.  But just buy it, you'll get the code that you download the game with, from Steam.  And that's how it's done.  Hope that helps some.Later"}
{"product_id": "B00BGAA0SU", "context": "if i bought a used copy of this game would i still be able to get all the limited editions features? or is it only redeemable once?", "response": "The ones with a code you won't be able to get again as that is one time use. I didn't really use the limited edition stuff your not missing out"}
{"product_id": "B000IZAQD8", "context": "does this item come with the wires", "response": "if your asking about the wires to connect the console to the television, the answer is yes."}
