{"product_id": "B00DC9SWWE", "context": "Can you turn off the blood? Also can you turn off the voices?", "response": "I don't think you can turn off the blood.  But yes, you can turn off the voices."}
{"product_id": "B009JZ04BC", "context": "Where do you install the application for the mouse? To change colors?", "response": "I am using Windows 8.1 platform. So I had to go to CM Storms website and download the recon software. It automatically installs and updates you to the current firmware. After that it's on the desktop. Just double click and go from there."}
{"product_id": "B008U5ZNIG", "context": "Does it work well?", "response": "YES! ! Hubby loves it! He's a programmer and \"gamer\" so is on computer a lot and he says it works well."}
{"product_id": "B00D3TRMD8", "context": "Can I buy it here and send to my nephew in different country? Will I be getting a password so that he can download?  Or am I the only one who can download?", "response": "Yes, If you buy it you will receive a code that he can claim on his Steam account. all you gotta do is send him that code. Hope this helped :)"}
{"product_id": "B00BT9B2LC", "context": "Hi, what is the system version of this 3DS?", "response": "Dear Yue,Thank you for your question.The system version of this 3ds is5.0.0-11J.Feel free to ask anything question if you have.Sincerely,"}
{"product_id": "B007JDMPOK", "context": "Is this for North American Version or EU one? I ordered one in the past and it turned out to be for the EU version of Tera.", "response": "The copy we received was the American version."}
{"product_id": "B00D96BORK", "context": "Does this Call of Duty Turtle Beach Headset work with the PS4 out of the box with nothing extra?", "response": "If you can reach the audio out on your TV with the cable then yes.Source: http://www.turtlebeach.com/vendors/console-compatibility/images/setups/PS4-Connectivity-cod-shadow.jpg"}
{"product_id": "B002672Z80", "context": "Does this come with two remote controllers?", "response": "It is one controller with two parts.  The main rectangular controller which is used for all games and the nunchuk controller which plugs into the first controller and is used on some games."}
{"product_id": "B00GG4BBUM", "context": "I received this for the PS4 on Tuesday via pre-order, but there is no book in the game case.  Is this normal, or was my game just missing it?", "response": "The majority of newer games are doing this. Gran Turismo 6, NHL 14 and South Park: Stick of Truth on PS3 didn't come with one either. Its this whole environmentally friendly thing going on. Or more like cutting cost to the publishers."}
{"product_id": "B00F27JDY0", "context": "What contents are included in the box?", "response": "I bought it as a gift and shipped it so I am not sure what's included with the unit. I apologize. Jim"}
{"product_id": "B00IRHE892", "context": "If anybody plays CS:GO with this mouse ---- When flick-sniping or playing scoutzknives, is the scroll-wheel accurate? Does 1 notch switch ONE weapon?", "response": "I play TF2 with it, and I have set the extra buttons numbers 1-9. This works for switching weapons well, but if you insist on using the scroll wheel, it can be chalanging to click once even in the locked mode. But it is so much fun to unlock it and just let it spinnnn!"}
{"product_id": "B003ZJ1VD8", "context": "What colour is the back light?", "response": "Well the regular $70 has no backlight. Just the insignia under the space bar pulsates a lightish blue."}
{"product_id": "B0045ZB66I", "context": "Will this play on windows 7 64 bit", "response": "That's what OS I am using to play this on"}
{"product_id": "B000CBWQUY", "context": "wifi can you talk on your ds all around the world", "response": "Can you do pictochat with wifi?"}
{"product_id": "B00001IVRD", "context": "Does this game work on Windows 8?", "response": "If you play from the shortcut icon on your screen it wll not save the game you are playing, but if you re-insert the disc and play from the startup screen it will save."}
{"product_id": "B004RMK4P8", "context": "MAN IT DOESN WORK THE CODE", "response": "you are probably doing it wrong, even tho i dont see how, I am from Panama, Latin america, and got my funds as soon as I redeemed"}
{"product_id": "B006QRMR4S", "context": "Can you play regular ds games on the 3ds?", "response": "I have not try but the package says that it can play ds, dsi games and ds downloadable games. SO to answer your question, yes it can. the cartridges are the same size"}
{"product_id": "B007YLUCME", "context": "I am confused of plug and play. If the controller cannot turn on without having it plugged in, what's the point of having a rechargeable battery?", "response": "lol pluge it in 2female as it wil work perfect hahahahahahahaha c yaaaaa"}
{"product_id": "B00027CXEM", "context": "Will this game work on a modern computer?", "response": "Hello, sorry for delay. Perhaps you can run it without problems, but it is a old game. I couldnt used it. I recommend you to buy some more new."}
{"product_id": "B00GS6A6V8", "context": "if i buy this from my computer how does it go to my ps3?", "response": "You will be e-mailed codes redeemable on PSN to download the DLC to your PS3."}
{"product_id": "B002BS47JE", "context": "Do you realy need the balance board?", "response": "Yes  it measures your weight and balance. I don't think  it won't work without  it."}
{"product_id": "B00BGA9X9W", "context": "CAN BE THE PS4 CONTROLLER USED FOR PS3?", "response": "Only when connected by USB. It doesn't work with all games and obviously the TouchPad won't work either."}
{"product_id": "B0029M6VKA", "context": "What is this thing? Is it a new type of monitor, is it something you wear or is it something like the Kinect for the PC? I don't really understand it.", "response": "It is a device used with certain computer games."}
{"product_id": "B00B1OK3TC", "context": "does it come with a microphone", "response": "No it does not. Jenny"}
{"product_id": "B00CMSCWGS", "context": "does this work for windows 8?", "response": "Yes, it works with all OS."}
{"product_id": "B002QHDKE8", "context": "Should I play skate 1&2 before Skate 3? I usually like to play games in order but I only have $40 to spend and my friend was telling me about how awes", "response": "I bought this for my nine year old son. He asked for this particular game. He does not have the 1 or 2 versions. He loves it and plays it a lot. I don't believe you need the other two to enjoy this game. We got a used version, it is fine and was half the price."}
{"product_id": "B00B3FIXJQ", "context": "How do u use this control", "response": "Press LT & sync at the same time to turn the mod on and again to turn it off.  While on press sync to cycle through all 17 mods. Excellent controller if your looking for a good bang for your buck."}
{"product_id": "B00005B8G1", "context": "I have seen a device called the GBA Worm Light (Screen Light for Gameboy Advance) does that mean you need light on the screen to see the game?", "response": "You only need an overhead light source. This type of light is used in dark rooms or cars at night. In the older gameboy models the screen will fade without light. It is kind of hard to explain until you have really experienced it. I hope this helps..."}
{"product_id": "B0053BCML6", "context": "can you play this game on the old Nintendo DSi", "response": "can you play ps3 games on your psx?"}
{"product_id": "B00E8JZILA", "context": "there's no cross-PLAY on this right? Saving the game on PS3 and continiuing on Vita... i already have this on PS3.", "response": "Unfortunately, no. I wish there was though. I would have liked to use my ps3 season 1 save to continue season 2 on my Vita."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "I get a couple of nights out of it. Playing about 2.5 hours a night. I usually charge it every 6-8 hours of use."}
{"product_id": "B00AXI9WFS", "context": "Do you need to have Kinect to play this?", "response": "No, it not necessary, my son play it without Kinect!"}
{"product_id": "B007SRM5MO", "context": "So why does the box say Internet connection required if the DLC is on the disc? Or is it only required for the Harley Quinn content?", "response": "You don't need the internet connection as the data is already on the disc. The internet connection is required for any additional DLC you may want to purchase or to play online."}
{"product_id": "B00AJZNUUI", "context": "WIll I need to purchase any additional remotes so that more than one person can play at a time?", "response": "The game system comes with one remote, so yes you will need to purchase additional remotes."}
{"product_id": "B005J2LW6A", "context": "wil these game work in my playstation", "response": "Yes this game will work on your ps3. The game will be in japanese though. So if you don't mind using an online guide to understand what the games menus Then i would say get the game."}
{"product_id": "B001AATQ0Y", "context": "Does it work for the PS2 Slim? My controller ports don't work, Would it work to plug in my controllers using this device instead of the standard port?", "response": "No it doesn't. Its only for pc and ps3"}
{"product_id": "B0090WBXSM", "context": "If I purchase this controller. Will it work for amazon fire tv games?", "response": "I would imagine it would work, but I'm not 100%. If the games for amazon fire ask for you to configure a controller/game-pad I'd bet your bottom dollar it would work."}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "Cracks in about 4 months if you have my head size medium large"}
{"product_id": "B00001LDBZ", "context": "Will it work on Windows XP?", "response": "No.  It crashed my cmptr"}
{"product_id": "B002I0HJG8", "context": "Is this the Veteran code which can make me have 8characters?", "response": "Yes, the game will give you founder status and enable 8 characters, but if you have bought extra characters already it will not overlap."}
{"product_id": "B00KGGJPYA", "context": "Does this work with an ipod touch 5??", "response": "It works very well with my iPod but I don't know what version I have (one of the earlier models) which doesn't take the charge anymore and the battery cannot be replaced according to Apple, so I bought a Gembonics external battery. I can't imagine why it shouldn't work with a iPod touch 5. Hope it helps."}
{"product_id": "B00HVBPRUO", "context": "Has anyone tried it on the xbox?", "response": "Yes, it does work for xbox one with the Xbox One Stereo Headset Adapter"}
{"product_id": "B00B1N07QM", "context": "So, I gather the D-Pad is more sensitive than that of the nostromo n52. Owners: did you get used to it? I want to use it for WASD.", "response": "I'm in the same boat. I want to replace my n52 for one with more keys, but I rely on the D-pad for WASD.  So far I don't see the Orbweaver as being a good in that regard. I wonder if they changed it with the new one that just came out with their own green keys."}
{"product_id": "B008KH7NZA", "context": "how to setup with pc? Is it simple or am I gonna need a bunch of cables?", "response": "It comes with everything you need. Just follow the instructions booklet inside. It's real simple."}
{"product_id": "B00001LDBZ", "context": "Will this work on Windows 8.1?", "response": "Don't know. I have 7 and it works OK. I really thought it was a WII game so I don't use it."}
{"product_id": "B008FHL56S", "context": "for a xbox 360 slim do i need to buy a 500gb slim or a 500gb and does the 320 work better than the 500", "response": "that depends of your needs, because if u used to download every game that u play so u need 500gb, but 320 works perfect"}
{"product_id": "B0086UK7I6", "context": "Why is the white mouse $20 more than the black mouse?", "response": "No particular reason I think just a more luxurious look to your mouse."}
{"product_id": "B00FBV6V56", "context": "does it work for the xbox 1", "response": "Yes but it requires the Xbox One adaptor that is sold separately."}
{"product_id": "B003OZOAKY", "context": "Serial key not working ,", "response": "Sorry to tell you, but it happened to me as well, as have a few others."}
{"product_id": "B003Y5AHPG", "context": "Do you have to buy the controllers for all 3 platforms or will the SNES old controllers work for all three platforms (nes/snes/genesis)?", "response": "You have to buy controllers for all 3 systems. The wireless controllers it comes with do not work"}
{"product_id": "B00GLG2D4I", "context": "Does it work with any smart phone?", "response": "Doesnt work with my smart phones"}
{"product_id": "B002I0J4VQ", "context": "can you play with friends who have ps3slim new version", "response": "Console includes power and AV cord but does NOT include controller. You can play online with friends that's have a ps3 console but not a ps4."}
{"product_id": "B00CX8VYM0", "context": "Can I play this on the PS4?", "response": "yes its available in ps4 just search ac4 for ps4."}
{"product_id": "B005EOOT90", "context": "can these be used with an Xbox one?", "response": "No they cannot they are only for xbox 36"}
{"product_id": "B00ATHFLZS", "context": "what the design on it called?", "response": "It looks like a circuit pattern."}
{"product_id": "B00AIALGZK", "context": "Can I play this game on windows 8.1?", "response": "Yes, windows 7, 8, 8.1, 10"}
{"product_id": "B006W41X36", "context": "Can you use external speakers (like through a stereo receiver) instead of headphones and still get the same surround effect?", "response": "You will get the sorround effect but it will be much less effective because you will listen to both speakers in both ears. This mix may fool your perception of the sound position intended from the game. For a stereo speaker set up I would not recommend it."}
{"product_id": "B00D78Q4UM", "context": "Do the keys have the tactile click? My K95 with cherry red switches don't have the click and I hate it. I need the click for my typing style.", "response": "I can't remember what the labeled switches are,  but they aren't the cherry my blues (clicky)  switches they may be cherry Browns."}
{"product_id": "B002I0HJG8", "context": "Seems like it is  for for the NA version for TERA enmasse? And who knows is this match the EU vision?", "response": "Yes there is an EU version. You can go to Tera's facebook or twitter accounts and find out more information about Tera EU."}
{"product_id": "B00EZKNT18", "context": "anyone know what size LEDs are in this remote i kinda wanna play with mine and mod it up a bit", "response": "Can't tell the exact part number or rating by looking, but they are though-hole soldered parts, nothing tiny.  You should be able to remove one, measure it, and install a new one without much trouble."}
{"product_id": "B0087ZMATE", "context": "Are the ear cups over-the-ear (like ear muffs) or do they sit on top of the ear like earpads?", "response": "They are on ear, not bad for sound isolation though."}
{"product_id": "B00DFB99UI", "context": "Does this wheel work with any type of racing games for PS3 for expample Grand turimo?", "response": "Yes, it does... I have used for Grand Turismo 5, NFS Most Wanted and other PS3 games it works properly."}
{"product_id": "B001CXYMFS", "context": "how does this stick work playing elite dangerous? any suggestions if this one isnt very good for the game?", "response": "It works very well, but you will wish that you had more buttons and hat switches."}
{"product_id": "B00BHSTXV6", "context": "Is the space bar much louder than any other key?", "response": "Actually I wondered that myself when I got it and it's a little quieter go on their website www.steelseries.com and I forgot what colors the keys are in the color chart but that chart is !really! Accurate. But as an over all keyboard I love it and all around (sorry for the Grammer doing this off my phone)"}
{"product_id": "B00FLLFJE0", "context": "I tend to leave my items charging, does this have an tickle charge or auto shut off?", "response": "It charges till its full then auto shuts off. Problem is after a while, it charges for 30 seconds then shuts off. Seems like batteries die easily. Hope this helps"}
{"product_id": "B00FM5IY38", "context": "does this support chinese ?", "response": "I'm sorry but I do not believe so."}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "Yes, the game run perfectly on win 7 64bit. There's a manual patch you have to download that fixes slow textures load, but is unrelated to the version of Windows."}
{"product_id": "B00FRESQYG", "context": "Is this version contains World of Warcraft, The Burning Crusade, The Wrath of the Lich King and Cataclysm ?", "response": "It now includes all the expansions except Warlords."}
{"product_id": "B00EVWZHLK", "context": "Are the discs stacked on top of one another or do they have separate disk trays?  I'm a collector and stacked discs tend to get scratched.", "response": "The one I purchased from Amazon had the discs stacked. I purchased mine summer 2014 for the XBOX 360."}
{"product_id": "B00D4WTO1M", "context": "on the PC version you can see how many people are  online and on each MP mode, can you see that on ps4?", "response": "Yea you can and it lets you know how many are playing in each game mode"}
{"product_id": "B005M0KSIM", "context": "I am thinking of buying the physical copy (since the pc download feature seems unavailable.) If i get the physical copy can i use it on steam?", "response": "I have the physical copy and it works on Steam."}
{"product_id": "B00GG4BBUM", "context": "How do you get the controller skin?", "response": "Amazon should email you a code in which you have to input that at the skinit website, the link to that website is also included in the email"}
{"product_id": "B00EOI2MRS", "context": "Does this controller come with the cord? I understand from the description it is used only with a wire, just asking if the cable is included.", "response": "The cord is attached to the controller. It's also not removable."}
{"product_id": "B003ZSN600", "context": "Does the wired controller can connet to PC through USB directly? or I need other tool support ?", "response": "Just plug and play."}
{"product_id": "B009K7QB8O", "context": "Can someone tell me how long the cord is on this keyboard? please and ty!", "response": "OH,  ABOUT 1.2METERS ·····"}
{"product_id": "B00B98HBTA", "context": "is it two player", "response": "Up to 4 player"}
{"product_id": "B004N7HSGU", "context": "Are these capable of using USB for a PC hookup or are they the green/pink cables?", "response": "If you use the headset with the Mixamp Pro, then yes, you can hook-up the Mixamp to the PC.  They also do come with a green/pink cable splitter if you wish to use just the headset."}
{"product_id": "B009WI7V9E", "context": "Does this game come with all of the DLC stuff for the first two games?", "response": "yes. also included bonus stickers from BioShock infinite"}
{"product_id": "B000VLNXRU", "context": "Can you ONLY use the 12 Saitek provided instrument modes, or can you customize them, or develop your own.", "response": "You can download additional instruments and develop your own if you have the skills."}
{"product_id": "B001AI7CF2", "context": "Does this allow for gamecube controllers to work with the Wii U for the new Smash Brothers?", "response": "No, but they do work with the adapter"}
{"product_id": "B0086UK7I6", "context": "What is the texture like on this mouse? Is it slick like Razer mice, or lightly textured like most other mice?", "response": "It has a matte finish, so I would say a slight texture but not waxy smooth."}
{"product_id": "B005G4CXPK", "context": "can you use digitec controler?", "response": "i am not sure since i do not have a digitec controller.sorry i can not be of more help."}
{"product_id": "B009YKVRYA", "context": "does it work with windows 8", "response": "Don't have Windows 8, sorry."}
{"product_id": "B0002EAA36", "context": "Is this windows 8.1 compatible?", "response": "Yes it is, I have been using mine under windows 8.1.  It works very well,"}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "Just one in and one out."}
{"product_id": "B00166N6SA", "context": "Is this the original base game for the sims 3? I can't download it I need to buy a dvd. Thanks!", "response": "The sims 3 is all you need once you received that's when you will download."}
{"product_id": "B00008J7NZ", "context": "does this game work on Xbox 360", "response": "I have to try about 50 times before it will read it it says disc can't be read"}
{"product_id": "B0053B66KE", "context": "Do they ship the correct version based on ur region? Eg PAL to NZ and Europe, Or do they only ship American NTSC version?", "response": "As far as I know it's only the American version because I live on the west coast and it shipped from mid California to me. I wish I knew more about it. I'm sure Amazon would accommodate for which area you order it from. Amazon buys in them self are reliable."}
{"product_id": "B00GHTP4ZY", "context": "We have a Windows 8 machine-will this work on it?", "response": "Absolutely.  I am using a brand new high end PC that came with Windows 8.  It is now running Windows 8.1.  Google \"can I run it?\" and check the web site that comes up.  It scans your PC and you can find out if your rig can play it or not.  Best, enjoy!"}
{"product_id": "B00DC7G0GG", "context": "Can you play the campaign with two players? Or is it just one..?", "response": "Any level can be played with 1-4 players. the loading screen for each level prompts the user to decide the number of numbers for the upcoming level. Hope this helps."}
{"product_id": "B0009PRCNO", "context": "Is it backwards compatible?", "response": "Only the 60gb version(CECHA01) is truly backwards compatible with 98% of PS1 and PS2 games.  The 80gb(CECHK01) uses software emulation and has much less compatibility(80%+/-). No other models have backwards capabilities."}
{"product_id": "B005L38QK2", "context": "Are there more buttons on the right-hand side of the mouse or just the two on the left that are next to where the thumb rests?", "response": "There are a total of 7 programmable buttons: two on the left (where the thumb rests), two on the right (next to pinky), left click, right click, and the scroll wheel itself. There is a eigth button but this is used to switch between your pre-programmed DPI settings and not for use as a interface button.Steel Series Engine: http://steelseries.com/us/support/downloads"}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "Card has to be shipped, online code will be emailed to you"}
{"product_id": "B004C34D2M", "context": "I bought this for my grandson's Wii.  IT WILL NOT SYNC!!!!!I tried to sync it to two other Wii units and IT WILL NOT SYNC!!!!What do I do?", "response": "Mine took a long time to sync but it did it eventually"}
{"product_id": "B008CXTW5G", "context": "Do the A1 and D1 series keys just not have any default values? I press them and nothing happens.", "response": "You can use the included software to assign a macro/keystroke to each key."}
{"product_id": "B001Q24UAM", "context": "Will it work on windows 8?", "response": "i have this game packand also the 101 game pack. all the games work great on my windows 8 dell computer, they are lots of fun to play"}
{"product_id": "B0088MVODO", "context": "If this is true, I don't have high speed internet, can anyone download them for me to a memory card or should I give them my console so that they can", "response": "You need to give them your console , or tell them to add on an external hdd then transfer it to your console , and it has to be downloaded from your PSN account so you can play it"}
{"product_id": "B00EOUL7T0", "context": "Will it work with tritton primer", "response": "Yes, that is why I bought it, and it works good.Yes"}
{"product_id": "B002L93F0A", "context": "When I plugged my controllers into the sockets on my Wii I still can't navigate the menu or click anything. Anybody know what is wrong?", "response": "You can't control the Wii menu with a GameCube controller, it has to be a Wii remote"}
{"product_id": "B00F9RGFEY", "context": "Are these on-ear or over-ear headsets?", "response": "They cover the ears completely, are very comfortable and can be worn for many hours at a time."}
{"product_id": "B00166N6SA", "context": "Is this the original base game for the sims 3? I can't download it I need to buy a dvd. Thanks!", "response": "Quite possibly the buyer wants to know if it says \"Go Social\" on the top of the box. If it does, it requires Origin and you cannot use Create-A-World's \"In-Game\" edit with it. Many Sims 3 creators are seeking the original DVD box before the \"Go Social\" version was released."}
{"product_id": "B009UCGVZC", "context": "Is this a Wii game", "response": "The game is available for the Nintendo Wii, the Nintendo WiiU, Xbox360, PS3, Nintendo 3DS, and soon for the PC.These are figures for use with all versions of the game, which are required to play as the represented characters."}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "No. The adapter is included"}
{"product_id": "B00GG4BBUM", "context": "Can i play this against a friend if he is playing the game on a PS3? I would be using a PS4?", "response": "No, that's not possible"}
{"product_id": "B0017Q4DGI", "context": "I'm having trouble loading this on our WiiU console. It is not letting me get click the \"TV ONLY\" button to play the game on the big screen. Advice?", "response": "What do you mean not letting you click to tv only?"}
{"product_id": "B00HFZ5KCG", "context": "are the O and X buttons swapped?", "response": "No they are not swapped on the Vita. Standard PlayStation button layout, the same as the DualShock 1/2/3/4"}
{"product_id": "B00BY0G0YU", "context": "does this game come with any dlc or vouchers that you redeem?", "response": "These two games are direct ports of PS2 games. The PS2 was a time before you had to pay EA or whatever other money grubbing publisher 50% more money per game to buy the part of the game that they delivered 3-9 months late. So, in short, the answer is no because there is nothing that requires unlocking."}
{"product_id": "B008M4BNQG", "context": "Will these work with the ps4", "response": "I plugged them into the ps4 once and they seemed to work."}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "Just the downloadable extras :)"}
{"product_id": "B00007JNFE", "context": "Is this a bagpipe?", "response": "No. It's a computer interface device."}
{"product_id": "B000VTQ3LU", "context": "Do you need a PSMove controller in order to operate the PSEye camera itself?", "response": "You only need the Move controller if you're going to be playing the specific games."}
{"product_id": "B0041G5SD8", "context": "will Empire and Napoleon Total War Collection - Game of the Year (PC DVD) [UK work in the us ?", "response": "You MUST have a Steam account. Both games only work through the MIDDLEMAN of Steam, meaning that they emphasize On-line Multiplayer."}
{"product_id": "B00EM5UFF4", "context": "Is this game 4 player split-screen or 2?", "response": "We saw split screen horizontally with two players.   Not sure if we can the internet game play.  We saw only computer game play."}
{"product_id": "B004X56PWK", "context": "Is this a game for people who just want alot of running in a Sonic game or is there alot of stopping and story and destroying bots?", "response": "Mostly running. Not nearly as much stopping as some of the other recent (bad)games. All in all they pretty much got it right here and it pretty much runs smoothly the entire game. Not much story (nothing like sonic adventure) and not so many annoying enemies. A great game!"}
{"product_id": "B000GCJ6MK", "context": "Is this an expansion kit, or is the full FSX installation? This price on this way cheaper than the Gold and Standark packages I see for sale here on A", "response": "cheaper price because \"no one\" uses / Microsoft no longer supports XP??"}
{"product_id": "B00DLDEKOK", "context": "Can this be used with the Xbox 360 wireless controller?", "response": "Yes I use it with my wireless controllers. BTW, the plug is NOT just a single 2.5 mm plug but more substantial plastic dongle which also has volume dial and mic on/off switch. Both of mine has survived 4+ months of daily use by myself and 2 boys."}
{"product_id": "B0090ECASW", "context": "is the key clicky or silent", "response": "I am sorry. This was a gift for a friend of a friend overseas"}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "Yes, that was the defective part in the first one I purchased and returned"}
{"product_id": "B002LARYGA", "context": "Can you use it to change channels if you have time warner cable box?", "response": "Yea u can record the buttons from tha remote u got from  with your box http://youtu.be/ULQTU2RAQOY"}
{"product_id": "B0053B5RGI", "context": "Can you enjoy this game by yourself, or do you have to be in connectivity mode and do multiplayer?", "response": "The main game can be played completly by yourself like any other Pokémon game, but once you have finished the game multiplayer modes becomes more enjoyable."}
{"product_id": "B00EI4V3X2", "context": "I have this headset, how can I remove the mic? I tried pulling it out with some force but nothing is unplugging it. How can I do this?", "response": "It should just pull out the mic slot, you can try to youtube it. I know some of the reviewers show pulling out the mic."}
{"product_id": "B001H4NMNA", "context": "Dear All... I will love to buy this product, but I have a question, Could I use this product with the silicon protector placed on the controller?", "response": "I use mine with the silicone sleeve on. It fits okay, but makes it a little harder to put in, I have to fiddle more with it. BTW been using that way for about 2 years now."}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "Hi, I also have windows 8.1 and the game works perfectly :). You do not need the disc."}
{"product_id": "B000O5DY0E", "context": "Did you have any problems with the downloads?My old CD would stop downloading and will tell me to retry again because a specific file will this happen", "response": "No problems it worked good"}
{"product_id": "B00FB4BUMW", "context": "So, just to be sure, when this is bought from a US customer it is a QWERTY keyboard?", "response": "Mine is qwerty so I would say yes."}
{"product_id": "B009Q5XGO2", "context": "Just making sure here but, I don't think this can be on with a case right?", "response": "Maybe with a skin don't know about a case though"}
{"product_id": "B00AJZNUUI", "context": "what include this wii? include a game?", "response": "how many controller does it have?"}
{"product_id": "B00HVBPRUO", "context": "Is it worth trying if I wear glasses? I tried a few headsets before and almost every of them was uncomfortable.", "response": "It a bit bogus on the head anyway, but it is cute and unique, will fit wit ur glasses"}
{"product_id": "B005CELN8W", "context": "What else is included on this DVD...possibly Money to Burn?  I can't find the complete list", "response": "There's around 16 total, some have to be 'unlocked' by your winnings: here are a few: Double Easy Money, 3-Alarm Fire, Rakin' It In, Brazil Beauty, 9 Suns, Jackpot Comet Double Wild and Jungle Wild. Hope this helps."}
{"product_id": "B00BMFIXKQ", "context": "Is this NTSC or region free?Thanks in adcance.", "response": "I honestly cannot answer that question other than to say I was able to play it just fine on my ps3!Hope this helps."}
{"product_id": "B00CX8VY4S", "context": "the game is digital download?", "response": "Not on amazon, but I know that you can download it if you have an xbox one or playstation 4. Not sure about the 360 and ps3, but I would assume that the have it for download"}
{"product_id": "B00D6PTMB4", "context": "Could someone suggest a good guitar to use this with? Something cheap yet not horrible and sold on Amazon? Thanks!", "response": "Amazon actually sell some very good guitars"}
{"product_id": "B00A878J5I", "context": "if I leave the sleeve on, does the remote plus controller still fit?", "response": "No, the sleeves need to be off. It is a tight fit even without the sleeve to ensure the controller battery contacts make a good connection."}
{"product_id": "B002JVX5V4", "context": "will it work on laptop windows 8", "response": "Don't have Windows 8.  Sorry"}
{"product_id": "B003O6EDSM", "context": "If I buy the Mass Effect trilogy from the Playstation Network, which DLCs would I have to buy in order to gain all of the possible trophies?", "response": "Mass Effect 1 - none, Mass effect 2- Arrival, Mass effect 3- From the ashes, Leviathan, Omega, and Citadel."}
{"product_id": "B00002JXBC", "context": "this product works for xbox 360 F1 Racing?", "response": "yes because it is a Microsoft product you will work on the 360 it uses a USB wired interface"}
{"product_id": "B008SBZD9G", "context": "may purchase soon, is it online only or can i play single player story mode. don't care for mmorpg games.", "response": "You seriously had to ask if an MMORPG game is online only? You must be new here..."}
{"product_id": "B00F68LBE0", "context": "Many critics say that the control is delayed and it is small is that true? I SHOULD BUY IT? I really like it because it isn't as expensive, HELP", "response": "I have noticed when the battery is low there is a delay.  There is a wired version of this controller that will experience no delay.   If you want a wireless controller I would recommend this controller."}
{"product_id": "B00006B84X", "context": "Can the ch fighterstick USB be made to work with windows 8?", "response": "I don't see why it wouldn't.  You can email support@chproducts.com for any questions as well.  They are really helpful."}
{"product_id": "B000OYMYZQ", "context": "Is the included battery just a standard rechargeable battery that I can use with the MS dual recharging station?", "response": "Yes, it's a standard microsoft battery, works great with any microsoft charge kits like the duel black MS charge station."}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "yes.. F7 and F8 keys have volume icons. the thing about this keyboard is you can custom program your own configurations.. great for gaming"}
{"product_id": "B003EUPCZG", "context": "Any advice out there? I am looking for a wireless left-handed laser mouse. I tried all the wireless ambidextrous mice.", "response": "If it is for gaming you dont want a wireless mouse, buy an original deathadder they are actually really nice."}
{"product_id": "B00BY0G0YU", "context": "does this game come with any dlc or vouchers that you redeem?", "response": "There were none that I noticed in the copy I received.  Besides an artbook and the game disc, there was nothing else.  Sorry."}
{"product_id": "B00HG0B8NA", "context": "is this the same freecell on my windows seven computer", "response": "No it isn't same as windows 7 game. Disappointing."}
{"product_id": "B00EZKNSTQ", "context": "does it work with pc?", "response": "It does work with pc, however when my controller broke and I contacted them, they told me that plugging the controller into a pc violates their warranty and that they are no longer responsible."}
{"product_id": "B00HN9LS48", "context": "Does the Kinect actually clip on and become secured to the unit or does this item just act as a wide table for it to sit on?", "response": "It clips onto the back of the TV. The Kinect is attached to the clipped in unit. Once it is installed, it will NOT fall off.  I have my TV on a swivel mount and the Kinect doesn't move even when I move the TV around."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "The picture on the box is of the German keyboard layout, but U.S. Ordered keyboards will be the standard QWERTY layout an American is used to. I own the keyboard and can confirm this based on personal knowledge."}
{"product_id": "B008CP6MA2", "context": "Is this really only 3 games now? Or will they renew the vouchers for Origins?", "response": "If you buy the game new, the voucher is still good until 2016. However, if you buy it used, the voucher may not be included or already used so it can't be used again."}
{"product_id": "B00CJ7IUGS", "context": "Do I need to have played Oblivion to understand Skyrim?", "response": "No, not at all. I had not played any of the previous Elder Scrolls games and I understood everything. You can get a more in depth look at the Oblivion history if you read the books scattered around Skyrim, if you are interested in that."}
{"product_id": "B0017Q4DGI", "context": "I'm having trouble loading this on our WiiU console. It is not letting me get click the \"TV ONLY\" button to play the game on the big screen. Advice?", "response": "I Don't  think  you can use it on the wiiu. I think it's  for the original  wii only?"}
{"product_id": "B0094X28J0", "context": "Does this not coming with a rechargeable Battery Pack?", "response": "I've always had to buy the rechargeable battery packs separately."}
{"product_id": "B00DB9JYFY", "context": "Does the game support two people with gold memberships playing on the same console, ie splitscreen?", "response": "I don't think so"}
{"product_id": "B00GV0LR64", "context": "Is there any way to use these and not cheat?", "response": "It aint cheating bc it doesn't really work , don't waste ur money like I did"}
{"product_id": "B00BI83EVU", "context": "Does this game come with one of those activation code papers inside? I'm considering a used copy.", "response": "No I don't think it did I never had to enter one."}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "Yes, it is working under windows 8.1 for me."}
{"product_id": "B002B9XB0E", "context": "Can you pull off a shoryuken with this guy", "response": "Yep, and lasts more than a week. Best one I've found."}
{"product_id": "B00A378L10", "context": "What do you mean by 'Brown Switches?'  Is the key light white and the keyboard black?   Thanks!", "response": "A \"brown\" switch refers to the style of mechanical switch used for the keys. The color of the lighting and keyboard aren't brown. This site here: http://www.keyboardco.com/blog/index.php/2012/12/an-introduction-to-cherry-mx-mechanical-switches/ offers a pretty decent guide to what different types of mechanical switches are and do. The key lighting is still white, and the keyboard itself is still black."}
{"product_id": "B002L6HJCI", "context": "Will the software work on windows 7 ?", "response": "I owned the entire series when I was running XP.  When I upgraded to Windows 7, it would no longer work.  Went to the silly online game for AoE.  So did they rework the software so it now works on Windows 7?  Because the original software does not."}
{"product_id": "B00BDX1M00", "context": "Is there a way to set this up with the ps4?", "response": "Yes there are many ways to setup your PX3 turtle beach head set to your PS4 the easiest I've found are by searching YouTube for \"How to setup my Turtle Beach PX3 Wireless headset on my PS4\""}
{"product_id": "B009XZ1CTQ", "context": "Will the physical CD version work for Windows 8?", "response": "Yes it will i have windows 8 and it work fine"}
{"product_id": "B00F27JGVA", "context": "is it a good idea to format the mamory card 64 gb when you get it new?", "response": "Not necessary, assuming that it's new."}
{"product_id": "B00D78Q4UM", "context": "Is the palm rest removeable?", "response": "yes, you can remove the palm rest."}
{"product_id": "B001GIOGBY", "context": "Are the dimensions above correct ? 29x18x13 inches seem very big.", "response": "Yes. It is bulky. But well made."}
{"product_id": "B002I0K6X6", "context": "Does the stick have a input for pressing in?", "response": "Yes the stick functions as a button as well."}
{"product_id": "B00BFOEY3Y", "context": "can this be used on a mac?", "response": "The logitech software works on Mac. All functions work on Mac."}
{"product_id": "B00EFFW0HC", "context": "does it still have bugs now", "response": "Definitely not as bad. Its more enjoyable."}
{"product_id": "B00B15EXJC", "context": "How big is the USB dongle?", "response": "Not long at all"}
{"product_id": "B00C71034I", "context": "i sit two player", "response": "It's multiplayer on line it's 3 to 8 players  but not off line... Hope this helps:)"}
{"product_id": "B00EOI2MRS", "context": "Does this controller come with the cord? I understand from the description it is used only with a wire, just asking if the cable is included.", "response": "Yes. It is permanently attached, in fact."}
{"product_id": "B00CJD4HD2", "context": "Is there any REAL problems with the mouse right now? because i heard of problems back in early 2013 about this mouse and I want to know if it's fixed.", "response": "Not one issue with the hardware or the software suffered to date. Been enjoying this mouse daily for months on end."}
{"product_id": "B001B5U80K", "context": "I have a Netbook without internal DVD player. Do you need to have the DVD on the system (external) to play it?", "response": "No....Once the game is installed on you're computer you can remove the disc and the game will still play."}
{"product_id": "B008GEH8LQ", "context": "Can you watch videos on this?", "response": "you can get on the internet and watch youtube videos on the 3ds. Not sure about streaming videos I haven't tried it."}
{"product_id": "B00FATRKOK", "context": "Does it come with game codes or disks?", "response": "It depends on the bundle! I received a disk with Halo 3, and a code for Tomb Raider. Read the description carefully!"}
{"product_id": "B007JDMPOK", "context": "Do I have to use the activation code to get the mounts? I was hoping they were seperate codes.", "response": "Yes you need the activation code to get the mount. And dont forget to put in the code in reverse and get a second one. Happy gaming !!"}
{"product_id": "B00CH923NE", "context": "Is this game appropriate for a 7 year old boy?", "response": "Yes, I'd say so. The game features typical \"Mario & Luigi\"-style cartoon mischief, involving jumping and hammer attacks on enemies. A seven-year-old might find the game a bit challenging, but I don't see any age-related content issues."}
{"product_id": "B007OVHW90", "context": "Are the end connectors 2.5 mm or 3.5 mm?  My son's X31 uses 2.5 mm and a white talkback cable.  Newer X31 models appear to be 3.5mm.", "response": "Its 2.5mm. The same size as the xbox controller jack for both ends"}
{"product_id": "B00EOI2MRS", "context": "Does it work on a Mac?  Please no guess or opinions.  A feedback from someone that's using it on a mac would be appreciated.  Thanks", "response": "It does work if you download \"Gamepad Companion\" or \"Joystick Mapper.\" They can map the keyboard controls to the controller buttons. You can also customize the each button. I've used both of these apps and both of them work perfectly."}
{"product_id": "B00DNGQQUQ", "context": "does this game have local co-op or couch co-op? which ever means 2 players for you guys thats its not online...thanks", "response": "This game doesn't have couch co-op or local co-op. Co-op is only available on Xbox live"}
{"product_id": "B00FLLFJ68", "context": "Can this charger be mounted vertically (ex: on a wall) and still work without the controllers falling?", "response": "I don't think that would be feasible.  I believe they would definitely fall out.  Gravity holds the controllers against the charger contacts and that would only work with it lying flat."}
{"product_id": "B00BHSTXV6", "context": "Is this keyboard wireless or wired?", "response": "yes it is, but i wouldnt hold that against it. it is an extreme upgrade, or at least it was for me. and the reach is pretty good, but i am sure you could go to the amazon purchase location and it will tell you how long."}
{"product_id": "B00DHF39KS", "context": "Are there boss fights in this game?", "response": "Yes. There aré several boss fights that lead to a level ending."}
{"product_id": "B00FYIXMHQ", "context": "Does the game used $ 83 brings beanie of Delsin?", "response": "I would assume it would for that price, maybe some missing pins, but I would contact the seller to make sure."}
{"product_id": "B00FQFFQ2Q", "context": "Do you need 2.0 gb of free space on your Xbox to play it? But practically what are the requirements", "response": "No it is not a problem with free space, it is because of the region, this is an xbox version of the game for USA region not UK"}
{"product_id": "B0065NP6NC", "context": "how different is this from fallout 3? I never completed FO3 but enjoyed the atmosphere and the idea that it starts you as a child.", "response": "FONV is similar to FO3 in concept. FONV is different in that it dumps you right into the action with more creatures and gangs. As with FO3 it has several DLCs  too. The graphics are slightly improved. Of course the setting is pretty cool. Please do finish FO3, good fun."}
{"product_id": "B00GU8W5AE", "context": "Jeez, what EXACTLY does the red button on top do? Can IT be reprogrammed?", "response": "The red button can be programmed. It is like all the other buttons on the mouse, just red(maybe it is a common fire button spot)"}
{"product_id": "B007XVTR3K", "context": "can you play this on xbox one? or do you have to play it on xbox 360 only?", "response": "its a 360 only game. Don't think they will remake it for the xbox one"}
{"product_id": "B00B3PDH5G", "context": "Just To be clear it can be used with a pc and how would I connect it to my pc?", "response": "The base has a USB cable, just plug one end into your PC and the other end into base of your headset.  You may have to install some turtle beach software also but it shouldn't be a big deal."}
{"product_id": "B002BXKJA0", "context": "Can you play this with steam?", "response": "no i tried but it would not connect for me sorry i got back to you so late"}
{"product_id": "B008SBZD9G", "context": "Hi, Does this product includes the CD-Key needed to register and play?", "response": "Yeah it includes everything you need. Just follow the instructions :) You'll download the game launcher then punch in your activation key and then that will download the game and you'll be good to go. Expect a long download about 12-14fb in total."}
{"product_id": "B00FLZ4FS2", "context": "Can i redeem right away one the Xbox One?", "response": "If you mean as soon as you pay for it no. It will be sent to you in a plastic case with a download code for ghost xbox one and 360. It took at least 3 to 5 days to receive the codes."}
