{"product_id": "B0097CUREG", "context": "why cant i play this game on kindle ? Is there someway that i could ?", "response": "You can play this game on Kindle Fire.  Download the Jackpot Party Casino app it contains all Williams games including Zeus 2"}
{"product_id": "B00BT9B2LC", "context": "is the LL have the same size of game cards as Xl?", "response": "Yes. But the LL can only play games from Japan."}
{"product_id": "B008J16AH4", "context": "does this game have multiplayer mode?", "response": "No, there isn't a \"multi\" player mode on this game,just a \"one\" player but we have fun with it at the same time,taking turns! LOVE the game & am going to order the \"Star Wars\" soon,as I've played both on smart phone but much more fun on PS3."}
{"product_id": "B00FMNNQCY", "context": "Is it $20 more than the black controller because of the color?", "response": "Yes. Actually the color makes some difference. A few dollars more. Not sure if 20."}
{"product_id": "B0053BCO00", "context": "Could a 5 yo play this?", "response": "This game is for everyone, kids, teens and adults should like it, I don't think the 3D effect is a good idea for kids under 7."}
{"product_id": "B00DC9SWWE", "context": "My son is about to be 11 and is dying for this game.  I've never bought him an M rated game.  How is the violence and language in this game?", "response": "The lenguage is not a problem in this game cause it have nothing,But violence obviusly yes i mean its a shooter game but no more than shooting,my suggestion is that if he want it so much you should get it for him"}
{"product_id": "B00IA2NYT4", "context": "Is this bundle a SLIM ps3? Or regular size?", "response": "Yes man is a slim one, at last the one I recived..."}
{"product_id": "B001PO2BJI", "context": "Can this be used with a Wii remote plus?", "response": "yes thats what I have! The one with motion."}
{"product_id": "B00FA6YFTQ", "context": "Does this pack give a Steam key for each game, or a single key for the entire package?", "response": "A key for each"}
{"product_id": "B008NMPSEU", "context": "After installation, would I need the disc to play?", "response": "Yes. which I find a big pain in the pratt, plus it really didn't have very different or exciting (interesting) games.  I would not recommend this.Paula"}
{"product_id": "B00E4MQODC", "context": "Does the usb receiver work with logitech keyboards? E.g., I am looking at a LT K750 and wondering whether either receiver will work for both devices.", "response": "No, it's a unique receiver that's not compatible with other Logitech products. The K750 uses the Logitech unifying receiver which is compatible with a range of Logitech products that supports unifying, but there are no Logitech gaming mice that support unifying receivers currently. Net, you'll need to use both receivers with that keyboard and mouse combination."}
{"product_id": "B000CBWQUY", "context": "will this work with the wii? will the nintendo wi-fi usb connector work with the nintendo wii?", "response": "according to nintendo's web site, it will work for the wii and ds.  just check the shopnintendo site."}
{"product_id": "B00D4WTO1M", "context": "It has language chinese?", "response": "I don't think so"}
{"product_id": "B0057WDE8Q", "context": "Is it wireless and would it be good for playing Mz PacMan", "response": "It is not wireless and yeah I suppose it would be good for pacman."}
{"product_id": "B00A378L10", "context": "Are the Home, End, PageUp, PageDown  functions accessed by using the shift key or NumLock? Also, I see tat the default function of the \"2\" is up arrow", "response": "When NumLock is on, the NumPad functions normally (the first functions you see on each key, NUMs, plus, minus, etc.). When NumLock is off, the NumPad acts as the second functions you see on the key (arrows, home, ins., etc.)"}
{"product_id": "B008NMPSEU", "context": "Can you list all the games in this software, please. Thank you so much in advance.", "response": "There are 20 slot games, however doubt you would recognize any names because they're not slots you'll find at a regular casino/racino.  As others have stated, all the games are fun and play as typical slots. Start with a few and play to win credits plus tokens that unlock more games."}
{"product_id": "B00DNGQQUQ", "context": "Can this be played on xbox One?", "response": "No. The Xbox one is not backwards compatible"}
{"product_id": "B000R0SRNU", "context": "why are you advertising this as an xbox 360 game when in reality its an original xbox game?", "response": "Technically James you are right that Lego Star Wars was originally for the original xbox, but they remade both the first and second games and combined them to get the game you see on this product.  Any other questions?"}
{"product_id": "B003O6JLZ2", "context": "is the controller wireless?", "response": "The answer is in the item description..."}
{"product_id": "B00FENJVOE", "context": "Can you use characters developed from D3, or do you have to start fresh from lvl 1?", "response": "You can definitely use a character developed from D3 and just continue onto Act 5.  If your character is level 60, they now will start leveling up to 70 and then gain paragon levels after that."}
{"product_id": "B00EV4O8VS", "context": "Has the box been opened? If not, is it shrink-wrapped?", "response": "When I received it, it had not been opened. It is like if you would buy it from a place like Walmart. Everything is there."}
{"product_id": "B00FB5R3XQ", "context": "Does this also work for ps2 games played on the ps3, the old ps3 with the actual games not digital downloaded ones?", "response": "This controller functions as a ps3 controller and can be used with any game the ps3 controller could.  I don't have the older ps3 to test but if you can use a regular six axis this should also work."}
{"product_id": "B001AH8YSW", "context": "does this have a control option to adapt to a 'windows' xbox controller?", "response": "I don't believe so, as it was only released on PC. The controls are super funky, so I'm not sure how it could be mapped to a 360 controller..."}
{"product_id": "B00DC7G0GG", "context": "If i use the Wii-motes to play, do I NEED the nunchuck thing, if so then would it be better to just get the pro controller?", "response": "Nope, you just play with the Wii Remote sideways like an NES controller. Of course if you want, you could get the Pro Controller too."}
{"product_id": "B0079V29EI", "context": "Does this come with a charging cable as well? I lost mine and was hoping for a two for one.", "response": "It didn't not come with a charging cable."}
{"product_id": "B005THAX5Q", "context": "Why is this game is this game so horrible", "response": "I don't understand your question."}
{"product_id": "B0095P5K8I", "context": "Has anyone had any trouble with it randomly double clicking and selecting stuff behine open windows or drop down tabs?  I have had mine for 1yr.", "response": "I had mine for about seven months before that happened randomly, really annoying. It still does it."}
{"product_id": "B002BSA20M", "context": "can this be played online with friends", "response": "Yes it can be. Lots of cool weapons and vehicles"}
{"product_id": "B007TYC8MI", "context": "this game is in spanish?", "response": "Nop is in English but the cover  is in French and English."}
{"product_id": "B00AKIPBNS", "context": "My son purchased 3ds in usa but found that the 3ds games purchased here in Australia are not compatible . What 3ds  does this game work on?", "response": "The 3ds sounds like it's region locked. You can either order your games from the us, via amazon or you could buy a 3ds in Australia. Those are the only ways I know of to work out this issue."}
{"product_id": "B002YVD3KM", "context": "Just received it.  Nestopia is recognizing it is plugged in, but there's no gaming response to any of the buttons.  What am I doing wrong?  Win7, hp", "response": "I have no clue"}
{"product_id": "B001ELWMHI", "context": "Can you buy games for this model today?", "response": "Only at used game stores, Ebay, or places like Amazon. They stopped making anything for the original Xbox almost ten years ago."}
{"product_id": "B00B70WKUK", "context": "is this like a CD and you put it in the computer and all good will be able to play  or i have to install program and be online .?thanks", "response": "Sort of, it's a disk and it'll install the base game (you'll need to have a steam account and be connected to the internet to have the game added to your account) but you'll need to download updates as well. I hope this was helpful!"}
{"product_id": "B000B78F72", "context": "Do you have to download this game to play or can you take the cd and use it on another computer?", "response": "You can use the cd on any computer you have. I downloaded it to my desk top as well as my laptop to take with me when I travel."}
{"product_id": "B0095C0I4W", "context": "Does this work with Windows 8.1", "response": "Doubtful... it didn't work with Windows 7 without major changes to the system configuration..."}
{"product_id": "B00B77OKNI", "context": "is it for kindle", "response": "Yes. It works well, but only on a few games made for children. I have been  waiting for the development of new games for 1 year now."}
{"product_id": "B000ZHMRTA", "context": "Does this monopoly game play fine in Windows 8 pro and RT?", "response": "I don't have Windows 8, so I don't know.  Thanks for wasting my time."}
{"product_id": "B00CPKUV9I", "context": "which of these video cards will run this game?Sapphire Flex AMD Radeon HD 6450, XFX AMD Radeon HD 6450 2GB,Radeon R7 240 2GB or other ones", "response": "All these work well as long as you update the drivers. I use a XFX AMD RADEON 6450 2 GB, WORKS GREAT."}
{"product_id": "B0050SZBP6", "context": "is this the physical game?  or just the serial... Standar Version", "response": "unless it says digital copy and if there is a shipping charge, then it is the physical box.  it came with disks but I did not need them, I already had the starter installs and just downloaded the patch after putting my game serial in."}
{"product_id": "B00FJWNSU8", "context": "Is this actually how the casing looks with the white sides instead of blue?", "response": "Mine is in blue."}
{"product_id": "B00F27JDY0", "context": "What contents are included in the box?", "response": "Some qr cards you probably won't use. The system itself a charger (that was surprisingly long) and some manuals in Japanese. There's not much to it other than that."}
{"product_id": "B00BV72X1U", "context": "will this work for xbox live?", "response": "Well if you're going to be playing on your Xbox, you don't need this. It's a transceiver for your computer. Microsoft has gotten rid of GFWL, but there are games like GTA IV that still use it, and I haven't had any issues."}
{"product_id": "B008U5ZNIG", "context": "Is this the cherry MX blue keyboard?", "response": "It does use Cherry mechanical keys.  The keyboard itself has green illumination.  Go to this link for more info: http://www.razerzone.com/gaming-keyboards-keypads/razer-blackwidow-ultimate-stealth-2013/"}
{"product_id": "B00B98HBTA", "context": "does this have hawkeye", "response": "Complete story mission 3: \"Exploratory Laboratory\" to unlock Hawkeye"}
{"product_id": "B0058FAEAS", "context": "Will it work with Windows 8?", "response": "We operate SAITEK on windows 8 and can work well"}
{"product_id": "B00I9GARIM", "context": "Does anyone know if a gaming mouse will fit into the space between the headphoens in the carrying case? Has anyone tried it?", "response": "Oh yes. The case is very roomy."}
{"product_id": "B00DGZDFO4", "context": "How is the online in this game? is it worth it?", "response": "I've played through Steam with friends, and works like a charm. Latency can be an issue if whoever hosts has a bad internet connection, but otherwise it's fine."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "I've had mine for almost 2 years, and it's still as functional as the day I got it. It's also seen more than just Dorito dust in those 2 years"}
{"product_id": "B003Q55Y5C", "context": "Will the game support a Logitech F310 gamepad, combined with a 2Ghz/Win7/D-Core/4Gb ram/Directx-11 environment? 2nd: Plz confirm NO \"Steam\".", "response": "the equipment,like gamepad will about run on any game.but steam is on this game.the single player i could not get to run pass maybe 5 mins then stops.even when reinstall."}
{"product_id": "B00C2B355W", "context": "why is mine all crackly? do i need a new audio cord? 2.5mm to 3.5mm? Where do i get it?", "response": "I would test it without the cord. Pc or ps4 and see if that's better if not than its either the base or headset. Either way it's defective, if it is better then yes 2.5 to 3.5 for standard hheadphone jack."}
{"product_id": "B00B70WKUK", "context": "So, does this work for pc users in the U.S.? UK editions being sold on the bay say PAL.", "response": "PC version runs on any computer with Windows (from XP to 8 I guess) and the game minimum requirements. Only console versions could have a region code (pal or ntsc), which could vary in different countries."}
{"product_id": "B008U5ZNIG", "context": "What's the difference between the ultimate and the ultimate elite?", "response": "Looks like the ultimate doesn't have lit keys"}
{"product_id": "B00DVEJA7G", "context": "Odd question, I use Spotify instead of iTunes on my iPod Touch...is this ok or must music run through iTunes?", "response": "Yes I use mine on both.... It's totally fine"}
{"product_id": "B00GU4F4OM", "context": "Is the Red Dragon Mammoth the same as a MSI Interceptor DS200? If not, what are the differences?", "response": "Just looking at it, it is the same. Same specs etc. I have to say this is a great mouse so far."}
{"product_id": "B00DNHLFQA", "context": "will these games work on windows 8?", "response": "They do work on windows 8, matter of fact, that's what I play them on."}
{"product_id": "B004GINKNQ", "context": "Will it be compatible with the 360 slim, i got one once but it crashed.", "response": "It worked perfectly in my 360 slim."}
{"product_id": "B00DE2W5XG", "context": "is the playstation plus card valid for 33 months or one year", "response": "İts for one year"}
{"product_id": "B001GROEEO", "context": "I have my ps3 registered  for  CHile (latinamerica)and I am not pretty sure if I can still use this , I am living in costarica,", "response": "hi there marvin, I have been using PS Card for a long time and never had trouble. I live in dominican republic but my account is registered as if I live in new york. I guess you won't have any problem because those cards are made for international usage. Hope to help with my information."}
{"product_id": "B00F27JGVA", "context": "works with psvita slim in US/CA?", "response": "Yes. I have a USA slim and it's fine."}
{"product_id": "B003O6E986", "context": "We don't have connect but I was thinking about getting this game for my son for his birthday. Can he still play with a regular controller?", "response": "My grandson plays it using a regular controller"}
{"product_id": "B0000A2TPE", "context": "If say my laptop eventually died, and I wanted to play this game on a different computer....is it possible for the game to be downloaded/played again?", "response": "Yes my sister used it on two different computers"}
{"product_id": "B003O6EDSM", "context": "Does this come with the DLC?", "response": "ME3 Extended Cut & Multiplayer free from the PS Store is FREE on PSN FYI"}
{"product_id": "B002I0J5CO", "context": "is it good for hearing the steps in black ops? please be honest", "response": "Yes, you can also hear the clicking of guns as they are being reloaded."}
{"product_id": "B005EOOT90", "context": "can I use on mac?", "response": "No just on the X box 360"}
{"product_id": "B003O6E986", "context": "Does this game have \"Open World\" where I can drive without being in a  race or being on a mission?", "response": "There is free drive, where you can just drive with your friends, but it's not an open world."}
{"product_id": "B00DC7G0GG", "context": "Can I use the wheel accessory in this game?", "response": "No. One person can use the GamePad, and up to three others can use a wiimote, classic controller, pro controller, or wii+nunchuck."}
{"product_id": "B00286BZ4Y", "context": "Does it work on Windows 7?", "response": "Yes, it works on Windows 7. I installed mine and it download just fine. I have a HP laptop computer. I recommend this Jeopardy game and The Price Is Right."}
{"product_id": "B001CXYMFS", "context": "how does this stick work playing elite dangerous? any suggestions if this one isnt very good for the game?", "response": "Sorry, I am not familiar with that game but the stick works very good with flight simulator games."}
{"product_id": "B00CX9L30W", "context": "Is the collectors edition worth the extra $20?  Does the helm exp bonus work whenever you want to create a new job or is it only good for a 1-time use?", "response": "Collectors edition give you 2 mounts and 2 pets, in any game it will cost more than that. Helm exp can be use in any job multiple times but it's only provide extra exp till u get to lvl 11 then you won't get any extra exp. I didn't regret buying the collector edition :)"}
{"product_id": "B004QRKWLA", "context": "Do I need to calibrate or download programs and are the programs included?", "response": "No, this is plug and play, I have one and it's awesome."}
{"product_id": "B00D3TRMD8", "context": "Is this the actual game or some kind of cheat code?", "response": "This is the Don't Starve game. It is just a code, instead of a disc, which you enter through steam to download a copy of the game."}
{"product_id": "B00G0OYHCW", "context": "Does the console play DVD's?", "response": "no it does not"}
{"product_id": "B0000512IE", "context": "I don't need 7 feet of USB cable.  If I replaced the cable with a different, shorter one, would the pedals still work?", "response": "7 feet is not really too much, depends where your USB plugin is and your position, legs length etc"}
{"product_id": "B002QHDKE8", "context": "is skate 3 popular", "response": "well, of course, many popular YouTubers play this game, such as: PewdiePie,jacksepticeye,Markiplierm,TheGamingLemon, and many more YouTubers."}
{"product_id": "B00CMC6HZ6", "context": "Should I buy WWE 2K14 or WWE 2K15 for the Xbox 360?", "response": "I think you should buy both for double the awesome!!"}
{"product_id": "B00GZ1GUSY", "context": "Is it normal to see this annoying white flash between screens a camp fire?  Not sure if mine is defective because it's irritating/annoying. TYIA.", "response": "Yes.  Normal transition for the game."}
{"product_id": "B00DCBDNW6", "context": "Monthly Fee???!!! u mean besides the PlayStation Plus Subscription and the Game Disk's actual price (37.58$) there is still a monthly fee?", "response": "Ok I dont need Ps subscription and I meed to make a monthly payments only for this game. How stupid people are? Do you think people play only this game?   Dont buy this crap. How stupid people become? Pay for the game and pay monthly payments for the same game."}
{"product_id": "B00BBUCCKO", "context": "is there a volume control key?", "response": "I'm not physically looking at it, but yes, several of the F keys at the top can control the volume while pressing the function (fn) key. There is no sole button for the volume."}
{"product_id": "B001FBHT34", "context": "Can you make this compatible with a ps3?", "response": "I don't know if you would be able to use the microphone but there are all types of adapters that convert the pink and green jacks into various devices. Just type in \"pc to ps3 headset adapters\" and find one that you think will work for you."}
{"product_id": "B00FM5IY0Q", "context": "I havent played the prior Dead Rising's. Should I play them for any story knowledge or can I jump right into this game?", "response": "You can jump right into the gay with no problem. If anything, read up on the previous games just to know the story line, other than that, you're good."}
{"product_id": "B0089NVTDM", "context": "Will it work on a Mac?", "response": "It's not working on my mac book"}
{"product_id": "B00D6PTMB4", "context": "Is easier to use the interface on PC or is it the same with a PS3?", "response": "Its pretty easy to use on the PS3, never tried it on a PC."}
{"product_id": "B00CPKUV98", "context": "How many hours does the campaign take, ballpark", "response": "Roughly 24 to 28 hours"}
{"product_id": "B003Q9RGRW", "context": "Is the end of the head set only for xbox or could you use it for a computer too?? Thanks for your answers!!!!!", "response": "It works like the cell phone headsets. Depending on what size your computer has ex. 2.5mm or 3.5mm audio. But it is both audio and speech in the same jack."}
{"product_id": "B00EV4O8VS", "context": "Has the box been opened? If not, is it shrink-wrapped?", "response": "The box was never opened, everything was brand new! The box it's self was not in perfect condition but it wasn't anything that could damage the product."}
{"product_id": "B000B6MLTG", "context": "does this cable fit the black slim xbox 360... need help ??", "response": "i bought this from microsoft, it works on my xbox 360, but then i bought and hdmi cable that works better, if you have a hdmi in your tv i suggest that you buy the hdmi cable instead of this one"}
{"product_id": "B0050SYK44", "context": "why is it rated m", "response": "Violence, blood, gore, some pretty strong language, minor sexual theme (mainly jokes) But there is an option in the settings of the game to turn the blood and gore off if that helps."}
{"product_id": "B00CMC6HCY", "context": "Is there only male Wrestlers?", "response": "There are male and female charcters in this game you can even create your own wrestler."}
{"product_id": "B004MR3QY4", "context": "I'm considering buying this for my boyfriend, who plays StarCraft: Heart of the Swarm. Do you think it would be good for him, or not make a difference", "response": "While this is a very accurate mouse, I doubt it would be much of a difference unless he has a really poor quality mouse right now. It couldn't hurt I suppose."}
{"product_id": "B005S0KH7I", "context": "is this a mechanical keyboard ?", "response": "Yes. It has lighted keys with the option to disable the Windows key.  One draw back, it shows the option to control video ( play, stop, etc) using a function key but, has no function key.  Good solid keyboard though."}
{"product_id": "B00A378L10", "context": "Hey was just wondering if there was any way to dim the led's on the keys?", "response": "There are several levels of brightness. The function keys at the top let you cycle through the different levels."}
{"product_id": "B002I0J51U", "context": "does move work with all ps3 models ? I have model # CECHH01", "response": "Should work with all PS3 models provided that you have the PlayStation Eye camera and run PlayStation compatible games that support Move."}
{"product_id": "B00C2B2Y9A", "context": "Does the stand have two optical inputs or is it one in and one out?", "response": "One optical input one out, and there is a USB input for the chat portion.... If your talking for the PS4??Pete"}
{"product_id": "B00AKIPBNS", "context": "I've heard that in the Fire Emblem series, there is something called PermaDeath. Is that Permanent Death? If it is, can it be turned off?", "response": "Yes, it's called Casual Mode, and you can choose whether to play through the game with it or not."}
{"product_id": "B0017KIBAI", "context": "Is this an official Nintendo Product and does it work with US Wii consoles even though it says \"Use in Japan only\"?", "response": "Yes this is an official Nintendo product.  It does work with US Wii consoles.  I'm assuming that you're NOT asking about Wii U."}
{"product_id": "B009AP23NI", "context": "Is this an official Nintendo product?", "response": "To me I think it's Nintendo product"}
{"product_id": "B0088MVODO", "context": "If this is true, I don't have high speed internet, can anyone download them for me to a memory card or should I give them my console so that they can", "response": "You can with a USB flash drive."}
{"product_id": "B000BIZR72", "context": "does it work on 3ds?", "response": "Per nintendo.com......Almost all existing Nintendo DS and Nintendo DSi games can be played on the Nintendo 3DS family of systems in 2D. With backwards compatibility, your existing portable games look and play just as well*."}
{"product_id": "B006PP4136", "context": "Is this starter kit made for the Original PS Vita or the PS Vita 2000/Slim?", "response": "Original... The slim version didn't even exist by the time I bought this product."}
{"product_id": "B00EI4V3FU", "context": "Can you hear game sound through this headset, or do I still have to have my TV volume turned up?", "response": "You need the TV volume. This is a chat headset."}
{"product_id": "B002I0J4VQ", "context": "Does it come with all the cords needed?", "response": "Yes it does.  But beware.  We purchased ours in August and by Christmas break it just stopped working."}
{"product_id": "B0097CUREG", "context": "1. The coins i had one day was not there the next. Anything i can do to keep my last pay balance. Then how do i get more coins from the \"bank\"", "response": "they should come back the next day. call the company that makes it and ask them."}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "yes. Based on my minimal research of the *new* 3ds, they appear to be the same if not smaller than the current 3ds and xl."}
{"product_id": "B004XIQN3I", "context": "will it work on windows 7?", "response": "Before I upgraded to Windows 8, this game played very well. The only problem, I mastered the game quickly and wanted to move to a higher level of flight, only to find the expense of doing so was too much."}
{"product_id": "B000QJ1NS8", "context": "Does it increase the stock battery life?", "response": "Probably, your original battery is ten years old now and has cycled a lot of times."}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "Missing DLC is as follows. (Not counting outfits).Ultimate Vault Hunter Upgrade Pack 2 (Raised level cap to 72) 652 MB $4.99Headhunter 1: Bloody Harvest 549 MB $2.99Headhunter 2: Wattle Gobbler 1.22 GB $2.99Headhunter 3: Mercenary Day 1.22 GB $2.99Headhunter 4: Wedding Day Massacre 1.04 GB $2.99Headhunter 5: Son of Crawmerax 1.04 GB $2.99"}
{"product_id": "B00JFPO7JG", "context": "Does this game work with XP?", "response": "No. This game requires DirectX 11, which as far as I know only works on Windows 7 or above. XP is 12 years old and no longer supported."}
{"product_id": "B00F9RGFEY", "context": "Does having the lights on eat the battery?", "response": "No, I have the lights on whenever I use it and it's lasted for 10-12 hours every time"}
{"product_id": "B0098EVZZ8", "context": "New to all of this...can you use on PS3?", "response": "as far as i know yes"}
{"product_id": "B00BMFIXKQ", "context": "Does the frame rate drop tremendously when in major cities for anyone else.       I have a super slim ps3", "response": "I too have a suoer slim 500 gb. Playstation 3. I rarely encountered any framerate issues. a couple of times when things got really crazy but not enough to take away from the fun I had playing the game."}
{"product_id": "B00H1FCUBE", "context": "Can they connect wireless with PS4", "response": "Yea if support NEC connection it should work just pair it"}
{"product_id": "B00166N6SA", "context": "Is this the one you need to buy to install in computer before you can play any other Sims3 games?", "response": "Yes this is the actual game, if you buy an expansion pack you need to make sure that this is installed first :) hope this helps"}
{"product_id": "B009IR1SR0", "context": "If I download this game on my current computer and eventually upgrade to a new pc, will I be able to transfer the game ?", "response": "Yes you can.  Just log in to your Amazon account and re-download the game client.  Very easy to do..  If you have the product key saved you can even do it from the orbit game console thing."}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "No it doesn't. I just put everything on a USB drive, drivers, profile editor and profiles. A little more of an inconvenience but for me having a mouse fully adjusted and customized to my hand makes up for it."}
{"product_id": "B006YDPU48", "context": "Can you dodge, block, and counter? Do you get health regain rings and necklace, and do you get health steal per hit armor?", "response": "You can dodge, block and counter (took me a lot of practice) and you don't naturally regain health except through consumable items and one ring that gives you a percentage of health back per monster kill, it's not useful for PVP kills though."}
{"product_id": "B00E369SDM", "context": "Does this PS3 have a disc drive to play game discs?", "response": "Oh yea of course, its just a physical slide on the top of the console."}
{"product_id": "B001BYMZ5W", "context": "Does this headset come with the USB Dac and also does it have Mic Monitoring?", "response": "It does not come with USB DAC I have a small portable amplifier that I use for that. Now I don't know if it has Mic Monitoring."}
{"product_id": "B000VTQ3LU", "context": "How long is the USB Cable?", "response": "the cable is about 6 ft"}
{"product_id": "B0050SYX8W", "context": "do you have to have xbox live to play this game?", "response": "no single player you can  do locally from your house but to do multiplayer you will need a online live card,*Online multiplayer and Spartan Ops missions require Xbox LIVE Gold membership (sold separately)."}
{"product_id": "B0050SWBAE", "context": "Why is this game such a ridiculous price? $92.00? Does it put your kids to bed and drive them to school the following morning? A bit steep otherwise.", "response": "You can get it from Gamestop used for $50-55.  The digital download is still $60."}
{"product_id": "B00I9UVY30", "context": "can you play as the women's teams?", "response": "No. Only team selection by country"}
{"product_id": "B00A1Y2STQ", "context": "I'm an idiot for asking this but, is this wired or wireless? I can't find out if it is or isn't!", "response": "It is not wireless. :)  Absolutely love this keyboard, my all time favourite!"}
{"product_id": "B002JVX5V4", "context": "do I need to leave the disc in the computer to play this scrabble game?", "response": "I never leave my discs in. It should download well -I have windows 7."}
{"product_id": "B0040UAYI4", "context": "Can i use this and play MW3 on the ps3 with the Eagle Eye?", "response": "Yes you can as well as other fps games."}
{"product_id": "B00ATHFLZS", "context": "can different keystrokes be assigned to the programmable buttons for different programs? How many?", "response": "Yes. Have not tested it fully yet."}
{"product_id": "B000M6DHA2", "context": "Is this a SDHC memory card?", "response": "No. Definitely not. Regular SD. Not SDHC"}
{"product_id": "B004W1IX1G", "context": "is it good to buy used wii games or not?", "response": "I bought a new one so I can't help you with that one.  Sorry."}
{"product_id": "B005S0KH7I", "context": "does Logitech Gaming Keyboard G105 work with win 8?", "response": "Yes. I'm using it with Win8 now."}
{"product_id": "B009GSX0A4", "context": "Are the vendors on Amazon selling the 'no region protection' copy of this game?", "response": "if they aren't selling the region free one just go on play-asia and buy the game from there they have a region-free version there for sell."}
{"product_id": "B00ERDGMT4", "context": "What is included with the game disc? Does it come with a map of Pandora?", "response": "If you need a map to play, go on the Internet.   This is one of the best fps rpgs out there.  You want it"}
{"product_id": "B007SRM5U6", "context": "Is internet connection required to play this game?", "response": "Nope, No internet required to play this game."}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the -box 360?", "response": "As long as you already have the portal to set this on then yes if will work. If you do not have the portal look at buying the Skylanders X-Box 360 starter pack. All characters except those from \"Spyro's Adventure\" are compatible"}
{"product_id": "B003NVMEVQ", "context": "When you click the mouse is the sound, soft or loud?  I need one that has as low noise as possible when clicking.", "response": "I would say loud. I dont consider it loud but while playing games with friends in skype or other Voips They have heard the clicks clearly. I do however own a Blue Snoball mic."}
{"product_id": "B00EV4O8VS", "context": "Does this bundle have the new high capacity GamePad battery that lasts up to 8 hours? Or, is it still the original one that one lasts 3 to 5 hours?", "response": "it has the the original one, 3 to 5 hours"}
{"product_id": "B00008J7NZ", "context": "Does this play on xbox 360?", "response": "As Halo 2 is produced by Microsoft it is backwards compatible on the X-box 360."}
{"product_id": "B00G6IJ5QK", "context": "Is this good for CS:GO?", "response": "yes its amazing i use it!"}
{"product_id": "B003VUO6LU", "context": "which version of software or Firmware has? 3.55? native software?", "response": "3.55 was a long time ago, I believe it was the first major geohot  exploitable firmware but to get one of those you'd have to buy one that specifically has one. You can downgrade to 3.55 on certain firmwares but not the current one"}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "I would assume so, but you should do more online research before purchasing."}
{"product_id": "B00BCEK2LA", "context": "Does this work with Windows XP?", "response": "A better answer: Get off windows xp. If you want some serious security issues and no support or new features then stay on it."}
{"product_id": "B008O510Y8", "context": "Is it comfortable even if I wear glasses?", "response": "I wear them for hours at a time while wearing my glasses and they are very comfortable."}
{"product_id": "B00886XQO0", "context": "This or turtle beach xp510 ? Is there differences between these two headsets?", "response": "The only difference I noticed was cosmetic stuff- logos, and the voices when it powers up, etc. If you buy a refurb though do so at your own risk... I'd suggest buying new."}
{"product_id": "B00E1L786S", "context": "What is frequency responce?", "response": "I looked in the literature that came with soundbar and it doesn't give that specification."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "I would never recommend a gta game to anybody under the age of 16. Its violent, has a lot of language and sexual content x drug related scenes, and a lot of things that children are not meant to play. But this is just opinion."}
{"product_id": "B00CORA9GC", "context": "Will this work on a Mac Mini with only the stock 4mb of RAM", "response": "I dont think so, i have 4gig on my"}
{"product_id": "B00GZ1H07Y", "context": "Does this have the Star Wars and 3D tables?", "response": "No. Zen has the Star Wars. Not sure what you mean by 3D?"}
{"product_id": "B005Q1YA5O", "context": "Is this the one that includes the base game sims 3 and sims 3 pets? I saw a cover just like this but this doesn't say it includes both", "response": "No just the pets add on. You have to pay for the the sims 3 separately. Good luck with the pets download . It took me 2 hours to download , then EA , the makers of the game, blocked my computer from m opening the add on."}
{"product_id": "B00CMC6HCY", "context": "is sheamis on the game", "response": "Yes, Shuqueta, Sheamis is on this game."}
{"product_id": "B0040UAYI4", "context": "Can the firmware be upgraded with a 64bit OS yet? (For when 4.0 comes out) I have read reviews saying that it take a 32bit OS to upgrade firmware", "response": "Sorry, no idea !"}
{"product_id": "B00BZOBE78", "context": "do you need the original Civ V to play this?", "response": "I think that you do need to have the original Civ 5 to play it."}
{"product_id": "B0045ZB66I", "context": "Does this version (the physical PC version) require Origin or Steam?", "response": "Actually mine is on steam, though I did register it with Bioware and Origins took it as well. Thankfully it keeps me from ever losing it. :)"}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "Yes, it work on WinXP SP3 or higher."}
{"product_id": "B00EM5UFF4", "context": "I bought this on the 360 can I upgrade this to the x1 without having to pay full price again.", "response": "Nope- and currently your stats do not transfer"}
{"product_id": "B00ECOBFA4", "context": "Hi there dose this come in a case with the dic or is it emailed to you to download on the xbox 360 thanks", "response": "Retail package like a store (with a case)"}
{"product_id": "B0050SXKU4", "context": "Is this US version? like will it work on a ps3 from usa?", "response": "will this work in any country ?"}
{"product_id": "B00D96BNGM", "context": "Does this come with ALL  original cables and accessories?", "response": "yes except for the headset adapter which you can purchase for 30 dollars"}
{"product_id": "B00009OY9U", "context": "Does it have a throttle lever?", "response": "Yes, it works, but it's really small and inputs are approximate."}
{"product_id": "B00A378L4C", "context": "are the leds very bright?", "response": "as a matter of fact, the LEDs can be very bright. It has 5 levels or stages of brightness, which including 4 stages of brightness and one breathing light, you may also check some videos about his keyboard on YouTube. so depend on your needs, it could be very bright. :) hope this helps."}
{"product_id": "B00ECOBFA4", "context": "Hi there dose this come in a case with the dic or is it emailed to you to download on the xbox 360 thanks", "response": "It comes with a case with the disc in it."}
{"product_id": "B00BCEK2LK", "context": "What is the length of the cord?", "response": "It should be around 6 foot.  It is long enough for me to use it with my laptop connected to my TV, and be sitting a good distance from it.  It is a very good mouse for the price that you pay for it.  The mouse feels very light so it is comfortable for long uses."}
{"product_id": "B00BI9MDSO", "context": "It's been about 2 years since it was released. Can it now fit the PS Vita Slim comfortably or do you still have to push on it hard?", "response": "If you have your PS vita without any protector, it fits perfectly. Yoou can have a screen protector but no more than that. At least in my experience"}
{"product_id": "B0050SY4DG", "context": "The game comes in several languages?", "response": "The xbox 360 version comes with a two disks. The first disk is the game, the second disk is alternate langauges."}
{"product_id": "B007TMFD7C", "context": "What brand and model of joystick would you recommend with this game? i.e. for MAC. All the ones I've been finding are for PC.", "response": "I bought the one that was recommended on the Xplane site at the time. It has some minor issues. Check some gaming sites and ask there."}
{"product_id": "B003O6EE4U", "context": "Is this the slim model? How do I tell if my xbox, which came in a box just like this, is slim or not? Thanks!", "response": "This is the standard model. If it was a slim it would be called Xbox 360 S..... other than that I do not know how to tell the difference between the two. Sorry I can't be of more help."}
{"product_id": "B00562O78S", "context": "Resistance 3???? Does it still come with Resistance 3???", "response": "If you preordered while it was a bonus, you'll still get it.  But if you preorder now, you won't.  Other retailers will be taking down the offer as well by Sept. 30, the last day Sony will be honoring it."}
{"product_id": "B003Q9RGRW", "context": "can you plug in both at the same time", "response": "Yes, you can plug in both at the same time."}
{"product_id": "B004QRKWKQ", "context": "does it work with a mac", "response": "I do not own anything by Apple. I can tell you to read the description for answer, or ask Google."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "You can buy the optional \"Jumbo Battery Cover\" (roughly the size of a small merkin), and that extended cavity gives you about an extra 3 cubic inches of dust-storage. Can't go full-potato without extra Dorito dust storage bruh."}
{"product_id": "B000LQ4HTS", "context": "Is this available for windows 7 ???", "response": "A quick check of their UK website indicates that, indeed, it will operate with Windows 7. For further information, do an internet search."}
{"product_id": "B00DE2W33I", "context": "Hello!! Can I use this PS4 in Italy?", "response": "not this PS4 because its a US model."}
{"product_id": "B005VA5D24", "context": "Do you need a cable to plug it in to the Xbox, or does it plug in directly?", "response": "On the bottom of the Xbox 360 Slim (If you stand it up) is a little hatch, just slide it in, Just make sure you have it in right."}
{"product_id": "B00EV4O7B4", "context": "Does this 3DS XL purchased on Amazon come with the manufacturer's warranty (Nintendo warranty)?", "response": "yes it dose 1 year aas I remember. my son don't have the box or paper work anymore sorry."}
{"product_id": "B00FB45YFQ", "context": "Will these work with a PS4? I am tired of this stringy little black wire that came with it. I need an upgrade, will these work?", "response": "http://steelseries.com/products/audio/steelseries-cross-platform-audiomixer You need this audiomixer for the steelseries siberia elite to be compatible with your ps4."}
{"product_id": "B00GLG2D4I", "context": "Any PDF of Manual for this device?", "response": "No,  only a small guide in hard copy."}
{"product_id": "B00A0EPNPI", "context": "My keyboard keeps pressing random keys once in a while (like once every 1-3 minutes) usually shift or ctrl keys. Is it broken? Is there a known fix?", "response": "Update drivers by grabbing official driver from manufacture website and also make sure it is plugged into USB 2 port not 3 or 1.1, membrane switches go out by not working at all or giving random presses that dont make sense like pushing the f key and getting a /"}
{"product_id": "B009DL2TBA", "context": "does it play ps1 games and ps2 games too?", "response": "all ps3s play ps one games (physical disks). only certain \"original fat\" ps3 models also play ps2 games."}
{"product_id": "B004J6KRD6", "context": "Will the T500RS work on the PlayStation 4?", "response": "Yes, for sure! It's the best option, IMO."}
{"product_id": "B007LQG9A6", "context": "is it compatable with pc games?", "response": "Not sure.  I play xbox. It should work since it is also for PC.  It works great on my XBOX."}
{"product_id": "B00FNKMVUO", "context": "is the software user friendly?", "response": "Very much. It was a simple download and you can easily change the button setting without even reading the manual."}
{"product_id": "B00AWEMODK", "context": "Just wondering, does this collection has separate registration codes for the different expansions or just one for the whole package?", "response": "My collection has different codes for each separate expansions.  I bought mine 5 months ago from Amazon."}
{"product_id": "B00GY4OAIE", "context": "Why did this product come in a paper sleave instead of the protective plastic blue ray case?", "response": "I don't know.  Mine was for PS3 and came in a plastic box.  However, I pre-ordered this game."}
{"product_id": "B0032MO77U", "context": "Does it try load other junk onto your computer as does another Jewel Quest 2 disc that I purchased and had to toss out?", "response": "You just have to get by the first screen. There isn't anything in my experience that it tries to load without your permission. As someone else said, just say \"no\"."}
{"product_id": "B001UIG6M2", "context": "Does this device work on ps2 consoles bought in india?", "response": "It might not work in India, but try see if it does work."}
{"product_id": "B00GY4OAM0", "context": "What are the supported controllers?", "response": "You can use regular Wii controllers or the Wiiu pad that comes with the Wiiu"}
{"product_id": "B00A1AQJAO", "context": "does the action replay stop working in 3 months???", "response": "Absolutely! It was a complete waste of money and frustration! Even after exchanging it for another one, no difference"}
{"product_id": "B00A0EPNPI", "context": "I am from europe (germany) it is possible to change y to z not only in the layout but also that u can programm it?", "response": "Yes karin. This requires installation software so you can install your countries keys."}
{"product_id": "B000K9Q5NW", "context": "Flight Sim Seat Possibility? Is it possible to get a pair of the Playseats Gearshift Holder Mounts to put on both sides of the playseat and have a flight sim cockpit?", "response": "Man this is such a great idea. And an elegant one too. Just one question: The Plexiglas is screwed or glued? Thanks."}
{"product_id": "B00BXE4W4C", "context": "I have made it to the cellar.  Used the hammer to get in but now it is not in my inventory so I can't break the wall with the map.  Any ideas how to get the hammer back?", "response": "Did you turn left after taking out the nails to the cellar - hidden object scene. Get electical tape and fuses? Then go back to cellar and see if you can pick the hammer back up."}
{"product_id": "B00D9FQ9CQ", "context": "Is blu-ray drive present with the console? if yes, can I play blu ray movies using this?", "response": "Unfortunately there is no Blu-ray drive present with the console, so you will not be able to play Blu-ray movies with this particular console."}
