{"product_id": "B0088MVODO", "context": "Do you need to buy this game new for the downloads to work?", "response": "I think the downloads are just codes and does not require the RE6 to work, like if somebody gave you RE3 code as a gift you can use it and get the game. I hope this answer your question."}
{"product_id": "B00004XRBB", "context": "Does it work on  64-bit Windows 7 and is a joystick compadible with it?", "response": "No and I am stuck with it . I did not think to ask."}
{"product_id": "B004NRN5EO", "context": "this game comes with case, manual and artwork?", "response": "I second what Marlon said."}
{"product_id": "B007FTE2VW", "context": "Do you need origin to install", "response": "Yes, you have to download the Origin client to download SimCity. The Origin client is free to download and its not bad to have as they sometimes have free games that you can download."}
{"product_id": "B00DC9T2J6", "context": "Do you have to pay for online multiplayer or is it free?", "response": "It's free you just buy the game and play. You would have to pay for the future DLC but that's not required"}
{"product_id": "B00HS5FETM", "context": "I have turtle beach earforce x31s will this cord work with that so that i can use my headset i already have with my system?", "response": "Ear Force Stereo Headset Compatibility: X12, X11, XL1, X32, X31, XP300 So yes it will work!"}
{"product_id": "B00BY0G0YU", "context": "does this game come with any dlc or vouchers that you redeem?", "response": "I have only played 10 and not 10-2 but as far as i know, both games do not come with any additional content other then what was released on the international version of the games."}
{"product_id": "B00BCEK2LA", "context": "Can the \"+\" and \"-\" buttons be programmed", "response": "Nooooo it cant + and - for mouse moving speed only , as i know"}
{"product_id": "B00EHBKUTE", "context": "Does the Tartarus gamepad have the glue issue horror stories on the palm rest that I've heard about the Orbweaver?", "response": "This one uses a totally different hand rest than the orbweaver. It uses the same as the nostromo, its just one solid piece of smooth plastic, vs the orbweaver's \"grippy\" glued on surface."}
{"product_id": "B00FXOP1MU", "context": "If I buy this as a used item, will the downloadable game have expired before I can play it?", "response": "The game has been factory reset and will not include The Legend of Zelda: Ocarina of Time 3DS"}
{"product_id": "B007JM8ULS", "context": "I been using this hard drive for a couple of days, however the Xbox now freezes I pull the hard drive out notice it runs very hot, it is temp problem?", "response": "hasn't happened to my son.......do you leave the xbox on for long periods?  When our computer monitor had heat issues, we bought a small fan that runs whenever the monitor is on and that fixed the overheating problem......"}
{"product_id": "B00E3667XQ", "context": "is it any good", "response": "As what? I can't speak to the video game streaming from a PC, but I've been happy with it as a Parrot AR.Drone controller and as an Android gaming device."}
{"product_id": "B008FHL56S", "context": "How do you actually make it work??!!   What else do you need to install this??!!   I purchased two hard drives, and two cables, and none seem to work.", "response": "Which Xbox do you have?"}
{"product_id": "B00D6NPFDK", "context": "Can I use Skylanders Giants figures with this portal and game? Please answer...", "response": "You can use the figures from any skylanders game that came out before swap force did."}
{"product_id": "B008HPAXZ2", "context": "how many come in the pack?", "response": "There is only one top screen protector and one bottom screen protector."}
{"product_id": "B009RXUNGM", "context": "let me get this straight. cause im not 100% sure. i can plug in the included shorter cable for a phone? the hesh 2's are too bulky for school", "response": "Yea you can plug in the shorter cable into a phone."}
{"product_id": "B00B3PDHBU", "context": "Does it have a warranty?", "response": "Yes the XP510 has a one year warranty.  For warranty information go to www.TURTLEBEACH.com/warranty"}
{"product_id": "B009S4JZKK", "context": "is this a game on a disk you can put into a dvd rom", "response": "Yes it is a disc you install to play the game. However, you must always be online to play the game... And yes I purchased it without knowing that feature (it's in very small print)."}
{"product_id": "B00BDX1M00", "context": "Can they this be used to chat wireless with a PC?", "response": "not sure- never used it on a pc"}
{"product_id": "B00BT9B2LC", "context": "does this product comes with a charger?", "response": "No it does not"}
{"product_id": "B00E1A1SP6", "context": "Are all nintendo DS games compatible with the 3DS XL ?", "response": "Yes almost 99% can interchange only difference is on some DS games the 3D will not work"}
{"product_id": "B00BMFIXOW", "context": "is this game fun? how long is the campaign? is the multiplayer cool?", "response": "The game is very entertaining, the whole assassins creed line is great, and the online play just adds more gameplay and is strategic and entertaining as well, I would definitely recommend this game to anyone that likes action games and another good one is Watch Dogs"}
{"product_id": "B00ENFVJJO", "context": "Will this work in the US? Also does this have a trickle charge or auto shutoff?", "response": "Hi, yes its a very good product! And it work very well!"}
{"product_id": "B00562O78S", "context": "when is the 3d monitor released? when is the playstation 3d monitor released in the US amazon says dec 31 BUT in the E3 conference they said it was fall 2011", "response": "Resistance 3 is to be released Sept. 6"}
{"product_id": "B008GEH9HO", "context": "Can you turn the connectivity off, similar to putting a phone in \"airplane mode\"?", "response": "Yes, you just do it in settings."}
{"product_id": "B00EPZ8POY", "context": "does work on any HDTV?", "response": "Well it worked on mine, and my friends so I guess yes it does.  And it's an amazing game I loved it since the first day I got it.."}
{"product_id": "B00HK74G2E", "context": "Can you play PS2 games w/ this PS3?", "response": "No, unfortunately you can't"}
{"product_id": "B0094H8H78", "context": "can you save your games ?", "response": "if the game has a password system then it works fine, however i dont think you can do save states and other emulator stuff like that."}
{"product_id": "B001AH8YSW", "context": "Is the \"Enhanced\" physical copy the same as the download \" Enhanced directors cut\" version?", "response": "I would assume so.  Butbif your running on windows 8 your better off trying to download because the disk won't work on wind 8.1."}
{"product_id": "B00FM5IY4W", "context": "why can't you make it for xbox 360", "response": "It's not that they can't, it's that they won't. They want to sell more xbox one consoles. If they keep making games for the xbox 360 then no one would go out and buy the one. That's including me  my 360 works just fine but I wanted to play the new xbox one exclusive."}
{"product_id": "B000OPOCFU", "context": "is this compatible with windows 7 64 bit", "response": "This requires a minimum of Windows XP...so every version above Windows XP should be able to handle it just fine."}
{"product_id": "B00A0EPNPI", "context": "I am from europe (germany) it is possible to change y to z not only in the layout but also that u can programm it?", "response": "Sorry I don't know what you are talking about? Change y to z is it the letters that you are talking about? programming to it? There are software that you can control the keyboard, but if you know how then I think it would be possible."}
{"product_id": "B00D96BNGM", "context": "IT WORK DOR PC", "response": "Although not officially supported for PC use, you may be able to use it depending on your system's configuration. Additional information and details can be found in our Knowledgebase:http://support.turtlebeach.com/entry/830517212/"}
{"product_id": "B000B78F72", "context": "Mainly want simple Spider Solitaire for WIndows Vista - will this suffice?", "response": "Sorry I use it on XP, have no idea about Vista."}
{"product_id": "B000096L71", "context": "if I buy the 4 disc used do I need a code to get it to play ???  thank you", "response": "if you do the code will be in the box the 4 disc's come in, just remember the 4th disc needs to be in the cd-rom when you play the game, other than that you should be good, are you getting a good deal buying it used?"}
{"product_id": "B004FS8LYK", "context": "Do I need to play any other Tomb Raider games to understand this one?", "response": "You do not, this is a reboot of the franchise and this game is the origin story for Lara."}
{"product_id": "B000B78F72", "context": "Does it have vegas solitare?", "response": "If it does I haven't played it. There are so many games I may have missed it.  Pretty Good Solitaire is my favorite game."}
{"product_id": "B00CX8VYM0", "context": "Should i buy this game? I honestly suck at games, I give up easily on timed stuff or too difficult, but this game looks interesting", "response": "If you are not good at games and don't want to be frustrated i wouldn't advise it. It is a very hard game. The graphics are amazing though."}
{"product_id": "B00519C7JC", "context": "can you play it on the ps4?", "response": "PS4: Backward Compatibility. PlayStation®4 does not have backwards compatibility to play disc-based PS1, PS2, or PS3 games."}
{"product_id": "B00005NIMB", "context": "Does it come with a power chord?", "response": "Thank you for your prompt response."}
{"product_id": "B001UIG6M2", "context": "Does it have star ocean till the end of time codes installed on the disc?", "response": "I don't know because I can't get it to work."}
{"product_id": "B000035Y6D", "context": "How do you set it up with the new flat screen TV's.  Any differance?", "response": "You should be able to plug it in the same and then go to channel 3"}
{"product_id": "B00DCDZM2I", "context": "My grandsons have the trap team portal. Do they need this portal and disk to play the swap team characters?", "response": "as far as I know the new ones are backward compatible which means they can use characters from older game sets."}
{"product_id": "B008BT2FWI", "context": "are these games 3 hiden objects system", "response": "There are several games on this disc.  Some you can play for an hour, then you need to buy them if you want to continue playing them.  There are 3 Montezuma games, the point is to get three same colored discs in a row or column.  I like the third one the best."}
{"product_id": "B0053B66KE", "context": "Do they ship the correct version based on ur region? Eg PAL to NZ and Europe, Or do they only ship American NTSC version?", "response": "I wasn't given the option for any version other than the American NTSC version."}
{"product_id": "B00JC9SWSC", "context": "Can you download movies and save them on the PS3?", "response": "There is a way. Im not sure how its done as I haven't actually done it myself. But my best friend did it when she got hers. Good luck :)"}
{"product_id": "B001E27DLM", "context": "Is this game backwards compatible with the 3DS?", "response": "yes, I have a 3ds XL and it works fine."}
{"product_id": "B0086UK7IQ", "context": "Is this mouse ok for smaller hands? Mine are, and though it's hard to tell from the photos, it looks rather large...", "response": "yes, John I Rhude"}
{"product_id": "B00DLDEKOK", "context": "can this display volume", "response": "Yes it does display volume"}
{"product_id": "B005VO5ZVY", "context": "Will this fit XL size?", "response": "Doubt it. I would look for one that specifies that"}
{"product_id": "B00DE2W4PK", "context": "The playstation plus comes in the box?", "response": "ya mine did. looks like a credit card with a validation number on it"}
{"product_id": "B00A1AQJAO", "context": "Will this work with the New Nintendo 3DSXL?", "response": "In the New 3DS XL, due to the card slot being more recessed into the system, the Action Replay will hit the system before it's far enough in to click into place."}
{"product_id": "B00CXCCB64", "context": "I played before on 360, now getting the One, am I still able to play live with my friends that are playing on 360?", "response": "You can only play on the platform you have.good news is its more players and all the maps are bigger"}
{"product_id": "B005HN5LKY", "context": "I ordered this product and only received the cord that plugs into the wall, should I be expecting the brick, or is that not part of this purchase?", "response": "I received brick and the cord, so I think you're missing a part."}
{"product_id": "B00DUARBTA", "context": "Does this game have multiplayer mode?", "response": "Like all lego games the second character can be controlled by another player"}
{"product_id": "B00BI83EVU", "context": "I'm curious if Watch Dogs is meant to be 21st Century Assassin's Creed? Is the play-style similar to Assassin's Creed?", "response": "Yes, minus all the climbing"}
{"product_id": "B001BZ2F56", "context": "Will This Game Work On Windows 8.1?", "response": "Sorry, I really don't know the answer to that I have windows 7."}
{"product_id": "B00B1MXGDO", "context": "Can you use the hammerhead pro headset with this when playing on the xbox 360?", "response": "Aslong as your not trying to pair with xbox one or ps4 they have perfect comparability with current gen consoles and pcs"}
{"product_id": "B002I0H2AG", "context": "does this game really suck ballls", "response": "I'm a fan of the franchise & liked how it's story predates the others. if you liked the other games you'll like it to. I have to be honest, it's short compared to the others so at $20 it's a good buy but not at higher."}
{"product_id": "B002I0JZIS", "context": "does it come with changer and usb", "response": "I think it came with both but I already sold mine so cant be sure"}
{"product_id": "B0086UK7IQ", "context": "Are all the buttons fully reprogrammable, particularly the ring finger button?", "response": "Every single button can be reprogrammed aside from the dpi and mode switch buttons."}
{"product_id": "B0089NVTDM", "context": "Will this work with the Wii U?", "response": "Sadly... VERY SADLY, no... it will not... I know your pain, fellow gamer. Nintendo needs to get their adapters back in production!"}
{"product_id": "B00ARCWQOO", "context": "We live in the UK and have bought our x-box here, but this game isn't available in the UK.  Will it work on our UK X-box?", "response": "As far as I know, only a few specific games on xbox are region free. If you bought your xbox in uk, this might not work. Ps3 is region free, which Mr Delahunty may be thinking of. Good luck."}
{"product_id": "B00F27JDY0", "context": "I've heard the x and o button are backwards, is that true and then is it possible to change it and have x as enter and o as back?", "response": "It is only backwards for the main menu and PlayStation store. For the games, the controls are set for whatever region the game was made in. There is no way to change the controls for the menu and the store though, however I got used to that quickly."}
{"product_id": "B007SRM5MO", "context": "Anything inappropriate for a 10yr old?", "response": "No My son is 6 and loves it"}
{"product_id": "B00E8RVP0U", "context": "does wii products play on Wii U too?", "response": "Yes it also plays on the Wii U.  Played it this morning. :)"}
{"product_id": "B00B70WKUK", "context": "can you play this game on windows 8", "response": "Hello,I played resident evil 6 on windows 8 and it worked perfectly fine.Thanks"}
{"product_id": "B00D96BMV8", "context": "How good is the headset adapter? Is it the official xbox headset adapter or Turtle Beach's version?", "response": "I think it's the Xbox version which ever one that the headset came with"}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "You can change the system language, no worries"}
{"product_id": "B000AOJ7FK", "context": "Does it come in case or download from here", "response": "mine came in the case as required"}
{"product_id": "B00F27JDUY", "context": "So i can game online and there will no prob considering it from japan?", "response": "No you won't have a problem."}
{"product_id": "B00HWMP0TU", "context": "does this version require me to load it via a cd drive or will it allow me to just download it on steam?", "response": "It comes with a cd that you can load the game off of.  According to the booklet you don't have to download it via the cd and can just activate it from steam, but I don't have any experience with that so I'm not sure how that would work out for you."}
{"product_id": "B009AFLXQQ", "context": "Will this controller work with the original Wii?  Or is it just for the Wii U?", "response": "Im pretty aure its wiiu only"}
{"product_id": "B002AQNT96", "context": "is this redeemable on steam or do i just get the game and thats it i boot it from the disk", "response": "I believe so. That's exactly what I did."}
{"product_id": "B00D9FQ9CQ", "context": "Is blu-ray drive present with the console? if yes, can I play blu ray movies using this?", "response": "HD Movies, but I don't see Blu-ray on the packaging."}
{"product_id": "B00HG0B8NA", "context": "can you make the cards VERY LARGE?", "response": "There really are few option with this game. I don't know anything about making the cards larger, but I know I was really unhappy with the quality. Therefore I don't play it. Sorry, I had to vent."}
{"product_id": "B003O6JJKY", "context": "Can this play dvds? or blurays on it in the disc drive? (Xbox 360 250GB Console)", "response": "yeah ! caame with everything"}
{"product_id": "B009SJR278", "context": "Do I need to buy a splitter for pc gaming?", "response": "Well, I haven't bought it and it's perfectly working. I don't think it is necessary. Maybe for other versions of this headphone(Like Razer Kraken PRO or only Razer Kraken) it might be, but for Razer Kraken 7.1, it's not."}
{"product_id": "B008RA5DIY", "context": "can I get on from a remote location as long as only 2 others are on?", "response": "I have a remote user getting on with two other users on."}
{"product_id": "B002L6HJCI", "context": "Is it a reductions version of all 3 AOEIIIs, or a better and expansion of AOEIIIs?", "response": "Hi, I think it is just the combination of three AOEs."}
{"product_id": "B00ECOAX34", "context": "this game include spanish language????", "response": "I asked my son this, and he said he does not know. He has never seen the option for it. Sorry!"}
{"product_id": "B00005NIMB", "context": "Work fine in Win7 64bits ? to Il2 saga ... Thanks", "response": "Mine worked great in Win 7 64 bits, I don't know about that game. Still my favorite joystick despite the age"}
{"product_id": "B0038PBF1W", "context": "How do I order more add on aircraft for this sim?", "response": "look on sim web site"}
{"product_id": "B007R9PWLY", "context": "hello,in technical details it says that the harddisk is 1TB7200rpm,but in the product disccription it says 750gb 7200rpm+256GB SSD? so which one is it", "response": "I noticed the same thing. I also await a reply."}
{"product_id": "B00DC7G2W8", "context": "I assume that we're going to get the Club Nintendo download code for one free copy of either SMB U, Pikmin, Zelda Wind Waker or Wii Party U, correct?", "response": "According to Nintendo Direct, you will have to register the game with your Nintendo Club account to activate the free download reward."}
{"product_id": "B0050SZ0SY", "context": "Can I play this game with an Xbox controller?", "response": "Worked out-of-the-box with a wired Xbox 360 controller."}
{"product_id": "B008U5ZNIG", "context": "Is this the cherry MX blue keyboard?", "response": "Yes and I desire that -  I like the old IBM keyboards"}
{"product_id": "B005761IOY", "context": "Where do I find a copy of the Quick Start Guide to download for the batarang controller ps3 wireless", "response": "if u know someone that has one they can copy it for you other than that not really sure,the batarang was limited at the time it came out, I had trouble finding parts for it, so I purchased another one. the first one sits on a shelf , n I use the 2nd one to play games."}
{"product_id": "B00D6PTMB4", "context": "Does it come with the guitar?", "response": "The program is available  with a Gibson Epihone guitar for around 300 dollars.  The package I bought at Amazon included just the guitar cable.  Reason I chose without the guitar is because I own several guitars.Arno"}
{"product_id": "B00EFFVZP0", "context": "what exactly is the difference between a campaign and a regular video game?", "response": "They're one in the same. BF4 just has multiplayer also (most have this though)."}
{"product_id": "B00HWMP0TU", "context": "Labeled as COMPLETE ED., but does't have EXT. PACKS & DLC as box describes. What do you recommend?", "response": "I'm not sure if you did not receive the correct disks, or if you are not aware of the preinstalled dlc and expansions on the disks in the package. If you received the incorrect disks, then I would return them immediately."}
{"product_id": "B001AH8YSW", "context": "Will it run on Windows 7 ?? I keep getting minimum requirements not met.", "response": "I think you need Windows Vista or Windows XP. Those are the two requirements on the box. I'm sorry it took so long to respond. I have been away from my home. Thank you."}
{"product_id": "B00B98HDNO", "context": "Can you play the PC version 2 player, or is it just single player?", "response": "Yes you can, similar to most Lego games"}
{"product_id": "B008O510Y8", "context": "People say this sounds \"tinny\" without an amp. What makes it sound tinny? Why don't other headphones sound tinny without an amp?", "response": "it sounds tiny because it is 150 ohms so it needs an amp to push it but the pc 360 are 50 ohm and dont need an amp ... jus look for a headset with 50 or less ohms and u wont need an amp"}
{"product_id": "B004GINKNQ", "context": "I have a black xbox 360 S Model 1439. We just got Destiny, which needs a hard drive. Will this do the trick?", "response": "Yes it will same reason that we purchased it."}
{"product_id": "B000B78F72", "context": "will this work for windows 8.1?", "response": "Im not sure about 8.1, but I have installed it on Windows 8 without any problems."}
{"product_id": "B008KH7NZA", "context": "Does this require a wire to the ps4 controller for chat to work?", "response": "no, just connect the cable from the headset and go. you need nothing more"}
{"product_id": "B00005QEFD", "context": "Will this be able to hook up to an HDTV? Specifially a Samsung Smart TV?", "response": "The Gamecube only supports AV cables. So if your TV has AV ports, which it most likely does, then it should work but there is not a way to play games in HD."}
{"product_id": "B0058FAEAS", "context": "Does it have changing resistance/ different feel based on airspeed in order to mimic the pressure required to apply control inputs in a real aircraft.", "response": "The answer is nope it does not change the feel on the yoke based on airspeed. I found it great and it help me a lot in my training but is not the same as real flying, but pretty close."}
{"product_id": "B00CX7FQ4I", "context": "The game is dubbed and subtitled in Portuguese ?. It's what I want to send my son in Brazil", "response": "it should ply any language in this game"}
{"product_id": "B00EOPT5ZS", "context": "Does this work for regular computer/office uses? In other words, not for gaming but for ergonomics when using computer keyboard heavily?", "response": "Yes, I have mine setup with Cut/Copy/Paste and Shift as the bound commands."}
{"product_id": "B00FLLFJE0", "context": "How does the base recharge the batteries? Does it plug in? Or does it have to have batteries in it?", "response": "it doesnt plug into a wall socket. It has a USB cord that plugs into a computer, a cell phone charger, a USB adapter, etc..."}
{"product_id": "B009K7U6IK", "context": "What kind of keys are on the keyboard? (mechanical, rubber dome...)", "response": "This is NOT mechanical those are expensive this are rubber dome older types. The keys do feel harder to press down than others i think thats what they call tactile feel. Wrist rest sucks and the backspace key is small. Despite those flaws i just mentioned it looks really good for a cheap keyboard."}
{"product_id": "B0032MM2P4", "context": "is there a shuffle feature during the game?", "response": "I have had that game for a long time and I just found out about a shuffle feature.  Yes, it does have one."}
{"product_id": "B00B1VJZO4", "context": "The installation is not working !!!!!!! It says that you have to have sims 3 installed before? WASTE OF MONEY", "response": "You do have to have Sims3 installed first.  However, at this point with Sims4 already introduced, Sims 3 should be very cheap or free."}
{"product_id": "B005THAX5Q", "context": "this game is the spanish ?", "response": "No, the game is in English. There might be a way to change it if you want to, but I wouldnt know how."}
{"product_id": "B007R9PWLY", "context": "I am buying a laptop with a 1 tb hard drive and 8gb solid state. In this configuration is the OS put on the HDD or SSD?", "response": "My ASUS has a HDD with the OS but I backed it up on one of my two STADA drives"}
{"product_id": "B00005NIMA", "context": "Can you use this with a laptop?", "response": "Worked great for me."}
{"product_id": "B000P46NMA", "context": "Is this the first game in the series?", "response": "Why yes it is!"}
{"product_id": "B003O6C0V4", "context": "does this include the total body tracking system?", "response": "Yes.  It works well for me.  You have to follow the instructions about how to wear the bands."}
{"product_id": "B0053B66KE", "context": "is it playable on ds or dsi", "response": "No. Only on a 3DS, 3DS XL, 2DS, or future systems. For DS Pokemon games, try Diamond, Pearl, Platinum, HeartGold, SoulSilver, Black, White, Black 2, or White 2."}
{"product_id": "B004AM5RAM", "context": "Does the epic have the TILT scroll wheel just like the epic chroma?", "response": "Yes, all versions of the naga have tilt scroll wheels"}
{"product_id": "B0088MVPFQ", "context": "I have Nintendo 3DS XL handheld player. Will this New Super Mario Bros 2  play with this console? Thanks. Edit | Delete", "response": "i'm not an expert in DS's but I'm in Australia and it wasn't compatible with my son's 3DS XL. Only works for USA consoles."}
{"product_id": "B002I098JE", "context": "does it require xbox live gold?", "response": "I got the game for my fiance, and I am currently away from home. However, he has not said anything about needing XBOX Gold."}
{"product_id": "B00DVEJA7G", "context": "Will this work with a gaming console such as a ps4 or xbox one?", "response": "I am not sure, but so far it has worked with all my Bluetooth electronics."}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "Sorry mate I can not understand your question.."}
{"product_id": "B008JHH5RC", "context": "Not really a question but... NOTE: This skin will NOT fit the NEW Nintendo 3DS XL.  Skinomi, please create a skin that fits the New 3DS XL.... ?", "response": "Please take a look at \"Skinomi MatteSkin - New Nintendo 3DS XL Matte Screen Protector (2015).\""}
{"product_id": "B0086UK7IQ", "context": "Anybody but me use gaming mice for non-game stuff?", "response": "Aside from gaming, I use it for web browsing. My buttons on the left are mapped to switch focus to a specific tab (G8-G17), open new tab (G18), open previously closed tab (G19), and close current tab (G20)."}
{"product_id": "B0088MVODO", "context": "if I buy the anthology on ps3 does it work on ps4?", "response": "Only if your ps4 is backward compatible."}
{"product_id": "B0057SDCLY", "context": "one question that headset can work whit ps3?", "response": "No it is made specifically for xbox"}
{"product_id": "B00IYWV852", "context": "Is the extra 20 buck for the deluxe edition of the game worth it?", "response": "The deluxe edition gives you some in game items and a slight edge on experience gained. Is it really worth it? I think the edge on gained experience is a deciding factor. If you can level quicker you can cap out and then try a different class."}
{"product_id": "B00B23MO9Y", "context": "i have the 2008 version which is missing this expansion plus 6 add-ons, if i buy the codes online will it work by using just this disc?", "response": "Yes, you can use any FFXI related gamedisc to launch the game on 360. As long as you register the codes you buy online to your square-enix account you'll be fine. It will download/update any content you're missing automatically."}
{"product_id": "B00BZOBE78", "context": "Can I use this without redeeming it on steam? Will it still unlock on my local computer?", "response": "Yes, if you buy it from anywhere but Steam, it will not be redeemed on Steam, so yes."}
{"product_id": "B00CERXJNW", "context": "Can you record text macros on the 'G\" keys?", "response": "Yes you can. I myself haven't used the feature."}
{"product_id": "B004J6KRD6", "context": "How quickly does the wheel turn? Is there any resistance from the motors?", "response": "Hey bro, the new T500RS is very good, really strong and very quiet. You can trust!"}
{"product_id": "B0009VXBAQ", "context": "does this work with balance board", "response": "I don't know but it looks the same as the original. I don't have a balance board."}
{"product_id": "B00CX9L30W", "context": "I have a question, even if this is an MMO, does this have a universal goal?", "response": "It does, its got (from the looks of it) a long and very well thought out storyline that is ever expanding in their free expansions. Its also got a great end goal raid system that really promotes player interaction along with a lot of extra game time and a goal everyone can strive to achieve."}
{"product_id": "B002LMX5ZW", "context": "Moraff requires a code number to get their discs to work. Is code number included in jewel case.", "response": "I did not have to enter a number when I loaded the disc (downloaded it in December)."}
{"product_id": "B006JSY3MI", "context": "Can it run on windows 8?", "response": "Yes it can, don't hesitate to pick it up! :)"}
{"product_id": "B002I0KP4G", "context": "I'm buying this for my boyfriend and I'm clueless, is buying the collectors edition worth it? What weight does it hold?", "response": "He'll be happy either way, but the collector's edition has a nicer box."}
{"product_id": "B00EV4O7B4", "context": "Does this 3DS XL purchased on Amazon come with the manufacturer's warranty (Nintendo warranty)?", "response": "ours was brand new in the box. yes it has a 1 year warranty"}
{"product_id": "B003VAHYQY", "context": "using controller with steam games?", "response": "It has worked perfectly for every steam game I have played with it."}
{"product_id": "B004AM5RAM", "context": "Do you notice any latency between clicking and games responding? I have had terrible wireless gaming mouse experience.", "response": "Honestly this mouse has amazing response time. I was impressed with how well this mouse works."}
{"product_id": "B0050SVNP8", "context": "Can this be played on a ds lite?", "response": "Yes this can be played on ds lite."}
{"product_id": "B001V9PTVE", "context": "Fallout Tactics does not run, cannot find the CD. Has anyone found a real solution? Win7", "response": "I could not get it to run on win 7"}
{"product_id": "B00GV0LR64", "context": "How do you take it off the tv after playing? Does it lose its suction when you put it back on?", "response": "I usually don't take it off just unplug it and ignore that it's there"}
{"product_id": "B004RMK5QG", "context": "if i bought my PS4 from US, and i traveled to a different country, will i not be able to use this code?", "response": "It depends on which country you choosed to play with on the PSN.If you use a US-PSN-account, there will be no problem. If you use any other country, you must buy the same plus membership."}
{"product_id": "B00CX8VYM0", "context": "Can I play this on the PS4?", "response": "Yes you can if you own the ps copy and you also get bonus gameplay content with the ps4/ps3 copy."}
{"product_id": "B009GSX0A4", "context": "Does this game work on PS Vitas in the US?", "response": "Yeah Vita is region free. I played it on my US Vita. It's just the DLC you'll have to worry about. If you want that your Vita need to be using a japanese account to use the DLC."}
{"product_id": "B008M4BNQG", "context": "Does this headset just hook up to your USB slot or does this have to hook up to the audio/video jacks also (red,white,yelliow) in back of your tv?", "response": "It can hook up to both. the USB is for the mic and hearing other people's mics, and the audio/video is so you can hear the game through the headset."}
{"product_id": "B00919RM1Q", "context": "Can this verison be used on Windows8?", "response": "I do not know as I do not have that version"}
{"product_id": "B0088MVODO", "context": "if I buy the anthology on ps3 does it work on ps4?", "response": "NO, PS4 do not have Backwards Compatibility."}
{"product_id": "B001LKM0EW", "context": "Does this work on Windows 7/8/8.1?", "response": "I have windows 8 and it runs fine."}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "Yes, we use it daily with Windows 7 64 bit."}
{"product_id": "B00F27JNGS", "context": "Yeah I have a question lol. When is it gonna be released in the US? Seriously. I WANT ONE! no japanese version!", "response": "You're probably aware of this, but it's just been released in the U.S., as \"Playstation TV\".  It's only in black though, no cool white color :-D  I bought one a week or two ago."}
{"product_id": "B00DBCAT3W", "context": "do you have to be online to play this game?", "response": "No, you do not need to be online. As far as I can tell there's no online element. The only thing going online will do for you is update the game with any bug patches or fixes. It's not necessary to play."}
{"product_id": "B009AFLXJS", "context": "How does the pro controller connect to the gamepad", "response": "It doesn't it connects right to the system wirelessly or via USB cable that comes with it..its a great controller I use for most all the games..Wii U is a great system"}
{"product_id": "B0047ERZ7Q", "context": "dose it work with the pspvita", "response": "doesn't vita have cameras though?"}
{"product_id": "B00IVHQ0KI", "context": "Does this product work with Xbox ONE and does it support the game Project CARS", "response": "It does work on an XBox One. I don't know about Project Cars."}
{"product_id": "B0000512IE", "context": "Can I use these with Window 8/8.1?", "response": "I don't see why not. I don't use the CH driver cd that come with it as it tends to cause controller issues. I have Win7x64 and no problems in FSX"}
{"product_id": "B004W1IX1G", "context": "Does it work for a wii mini?", "response": "It should! You will need the motion thing for your remote!"}
{"product_id": "B00BGA9X9W", "context": "Why doesn't this come with a USB cable to charge it?", "response": "Pretty much any android charger will work though"}
{"product_id": "B00FNQUN7Q", "context": "Which are the differences between this card an the \"ps plus 12 month subscription card\" ?", "response": "Same thing!  Just looks different."}
{"product_id": "B002I090AG", "context": "Does it come with a Charger", "response": "I googled it, and it pulled up a page that says a 3ds does come with a charger cord as well as the sd card."}
{"product_id": "B00D6NPFDK", "context": "What language is this game in? I recently purchased a differnt one in Spanish accidentally and I need an English version.", "response": "I want to know if this have both language, I want Spanish version??"}
{"product_id": "B00E3667XQ", "context": "While console mode is enabled, is it obligatory to have the shield in clamshell mode?", "response": "Provided you have bought the media remote or shield gamepad you can close it into clamshell position. I have the Nyko dock and use it in this form factor all the time."}
{"product_id": "B00C2B355W", "context": "Does the PS4 allow 7.1 through PS4 dashboard audio out sound settings or does it limit the output to 5.1?", "response": "Currently uses 5.1 but Sony is looking to enhancing to use the 7.1 capabilities in an update within the near future. Still an amazing sound once fine tuned for personal use between chat and game audio equality and the ever favorite no wires at all from the headset."}
{"product_id": "B0050SYILE", "context": "Is this o.k. for asia region  (vs u.s.a / canada", "response": "This is made for USA made consoles.  So it probably wouldn't work for any other country."}
{"product_id": "B00IIHU44E", "context": "Can I use my 360 controllers with the new system? Thanks!", "response": "no ,new console don't allow to use XBOX360 controllers."}
{"product_id": "B005S0KH7I", "context": "Is this compatible with windows 8?", "response": "As far as I know, yes? I don't see why it wouldn't but I am using Windows 7 so I cannot guarantee."}
{"product_id": "B001BYMZ5W", "context": "Do these headphones offer sidetone? That is, can you hear your own voice through the mic?", "response": "No. The only drawback. Have to lift one side abit for that"}
{"product_id": "B00BV72X1U", "context": "Will this work with windows 8.1?", "response": "Im not sure because I am using windows 7. Sorry I cant help"}
{"product_id": "B00CPKUV7K", "context": "Which disc do I load first or all 4", "response": "Start with disc 1 and then follow the instructions on the screen"}
{"product_id": "B00AKIPBNS", "context": "IS this appropriate for a 8-9 year old?", "response": "Yes I think it is there is no blood or mature content in this game however a young kid may not understand how to play the game and or get bored with the battle tactics"}
{"product_id": "B009XZ1CTQ", "context": "my grandson is 5 - can he do this game?", "response": "yes, it's a easy game"}
{"product_id": "B006RJ373K", "context": "system requirements for mac and pc?", "response": "For the Mac, more than the minimum 2GHz processor and 2GB of RAM specified in the operating manual. It does not run with the minimum!"}
{"product_id": "B00BQZ5EWW", "context": "are there black people?", "response": "Yes, among the Blemmye and Meroe people of NE. Africa"}
{"product_id": "B00BGAA3S2", "context": "Which the contents of the pack? Comes with the support?", "response": "Produto foi enviado em excelente estado....embalagem pequena e bem fechada....câmera já vem com suporte para fixação na TV.  Recomendo"}
{"product_id": "B00FATRKWM", "context": "Dear Sir/Ma'am, Do you know if I can connect external Hard drive is there UBS connection? Because 4GB v low.", "response": "You probably know by now, but the easiest solution to more storage is a 16gb USB flash drive. You just plug it into the USB port on the rear. There are two ports, so you can add two 16gb flash drives for 32gb of storage."}
{"product_id": "B00GV0LR64", "context": "So I'm guessing if the game is designed for higher accuracy WHEN aiming, this isn't going to help much. Is that right?", "response": "Correct. Also in games like BF4, for example, some of the vehicle and weapon crosshairs are not directly centered on your screen."}
{"product_id": "B0094X28J0", "context": "Does it come with the wrist strap?", "response": "Yes, it does include the wrist strap."}
{"product_id": "B00I5LMSE2", "context": "For multiplayer does every need the game, or is this a multiplayer single cartridge game?", "response": "The only multiplayer feature this game really has is Kirby Fighters. People who do have the game can choose from 1 of 10 copy abilities to use in battle. People without can only select Sword and Cutter."}
{"product_id": "B0001BR9Q6", "context": "will hoyle card game play on windows 8?", "response": "Windows 8 is not listed as an option on the box, I use it on Windows 7, hope this helps."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "I have both system and can't see any.  The same as far as what my eyes can see."}
{"product_id": "B00D3RBYM0", "context": "I see there is a new version of this game which is more expensive.  I wanted to get this for my 6 year old, would the original version be sufficient?", "response": "As long as the seller is reliable and the condition of the disc itself is good, a used copy is fine"}
{"product_id": "B00005NIMB", "context": "Work fine in Win7 64bits ? to Il2 saga ... Thanks", "response": "Been using it with Windows 7 64 bit for years, works perfectly under that OS with native support."}
{"product_id": "B00BBUCCKO", "context": "How loud is this keyboard?", "response": "I have to admit, I've never noticed how loud this keyboard is, so I suppose that means it isn't very loud at all! It is a bit quieter than my Dell laptop keyboard, if that helps."}
{"product_id": "B00AIALGZK", "context": "Can I play this game on windows 8.1?", "response": "Yes you can it works great"}
{"product_id": "B00HEX8TA4", "context": "Can this just be a plug and play?", "response": "Likely yes.  However, you will give up convenient color/speed/button setting features."}
{"product_id": "B00D96BNGM", "context": "IT WORK FOR PC", "response": "Although not officially supported for PC use, you may be able to use it depending on your system's configuration. Additional information and details can be found in our Knowledgebase:http://support.turtlebeach.com/entry/830517212/"}
{"product_id": "B00DUARBTA", "context": "is it like in the indiana jones lego or star wars when you push L2 or R2 it can switch between characters?", "response": "no you switch characters by clicking triangle and holding down triangle."}
{"product_id": "B00FATRKWM", "context": "Dear Sir/Ma'am, Do you know if I can connect external Hard drive is there UBS connection? Because 4GB v low.", "response": "I am sorry but I do not know."}
{"product_id": "B000ZHMRTA", "context": "Does it play in Windows 7?", "response": "Yes, it works fine in windows 7, you have to have the disk in though."}
{"product_id": "B0088MVPFQ", "context": "I have Nintendo 3DS XL handheld player. Will this New Super Mario Bros 2  play with this console? Thanks. Edit | Delete", "response": "Yes it will work. That's what kind my Husband has and it works perfectly :-)"}
{"product_id": "B00CD1FCAC", "context": "On the Silver Cherry MX Red (CH-9000019-NA) Are the backlighting LEDs Blue, Red, switchable? Description says blue, then says red", "response": "Normally it should be red, I don't know why the discription says blue, but the 'MX red' should also definitely be with red LED lights. Also, its not switchable."}
{"product_id": "B000TLU67W", "context": "you can play ps 1 games on the original ps2, can they be played on the ps2 slim?", "response": "Yes, it plays both play station 1-2. Play station 2 needs bigger memory cards..compared to play station 1. It kind of nice, one doesn't have to replace all their play station one games.."}
{"product_id": "B00D84DRNC", "context": "Best Buy says the depth of the New 3DS XL is 5.12 inches. This says the depth is 120 mm (4.72 inches). Has anyone tried it to confirm it fits?", "response": "Tested it out on all three generations of 3ds (small original, 3DSXL, New3DSXL), all outfitted with Hori Duraflexi TPU cases and they all fit."}
{"product_id": "B002I0J5CO", "context": "Is this a wireless headset?", "response": "No, it is wired with a 12' cord and a control box with a mic on/off switch and 2 volume control knobs for voice and game effects."}
{"product_id": "B009DYOPK0", "context": "I was wondering on a level 1-10 how loud the clicks are? odd question but gaming annoys the girl friend lol", "response": "I believe it has omron switches. Not sure on the scaling, just sounds normal. Much like my old logitech g500. Based on your last statement, its probably not the clicking. Try screaming at the game more it will cover the mouse and fans."}
