{"product_id": "B00EV4O7B4", "context": "My sons 3DS XL broke, does this come with a warranty?", "response": "I dont think so"}
{"product_id": "B007XVTR12", "context": "does black ops 2 (CD version) come with a Steam product code?", "response": "I'm not sure how many discs are inside  - its DVDrom.  It does include a Steam code and an Internet connection is required to activate and play the game."}
{"product_id": "B00FEOR4MY", "context": "what comes with it is it just the case", "response": "Yes, the case with lace"}
{"product_id": "B00DVEJA7G", "context": "does it come with a charger", "response": "Nope. Cord to attach to cpu. Galaxy cord will fit though. Exceptional battery life..."}
{"product_id": "B008BT2FWI", "context": "does it work on window 7", "response": "Yes, it works beautifully on Windows 7 because that is where I have it installed."}
{"product_id": "B009K7U6IK", "context": "What kind of keys are on the keyboard? (mechanical, rubber dome...)", "response": "It's cheap plastic over rubber domes man. This keyboard is crap. Go to craigslist and get you a used keyboard it will still be better than this one."}
{"product_id": "B00AAS88K6", "context": "will this mouse work with a new Mac Power book?", "response": "It works great with my MacBook Pro retina."}
{"product_id": "B003ZSN600", "context": "is this an official microsoft controller?", "response": "im pretty sure it is. it comes in Microsoft packaging and is completely overpriced. all joking aside yeah. i have ordered other wired controllers off of amazon and they were all cheap this one came out of the box and had a completely different presence than the others."}
{"product_id": "B00GV0LR64", "context": "(Any Ideas?)This will be my Review: I cant fix ist on any screens. I tried with LG 42\", LG 50\", Samsung 21\", LG 23\" and some other screens in a store.", "response": "Avoid this issue by purchasing the original powered red dot attachment...  http://www.amazon.com/PlaySation-Xbox-One-Wii-PlayStation-360/dp/B00JK0LWO4/ref=aag_m_pw_dp?ie=UTF8&m;=A19VHI2FAT9ZVY"}
{"product_id": "B001EYU1WS", "context": "Does this connect with USB?", "response": "Yes it does. If you are using a USB hub, make sure it is a powered one. Most of the Saitek add on panels require more power than the Saitek yoke (unpowered) can deliver."}
{"product_id": "B00IAVDQCK", "context": "Can you hear your own voice when you speak ? (Like on Turtle Beaches, you can hear yourself through your own headset to allow voice moderation)", "response": "Unfortunately no. This may be a problem with all of the Xbox one headsets because my friends turtle beach is the same. You get used to it though."}
{"product_id": "B002I0H09Y", "context": "it is a usa version?", "response": "Yes. AI is perfect, iz very good.............."}
{"product_id": "B009CEM332", "context": "Is this playable with just a keyboard?", "response": "Yes you can configure this in the Options. I'm using the same control keys like in THPS2"}
{"product_id": "B00CX7FQ4I", "context": "does this game allow two players (in the same room) to play each other with two controllers on your local xbox.like the orginal xbox did.", "response": "Yep you can still vs each other!"}
{"product_id": "B00A8HIGSS", "context": "What does it mean by \"DLC valid till 2015,march 31\"? Does this game have DLC?", "response": "it does have DLC but only if you have a Japanese PSN account."}
{"product_id": "B0085P7U0U", "context": "Does this software work with new operating system Maverick", "response": "Yes I have all Mac computers the MacBook Pro and the iMac desktop and I'm having no problem with the software! I don't know what system uses Maverick but if you are talking Mac Lion OS there are no problems."}
{"product_id": "B004RMK4P8", "context": "my play station can not redem the code you sent me. i am currently in greece. what should i do now?", "response": "Check if your PSN Account is an USA Account. PSN Cards are only for this accounts."}
{"product_id": "B00EADTVL2", "context": "do the lights turn off when no controller is attached, or are they constantly on when the unit is plugged into the wall?", "response": "The lights are off when there is no controller attached"}
{"product_id": "B00DFB99UI", "context": "How many degree does it turn", "response": "around (0 degrees it does not turn 180 degree. I use it on Nascar and a few other games with no issues."}
{"product_id": "B0057WDBHA", "context": "Will it work on PS4?", "response": "Nope only madcatz new ultra sf4 TE stick is cross compatible with ps3/ps4 (comes out in august)"}
{"product_id": "B00A750QIE", "context": "Can u play online against other players", "response": "Yeah you can play online against/with other players."}
{"product_id": "B0071NH8B8", "context": "can i use it with a different provider besides AT&T?", "response": "That I dont know. I only use it for gaming. I suggest google searching that question. Hope that helps and you find your answer. It is a great system"}
{"product_id": "B00GBCLG0E", "context": "does it play ps1, and ps2 games", "response": "only PS2. However, some games have been remade or remixed to work on this system."}
{"product_id": "B002LMX5ZW", "context": "Does the game fill the screen?  The version by another maker that I have does not. My resolution is 1366X758 on a lap top.", "response": "Yes, it fills the entire screen. It's resolution is 1920x1080. This is one of my all-time favorite computer games. I run Windows 8 and have a 26\" monitor."}
{"product_id": "B00BI83EVU", "context": "I was under the impression that games would be able to be delivered to arrive by the release date.  Is this correct?", "response": "I pre-ordered mine, it's on the UPS truck, and scheduled to deliver on the 27th, as promised."}
{"product_id": "B00F27JDUY", "context": "Hello, I have a question is this ps vita system support with the other language too, or only Japanese language", "response": "PS Vita is region-free. You can set it up as English and it will be fine."}
{"product_id": "B0076HD2W8", "context": "does this work with a mac", "response": "There is a third party driver you can get that makes it work. http://tattiebogle.net/index.php/ProjectRoot/Xbox360Controller/OsxDriver"}
{"product_id": "B004YC4NN0", "context": "What emulators does this work on?", "response": "I know that the controller works with RGR Plugin (Vizzed.com emulator), NES emulator's, and most other Nintendo/Sega emulators."}
{"product_id": "B000056SPM", "context": "Is this only for flight sims, or can this be used for all driving games as well?", "response": "generally for flight sim . their is one out that is wheel based"}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "Yes. I'm running it on my laptop that has windows 7."}
{"product_id": "B00BT71S4K", "context": "the galaxy note 3 fit on the controler?", "response": "yes it fits my galaxy mega with a case on it. its the biggest phone out right now :)"}
{"product_id": "B00DGZDFO4", "context": "not opening and im trying to get help but NOBODY is helping me..I have windows 8????", "response": "Have you tried running it as an administrator, also if that didn't work try to run in compatibility mode for Windows 7, let me know if this helped at all"}
{"product_id": "B00JM3R6M6", "context": "will this work on 2ds?", "response": "Yes all 3ds games will work on 2ds. The 2ds is just a 3ds without the 3D feature, that is the only difference."}
{"product_id": "B002TLTBN0", "context": "Does this work for Wii games if playing on a Wii U?(for example Xenoblade Chronicles)", "response": "Yes I does and your better off with it than the wiimote"}
{"product_id": "B0029M6VKA", "context": "Can you set an \"escape\" hot key that would disable the TrackIr input while it's held down, for use with fine aiming or menus?", "response": "The software allows you to assign a hotkey to pause the tracker, but in my experience the delay is such that it would not be practical for what you're asking."}
{"product_id": "B00965WK8K", "context": "Can any serious gamer here comment on how flawless the sensor in this mouse is? Any (even slight) positive/negative acceleration, angle snapping, etc?", "response": "You can install a driver, which I would highly recommend, you can adjust many settings from there. But I have played many games with this and for the price of $38 you cant get a better deal."}
{"product_id": "B007LQG9A6", "context": "does it word with dell", "response": "Yes, any windows PC"}
{"product_id": "B005MQ3BSK", "context": "Is this compatible with a mac???", "response": "I'm sorry. I don't know. I bought it as a gift."}
{"product_id": "B00AEX81SG", "context": "Does this come with the Sony Manufacturer warranty of 1 Year?", "response": "I'm not certain. You should call a support line Sony may have or a customer service number they may have."}
{"product_id": "B00030GSJY", "context": "Can you use joystick separate from the throttle?  On some flight sims I just want to use the joystick by itself.  Thanks.", "response": "Say no I don't think so. The joystick plugs into the throttle with a serial plug and the throttle plugs into the computer with USB"}
{"product_id": "B004XIQN3I", "context": "will it work with logitech extreme 3d?", "response": "It is a lower end sim...no, it will not work, doesn't hurt to try though."}
{"product_id": "B00EW6QT76", "context": "Does this include Playstation Plus?", "response": "No it does not unless otherwise stated."}
{"product_id": "B009XZ1CTQ", "context": "Can you load the DVD on 2 different laptops,or once only?Do you need a space bar to play(ours is currently broken)?Is the PC version superior to xbox?", "response": "I believe you can load to more than one computer.  My son says you do not need space bar to play"}
{"product_id": "B00BU3ZLJQ", "context": "Can this be played offline? The person who I am buying this for does NOT have internet. Will he still be able to play the full game?", "response": "Hey nope my son plays offline with it only."}
{"product_id": "B00CERXJNW", "context": "Is the wrist rest removable?", "response": "Yes it is. It actually doesn't come attached. You have to attach it if you want it. It's a pretty good wrist rest and very sturdy. You  screw it in if you want it attached so it doesn't come off by mistake."}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "They are the same!  Action replay simply rebranded the same device for USA with the word PRO.  This device is TRULY awesome.  Saving 700 hour play file of Animal Crossing to my PC was a relief!"}
{"product_id": "B0010WS20W", "context": "I have Master Poker  Ver 2.01 is this a later version ?", "response": "The version you have is the most recent version. I have the oldest version 1.01. Which I am planning to ordering very soon. I hope that helps. It's great software, don't  you think?"}
{"product_id": "B002RYLG4Q", "context": "I heard if you played the original NES this system has a slight delay compared to it, have you noticed this delay (if any) and if so is it noticeable?", "response": "It's a start up delay. No problems at all during game play. I absolutely love it. I've played everyday without any problems. It's great."}
{"product_id": "B00D7UHT0E", "context": "Just Dance Nintendo is Ok to use with regulat TV?", "response": "Yes, I believe so!"}
{"product_id": "B003O6G5TW", "context": "Does it come with multiplayer or?", "response": "Yes. It includes a multiplayer section along with the single player campaing. See it for yourself on the follow youtube link: Battlefield 3 - Multiplayer Gameplay Trailer: http://youtu.be/FRqfFfuVuNE"}
{"product_id": "B00FRESQYG", "context": "is this a good one to start with? i know nothing about this game except it looks like something i can play with my son.", "response": "This game contains all to start witj one month free"}
{"product_id": "B003O6C0V4", "context": "Do the accesories that come with this game work with the first Active game?", "response": "I haven't tried it, but I doubt its backwards compatible. The resistance band is the same though."}
{"product_id": "B0053B66KE", "context": "Do they ship the correct version based on ur region? Eg PAL to NZ and Europe, Or do they only ship American NTSC version?", "response": "My friend sent me the NTSC version I guess it was because buy from Venezuela! Greetings!"}
{"product_id": "B000I10PY2", "context": "What types of games can you play on this?", "response": "GameBoy games and nintendo ds games"}
{"product_id": "B00FATRKWM", "context": "What is the difference between the Xbox 360 and the Xbox one?  Also, what does the kinnect do?   My 8 year wants one, and I have no knowledge on this!", "response": "The Xbox 360 has more games for younger children. The Kinnect allows you to actually connect with other people playing the game. You can limit it to just their friends. It also allows you to do interactive games because the Kinnect bar sees movement. I hope this helps!"}
{"product_id": "B0015PHMFU", "context": "is it micro switch (does it have that *click* felling)", "response": "yes you can feel.stick part not good working. there is a gap you feel while moving it"}
{"product_id": "B001L5TIR4", "context": "Can I download this to my ipad?", "response": "I would think so. I download to my kindle. It s a playrix game and on Amazon you can get it for your Ipad. Have fun with it. Love the game"}
{"product_id": "B00475AYUA", "context": "If we get a download code, where do we download it?  Don't want to use steam if possible?", "response": "There isnt a dl code it just downloads from amazon"}
{"product_id": "B00C710AT6", "context": "Does this game work on a Windows 7 computer?", "response": "It worked, but it was slow. Just get 2K15. A better game imo."}
{"product_id": "B00ARD5410", "context": "Which is better M60 or M65? I heard some complaints about M65 acceleration,iso I want to know which one you recommend, especially for gaming?", "response": "I've only used the m65 and I am very satisfied with it."}
{"product_id": "B005LUUWL6", "context": "Does this work for 3DS games, or is it just a ARDS that works on the 3DS?", "response": "It works great on the XL 3Ds, its a little loose on the regular 3DS.FYI: There are no cheat codes for 3DS games...YET! You can use this for  your DS games that you play on your 3Ds console."}
{"product_id": "B00DJYK9L4", "context": "What controllers are supported?", "response": "Regular wii remote is inserted in belt."}
{"product_id": "B00GZ1GUSY", "context": "It is Singal Player or Two Players", "response": "Single player with an online multiplayer component."}
{"product_id": "B005764CWO", "context": "What kind of plug does this have? I'm looking for s USB controller.", "response": "Its usb, i am using mine now to play FIFA 2014 on my laptop."}
{"product_id": "B00DC7G0GG", "context": "Do you have to use the gamepad if you are playing single player?", "response": "You don't have to!!.. you can use the wiimote as well."}
{"product_id": "B00E88G054", "context": "is this item wired or wireless?", "response": "Wired. Get the wired one the wireless one is garbage."}
{"product_id": "B00FLLFJE0", "context": "I tend to leave my items charging, does this have an tickle charge or auto shut off?", "response": "At least now I know why my controllers giggle when I put them on the charger :-P"}
{"product_id": "B003O6CB6S", "context": "does the disc version still use steam as a drm?", "response": "Yes it does use steam.I think you will see a lot of games that use steam or originmyself I'd rather not use any of those connection,  but not much you can do about it.  I'd rather have the older style. lol"}
{"product_id": "B008CP6MA2", "context": "I'm new with the PS3, do I need a PSN account to download Ghost of Sparta and Chains of Olympus?", "response": "yes you do need an account and it will be on your download library"}
{"product_id": "B00CPKUV9I", "context": "What are system requirements?", "response": "Online Prediction:Core i5-660 3.33GHzAthlon II X4 620GeForce 9800 GTXRadeon HD 5550 1024MBWin Xp 32DX 9HDD: 25 GB"}
{"product_id": "B002I090AG", "context": "Does it come with a charging cradle?", "response": "Yes it does.It also comes with a very thick booklet to explain everything, which really surprised me.It's a very nice item and my granddaughter(14) loves it."}
{"product_id": "B007VFHIHA", "context": "what is this code guys? can i or not play this game on my windows 7 desktop", "response": "Its a steam code. Which requires steam (http://store.steampowered.com) to activate, download and play the game. Yes you can I have played it on my win 7 x64 pc."}
{"product_id": "B002XLR0JI", "context": "is this a quiet mouse? it's really important that is it cause i game at night mostly and i got roommates", "response": "No, the buttons make a clicking sound"}
{"product_id": "B006JKARN0", "context": "Can two players drive at same time?", "response": "It has 2-player split screen play in Arcade mode or online multiplayer."}
{"product_id": "B0053BCO00", "context": "will this work in the 3dsxl", "response": "My son has 3ds and it works for him, so he says it would work for the 3dsxl"}
{"product_id": "B0089OBLDO", "context": "can i use this so i can use a wii u pro controller on a ps3?", "response": "Nop there is no way u can use with wiiu pro on a ps3"}
{"product_id": "B006SVUQNQ", "context": "Does it work for installing Battlefield 4?And do you know this from experience?", "response": "Yes, this hard drive will be able to hold any game install up to 250 GB. I've installed battle field 3 and it works fine."}
{"product_id": "B008XHCLFO", "context": "Can the top part be taken off? I simply want the grips not the whole protection part (though that isn't bad, but i think it's ugly)", "response": "If I understand your question correctly, yes it's is two peices one that goes over the top an one over the bottom."}
{"product_id": "B00ECOAX34", "context": "is it compatible with the wii", "response": "I do not know. My son has a Wii U. I think as a video of the latest Wii, does not work on the older version. Instead, most videos work on wii Wii U."}
{"product_id": "B006W41X1S", "context": "Can you use more than one headset at a time?", "response": "The transmitter will only connect with one headset at a time. If you're referring to using more than one headset on Xbox 360 in general -- it is possible, but each player will need their own Xbox Live account in order to communicate with others online."}
{"product_id": "B00005NIMB", "context": "Does it come with a power chord?", "response": "Thanks for the feedback."}
{"product_id": "B00DJYK8XS", "context": "Is this for the original wii or for the wiiu?", "response": "I bought it for the original wii, but you can select whatever format you want by clicking on each format above the product description."}
{"product_id": "B002P35JMO", "context": "Someone please tell me where the fat end of this thing plugs in!  PLEASE HELP!", "response": "This goes to an Xbox 360 Slim. If look on this page (http://hdfanatic.com/2010/07/08/xbox-360-250gb/) there is a picture of the back of the Slim. The fat end goes in the A/V Port. I hope this helps."}
{"product_id": "B005F1ZUU4", "context": "Does this include a disc needed to be used?", "response": "It does, but don't even bother with it. Follow the instructions from the top reviewer and you will have no problems with this device."}
{"product_id": "B00EFFVZP0", "context": "Greetings, I bought this game with you, but I want to know if it brings the Spanish language?", "response": "no. it is in English. you could try to contact EA support (easupport.com) or go to battlelog.battlefield.com forums to find out information if a language package might be included in a future patch. gg"}
{"product_id": "B00EF1OGOG", "context": "When used to charge an Android (Nexus 5, in particular), does it show up as \"Charging (AC)\" or \"Charging (USB)\" in the Battery menu?", "response": "I don't have a Nexus5 however it charges the iPhone, iPod touch, Windows phone, kindle fire, kindle fire Hd. All Without a problem and charges it fast. It shows it as AC CHARGE! Goes this he did you out!"}
{"product_id": "B00DYAQHTQ", "context": "Is this a non-stop violence game?  I find most games to have too much story and that's boring.  I like just pure violence.", "response": "A bit of both would be about right ..as far as \"pure violence\" u might want to stick to GTA V"}
{"product_id": "B00009ECGK", "context": "Do I have to pay monthly or yearly to play WOW and how much is it?", "response": "This is not WOW this is the games leading up to it. I believe you can pay monthly for WOW. You can go to steam .com are find out more. Hope this helps."}
{"product_id": "B0057S9SYY", "context": "Will these support chat via the xbox one headset adapter?", "response": "I'm not sure ..I would guess to say no. Seems these are for the X box 360"}
{"product_id": "B002I0H79C", "context": "Does this work in Colombia?", "response": "Almost all Xbox 360 games are region free. This game will work on any 360 console."}
{"product_id": "B00CX8VY4S", "context": "the game is digital download?", "response": "The game is similar to all other Xbox One games, it install from a disc on to the units hard drive.  You must have the disc in the disc drive to play the game.  The game is available directly through the xbox one store as a digital download though."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "I just bought this G9X about a month ago and have not had any problem with it. No noise at all from mouse. Works great with games (WOW and Diablo3) I run at max."}
{"product_id": "B0086UK7IQ", "context": "Are the buttons too close together for your thumb to accurately hit? It seems with 4 rows of keys it might be easy to hit multiple at the same time.", "response": "No, they are well enough apart that they are easily pushed separately but it does take time to get used to it."}
{"product_id": "B00DLDEKOK", "context": "Can this be used with the Xbox 360 wireless controller?", "response": "Yes my boyfriends uses his with his wireless controller it works perfect he loves it but you need an xbox online account to talk but the mic is awesome I recommend this mic it came early and works"}
{"product_id": "B000I10PY2", "context": "Does this feature a gba compatable link cable port?", "response": "DS Lite systems do NOT have a GBA link cable port. GBA titles can only be played in single-player only."}
{"product_id": "B000HZFCT2", "context": "I know it's compatible for Windows, but does it also work for Macbook Pros?", "response": "I don't really know, it has no required computer references that I know of, but just to make sure you should check Microsoft's site, they have a section about xbox, and then a section about the gaming receiver"}
{"product_id": "B005YR1VP2", "context": "Does the Xbox 360 250GB console come with cables? Do I need any adaptors for my old console?", "response": "You only need to HD cable or HDMI."}
{"product_id": "B004IK24MU", "context": "Can I charge the the batteries alone? (without placing the whole wiimote on the charger)", "response": "No, not on this one."}
{"product_id": "B0032MM2P4", "context": "Can I use this on Windows 8?", "response": "Sorry, I can't answer this as I have Windows 7 on my computer."}
{"product_id": "B002CZ7P04", "context": "is is appropriate for children?", "response": "My Sister said it is fine for children 8 and up..."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "Enough to create a life sized potato."}
{"product_id": "B00EPZ8POY", "context": "Hello, I want to know if if the cover looks like the one in the picture? also, does it have spanish subtitles? thanks", "response": "Yea that is the cover and it does not have spanish subtitles, only English and French"}
{"product_id": "B001GIUWX0", "context": "Can I use my Wii Classic Remote with this game?", "response": "Sorry for the lateness of this answer..yes you can use the classic remote to use this, and also the classic controller too."}
{"product_id": "B00I4C2EKA", "context": "Can I play this game on a non-gaming laptop that is just a couple years old, or will it run slowly?", "response": "I have a two year old Toshiba Satellite and in runs decent. However the huge maps go a bit slow; near the end of any game everything slows down a  bit. Rarely crashes. These issues haven't stopped me from playing."}
{"product_id": "B002I0H2G0", "context": "can it play two players", "response": "If you take turns."}
{"product_id": "B00BI83EVU", "context": "Will the single-player gameplay be significantly diminished if you don't have a reliable internet connection?", "response": "I get hacked almost every time from online contracts and my internet speed is 512kbps download /  256kps upload.  So if you internet connections slower than this, then you won't be bothered by most people trying to hack your single player experience."}
{"product_id": "B00D2EGWDA", "context": "I just bought this new, did the download on PS3 then installed it. When I go to play,only have 3 maps town/farm..where is the dlc at?thanks", "response": "Right now I'm deployed and sent this game to my nephew but I will try to get you the information as soon as I can."}
{"product_id": "B008HPAXZ2", "context": "Does this product have an a and b protective film, like the ones for mobile phones?", "response": "He means is the screen protector sandwiched between two disposable layers typically labeled A and B like on mobile phone screen protectors. They're simply for application and you peel them off in steps (sometimes labled as 1 and 2 instead). I don't know the answer, but wanted to help him."}
{"product_id": "B00BHSTXV6", "context": "How does this thing handle dust, Are there any piano glossy black parts? If so I'm not buying it because I live in an EXTREMELY dusty area", "response": "Yes it has, like 20% of the surface is glossy, and indeed get dusty."}
{"product_id": "B000OLXX86", "context": "Should i buy 3 games separately or with trilogy. People say trilogy doesn't have dlc. Does these separate games come with the DLCS on amazon?", "response": "My copy came with the dlc. I would go with the single games and not the trilogy."}
{"product_id": "B00ERDGMT4", "context": "Can we install the add on several consoles front the add-on CD? Or it will only works for one (as code will do)?", "response": "It's not serialized. You can install on as many consoles as you like."}
{"product_id": "B00CMQTVK0", "context": "can it be turned on its side like the xbox 360 can. or does it have to be kept flat like in th pictures", "response": "Its designed to be flat."}
{"product_id": "B00BBUCCKO", "context": "Do the keys stay lit continuously?  Or can they be made to?", "response": "There is a button on the top right that cycles through high, low, and off and the keyboard stays lit on high and low as long as the computer is sending power to it."}
{"product_id": "B00EFFW0HC", "context": "I have a xbox 360 4GB will that hard drive be big enough to play this game??", "response": "sorry , you need hard disk 60 gigas at less, version arcade 4 giga not support it the  game"}
{"product_id": "B000E1A4XS", "context": "whys it rated teen", "response": "No doubt because of the scare tactics. I wouldn't say it's scary, though it might be to someone who's younger than thirteen, really. Also, the backstory is a little morbid, when you go into looking through newspaper articles and whatnot in-game."}
{"product_id": "B008U5ZNIG", "context": "Does it work well?", "response": "Yes it has a very high build quality and doesn't press down too lightly."}
{"product_id": "B001KMRN0M", "context": "does this plug into ps3 console?", "response": "Hi, I don't know, because I haven't ps3 console. Sorry."}
{"product_id": "B00BXONG7G", "context": "Played BF3 all the time, and never picked up BF4.  What's the best deal to get 'everything'?  Looks like $49 + $49 - looking for a better deal", "response": "I suggest getting the game + premium. Totally worth it. Expansions are really cool, plus they sweeten the deal with some ingame stuff"}
{"product_id": "B000LQ4HTS", "context": "Does the throttle work on it's own, since I'll be using a different stick?Thanks in advance.", "response": "Are you asking \"throttle and joystick work separated?\" If this is the question, the answer is no. There is a cable to connect them. Telling you the truth, I´ve never tried to do it. I hope I've helped."}
{"product_id": "B006W41W3M", "context": "can they be used with x-box one", "response": "They are compatible with anything that has a digital audio output. I actually have mine plugged into the actual tv so I can use them for anything."}
{"product_id": "B000OLXX86", "context": "Does this game come with the DLC?", "response": "No, at least mycopy didn't come with it. You have to buy it off the XBOX Live Marketplace."}
{"product_id": "B003VUO6LU", "context": "What CECH is the console and what year it is?", "response": "its a model of the ps3 slim the best thing to call playstation support here is the # 1-800-345-7669"}
{"product_id": "B00CPKUV9I", "context": "what is steam drm ?", "response": "A web site you join to play Wolf and others.  You don't het Wolf with this buy."}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "There is only multi-player. One game mode tries to emulate a mixture of multi-player with a story campaign, but it's not very good."}
{"product_id": "B00CMQTVUA", "context": "How large is the Hard drive  for xbox standard system?", "response": "500gb of hard drive space"}
{"product_id": "B004HYIAPM", "context": "Do you have to continue buying subscriptions if you buy the CD or does buying the CD give you unlimited time to play?", "response": "You dont not have to pay a subscription if you download from amazon or buy the disc it is a pone time purchase with the option to add downloadable content which enhances gameplay or buy the legendary edition which includes all dlc"}
{"product_id": "B004IK24MU", "context": "can someone help me im trying to get them to sync", "response": "I only know how to sync it when the charger is not in it, I only know how to do it with batteries..."}
{"product_id": "B003NSLGW2", "context": "What makes these worth $90+???", "response": "I only paid $6 for these, and they break after a while."}
{"product_id": "B00J6DLPLK", "context": "is this game satanic/Demonic? and sexual?", "response": "Not so much satanic. A little demonic and very sexual"}
{"product_id": "B006RJ373K", "context": "Can I use it with Windows Vista?", "response": "Yes, I am using it on 7 though."}
{"product_id": "B007LQG9A6", "context": "is it compatable with pc games?", "response": "yes i bought it specifically for my pc"}
{"product_id": "B001L5TIR4", "context": "Can I download this to my ipad?", "response": "No. There are different versions of computer games made especially for mobile devices. This game is in the App Store."}
{"product_id": "B0006PJAZU", "context": "I have some old file from Windows 5.1 will this software open them?", "response": "I can't say for sure. I can tell you that this program has been able to open the Presentation documents (wpg) and word perfect documents (wpd) that were made by Corel suite 7 that was built for win95. I used it on win98, which was the last operating system that ver 7 would operate on."}
{"product_id": "B00I9GARIM", "context": "Does this require software, and is it compatible with Mac?", "response": "I just plugged it into my Mac, switched to the USB sound device and they work just fine [: Didn't need to install anything"}
{"product_id": "B005BLAJRC", "context": "what games are included on the cd?", "response": "I have an OLD version of this that includes a game called Star Collector.  I don't see it listed anywhere. Is it in this collection?"}
{"product_id": "B00EM5UFF4", "context": "What kind of game is this?  Is it just for kids?  I'm a 37 year-old male?", "response": "My 2 boys and I all play it.  Think of this game as a family style COD.  It is a blast."}
{"product_id": "B00CJ7IUI6", "context": "This version is pal/uk  or ntsc/usa?", "response": "every video game,dvd,pc game has a region code. the number in the corner of the game cover. us is region 1 and ntsc format. asia is 7(?) and pal format. look for the region code for your country. ask for favorite retailer for specific information."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "I didn't notice that before but no, when I bought mine, I got it in American characters."}
{"product_id": "B009GSX0A4", "context": "Does this version have English subtitles or just the limited edition", "response": "This is the Japanese version of the game you need to buy the let's get physical edition in order to get the English subtitled physical edition if you don't care to have a hard copy you could buy the regular edition on the psn store"}
{"product_id": "B00FC1UH82", "context": "Is it wireless? or you have to plug it via usb?", "response": "It plugs in via USB."}
{"product_id": "B00ATF5YZM", "context": "Do you need steam to download this game?", "response": "Yeah. The product key you received should be entered into Steam. When you open Steam, at the bottom left corner, click add game. From there it should be pretty obvious. There should be option where you redeem your product code."}
{"product_id": "B005BLAJRC", "context": "Does it work on Mac os x maverick?", "response": "The box indicates that it will work on a \"Macintosh OS X 10.4 - 10.6, G5 or intel processor, 867MHz or faster, 512 RAM, DVD-ROM drive, 32 MB VRAM\".I use \"Windows Vista\" so I am not familiar with Mac OS. I hope this answers your question."}
{"product_id": "B00D96BORK", "context": "Where can I get an extra audio cable that comes with this headset (the one with the green end)", "response": "I actually found one, ordered it from amazon, thanks anyway !!"}
{"product_id": "B002I0J5CO", "context": "How long is the cord?", "response": "12 foot cable length and 3.5 mm plug for line input. Here you go. Hope it helps"}
{"product_id": "B00E6OLJ88", "context": "will this work on gotham city impostors?", "response": "What do you want from me ؟"}
{"product_id": "B0036VO4XO", "context": "Hello, a straightforward question: I have a Win 8.1 laptop with no mic-in jack. Will the Amigo II enable me to record the audio from the mic?", "response": "Yes, the usb plug provides both audio input and output functions"}
{"product_id": "B002DUCF8A", "context": "Is there a waranty on this item? Mine has failed after 4 months and I was wondering where I can get it fixed. The CRS-HDG-IAS-VS-ALT switch is frozen", "response": "There is but I too had this issue I just pulled the knob off and sprayed some silicone lubricant in there and it frees up and started working great."}
{"product_id": "B00E1A1SP6", "context": "Will the new one come with an sd card, wall charger, stylus, etc?", "response": "Yeah. It comes with a SD Card, charger and a stylus."}
{"product_id": "B00EZKNT18", "context": "will it work for alienware", "response": "yes, it works on my m17x.and it works on every pc i own.just like an original 360 controller, but better....way betterin my opinion quality is above microsoft and that's saying a lot.i typically HATE 3rd party controllers/peripherals, but this controller ISthe exception!.! i just wish i could find a purple one for cheap."}
{"product_id": "B00F27JGVA", "context": "Will this be recognized by Playstation TV? Sony says only 32.", "response": "I don´t know, i don´t have ps tv, sorry."}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "Yes, the one I got is a super slim PS3."}
{"product_id": "B003N3HEU0", "context": "Is the language shown on the screen as well as heard?", "response": "It's shown and heard. They tell you missions and such on screen."}
{"product_id": "B004YC4NN0", "context": "What emulators does this work on?", "response": "I was able to use it on PSX, SNES, NES,  and Genesis emulators without an issue."}
{"product_id": "B00BA9AWTO", "context": "I installed on my other computer and was able to do something so that I did not have to have the disc in. Can't remember what the secret was. Anyone?", "response": "it's been so long I forget. and don;t have the item installed anymore. sorry I couldn't be of more help."}
{"product_id": "B00FB4BXGA", "context": "The picture shows a bunch German characters and different than usual letter arrangement, is it like that on US ordered keyboards? or is it just normal", "response": "Keyboard layout is normal u.s. standard qwerty"}
{"product_id": "B002I0K3CK", "context": "Why is this game $67.99?? This game is 2.5 years old and all new games are based at $60....", "response": "It's most likely because Nintendo is no longer having new copies of this game printed. Once a game goes out of print, it's value as a new, sealed copy tends to increase."}
{"product_id": "B005Q1YA5O", "context": "Is this the one that includes the base game sims 3 and sims 3 pets? I saw a cover just like this but this doesn't say it includes both", "response": "No, this is just the expansion pack. You could try looking for a bundle that includes both games. :)"}
{"product_id": "B000PT18OS", "context": "is this for the 110V or 220V ?", "response": "it is for a 110 ac outlet, but don't bother buying this one."}
{"product_id": "B006W41X1S", "context": "Does it work with Xbox One?", "response": "This is from TB website:*Please note that you will need to connect this headset to the stereo outputs from your TV or audio receiver for game audio and use the Kinect® for game chat with Xbox One.So if u dont have kinect then these wont work to chat."}
{"product_id": "B00I4C2EKA", "context": "It says it uses steam for DRM so I cannot play this on the MAC? even though I have steam on my mac?", "response": "You can play it on a Mac. I just bought this from amazon (50% less than from steam direct), added the code to steam, and the game downloaded immediately."}
{"product_id": "B00F27JGVA", "context": "Does this card works correctly with USA's PS Vita systems?", "response": "I didn't get to buy that one cause I thought it was over kill. But it should with. The Japanese unit works with American hardware. So should this. Hope that answer is satisfactory."}
{"product_id": "B0057WDBHA", "context": "How many buttons does this Stick have? To be more precise does this Stick have buttons for PPP and KKK?", "response": "I don't know, can you tell me what color the sky is? I can't see it in my peripheral view."}
{"product_id": "B004NRN5EO", "context": "Someone would tell me if this game is in Spanish or with subtitles in Spanish thanks?", "response": "It's in British English for all versions. I think you can get the Spanish localization which will have Spanish subtitles. I am not positive though, sorry."}
{"product_id": "B00DB9JYFY", "context": "Does this game offer two-person co-op?", "response": "No, but you can play with your friends in a party on Live."}
{"product_id": "B007TYC8MI", "context": "can you play on multiplayer offline? like with my brother and a 2nd controller? or only online multiplay", "response": "All the God of war games is for 1 player"}
{"product_id": "B007MJSZDQ", "context": "Received item.  One of the two batteries will NOT charge.  Would like to replace it.  How do I go about using the warranty? No paperwork was included.", "response": "Battery don't hold charge"}
{"product_id": "B008RA5AWS", "context": "Once i purchase the Quickbooks Pro 2013 with Enhanced Payroll, will i still need to purchase a year subscription ??", "response": "Brenda is correct, it includes a one year subscription for up to 3 employees."}
{"product_id": "B000087H7T", "context": "Does it come with any type of warranty\"\"..", "response": "Amazon requires all sellers to offer at least a 30 day return policy on the items they sell. Certain sellers offer a better warranty on items, as do we. Specifically check out each seller, the better their feedback the more likely they sel quality products with quality service!"}
{"product_id": "B003G6ISRC", "context": "Does this work on Windows 7?", "response": "I don't know why it shouldn't.  It was a gift for my grandson and I haven't heard about any problems with it so far.  Hope that helps.."}
{"product_id": "B0006PJAZU", "context": "Is it compatible with windows 8.1?", "response": "I'm not sure as it does not work with my Windows 7"}
{"product_id": "B005FMLZQQ", "context": "does it works on DVR?", "response": "Plus why do you have to use a DVD player the 360 plays DVD s I unhooked mine."}
{"product_id": "B0095D1CM8", "context": "Does it has all its accesories?", "response": "it comes with 3 different palm pads, 3 pinky rests/pads, 6 weights, and the allen-key to change it all out."}
{"product_id": "B00DB9JYFY", "context": "Does this have singleplayer?", "response": "There is no single player in Titanfall.  There is a campaign though.  It is a mixture of different  multi-player matches centered around a developing story.  There is a theoretical ending and from there the choice of  type of match you play is up to you."}
{"product_id": "B00ATF5YZM", "context": "Can you play multiplayer or is there no players online?", "response": "Yes, there are a lot of servers still up. Just check you're running the latest patch (1.7). This is most likely why you're not seeing any servers."}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "the wireless controllers will not work with the usb charger connection, as that connection is not meant to play games, only to charge."}
{"product_id": "B00BMFIXT2", "context": "What languages are available with this game?  Is there French or Spanish audio (audio, NOT subtitles) available? Thanks!", "response": "yes spanish for sure I have not tried french."}
{"product_id": "B00D78Q4UM", "context": "I am hoping to map additional language keys to the G-keys, is this possible? (i.e. I need some additional keys to type in German, like ä, etc.)", "response": "I would think so. I use mine for mapping keystrokes as a sizzle button and works great. As long as you can input the characters its should work fine. :D"}
{"product_id": "B002B9FIUU", "context": "I have a Win 7 notebook, will this adapter work on my computer?", "response": "As long as you have a USB port open for it to use, it will work."}
{"product_id": "B0040UAYI4", "context": "I have a corsair k70 rgb and razer deathadder chroma, will it work with this? I heard some peripherals do not work.", "response": "that is true , some mice do not work. there is a help page on the penguine webpage that might help. other than that i do not knot know if your mouse will work."}
{"product_id": "B00D5WDI3G", "context": "Will this version run on windows 8?", "response": "Yes, I have it running on both 8.0 and 8.1 and it runs fine!"}
{"product_id": "B00FQPQO4A", "context": "How big is the real download? I assume I'm downloading an installer, then the real deal. Also, do I need Steam?", "response": "I forget the size,  but not to bad.  No steam needed"}
{"product_id": "B00FM5IY0Q", "context": "Does this game have multiplayer mode?", "response": "It's purely co-op, Carole."}
{"product_id": "B007VFHIHA", "context": "I have a desktop windows 7 thats been upgraded from XP will this game work on it?", "response": "As long as you meet the hard ware requirements then yes."}
{"product_id": "B000GCJ6MK", "context": "Does this game comes as a CD or DVD ? Are there any  other  appliances  that must be used i.e  joystick?", "response": "my copy was a cd and would not work with windows 7, it helps if you use some kind of joystick as you can get behind the helicopter using a keyboard, hope that helps"}
{"product_id": "B002I0IIPY", "context": "What controllers the sonic colors use", "response": "Wii remote and nunchuk or just the remote.  Mostly one player, some two-player mini-games."}
{"product_id": "B00E0H5J8M", "context": "Does the mouse make noise when clicking or is it silent?", "response": "It makes a clicking sound, however it is not too loud"}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "You don't. Just plug it into any device that has headphone plug in. You can also use it when playing PS3 or XBox as long as you use the USB cable that comes with it."}
{"product_id": "B00GO4PTR0", "context": "These memberships works for just one account? Or multiple accounts in the same console? Thanks", "response": "Think it works with multiple accounts as long as it's the same system...hope this helps."}
{"product_id": "B0091WIOJ2", "context": "Do i need a 7.1 Surround sound card for these to be fully functional.", "response": "On the pc no, the wireless hub is connected via usb and Windows recognizes it as a surround sound device."}
