{"product_id": "B00ENFVJJO", "context": "Will this work in the US? Also does this have a trickle charge or auto shutoff?", "response": "Yes it works in the US, and yes, it will charge your controllers until they are full, then it stops.  I own this item, it works great!"}
{"product_id": "B000CBWQUY", "context": "wifi can you talk on your ds all around the world", "response": "only on Metroid prime: hunters so far. And only with your friends."}
{"product_id": "B003JVF728", "context": "Does this game work on a Windows 7 laptop?", "response": "I think so when i had my windows 7 laptop the game was unplayable, but i think the problem was that my graphics wasn't good enough.  It just jumped from frame to frame. Have a new computer , windows 8, and it now works flawlessly"}
{"product_id": "B0040UAYI4", "context": "Can i use this and play MW3 on the ps3 with the Eagle Eye?", "response": "I'll tell the truth the system is nice but for me being a PC gamer it was a waste of time it was to jumpy for me I did better with out the eagle eye..."}
{"product_id": "B009AP23NI", "context": "Does this take AA batteries?", "response": "No this has battery built in.  All you need to do charge is plug it up to wall or usb on the wii u."}
{"product_id": "B000B6MLTG", "context": "So will this connect an Xbox 360 to an older, non digital tv -picture and sound??", "response": "no sound just video and need to have vga connection !"}
{"product_id": "B0079V29EI", "context": "Do these still fail to hold the additional power after a month of use?", "response": "I have not had any problem but not used enough yet to tell"}
{"product_id": "B007Y7OP8K", "context": "is this game in english?", "response": "The speaking language is not English but the subtitles are in English."}
{"product_id": "B0088MVODO", "context": "is this game region locked? if so to which region?", "response": "Yes, I could never download codes. Central America"}
{"product_id": "B006W41X36", "context": "Is this the right decoder needed from a Samsung 4k to a Sound Bar that does not have an internal decoder in order to get all sounds from PS4 & DVR?", "response": "The sound bar is is a tricky one considering that it only works with stereo compatibility. Surround sound would not be very effective but will certainly allow for a Dolby decoded sound from the optical output of your PS4 or DVR."}
{"product_id": "B000VBFWAG", "context": "Can it work on windows 7?", "response": "hi it didn't work on my computer waste of money and a very upset child ...don't bother"}
{"product_id": "B001AH8YSW", "context": "Hi, is this the larger boxed dvd version with mutiple disks, a printed manual, game guide and a map?", "response": "Yes. But be sure your computer has the proper Windows. It will not operate on my windows 7."}
{"product_id": "B000TT2D2A", "context": "Is this a wireless drum set?", "response": "No.   It has a usb cable that plugs into Xbox."}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "Yes it should. The box said on XP sp3 or higher"}
{"product_id": "B00AAS88K6", "context": "If I swapped the batteries with Rechargeable Eneloops, would this be able to charge them over the wire like the Logitech MX Performance mouse can?", "response": "I'm not sure as I haven't tried it yet, but I doubt it would recharge themFor an accurate answer you'd better contact razerzone.com support"}
{"product_id": "B00E1DMWBM", "context": "Can you Get sega CD games on this Device or only the 16bit ? and how hard is it to down load games ?", "response": "This was a gift but I think the games were built into system"}
{"product_id": "B005OSFUZI", "context": "Can I use my analog pedals to record and to play the game in my PC?", "response": "No, you can't. But you won't be needed it as the game provides you with every effects you need for the songs. Also, you can customize every aspect yourself in the game."}
{"product_id": "B00FZ12F34", "context": "Will these work on a Wii U console?", "response": "The figures work on all consoles."}
{"product_id": "B00JM3R6M6", "context": "Is this game appropriate for an 11yr old girl?", "response": "Yes it is. As the rating suggests, it says E for everyone :)"}
{"product_id": "B00G6YJ60E", "context": "Is Whistleblower included in this or do you have to buy that seperately?", "response": "Whistleblower is seperate. . .and TOTALLY worth it."}
{"product_id": "B00DC9T2J6", "context": "My son really wants this game but M rating isn't going to fly with Mom. Is there a way to turn off blood / gore for PC version?", "response": "Unfortunately to my knowledge there is no option to turn off blood and gore, however the worst thing that will be witnessed is a 2 second scene that occurs when a Titan crushes a pilot. All you see during this move is a misty red cloud. Aside from that the game is actually pretty clean."}
{"product_id": "B007MJSZDQ", "context": "Did you find that these are compatible with your controller or does the controller light just flash when  you insert them?", "response": "The one battery pack that worked for a short time worked fine."}
{"product_id": "B0050SVHZO", "context": "exactly what comes with the console?", "response": "It comes with the HDMI cable, sensor bar, battery charger for the WIIU PAD, the WIIU PAD, the console and that´s it, no game."}
{"product_id": "B00FENJVOE", "context": "Whats the content in the box? Only the DVD? Have some manual or something else?", "response": "The DVD with an installation guide. Some 1 month trials for various games including D3 and a super awesome Diablo 3 note pad. So really, the note pad."}
{"product_id": "B0081Q58AW", "context": "Is this the physical version or the cd-key version? I would like to purchase the box version if possible.", "response": "The item that I have for sale is the actual boxed version, I cannot answer for any other seller's items."}
{"product_id": "B0079V29EI", "context": "Will this work with PS Vita slim?", "response": "Unfortunately it will not. There is a model that will work specifically for the Slim version and it recently came out in the market. Its from the same company too"}
{"product_id": "B0002DKTY2", "context": "will this work with windows 7?", "response": "Yes.  It works with windows 7.  I have loaded the program on a Dell I purchased in 2010, and the software runs flawlessly."}
{"product_id": "B002DUCF8A", "context": "Can this panel work with X-Plane 10?", "response": "I'm not sure I don't run X-Plane 10"}
{"product_id": "B00EHBKUTE", "context": "For those of you that have bigger hands, does this \"fit\" well? I have bigger hands and its hard to find peripherals that \"fit\" comfortably.", "response": "Well you can adjust the pad, so I would say yes but I don't have really big hands."}
{"product_id": "B001H4NMNA", "context": "Do you have to plug this into the PS3 or can you use a wall outlet to charge the remotes with this?", "response": "It has an AC adapter and doesn't require the console to charge the controls."}
{"product_id": "B001UWGDPS", "context": "will this run on win 7 32 bit", "response": "It ran fine on my old computer: 2005 Dell XPS, Windows 7 32-bit, 3.2Ghz single-core Intel processor, 4GB RAM, and GeForce GTX 560 graphics processor"}
{"product_id": "B004N7IIQ4", "context": "is the mix amp compatible with xbox one", "response": "Yes it is, but you have to buy the xbox adapter for the xbox one controller."}
{"product_id": "B003O6EE4U", "context": "Is it possible to watch DvD's with the Xbox 360?", "response": "sure it is possible!"}
{"product_id": "B00EI4V3X2", "context": "Is this headset surround sound for both PS3 and PS4? I would like a headset that has equal surround sound for both systems?", "response": "Yes, the PX4 headset is compatible for surround-sound game audio on both platforms."}
{"product_id": "B0061PAZUS", "context": "Is the game in Spanish?", "response": "No, but there are a lot of songs in Spanish on this game."}
{"product_id": "B002TLTBN0", "context": "The original 'Classic' controller can't be used with Super Mario Brothers for the Wii. Will this controller work with Super Mario Brothers Wii?", "response": "No I tried it"}
{"product_id": "B00GZ1GUSY", "context": "I did not receive a game booklet inside the case. Was it left out or did the game not come with it?", "response": "Same here no booklet, just the registration code/card"}
{"product_id": "B00CMQTVUA", "context": "Does the Xbox one include any Kinect based game like the Xbox 360 with Kinect did (I believe it had Kinect Adventures)?", "response": "No it does not...but you can get the titanfall bundle or the forza 5 bundle."}
{"product_id": "B00J6DLPLK", "context": "For a big fan of Nier, who deeply love the narrative and characters. Would you recommend this game? (Really don't mind the gameplay)", "response": "I wish I could answer that, but hadn't played Nier... This is my first game from this developer."}
{"product_id": "B0050SX7BQ", "context": "I just received this game today and found out there is no game manual. Am I the only one who is missing it?", "response": "No game manual for me too... But not a big deal for me because we can found it in internet..."}
{"product_id": "B0050SYILE", "context": "Is this two discs?", "response": "Yes, there are two discs.  Disc 1 is the installation disc.  Disc 2 is the \"play\" disc, meaning you have to have it in the X-Box while you are playing the game."}
{"product_id": "B00EM5UFF4", "context": "Is this game 4 player split-screen or 2?", "response": "2 split screen. Haven't tried it personally because I have one controller."}
{"product_id": "B004SJFJUA", "context": "Does this work with the 3DS XL or just the 3DS?", "response": "Just the 3DS, not the 3DSXL."}
{"product_id": "B002ST7AEU", "context": "Will this work with the energizer charging station?", "response": "Sorry I'm not sure. I bought the charging dock that came with the batteries."}
{"product_id": "B008M4BNQG", "context": "does this head set also work with a PC", "response": "Have seen review on utube that says you can use it apparently very informative to watch explains which turtle beach headset is best for your gaming needs hope that helps"}
{"product_id": "B00DC7O3K6", "context": "Does this game require the Wii Plus remote or can it be played without it?", "response": "Yes it requires a wii plus remote, without it you can't play some events of the games."}
{"product_id": "B00B5QLS4A", "context": "can you turn led off", "response": "Yes the software lets you turn off the leds"}
{"product_id": "B00CJD4HD2", "context": "Would this be a good mouse for playing League of Legends?  Looking to purchase it as a gift.", "response": "This is an awesome mouse for any game!"}
{"product_id": "B00BCEK2LA", "context": "I currently have the MX 518. Anyone have a comparison in both use and size?  I have smaller hands and have a heck of time finding a gaming mouse.", "response": "I have the MX 518, and just bought this one for another computer. They are pretty much the same, but the G400s seems to be taller. This is an issue for my daughter, but not so much for the men in the family. I haven't tried the G400s yet, so I don't know if it would work for me."}
{"product_id": "B009DL2TBA", "context": "Sorry you put only \"500GB PS3 System\" this is the super slim Playstation?", "response": "This Playstation has the sliding top disc tray instead of a disc slot."}
{"product_id": "B00IAVDQCK", "context": "Would I be able to hear regular tv with these headphones? Does it only work for games or can I also listen to apps like Netflix and Youtube etc.?", "response": "It's not just for gaming. I use it on my laptop when listening music or watching videos."}
{"product_id": "B009GZX49Y", "context": "I own the Ezio trilogy and have downloaded the 2 online games. If I sell the disk, will the new player be able to download those 2 games?", "response": "the disc has the games inside it just makes you isntall not download but box comes with a code for UPLAY and you need that code to play the multiplayer part of the game,unless you dont care for multiplayer then youre good."}
{"product_id": "B00A1AQJAO", "context": "Does this also work for the Dsi XL", "response": "Look in the upper left of the package.  It does not list the DSi XL.  Check out the red version, it lists it.  I have just been comparing the packaging since I want to purchase one and noticed this difference."}
{"product_id": "B00BGAA29M", "context": "Good day, the game has the Spanish language.", "response": "Yes, the game itself is in Spanish and has subtitlesSí, el juego sí está en español y también tiene subtítulos"}
{"product_id": "B00HEX8TA4", "context": "Has anyone tried this mouse with LoL? If so, how effective is it? LoL is the reason I just purchased this as well as a Razer Tartarus Keypad. Thanks!", "response": "This mouse is great for gaming. The 2 thumb buttons can easily be mapped to game functions. (I haven't tried it with LoL, but I used to be a big LoL player.) The mouse looks pretty cool too :)"}
{"product_id": "B0053BCO00", "context": "Does this game work on a 3DS XL?", "response": "I have a XL and it works great, and since the screen is bigger you can see it better."}
{"product_id": "B007VTVRFA", "context": "So I should buy Cities: Skylines instead?", "response": "Yes.  Skylines is half the price, none of the grief and a drastically superior city simulation in every way.  Oh, and your cities will be bigger.  Much, much bigger."}
{"product_id": "B0029M6VKA", "context": "Can you set an \"escape\" hot key that would disable the TrackIr input while it's held down, for use with fine aiming or menus?", "response": "Yes. I think it's default to f6. When you hit button the view freezes wherever you are looking"}
{"product_id": "B0000512IE", "context": "How far are the pedals apart? i.e. the spacing distance.", "response": "4\" I'm using this pair for 737ng flight simulator project"}
{"product_id": "B000J18SR2", "context": "Can you play 2 player (LAN) with 1 DVD or does each player need a DVD?", "response": "You can install the game on an unlimited number of computers and LAN with buddies without needing the disc in any of the computers!"}
{"product_id": "B008KH7NZA", "context": "Stream quality? Is the mic sound quality good enough to stream with? Im considering these or blue yeti/snowball but id prefer no stand on my desk", "response": "Like I said it is sensitive so background noise might be a problem but other than that the quality for streaming is excellent."}
{"product_id": "B004SJFJUA", "context": "Does it come with back piece and charge base?", "response": "Yes comes with a piece to attatch to your Nintendo unit. Use your old charging cord."}
{"product_id": "B00BM7NXMW", "context": "do the colors cycle through -or fade into each diff color automaticly with a setting", "response": "Unfortunately they don't cycle through colors through software settings.You have the option of choosing only 1 set color that will fade in and out.For some reason the orange fades into a blood red color before blacking out which is just a cool unintentional effect."}
{"product_id": "B00G21VQ2M", "context": "does it have english subtitle? can i play online if im in the US", "response": "no english subtitle...you can online if your US console able to connect to Japan Server.if you have experience play Japan domestic before, you should know how to do it, it will work.If you never play japan domestic game or you don't have friend know how to do this, I suggest you don't do online to avoid any disappointment"}
{"product_id": "B00D6PTMB4", "context": "Does it come with the guitar?", "response": "The actual game will only come with an air guitar, this guitar will only exist in your imagination and does not plug into any systems but your mind (advantage is calibration is not required and neither is tuning). For a physical guitar you can either buy the guitar and video game bundle or purchase the game and guitar separately."}
{"product_id": "B0079V29EI", "context": "What do you recomend to me to use the portable charger of ps vita or this grip? I play ps vita at home most of the time.", "response": "I use both and alternate to save wear and tear on the recharging process on each."}
{"product_id": "B002DUCF8A", "context": "Is the flap control a 3-way rotating lever, or an up/middle/down switch? I currently use one of the levers from a throttle quadrant as a flap control.", "response": "Its a toggle switch up an down only  and not similar to actual flight flap system. I still prefer using m joystick lever for flaps"}
{"product_id": "B00CBQO930", "context": "Is this mouse good for League of Legends?", "response": "Oh yeah, thats mostly what I use it for. it works amazing, you can tune the dpi to the speed you want and it fits comfortably.  im noticing however that it'll freeze for a second and start to go slow for a second, but I'm not sure if its the mouse or something else"}
{"product_id": "B00EEMLPR2", "context": "im new to gaming and found this for 73.99 is it worth it?", "response": "Yes I recommend it, camera works great, you also get the online multiplayer season pass for the new DLC maps"}
{"product_id": "B00ENFVS5Y", "context": "Is there a version of this wheel to avoid?  I heard some of the earlier batches had problems.", "response": "I just bought mine 2 weeks ago - no problems, just upgrade firmware first thing."}
{"product_id": "B0065NP6NC", "context": "Is this version more, or less buggy then the regular edition? Less crash/freeze prone?", "response": "far less,buggy than the original release version, also if you're getting the pc version you can download addition after market patches & mods to improve the playability even further at nexus mods.com ...... have fun ... great game !!!"}
{"product_id": "B000GCJ6MK", "context": "Will this work on Windows 7?", "response": "It works fine on Windows 8.1 - Awesome program - wish it were available when I was taking flight training."}
{"product_id": "B0079V29EI", "context": "I have the PS Vita Model 1001 that was part of the Assassins Creed Liberation bundle. Will this work with that model?", "response": "I have the assassin's Creed liberation bundle and it fits.  Just read the reviews about the charger and be wary that feature should not be your deciding factor in purchasing this device."}
{"product_id": "B002I0GF72", "context": "Is this the same game as Majaras Mask with better graphics or something. Its hard to tell looking online everywhere", "response": "It's a totally different game all that shares a similar link is that it stars at other has no resemblance"}
{"product_id": "B0051UMYLW", "context": "Does this collection run on Windows 8?", "response": "Not sure about all the versions, but you can always install multiple virtual operation system under Win 8 for old games.They run on my Win 7 for sure."}
{"product_id": "B0098F1Y3K", "context": "Will this work with a plain old ds player?", "response": "No. You will need a 3DS to play this game."}
{"product_id": "B006LVZEN0", "context": "Is it good for Large and Wide hands?", "response": "It is but the software quality is not up to the same bar the hardware is. Mine stopped tracking consistently after about a year. You can get the same life from a 20 dollar gigabyte mouse and they have models that will fit large hands."}
{"product_id": "B00DE2W5XG", "context": "If this is a launch day bundle, is the ps4 a first day ps4 which has problems?", "response": "actually I received this but no and it did have the blue ring of death but Amazon work with me and resent me a new unit ASAP with no other complaints I love my ps4"}
{"product_id": "B009UCGVZC", "context": "does ur set contain the cards?", "response": "Yes. It came with the figurines, a mini manual, and 3 legendary cards. It's perfectly packaged new"}
{"product_id": "B000P46NMA", "context": "what is the order of the assassin's creed games.", "response": "The order according to the timeline is:Assassin's CreedAssassin's Creed IIAssassin's Creed BrotherhoodAssassin's Creed RevelationsAssassin's Creed IV Black FlagAssassin's Creed Freedom's Cry (DLC for black flag)Assassin's Creed RogueAssassin's Creed IIIAssassin's Creed LiberationAnd there is a second DLC with Aveline on Black Flag and that comes last.So there you go.. hope this helps"}
{"product_id": "B00BCEK2LA", "context": "Hi, is this mouse blue or grey?   Thanks.", "response": "both.. its like grey with blue accents"}
{"product_id": "B00CERXJNW", "context": "Hey, I'm a programmer and the one thong that really matters to me is: Can you adjust the G-Keys to type text? It would be very cool!", "response": "You can adjust the \"G\" keys to do pretty much anything. Just download the software for the keyboard at Corsairs site. From there you can adjust each \"G\" key to do anything as in adding text to using macros, pretty much anything."}
{"product_id": "B00FZ12F34", "context": "this Exclusive Amazon DISNEY INFINITY Infinite Bundle, with Sorcerer's Apprentice Mickey Figure is for PS3?", "response": "i bought it and my son has a ds.  you may have to check the fine print, b/c it may be used for all."}
{"product_id": "B000IZAQD8", "context": "Does this connect to witrless internet by a router", "response": "It does not. It has limited access to the Internet in general."}
{"product_id": "B003O3EFY2", "context": "How good is the wireless connection?", "response": "the wireless controlers aint that good"}
{"product_id": "B0079V29EI", "context": "is it possible to change the battery of the nyko?", "response": "No I don't believe so"}
{"product_id": "B00IYWV852", "context": "How do you get theThree Guest Passes with seven days of play time that come with this edition?", "response": "You should receive them in an email from NCsoft."}
{"product_id": "B004QRKWLA", "context": "Does this controller work for Minecraft. Kids love it on the 360 but have dificulty with the keyboard on the computer", "response": "sort of there are programs you can download to set what the buttons do"}
{"product_id": "B005S0KH7I", "context": "How long is the wire?", "response": "It's 68 inches, or 5.7 feet."}
{"product_id": "B001CC8UBG", "context": "Works on windows 7?", "response": "It should. the drivers in the game and in windows 7 should be compatible. Try installing and running this program and if it fails it will tell you exactly why. http://www.systemrequirementslab.com/cyri"}
{"product_id": "B00EPZ8POY", "context": "will this work on ntsc ps3", "response": "All PS3 games are region free which is good to know for any possible future purchases. Just remember that DLC is not region free and cannot be mixed between different versions."}
{"product_id": "B00DWXUYN0", "context": "I have a 3ds with a small case on it. Would it fit well inside of this carrying case?", "response": "This is meant for 3DS XL models, if you don't have that model don't get this."}
{"product_id": "B00I5LMSBK", "context": "my copy of the game did not come with a playing manual, is this normal ?", "response": "Yes, unfortunately a lot of modern games nowadays are trying to push to digital downloads because it is cheaper, that is why there is such a limited copy of ASB, and also why the game has the safety information printed on the cover."}
{"product_id": "B00D96BMV8", "context": "Does this headset come with the Xbox One Stereo Headset Adapter?", "response": "Yes it does. It has just a standard 3.5mm jack that plugs into the adapter which plugs into your Xbox One controller. This way you can use you XO Four headset with a phone or tablet if you desire. I hope this helps!"}
{"product_id": "B003Q9RGRW", "context": "Does this come in the original box as shown in the picture??", "response": "Yes, where the chatpad and headset are is see-through plastic and the rest of it is the original box."}
{"product_id": "B0090WBXSM", "context": "Does this work with the Fire Stick?", "response": "We just got this today and we got it to pair to the fire stick. However, we had the same problem it the directional arrows and toggle switches worked, but you could not select anything. I would really suggest if you have a fire stick, to avoid this item."}
{"product_id": "B0096DMDXY", "context": "Is this compatible with iMacs", "response": "iMacs, I don't know, but it is compatible with Mac computers."}
{"product_id": "B0086UK7I6", "context": "Does it have any clicking issues that happen to it?", "response": "Sometimes I get excited playing games and click the wrong buttons.  Aside from that it doesn't have any issues, unless you consider being awesome an issue.  Just buy it, you know you want it!  Besides you deserve to treat yourself with all the hard work that you do."}
{"product_id": "B00FLLFJE0", "context": "What's better? This, the standard Microsoft Play & Charge Kit, or the Nyko Power Kit plus?", "response": "Standard Play and Charge Kit. I have both now and it charges more reliably and faster. Also the batteries seem to last much longer."}
{"product_id": "B0086V5V8G", "context": "Is this gameplay style similar to Deus Ex: Human Revolution?", "response": "Not really no, deus ex is a first person role playing game while splinter cell blacklist is an action adventure stealth game. But there are first person shooter type elements in the game with a certain character that you play with in certain missions."}
{"product_id": "B00FVQCFGA", "context": "I need a hard drive for bf4 will this work just fine even if its not a microsoft hdd?", "response": "yes this will work fine"}
{"product_id": "B009D3HSTG", "context": "Does this have a \"rumble pak\" built into it?", "response": "No. And it doesn't support it, either."}
{"product_id": "B005J2LW6A", "context": "What modes does this game have?", "response": "Arcade, online, and Mission mode. Theres a lot to keep you occupied. But I would choose Full Boost over this version just because there are more characters and the system is better."}
{"product_id": "B0050SX9I2", "context": "Does this work with services such as Netflix, Hulu and WWE Network?", "response": "I use it as a remote to use the blu-ray, and any other app. Hulu+, Netflix and Crackle."}
{"product_id": "B00DC9T2J6", "context": "Wondering how you play this game on a desktop PC?  Do you use a wireless controller or a keyboard and mouse?  Which controller setup is best?", "response": "The best setup is with a keyboard and mouse. Mice give much greater accuracy when compared to controllers. Although you can play with a controller you might be at a disadvantage though."}
{"product_id": "B004QRKWLA", "context": "How much Dorito dust will this hold until it is non-functional?", "response": "The more Dorito dust you cake onto this thing, especially around the analog sticks, the better you will become at Call of Duty. Also you should rinse it off with room temperature, flat Mountain Dew, but only the Gamer Fuel variety."}
{"product_id": "B000FRU1UM", "context": "is gta4 appriote for ten year olds", "response": "Yes and no, if the kid is mature sure"}
{"product_id": "B00FBV6V56", "context": "The inline cable has broken for the headset I ordered in July (2.5 months ago).  Is it still covered by the one year limited warranty?", "response": "As previous person stated, it should be covered by the 1 year warranty,contact Astro and they will help you."}
{"product_id": "B00BTOAFXS", "context": "in the halo games you cant charge your weapon. Do you know how to fix it?", "response": "There isn't much you can do if you want to keep the trigger stop in, but an alternative could be to take the trigger stop out of that trigger only, which would still allow you to use it on the other trigger."}
{"product_id": "B001IYR53W", "context": "Will it run on windows 8?", "response": "I have 7 and it runs ok. Don't know about 8"}
{"product_id": "B00D6PTMHI", "context": "Does it work on a macbook air?", "response": "I own a Macbook Air and installed it with my USB connected disc drive from Amazon without any issues. It runs fine on there, but I would recommend keeping the charger plugged in all the time as it drains the battery quickly."}
{"product_id": "B00DGZDFO4", "context": "Can you gift the PC download version? If so how?", "response": "I think you can. amazon gives you a download code, so you can just copy and paste that in a e-mail to the gift reciever or some sort without redeeming it yourself."}
{"product_id": "B009SJR28W", "context": "Does it still light up without the use of the synapse software?", "response": "She lit up as soon as I plugged her in!"}
{"product_id": "B009AFLXQQ", "context": "Will this game work with Wii games such as Super Smash Bros. Brawl on the Wii U?", "response": "No, for that, you need a Classic Controller or Classic Controller Pro. Or better yet, a Gamecube Controller Adapter for Wii Remote."}
{"product_id": "B008O510Y8", "context": "This or the PC 360?  I want a noise blocking headphone, also a good microphone and these two seem vaguely familiar.", "response": "It's for PC and I would highly recommend it."}
{"product_id": "B000ZKA0J6", "context": "Is this a physical copy or a digital copy? Does it matter?", "response": "Physical, but you still have to set up a Blizzard online account to play it. However, it makes a good flying projectile to ward off the zerg... Maybe the line between reality and fantasy is beginning to blur in my old age..."}
{"product_id": "B00CERXJNW", "context": "This keyboard looks as if it sits in a try.  Can it be removed from this tray, sacrificing the media keys above the function keys?", "response": "The wrist/palm rest is detachable, but the keyboard itself is a solid piece."}
{"product_id": "B00DC9T2J6", "context": "Will the game work on a PC with Windows 8?", "response": "Should not have any problems. I run it on 8.1"}
{"product_id": "B00FATRKWM", "context": "Dear Sir/Ma'am, Do you know if I can connect external Hard drive is there UBS connection? Because 4GB v low.", "response": "Yes there is a USB connection."}
{"product_id": "B00FWWY1V0", "context": "do they stick without the regular cover", "response": "Yep they stock good"}
{"product_id": "B00GS6A6V8", "context": "the game is included in this bundle or just the dlc's?", "response": "Just the dlc not the base game"}
{"product_id": "B004SJFJUA", "context": "Does it come with just the base or the Base+Battery? , Battery by itself  is 20$ here Nyko Power Pak+ for 3DS", "response": "Battery + Base. I didn't care about getting the base but I purchased this one because it was cheaper than buying the battery alone."}
{"product_id": "B00DC7G2W8", "context": "Does this game will come with a game code for one of four other games (New Super Mario Bros. U, The Wind Waker HD, Pikmin 3)? I read that elsewhere", "response": "Yes, you must register Mario Kart 8 between 5/30/14 (12:00a.m. ET) and 7/31/14 (11:59 p.m. PT) using the code included with the game on Club Nintendo and you'll receive a free download code for the digital version of one of four free games."}
{"product_id": "B00BBUCCKO", "context": "How long is the cord?", "response": "It's about 3 feet"}
{"product_id": "B00FEOR4MY", "context": "Will the 2DS in a neoprene cover fit inside this case?", "response": "I would imagine, as this case just kind of holds it and isn't a tight fit, there's a little extra room."}
{"product_id": "B00DGZDFO4", "context": "Can you gift the PC download version? If so how?", "response": "Yes, just download the key generator program, copy the Steam key code for the game, and e-mail it to the recipient of your gift."}
{"product_id": "B008GEH8LQ", "context": "What firmware version does this red/black model ship with?", "response": "Mine came with a firmware of 6.2 and I received it on January 10, 2015"}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "taiwan si viene con su cargador,su lapiz stylus y su manual"}
{"product_id": "B0000A2TPE", "context": "If say my laptop eventually died, and I wanted to play this game on a different computer....is it possible for the game to be downloaded/played again?", "response": "yes, i have it installed on 2 other computers besides the one i use."}
{"product_id": "B009S4JZKK", "context": "does this program work on windows 8 .1", "response": "No idea...purchased while using dial up...still waiting for Frontier  hi speed service."}
{"product_id": "B003O6EDSM", "context": "So it comes with all the Mass Effect Games? Right ?", "response": "Not only does it come with all three of the games, it comes with all of the DLC packs.  I was surprised at this as the xBox version does not include the DLCs but the game was originally designed for that platform."}
{"product_id": "B0050SVHZO", "context": "Can the 8 GB version of the Wii U handle playing all games and the new Marvel Super Heroes?  Why would you need more than 8 GB?", "response": "I would definitely buy the 32GB, if you buy the 8GB, you'll regret buying it.Don't be afraid to buy the deluxe 32GB model."}
{"product_id": "B00E1A1SP6", "context": "Will the new one come with an sd card, wall charger, stylus, etc?", "response": "does this, or does it not come with a charger, sd card, and stylus?"}
{"product_id": "B002RRLQIO", "context": "Does the keyboard come in the original box sealed, with everything in it like the software?", "response": "It depends if you get it used or new. Most of the time when you get it used, it could come repackaged and the installation CD is no where to be found. Thankfully you can easily download the Logitech Gaming Software from their website."}
{"product_id": "B006JKARN0", "context": "Can this game be played without the steering wheel?", "response": "Yes of course, i have been played that way"}
{"product_id": "B006IOAHPK", "context": "Does this game contain a printed manual? Does it have any insert in the box?", "response": "This game has no instert either. And I did wish this game had a printed manual, I'm sure it would have been hilarious too if it did."}
{"product_id": "B0050SX4CI", "context": "Compatible with MotoGP 14? Is possible to use 2 together to play Split Screen?", "response": "Don't know about motor 14,  but I use it with little big Planet karting  and we use 2 together split screen on that game and they work well.  They are a little hard to get used to if you're used to playing with a controller but after a short learning curve I really like them."}
{"product_id": "B005UI8V6C", "context": "Does it work on windows 8?", "response": "I haven't found any problems w/ playing this game on Windows 8,  I have been playing for approx. one month."}
{"product_id": "B00CRL9TU2", "context": "I have GT5 and want to use my GT5 garage full of cars on GT6. Is that possible? Will I be able to do on line \"Seasonal\" races to rack up credits?", "response": "You can not transfer your cars from GT5 to GT6.  The physics between the two games is different making it implausible to transfer your cars.  They would not work correctly."}
{"product_id": "B00H4BBVZQ", "context": "Amazon states that the DLC is \"included\".  Is all of the content on a disc, or is it one of those vouchers?", "response": "The DLC is not included, contrary to what's stated in the product description; the game is identical to the original release. The package does contain codes you can use to redeem the DLC, but you're required to have or create an Xbox Live account to redeem them."}
{"product_id": "B00GU4F4OM", "context": "Will this mouse work with Windows 8.1? I have been seeing some reviews of some that have issues with 8.1 for some reason...", "response": "It works perfectly fine with windows 8.1"}
{"product_id": "B001AH8YSW", "context": "When I try to launch the game I get an message that says to insert the original game disc. That is what I believe I have done. I have Win 8& 4 discs ?", "response": "http://www.fileplanet.com/202241/200000/fileinfo/The-Witcher-Patch-v1.5 is a patch for the game"}
{"product_id": "B00BI4VVGY", "context": "is this a 30v 20 v or 10v?", "response": "this is 12v, connected to the PSU"}
{"product_id": "B00FM5IY38", "context": "Is there a way to tell if an Xbox One game is exclusive? PS4 games say \"only on PS\" etc. Am I missing something? I want to pick exclusives to buy.....", "response": "This is an xbox exclusive, you could just type in on google or wikipedia for xbox exclusives."}
{"product_id": "B000HZFCT2", "context": "Does it work with Xbox One controller ?", "response": "Yes, it does. https://support.xbox.com/en-US/xbox-on-windows/accessories/xbox-wireless-adapter-for-windows-compatibility"}
{"product_id": "B00GJSUUC0", "context": "I heard there was a dog and the dog would allow you to throw it like a fighting star?", "response": "No. And for future reference, avoid trolling on this site, and actually ask some questions that need to be answered."}
{"product_id": "B00A378L10", "context": "Hey guys, I have a laptop, does this just plug right in through usb port?", "response": "It plugs in via USB, yes."}
{"product_id": "B004RMK5QG", "context": "I have 2 one year ps plus cards..I redeemed 1 back in nov. Anyone know if I can go ahead and redeem the 2nd so I don't forget about it?", "response": "I bought 5 on black Friday in 2013. I added all 5 years onto my account without any issue."}
{"product_id": "B00CX8VYM0", "context": "Is this game as good on Xbox one as it was on the 360?", "response": "I would never call the game good but its the same on xbox one and xbox 360 as far as I can tell."}
{"product_id": "B002RYLG4Q", "context": "how well would it work on a samsung flat screen tv?", "response": "Yes it works on any tv and its clear as it can be for an 80's system"}
{"product_id": "B0073J8BYS", "context": "How big of a deal is it not having the motion controller?", "response": "A lot of the games you won't be able to play without it."}
{"product_id": "B0053B66KE", "context": "does it play on a new 2ds?", "response": "Yes. The game's 3D doesn't kick on until you get into a battle. Otherwise it always looks normal"}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "yes it did, the build quality on this controller was less than par. I'm upset with the D pad not functioning as it should I wish I would have purchased the OEM product"}
{"product_id": "B001E27DLM", "context": "How will I know I will not get one of the pirated copies?", "response": "get it from the same guys I did. Budget Video Games Inc."}
{"product_id": "B009GZX49Y", "context": "este juego esta en ingles o en español?...o si se puede cambiar(this game is in english or in spanish?", "response": "It is in English."}
{"product_id": "B000AOJ7FK", "context": "Can this game do Single Player?", "response": "Yes, offline with Bots"}
{"product_id": "B00DC7O77A", "context": "Is this a Gamepad only game or can a Wiimote be used with it?", "response": "All controller options are supported"}
{"product_id": "B00DC7G3Q8", "context": "What is the game about?", "response": "Yoshi has to rescue a kidnapped baby luigi while protecting baby Mario so the brothers can be reunited."}
{"product_id": "B00IYWV852", "context": "How do you get theThree Guest Passes with seven days of play time that come with this edition?", "response": "You should recieve the guest passes via email from the Wildstar customer support address. Check the email you used to create your Wildstar account."}
{"product_id": "B0073J8BYS", "context": "is there 2 controllers", "response": "It comes with just one controller."}
{"product_id": "B00E1DMWBM", "context": "this may be a stupid question but can it play sega genesis cartriges?", "response": "My girlfriend ordered it as a gift. From my understanding. It's a standalone handheld sega. So no sega games needed they are on it. Hope it helps"}
{"product_id": "B00DC7G0GG", "context": "Do you need a 3d tv", "response": "Only if you really want to experience the game with a 3D TV; the game looks detailed without the 3D television experience."}
{"product_id": "B009JZ04BC", "context": "Can the LEDs be turned off?", "response": "Each of the various DPI settings has a corresponding color. The LED is only completely turned off when the DPI is on the lowest setting, otherwise there is always a color."}
{"product_id": "B00EEMLRTS", "context": "Will the camera run off of USB power when the battery is 100% drained?  Like how a PS3 controller will?", "response": "Yes but it is bad for the battery"}
{"product_id": "B002Z7BE24", "context": "Does this video game come with the manual booklet? and also is this the greatest hits version or the standard gold edition version packaging?", "response": "It depends where you buy it, and if its new/used. Though mines is a used game, it came with the manual booklet. You should be able to find out by the seller's description. I believe its the standard gold edition"}
{"product_id": "B001DNGCN2", "context": "does this fan fit the 60 gig ps3 or the 40 gig ?", "response": "I have the 40 and it fits"}
{"product_id": "B00F8W9SWQ", "context": "Is this a USB Keyboard?", "response": "Yes it is a USB keyboard. Overall a nice keyboard for the price!"}
{"product_id": "B00HEX8TA4", "context": "Can this just be a plug and play?", "response": "Yes. It works fine out of the box. If you want more control over the DPI/sensitivity and colors, you need to download and install the small management program."}
{"product_id": "B004N7HSGU", "context": "Can you have at fairly loud volume without disturbing someone nearby? How much \"bleed?\" I'm used to noise isolation earbuds.", "response": "You can have a very loud volume without disturbing anyone nearby.  The bleed is absolutely minimal.  For example: if someone next to me was using them and I could hear it and then I put them on, it would probably be too loud."}
{"product_id": "B00DC9SWWE", "context": "I love campaign modes on other first-person shooters and play offline quite a bit.  This a problem with this game? Description troubles me.", "response": "Microsoft makes an obscene amount of money on xbox live. Everything they are doing seems to force everyone on to xbox live. I guess I'm finished with xbox."}
{"product_id": "B001O3066U", "context": "Replies indicate this edition will play on Windows 7 Home Premium.Reviews in other places indicate there are problems. What do you think?", "response": "Scrabble works in my Windows 7 Home Edition.  Mine works wonderul.  It also says that you have to keep the disk in to play.  Not true!  Once loaded I put the disk away."}
{"product_id": "B002CZ7P04", "context": "I bought wii in 2012 . can I use it with Walk it Out. What other efforts it need to implement it ?", "response": "I think all Wiis are alike .  I bought mine new when they came out and a 2nd (used) 8 years later.  Should work just fine  !!"}
{"product_id": "B002HH9TUG", "context": "How do the triggers feel? They look flat, maybe like Wii U triggers. I like springy triggers more.", "response": "I'm not much of a gamer but they do feel springy and seem to bounce back quickly."}
{"product_id": "B007TYC8MI", "context": "Is this a digital version? or a hard copy?", "response": "Hard copy and code for play online"}
{"product_id": "B0087N222Q", "context": "How do i plug this pair of headphones To the ps3 so y can speak With my friends(black OPS 2)?", "response": "I honestly forgot my friend, but it does work, I use it everyday. Oh, wait, just read the instructions, it's very simple, just charge the headphones up all the way, then go to the PS3's settings (add a device) where you can pair the two up."}
{"product_id": "B00DC7O77A", "context": "Does this game support the use of the wii u pro controller instead of the gamepad?", "response": "Yes, it does. It uses gamepad,  wii mote and/ or nunchuk,  or wii u pro controller"}
{"product_id": "B00GJ2HZ7E", "context": "it doesn't say windows 8.1 compatible but if it's all steam based doesn't it only matter on what OS you can run steam on?", "response": "Not necessarily. I can run Steam on my pc, but not COD: Ghosts because my Windows version is not 64-bits. That being said, I have the pack and all the games run fine on my Windows 7 PC, I don't believe you will have an issue."}
{"product_id": "B00B1OK3TC", "context": "Does this work on CHROME OS?", "response": "Honestly I don't know. it didn't work for me when I got it. It was defective so i sent it back"}
{"product_id": "B00JB4WHWU", "context": "why do they ship you a physical time card and not just email you the code?", "response": "Beats me, I thought I would get an email with the code or a number, but I had to wait for the physical card. Same thing for WOW."}
{"product_id": "B00FB45YFQ", "context": "How well do these headphones stand against people with big heads?", "response": "I would imagine very well. There's a lot of room for the cups to expand and the headband adjust automatically and also has lots of room to expand."}
{"product_id": "B00IAVDPSA", "context": "do you need a kinect to use any of the remotes funtions?", "response": "It's not impossible to do it without a kinect, but it is difficult. The kinect works as a middle man between the Xbox and the TV. Without the TV and Xbox 'synced' you can't use the media remote to turn up your TV volume or anything."}
{"product_id": "B004TTNTYW", "context": "Is this original Nintendo or generic?", "response": "We use ours on the original"}
{"product_id": "B001DNGCN2", "context": "How loud is it? only reason i'm looking at this because the current built in fan of my ps3 is too loud for my taste", "response": "not loud at all,in fact i can hardly here it."}
{"product_id": "B002BRZ79E", "context": "When you buy the PS3 version on Amazon, do you get a code when it ships? or do you have to wait for your physical copy to ship through mail?", "response": "It's a physical copy that ships in the mail.  You receive a game disc that allows you to install the game.  After that, you no longer need the game disc, as the game is saved to your system.  You would only need the disc again if you were to lose the system"}
{"product_id": "B00AWEMODK", "context": "I already have the game and part of the expansions on my computer, if I bought this just for the extra expansions, will it install on top ok?", "response": "You can select what you want to have installed and once you add your new activation code your account will know you have the ultimate collection for Seekers of Adoulin - no problems."}
{"product_id": "B0098F1Y3K", "context": "can I play this game using nintendo ds or do i need nintendo 3ds?", "response": "3ds games MUST be played on a 3ds machine. It's great training!!!"}
{"product_id": "B003ESDQW4", "context": "is Black cat in this game?", "response": "Black cat is not in this game from what I remember"}
{"product_id": "B00BGAA3S2", "context": "Is there an extension cord for the camera available?", "response": "nothing that I'm aware of it at the moment but I don't really see why you would really need one"}
{"product_id": "B00D96BNGM", "context": "can this unit be substituted for comuter headset", "response": "yes it can be substituted using bluetooth or wired"}
