{"product_id": "B002J9GDXI", "context": "How long is the cable? Is it braided?", "response": "yes, braided. about 6ft long. love this mouse"}
{"product_id": "B0076HD2W8", "context": "Will this still work without a CD Drive?", "response": "Yes. The cd is useless anyway. Look at this vid. http://m.youtube.com/watch?v=kxa5CJsDzwQ"}
{"product_id": "B000YMQGWU", "context": "Are these compatible with Mac iOS X?", "response": "Sorry I only own a window pc."}
{"product_id": "B008O510Y8", "context": "How long are the audio/mic jack wires?", "response": "It's 3 meters long which is almost 10 feet."}
{"product_id": "B00HPU96FI", "context": "Just got this cable from Amazon. Fits my 42\" vizio nicely. However, the screen colors are skewed and oddly green. Anyone else experiencing this?", "response": "It looks really blue on my TV and on my computer monitor. I looked at this question's answers and assumed it was a defect. But after exchanging it for a new one, I still have the same problem! :/"}
{"product_id": "B00CHYOP80", "context": "does it say ps4 on the box", "response": "Yes it does and is compatible with the PS4. I used it on both my PS3/PS4."}
{"product_id": "B0057WDBHA", "context": "Will it work on PS4?", "response": "Don't know bought it as gift...maybe ask company who makes these"}
{"product_id": "B006SVUQNQ", "context": "Is this hard drive backwards compatible with Xbox 1 games?  I know these hard drives need to have a partition in them for older Xbox 1 games to play.", "response": "No it won't work because its not made by Microsoft but works great for memory"}
{"product_id": "B00D3TRMD8", "context": "Can I buy it here and send to my nephew in different country? Will I be getting a password so that he can download?  Or am I the only one who can download?", "response": "You get a CD key, for the game and you give him the CD key. I don't know if it is usable in other countries though."}
{"product_id": "B00CQ9L1Z6", "context": "Does this allow to clone pokemon?", "response": "NO BUT 4RI GOLD does"}
{"product_id": "B004RMK4P8", "context": "MAN IT DOESN WORK THE CODE", "response": "Works very well n take only few seconds!"}
{"product_id": "B004QRKWKQ", "context": "will it work on windows 8", "response": "Yep! I have windows 8 and it works great!"}
{"product_id": "B00286BZ4Y", "context": "can it be used on a regular pc", "response": "I run mine on my laptop but did not buy a special version. I have Windows 7 but found that it works better on a previous version.For most things I run my laptop as a pc."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "I don't see how all you guys are saying yours fits fine. Mine might fit OK....if I used a hammer to place it. Then a crowbar trying to get it out. On top of that it's constantly mashing the power button, which can't be good. Got burned on this case and trigger grips, lesson learned. System first, accessories later."}
{"product_id": "B003XNU1JQ", "context": "Once you download it do you have to have Internet to play it?", "response": "No, after you download Mario 3 it is on your Wii system and you don't need to be connected to the Internet to play."}
{"product_id": "B00007JNFE", "context": "Is this a bagpipe?", "response": "Not a bagpipe, though mostly hot air."}
{"product_id": "B00GANWVJE", "context": "Does this game work with Nintendo DS?  Or is 3DS required??? buying for gift, not familiar with game systems . . .", "response": "You need a 3DS to play it"}
{"product_id": "B0073QM45I", "context": "This cable works without having a battery? I mean, It will charge my controller without a battery inside?", "response": "You will have connectivity to your Xbox.  With no battery there is nothing to charge."}
{"product_id": "B00FE8WKMO", "context": "I had the regular wii, just got the wiiU. Can I use my old balance board with this new game?", "response": "Yup, i have Wii Fit Plus for the original Wii, and the balance board from that works perfectly with my WiiU Wii FitU."}
{"product_id": "B00GZ1GUSY", "context": "Is it normal to see this annoying white flash between screens a camp fire?  Not sure if mine is defective because it's irritating/annoying. TYIA.", "response": "Yeah it's normal. Mine flashes too. You're welcome."}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "It is a Japanese 3DS and only works with Japanese games."}
{"product_id": "B0053BCML6", "context": "Can more then one person have a house in New Leaf just like in Animal Crossing City Folks?", "response": "All your villagers have houses as well as yourself being the major. But you will also be able to create three addititional file with houses as well. Lol hope that answered your question."}
{"product_id": "B00B67ZTUW", "context": "is it multi player", "response": "Yes it is but when you link to a character only one person can use the pair"}
{"product_id": "B00H7KDNBO", "context": "We have a MacBook Pro 2011.  What version should we purchase (DVD, instant download, PC?)  We want to make sure it's compatible on a Mac.", "response": "If you have Origin downloaded on your Mac - you should be fine.  DVD: They ship you a copy and you manually install from disc.  Instant download:  You link your Origin account to the Amazon download.  PC:  You download a digital copy and activate/install it from origin - which can be a little confusing."}
{"product_id": "B00005NIMB", "context": "Will this work on Win8 64bits?  I will play mostly the \"Battlefield\" games.", "response": "Sorry, i have no idea."}
{"product_id": "B006RJ373K", "context": "Can I use with \"Windows 8\" without any problems ???", "response": "yes I use Windows 8"}
{"product_id": "B007WWW2C8", "context": "Where do I put in the game code?", "response": "Aloha Caleb,If you downloaded the PC version, you'll need to download steam to your PC first!"}
{"product_id": "B009NQPGOW", "context": "hi, is the game also in italian language?", "response": "Will be it available in italian?"}
{"product_id": "B000SOYG8U", "context": "i was install the game in my pc but the system require the eaw dvd, so i cant play the game, please help me", "response": "You have to have DVD in the disk drive to play the game.  If you did not buy the game, then I can't help you."}
{"product_id": "B002RYLG4Q", "context": "I heard if you played the original NES this system has a slight delay compared to it, have you noticed this delay (if any) and if so is it noticeable?", "response": "If there is a delay I have not noticed it.  I certainly do not feel that the action of the game is any different from an original NES."}
{"product_id": "B00FWWY1V0", "context": "do they stick without the regular cover", "response": "Nope there Slick As hell Smooth movements/Aiming Worth the 15$ even without the regular Cover C:"}
{"product_id": "B0088MVPFQ", "context": "can you play this on the 2DS?", "response": "Yes it will.  It just will not have the 3d feature"}
{"product_id": "B009GZX49Y", "context": "Are all three games on the disk or is only one on the disk and the rest have to be downloaded?", "response": "All come with the disc but the first two need to be fully installed (not from the Internet just from the disc) revalations is the only one that doesn't require a full install to play"}
{"product_id": "B00E369SDM", "context": "Does this 12 GB system play ps2 games?", "response": "sorry no more in stock"}
{"product_id": "B005EOOT90", "context": "Can you watch netflix with these", "response": "Hi, I believe you can. I bought these for my son. he uses it while playing xbox. Since you can watch netflix on the game console I dont see why not.  Sounds pretty clear. Good headsets!"}
{"product_id": "B00BMFIXEW", "context": "is the sexual content strong in this game or mild,", "response": "Mild. There is very little sexual content. But the game is full of assassinations..."}
{"product_id": "B00BMFIXZG", "context": "Does this work at all with windows 8?", "response": "It should work just fine on Windows 8.  Back of the box says vista/7/8."}
{"product_id": "B008GEH9HO", "context": "is there a warranty", "response": "Yeah, but for a year or two so I strongly suggest to get an warranty (Canpoy or Sqauretrade, if offered) so you'll know you're covered in case it gets damaged or spill on."}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "Just extras for the game. Small single player side story campaign, multiplayer maps and a making of movie."}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "It comes with FSX compatibility, and other games can be supported using the DirectOutput SDK in C++.  I've personally implemented this for Falcon 4 Allied Force and BMS4, and it looks like someone else did it for DCS: http://forums.eagle.ru/showthread.php?t=94174"}
{"product_id": "B0091WIOJ2", "context": "How do these feel while wearing glasses? I need glasses to see my tv and the current headset I have now digs into me, these look more comforting", "response": "it depends on how the glasses looks from the side if its vertical flat then you wont feel pain"}
{"product_id": "B000035Y6D", "context": "How do you set it up with the new flat screen TV's.  Any differance?", "response": "Its the same thing you just use the yellow, white, and red wires for the picture."}
{"product_id": "B000A2R54M", "context": "I would like to play multiplayer between a DSi with Mario Kart DS and a newer 3DS console.  Do I need to purchase another Mario Kart DS for the 3DS?", "response": "You do not need to purchase another Mario Kart DS ... simply play it in the DSi and go to multiplayer on your 3DS and should be prety simple from there."}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "The cord is around 3-5ft long"}
{"product_id": "B00EI4V3X2", "context": "Is this headset surround sound for both PS3 and PS4? I would like a headset that has equal surround sound for both systems?", "response": "Yes the headset is compatible with PS3 as well as ps4...awesome headset. I purchased the headset when the ps4 first came out on day 1 and a year and half later it's still running like a champ."}
{"product_id": "B00D8S4GNS", "context": "Does the DLC from JD4 work with JD2014?", "response": "No I that will not work but they have been putting up some DLC from that on Just Dance2014. So yes and no I guess. I'm sure they'll put more from the past JD4 on this one as time goes on."}
{"product_id": "B00FZ12F34", "context": "Do the new avenger heroes work on this portal or do I need a new portal?", "response": "You need to buy the new game Disney 2.0 which comes with the new portal. Characters from 1.0 will work on the new 2.0 portal."}
{"product_id": "B00919RM1Q", "context": "Is it comparable for Windows 8?", "response": "Sorry, I do not know that answer as I do not have windows 8 yet."}
{"product_id": "B00CXI0BPG", "context": "is the scroll wheel free-scrolling?", "response": "No, it's got a pretty solid ratchet to it. Nothing too hard, but it's there. Middle mouse click has a lot of resistance to it though."}
{"product_id": "B00FENJVOE", "context": "Is this a digital key or will I have to wait for this in the mail?", "response": "This is a physical copy, NOT a digital code."}
{"product_id": "B0057S9SYY", "context": "are these wired or wireless because somebody said and i quote \"These are wired but can come wireless\"", "response": "I have no idea where you heard that before because these are only wired"}
{"product_id": "B001L5TIR4", "context": "does an icon for The Rise of Atlantis appear on the desktop?", "response": "If You Choose For It To Show Up On The Desktop It Will. If You Do Not It Will Be In Your Start Up Menu."}
{"product_id": "B00BI9MDSO", "context": "The new ps vita slim model fits well in this case????", "response": "Sorry I don't believe it does, I have the older Vita, and it fits snug like a bug in a rug! You should look into something like this. It really is the beat case for your money. GoodLuck!"}
{"product_id": "B00BKF5IXS", "context": "Does this bundle have everything needed to play regular ps 3 games. Not just move games. Or do I need another console?", "response": "Everything you need to play is there. However, for multiplayer games you might want to purchase extra controllers."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "It seems like its made really well. No signs of wear yet on mine."}
{"product_id": "B0073J8BYS", "context": "Is it a big deal to have the Motion Controller without the Move Navigation Controller?", "response": "It depends on what games you are playing. The MNC can be very helpful and is requires for some games. Check your games' requirements."}
{"product_id": "B0009VXBAQ", "context": "will this Wii play, all of the \"Just Dance\" versions, \"Wii Sport resorts\" and other regular \"Wii\" games?", "response": "It will play every wii game,  i know for sure it will play wii sports resorts because i have it. Hope this helps"}
{"product_id": "B00JFCA6V2", "context": "Can you play games off of the game cards without purchasing a Sony memory card?", "response": "No, because each game requires some memory be available.  You could get away with buying the smallest memory card.  I think its 8 gigs."}
{"product_id": "B006IR6NH8", "context": "Can I be able to attach this to my G27, I know that the buttons wont work, but is it attachable?", "response": "Yes you can. There are adapters for sale. Not to bad priced. I did it and love ot"}
{"product_id": "B0050SVHZO", "context": "Is the Wii U backwards compatible with Gamecube Games and the Wavebird Wireless Gamecube controller?", "response": "No. Sorry dude. It doesnt have gamecube comtroller porta. If you have the wii u gamecube adaptor for smash bros it should work tho"}
{"product_id": "B0017KIBAI", "context": "Does this work good for the Wii U?  Clueless father buying for son.  He plays Super Smash Bros. most of the time.", "response": "It can, but you would need to buy the Wii U gamecube controller adapter as well. Currently, the adapter is sold out in many places, but should go back to the original price of $20 within a few more weeks, if you wait."}
{"product_id": "B00H72EMP8", "context": "can you hear your own voice with this headset?", "response": "Not unless your partners have the TV up where your voice comes through the TV and back through the mic. The Mic is really good."}
{"product_id": "B009DL2TBA", "context": "does it play Japanese games", "response": "no this is the american version you will have to go to amazon the japan version"}
{"product_id": "B00B3FIXJQ", "context": "how do you know the mods are onwhen you press the sync buntton and what color is each mod", "response": "Its came with a paper but they work even though I dont use it"}
{"product_id": "B000NJBD90", "context": "If using this for a PC will it recognize the analog sticks?", "response": "Yes, but please note that controller may not be compatible with all PS3 games."}
{"product_id": "B00A878J5I", "context": "can you charge the Wiimotes with the wrist strap still on the controller?", "response": "Yes you can, there is a notch in the side to slip it to the side."}
{"product_id": "B009RHEBWA", "context": "Does 2012 Deluxe + state  work with Windows 8  ?", "response": "If this 2012 Deluxe + State works with Window 8; then, why H&R; Block does state as \"Win 8 Compatible\" ???  I used Tax Cut, H&R; Block for many years, but I am changing to other tax program......"}
{"product_id": "B009D3HSTG", "context": "Is it possible to use two of these at a time and play multiplayer games?", "response": "Yes it is. It really depends more on your computer and emulator than the controller. I use Linux instead of Windows or Macintosh and it works great on that. As far as Windows or Macintosh, I can't really say..."}
{"product_id": "B00EI4V3FU", "context": "Does this plug into the system? or does it plug into the controller?", "response": "Plugs into the controller but it's a bad headset really quite"}
{"product_id": "B00DB9JYFY", "context": "Does anyone play this game online anymore?", "response": "Barely any people play at all now"}
{"product_id": "B0000C7GHG", "context": "good afternoon could tell me if it comes with controls?", "response": "The one I purchased came with controllers"}
{"product_id": "B00CBQO930", "context": "How do you pick a color when you order it?", "response": "Red is the lowest DPI, then green, then blue, then purple is the highest."}
{"product_id": "B0088MVPFQ", "context": "what is the newest mario for the 3ds", "response": "If your looking for the traditional game of Mario this is the most recent one.  There is a newer one but it is only on the Wii-U."}
{"product_id": "B00E9I1FPI", "context": "i already downloaded the base game of Skyrim off steam. will your disk allow me to have all the expansions added to my existing game? or a new game?", "response": "Hey Ashlan you can still play your game it downloads everything and will continue with your game. You will not lose anything. I hope that helps."}
{"product_id": "B002DUCF7Q", "context": "If i add alot of these like half a cockpit do i need to upgrade my Power supply?", "response": "Hello, yes! You sure do! Saitek Also sells an extra power ac, I'm using it and works perfect. I have 5 panels connected"}
{"product_id": "B000ND3XXA", "context": "I know this is meant for a computer, but would it also work with the Wii U possibly?", "response": "NO it only works on computers"}
{"product_id": "B00D96BMV8", "context": "How good is the headset adapter? Is it the official xbox headset adapter or Turtle Beach's version?", "response": "Xbox official versions, not turtle beach"}
{"product_id": "B002L93F0A", "context": "Am I right when I see that there are two (2) controlers for $12.50 price?", "response": "Yes, that's what I recieved :)"}
{"product_id": "B008GEH8LQ", "context": "Is this like a store bought 3DS XL?", "response": "Of course it is, Only you get it for a better price  Just make sure you click on \"new\" and not \"used\" I'm really happy with mine.."}
{"product_id": "B001KMRN0M", "context": "Does this come with a memory stick?", "response": "No it does not come with memory stick, this adapter combo worked great for me:32GB 32G 16GB x2 SanDisk MicroSD MicroSDHC Card with Memory Stick Pro Duo Adapter - BulkShipping weight (PSP+Adapter Combo) was 1.75 pounds.You will also need to buy the mini usb data cable separatedly:Data & Power USB Cable for Sony PSP"}
{"product_id": "B002L93F0A", "context": "HOw do you connect this to the Wii, my son's console does not have a slot matching the plug on this unit", "response": "The wil has a door on the top of it open and you can use this remote."}
{"product_id": "B0090ECASW", "context": "do you get the mad catz or cyborg version? Also, do the keys light up and (if so) are you able to choose the color?", "response": "Hi, I don't know what version it is, I think it may be the cyborg version and yes the keys do light up and yes you can choose the colour"}
{"product_id": "B000M6DHA2", "context": "Is this a SDHC memory card?", "response": "This is not an HC card.  I am guessing you are installing homebrew and yes this will work for you."}
{"product_id": "B00B1MXGDO", "context": "The additional buttons on this controller act like the Scuf Gaming's paddles right?", "response": "yes. the rockers and the additional shoulder buttons can be programmed to serves as any other button on the controller. you cant program new functions but you can program the rockers with the axby buttons so your thumb never has to leave the stick, for example."}
{"product_id": "B009SJR278", "context": "Would this work on my Macintosh?", "response": "So long as it has a headphone/mic port on the front/back/side then yes, the headset will work for you."}
{"product_id": "B00HEX8TA4", "context": "Does your scroll wheel wobble? Mine wobbles significantly. Makes a jittering noise if I shake the mouse.", "response": "No, mine is fine. It works perfectly."}
{"product_id": "B004N3FGHC", "context": "Does this work with a wii U?", "response": "I do not know if it does. We are getting a Wii U for the kids for Christmas so I will be interested to find out!!"}
{"product_id": "B00CMQTUSS", "context": "Seeing as you can use this for PC now, how is the Xbox One controller vs the 360 controller?", "response": "Many say that it has changed a lot, but I didn't find ALLLLLLL that change at all. But is sure seems more durable and smooth."}
{"product_id": "B0032MM2P4", "context": "Can I use this on Windows 8?", "response": "I do not know, I can not get it to work on win 7 ultimate"}
{"product_id": "B005BLAJ68", "context": "can you play off line without Wi-Fi or internet?", "response": "Yes, if you can figure out how to download it."}
{"product_id": "B001H4NMNA", "context": "Does it come with the chargable batterypack for the controller ?", "response": "This is only for PS3 controllers. They don't come with battery packs. All you have to do is push the controller into the slot and it charges. It's really easy."}
{"product_id": "B0016HG4H4", "context": "Will this work with Wii Band Hero?", "response": "It works great with Band Hero, but doesn't work with Guitar Hero. Guitar Hero requires a wireless drum set."}
{"product_id": "B009AGXH64", "context": "how many people can play at once?", "response": "Some games support up to 5 players at one time such as Nintendoland and Sonic Racing."}
{"product_id": "B001BYMZ5W", "context": "can this hook up to ps3? ps4? i have a monitor with headphone jack, that works?", "response": "I use it on PS4 with astro mixamp and Y connector to fully utilize the power of this headset."}
{"product_id": "B00B5GZORW", "context": "Does anyone know how to get past the point of the downed tree in front of the path? I have started 3 times and keep getting stuck here.", "response": "Then you can get the hachete and cut the tree stomp."}
{"product_id": "B00ENFVJJO", "context": "is the adaptor universal? or can be use in 110 thru 220v?", "response": "Not universal but can be used in 110 true 220v in my country(turkey) we use 220v and i do not have any problem about that. Great product, you should buy it."}
{"product_id": "B00D3RBYM0", "context": "Does this game require the kinect to play?", "response": "This game do not require Kinect so if you don't have Kinect you will be able to use it without a problem :)"}
{"product_id": "B00GP0HQ3S", "context": "Does this come as shown in the picture without packaging or is it factory sealed?", "response": "Yes it comes fastory sealed"}
{"product_id": "B00INUME3K", "context": "Whats the difference between MX GP and MX GP 14?", "response": "Tracks and images are best"}
{"product_id": "B0094H8H7I", "context": "Does it have Castlevania Bloodlines on it!", "response": "Unfortunately no, in fact there are no castlevania games on it at all :("}
{"product_id": "B005S0KHIC", "context": "Is this the same as Logitech G9x Black Two modes scroll USB Wired Laser 5700 dpi Gaming Mouse. My son asked for that for christmas.", "response": "Yes, it is exactly the same except for the logo."}
{"product_id": "B002P35JMO", "context": "Someone please tell me where the fat end of this thing plugs in!  PLEASE HELP!", "response": "I have just a regular Xbox 360 and it goes in the back"}
{"product_id": "B00004VUFG", "context": "does this steering wheel work with farming simulator2013", "response": "I don't know. I Only used it on GTR Racing."}
{"product_id": "B004RMK5QG", "context": "How Many Years can you stack up of PS+", "response": "As many as you want"}
{"product_id": "B002CJ8Z04", "context": "does this have the same plot as ruby/sapphire?", "response": "Pokemon Emerald has a similar plot to that of Ruby/Sapphire, however there are some key differences: In Ruby/Sapphire the main antagonist is either team aqua/magma but in Emerald you both are equally dubious, also there are different gym leaders and E4 members. So no they don't have the same plot."}
{"product_id": "B007VPZR5U", "context": "can this mouse make macros for GW2?", "response": "I dont play gw2 but macros are easy to make."}
{"product_id": "B00IYWV852", "context": "I was thinking about buying a couple of this game as gifts, it won't be an issue will it? The recipients won't have any problem using the game codes?", "response": "Yes, when you buy it you get an unused game code.  The person receiving the code just needs to make an NCSoft Account and redeem the code on their site."}
{"product_id": "B009AFLXJS", "context": "1# Is this wireless? 2#Old school here and have wavebird wireless that was used on GameCube and Wii is there anything out there so I can use wavebird?", "response": "An extension controller is often used for the corresponding software. I can be connected to the main body up to four wireless."}
{"product_id": "B00DPQ6GPO", "context": "I am a black ops 2 player on ps3. I like using single shot guns, like the FAL, and pistols, like the five-seven. Is this a good controller for me?", "response": "Its working pretty good for me sometimes its a little slow on shooting but i find it usefull for me for those guns"}
{"product_id": "B00CWFUHT0", "context": "Does it come with a HDMI cable", "response": "Yes. I need with hdmi cable"}
{"product_id": "B0010WS20W", "context": "Do you need an internet connection to play this game?", "response": "Nope. This is entirely off-line and can be played with the oldest, crustiest computer available in your closet. It is not flashy, it's very simple in graphics but it IS WORTH EVERY PENNY in quality."}
{"product_id": "B009RXUOD4", "context": "how long is the wire?", "response": "The wire is pretty decent. It stretches all the way across my room and it's about 13 feet or so."}
{"product_id": "B00EPZ8POY", "context": "does this game works with any ps3 console(usa)?", "response": "Yes men it works!!!"}
{"product_id": "B00G42KO0Y", "context": "does it have vibrater feature", "response": "Not that i know of"}
{"product_id": "B000IZAQD8", "context": "does this come with two controllers?", "response": "Mine came with one controller"}
{"product_id": "B00EZPCWWA", "context": "can you play regular ds games?", "response": "Hola si puedes jugar los juegos q juegas en tu ds y los de 3ds también solo q no lo ves en 3d"}
{"product_id": "B00AJZNUUI", "context": "does this work with skylanders?", "response": "There is a USB port and it does work with Skylanders (according to my sons)."}
{"product_id": "B00IVHQ0KI", "context": "it does come with the pedals, right?", "response": "Yes, pedals are included."}
{"product_id": "B00IURGGA8", "context": "Does this work with Mac os Yosemite?", "response": "I've got Yosemite installed on my Mac and it works perfectly"}
{"product_id": "B00CERXJNW", "context": "Can one easily replace the LED's if one goes out?", "response": "No, not to replace. When LED fails complete swap during warranty, afterwards go live with it.LEDs on the Ks seem to fail quite often."}
{"product_id": "B00E1L78N6", "context": "does audio pass over usb on the xbox one?", "response": "Yes you can talk to others playing and you can hear audio. I am not sure what you mean by \"audio passing over usb\""}
{"product_id": "B0095P5K8I", "context": "does we need to have a mouse pad or we can us it with out the pad?", "response": "sorry for late respond my friend.... I use mine anywhere, right now i'm using it on a book XD... the only place that it can not be use is on glass, well, you can not use any mouse on glass field... I hope this answer helps you :)"}
{"product_id": "B00BZOBE78", "context": "Is this a steam key? And if not will it work with steam?", "response": "Yes this game uses Steamworks as DRM meaning the key has to redeem on steam. It works any version of civ 5 that is redeemed on steam no matter where you bought it"}
{"product_id": "B0027AP5S8", "context": "is this just a case or is it that actual console", "response": "Just the case, it was such a poor fit I put it back in the original case. Save your money."}
{"product_id": "B001444IN6", "context": "will this run on windows 8", "response": "Yes it will. I have windows 8."}
{"product_id": "B00BMFIXZG", "context": "I bought this game and I can not play , I get it already been registered before. I could say I go to play ?", "response": "If it is a used copy then someone has already registered the copy and it is basically useless.  You could try contacting Ubisoft's service department to see if they can do something."}
{"product_id": "B00CX8VY4S", "context": "Can you jump in this game?", "response": "Not while standing if you're trying to get over something you basically climb it."}
{"product_id": "B000GCJ6MK", "context": "How can i run it on a mac?, thank you in advanced!", "response": "Am not sure how to run it on a Mac.  But my brother in law who advised us said it works best with Windows.  Sorry !"}
{"product_id": "B00CX8VYM0", "context": "Should i buy this game? I honestly suck at games, I give up easily on timed stuff or too difficult, but this game looks interesting", "response": "Well honestly I think so because if your not good at games at the beginning one part would be difficult but it's a really good game so ya you should get it"}
{"product_id": "B004QRKWKQ", "context": "i need the reciever for play in pc?", "response": "it comes with the USB Receiver so no worries."}
{"product_id": "B00IVHQ0KI", "context": "Has anyone had any problems with the gas pedal? Ours is not responding. Any tips? I am about to return it. So frustrating.", "response": "If you are getting no response from the pedals try rebooting your Xbox by unplugging it and plugging it back in.  I've had mine for 5 months and every couple of monthsthe pedals will stop working.  Rebooting has fixed it every time."}
{"product_id": "B0016897GS", "context": "Can I use this to connect my smart tv to my computer modem? Is this the correct cable? Thanks", "response": "No... But you can do it wirelessly. Call your internet provider to turn on WiFi. then your phone will be connected to the Internet ."}
{"product_id": "B00FLLFJ68", "context": "Is there anywhere to get another dongle? I lost one and need two for my two controllers.", "response": "You can get them direct from Nyko. Just search online for it. I think they're five bucks but may cost shipping. They aren't available anywhere else that I can see."}
{"product_id": "B00B15EXJC", "context": "Does this controller work well with call of duty games", "response": "Yes it will work great. This controller will also give you an unfair advantage with its rapid fire settings. I would give it a 100% with Call of Duty."}
{"product_id": "B008SBZD9G", "context": "Is it a Steam version or can I directly punch in activation code in FF14 client? I would prefer a direct activation code that can be used in 14 client", "response": "It's ether or. I used the client"}
{"product_id": "B00074TQFO", "context": "will this work with windows 8.1", "response": "Yes! I love them and have begun ordering more and more puzzles from Jigsaw Galore."}
{"product_id": "B00CMQTUY2", "context": "how is the D-pad of xbox one controller  as compared to ps3 controller better or equivalent  or much better for fighting games like mortal khombat ?", "response": "If you're playing a charge character or shoto, xbox control is better, if you're playing a hybrid/rush then the PS3 control is slightly better. The difference in quality for fighting games isn't huge. (Unlike the 360 one which I feel is worthless for fighting games)."}
{"product_id": "B001AATQ0Y", "context": "Does it use 2.0 USB or 3.0 USB ports?", "response": "Yes for both it doesn't really matter it still work for both. It doesn't use your computer speed, but the emulator or game you are playing is going to use the computer speed, not the hde dual controller."}
{"product_id": "B00FNKMVUO", "context": "I'm sure this is dumb question but, does the mouse change colors?", "response": "Yes it does.   Each profile can be assigned a different color.   You also can set up pulsing and intensity for each color"}
{"product_id": "B008CXTW5G", "context": "does it have any warranty? I bought it several months ago, but my W is becoming more and more insensitive..so ..", "response": "I think it had a limited one. The keys fall off so easy that I no longer use it. I use the razer death stalker now."}
{"product_id": "B0073QM45I", "context": "Hey, I have a regular xbox 360 wireless controller. The product says \"Charging Cable,\" but if it plays PC too (given the drivers)?", "response": "I could never get it to work on my PC except for charging.  I ended up buying an xbox 360 wireless usb receiver for it instead."}
{"product_id": "B0079V29EI", "context": "I have read lots of complaints about people receiving the wrong model for their vita. I have the original vita, will this grip work for that model?", "response": "The complaints you are referring to I saw and I am not sure why those people recieved a grip for the slim vita. I can only speak to what I received,  I bought two of these grips from here and both work great and are indeed the same model that you have."}
{"product_id": "B0057S9SYY", "context": "Will these support chat via the xbox one headset adapter?", "response": "Hello! These are made for the X360 console only. You may get audio with the new console. but chat is not available."}
{"product_id": "B006PP4136", "context": "Is this starter kit made for the Original PS Vita or the PS Vita 2000/Slim? If not, which accessories that come with it fit the PS Vita 2000/Slim?", "response": "Its cloth, so I see no reason why it wouldn't, unless the new Vita is to wide or to thick or something, check the dimensions on both and if the new one is smaller then it shouldnt be a problem. But if you are looking for a hard plastic casing, then this isn't for you."}
{"product_id": "B00GHJ6X8G", "context": "I'm from NY  so I'm very interested in what the Yankee roster is before i buy this.....do they have any of the new players like Tanaka, Ellsbury,etc?", "response": "When you go to play the game and do your teams, it updates with new players that you can select."}
{"product_id": "B00BI83EVU", "context": "Does this game come with one of those activation code papers inside? I'm considering a used copy.", "response": "Yes it comes with a code but i havent use it so it means that i dont know what exaclty it does"}
{"product_id": "B00HWMP0TU", "context": "So it looks like there are actually 2 versions of this game. One of them is complete in box and the other requires Steam. Correct?", "response": "Actually it is just a different way to get the game.  One has the disks and the other is downloaded (no media)."}
{"product_id": "B007W8S2MG", "context": "In terms of the story line, will everything still make sense if I haven't played Persona 1, 2, or 3?", "response": "Yup there each there own game I reccomend you play p3 after you finish this one"}
{"product_id": "B0002FGFHU", "context": "Is this a physical copy or a download?", "response": "It's a physical copy (hence, the shipping costs)."}
{"product_id": "B009AFLXQQ", "context": "i am buying the deluxe set wiiu do i need a pro controller", "response": "Not necessarily. I didn't buy a pro controller til later down the road. And its mainly for guest when they want to play with me. Other than that, I use my gamepad for everything."}
{"product_id": "B0080CE2WC", "context": "mine blinks red when I plug in any controllers.  What does this mean.", "response": "That it is charging my turns blue when they are done."}
{"product_id": "B004JKZUJI", "context": "dose it break easley", "response": "No, it felt many times from my kids and was OK(still working)"}
{"product_id": "B00GANWVJE", "context": "Is it different enough from ALTTP to where I won't feel deja vu?", "response": "While it is similar to ALTTP in that it's the same time frame and locale? The new art direction of this game adds a feeling of nostalgia even though it's someplace you may have seen before, much like how heartgold and soul silver were good games even though it was the same area."}
{"product_id": "B00178630A", "context": "Does this game include the CD-key?", "response": "It is found on the Diablo III Game DVD disc cover as a white sticker with the Diablo III Authentication Key printed there-on."}
{"product_id": "B00FLZ4FS2", "context": "code for xbox because one does not work? I feel cheated", "response": "First you should insert on XBOX 360 than will be available to download on XBOX one"}
{"product_id": "B00B0QONB0", "context": "is this for titanfall", "response": "This item is for any Xbox 360 game that needs to be saved. So yes Titanfall and any other game. Works great and I haven't had any issues with it to date :)"}
{"product_id": "B0009PRCNO", "context": "Does this have wifi?", "response": "Yes it does. Thank god."}
{"product_id": "B0097CUREG", "context": "Is this compatible with Windows 8?", "response": "I don't know I am still using xp"}
{"product_id": "B004HYK8Y8", "context": "is this game a mmorpg", "response": "No, this is a single player role playing game. There are videos on Youtube.com that show the game, if you can get on there."}
{"product_id": "B00ERDGMSA", "context": "wait so does this come with all dlcs and skins for pc?", "response": "It comes with all the dlcs but not much skins. I hoped I helped answer your question. I know there are at least one skin."}
{"product_id": "B004XIQN3I", "context": "will it work on windows 7?", "response": "Yes, it installed and worked on my Windows 7 laptop and desktop but the game is kind of lame and I dumped it. try IL-2 Sturmovik."}
{"product_id": "B008VXCPRY", "context": "Will it play on Windows 8?  Is it touch screen enabled?", "response": "Yes, but you have to change or delete a certain file in the game data. It sounds difficult but really isn't. Look up 'bastion Windows 8 troubleshooting' or something similar on Google. Also, I highly recommend an Xbox 360 wired controller. It makes the game so much more playable on pc."}
{"product_id": "B00CPS59CE", "context": "I have a feeling its a really dumb question to ask, but does it come in the original box of the headset or another box? Im just kinda curious", "response": "Yes, it does come in an \"original\" Turtle Beach box, but one that is labeled \"re-certified\". It also comes with an original instruction book.  My son has had no problem with it.  It works just fine."}
{"product_id": "B000PD0HQE", "context": "Does this come with a xbox live 1 month code and a standard xbox 360 headset?", "response": "this item includes 120 gb HD, power brick, one black wireless controller and will include one game only. No box , no headset,"}
{"product_id": "B00B08REVE", "context": "Will this work on Turtle Beach Ear Force M5 Silver Mobile Gaming Headset?", "response": "it should but not 100% guarranteed"}
{"product_id": "B008TP1OKI", "context": "Does it work with Destiny?", "response": "I'm not sure, he don't have that game, but we have been having issues with our XBOX live. He can't play online and hasn't been able to in a week. The hard drive does work. I had to figure it out. But it works."}
{"product_id": "B007Y7OP8K", "context": "what is storyline of this game and its windows 8 compitable?", "response": "Sorry I bought this game as a gift for my brother. I asked him about it but he was not very  good at explaining what it's about. He did say he liked it very much and that it works on Windows 8."}
{"product_id": "B007VPZR5U", "context": "can you program the buttons to be used as any key? or just numbers?", "response": "Bryce, you can program the keys to carry out any action on your PC. MMO games especially. Not just numbers."}
{"product_id": "B00A1Y2STQ", "context": "Does the keyboard light turn off when the computer goes to sleep?", "response": "It does if you put it into manual sleep mode (when you click sleep), but not when the screen times out."}
{"product_id": "B0090ECASW", "context": "do you get the mad catz or cyborg version? Also, do the keys light up and (if so) are you able to choose the color?", "response": "Mad catz, yes they light up and ye I can change the color."}
{"product_id": "B00D3TRMD8", "context": "Can you download it on Amazon tablet", "response": "you can't run this game from your Amazon Tablet.  Its system requirements are:  \tWindows XP/Vista/Windows 7/Windows 8"}
{"product_id": "B00BGA9X9W", "context": "Is the Micro USB charging port the same as the DS3?", "response": "PS3/DS3 used a mini USB, PS4/DS4 uses micro USB.  Image for clarity: http://blog.premiumusb.com/wp-content/uploads/2012/06/mini_vs_micro.jpg"}
{"product_id": "B00EFFVZP0", "context": "This game is in language or subtitles in Spanish?", "response": "The game is in English. I am not sure if you can set it up for Spanish subtitles."}
{"product_id": "B001CC8UBG", "context": "Does it include online playing?", "response": "I really do not know."}
{"product_id": "B0002L88HE", "context": "When I click on the Desktop icon to play The Titans Expansion it says \"please enter The Titans Expansion CD ROM. Any advice on what to do?", "response": "I'm going to guess the disk is in there?"}
{"product_id": "B002CJ8Z04", "context": "you can play this on the gameboy color right?", "response": "Unfortunately no, you must have Gameboy Advance or Gameboy Advance SP."}
{"product_id": "B000FP0K0U", "context": "Will this work with Windows 7?", "response": "Not sure...when I used it I had xp...they should say on the info."}
{"product_id": "B00ENFVS5Y", "context": "Why my alienware said it can not recognize this device? somebody please help me. How to get this work on pc.", "response": "I don't know if amazon will let me spell it but here it is http://www.thrustmaster.com/en_US then go to downloads and choose your system thrustmaster dot com just in case you don't see the link"}
{"product_id": "B001AWBYRA", "context": "If I buy the physical copy of the game will that redeem on steam?", "response": "Hey Tim,The physical version does NOT use Steam. However, if you buy the digital download version from Amazon it does use STEAM."}
{"product_id": "B00CX8VY4S", "context": "Can you jump in this game?", "response": "Nope. All you can do is climb or vault over objects witching a certain range."}
{"product_id": "B00BV72X1U", "context": "how does this work i got this in mail and disc wont read i think its too small", "response": "It doesn't work.  I had to get a refund."}
{"product_id": "B003O6CBIG", "context": "Can I Change the language???for example spanish?", "response": "i do not know much spanish"}
{"product_id": "B00ANHBJBY", "context": "How would this work for Smash?", "response": "It's supposed to be awesome for Smash. That is the reason my son asked for this controller. 1st Item I purchase did not keep a charge. So I had to send it back. I reordered a new one."}
{"product_id": "B00006B84X", "context": "Does this have a twist access or not? On CH website, it says it has a three way axis, which makes me think it does, but some reviews say it doesn't.", "response": "You have the X, Y and Z.  X being left to right stick, Y  being  fore and aft stick, and z being a wheel on the left of the stick.  There is no twist."}
{"product_id": "B00009ECGK", "context": "can I play this on windows 8", "response": "Yes you can play this game on win 8.  I have reinstalled this game on a new computer and it worked not only great but with zero extra steps"}
{"product_id": "B000IZAQD8", "context": "can it play ps1 games", "response": "Yes ps2 can play ps1 games"}
{"product_id": "B002CZ7P04", "context": "is is appropriate for children?", "response": "It is appropriate for all ages! I am 63 and love it!"}
{"product_id": "B007YLUCME", "context": "The controller won't turn on itself if I unplug the usb cord.  Is there a possibility of having a battery problem?", "response": "It may need to be charged longer, other than that it may just be that you havent installed the drivers correctly."}
