{"product_id": "B003NVMEVQ", "context": "When you click the mouse is the sound, soft or loud?  I need one that has as low noise as possible when clicking.", "response": "It makes a click but its not very loud. In fact i really didn't even notice it until i saw this question."}
{"product_id": "B00IAVDPSA", "context": "Does this controller connect to a Windows PC (like the Xbox 360 media remote)?", "response": "Windows Media Center on my HTPC doesn't respond to it so I'm going to say probably not."}
{"product_id": "B00HFZ5KCG", "context": "Is this unit region-specific?", "response": "Is it region locked? Is that what you mean? No it's not region locked."}
{"product_id": "B00DLDEKOK", "context": "Does the volume box move up so its not so close to where ya plug it ino the controller??", "response": "No it doesn't.  It's part of the plug assembly."}
{"product_id": "B0017Q4DGI", "context": "can you use this game on a mini Wii?", "response": "I don't know the answer to that question."}
{"product_id": "B00GS1TYIO", "context": "Is this Windows XP compatible?  I didnt see it on the description.", "response": "The box says Windows 8.1 / 8 / 7 / vista / XP  Pentium 4 or faster processor  2gb free disk space  1gb ram     DVD optical drive Hope that helps."}
{"product_id": "B004H7P0B6", "context": "Do these work with the wavebird wireless controller? The sticks on the wavebird look the same,but does anyone know for sure if they are.", "response": "I do not know if it works for wave bird but wireless controllers have a smaller sticks. This can cause problems and you might have to make adjustments to the sticks."}
{"product_id": "B005G4CXPK", "context": "This is just a pop into the disc drive and play version of Assassin's Creed, right? No set-up crap?", "response": "There aren't many computer applications that run that way. This isn't one of them."}
{"product_id": "B0076DO5A0", "context": "what are the system requirments on this game?", "response": "My box says: Windows XP (SP3) Vista (SP1).  Great game Fred, you will like it if you are into one man shooter games!  I usually play it a couple months apart"}
{"product_id": "B00E3667XQ", "context": "Is it worth it even IF I cannot use the streaming feature?", "response": "Yes if you use it as a tablet it is warry good :)"}
{"product_id": "B0002DQUH2", "context": "are the function keys separated in groups of four?  I am blind and that is easier to use", "response": "Yes.  That top line is as follows.  The Esc key is on the left end, by itself.  Then, moving to the right you have a space the size of a key, then F1 F2 F3 F4;  small space, F5 F6 F7 F8; small space, F9 F10 F11 F12; small space Print Screen, Scroll Lock, Pause."}
{"product_id": "B00CPKUV98", "context": "Is there any difference between the PS3 version and any other platform?", "response": "In terms of game play and story line there is no difference, control settings makes the difference between one platform to another."}
{"product_id": "B00I4A751U", "context": "is it in english", "response": "does it run pretty well on ps3 ?"}
{"product_id": "B00FLLFGO8", "context": "Will this hold an Lg G3?", "response": "Yes it does, seems like it's even compatible with tablets and ipad minis too. It's adjustable."}
{"product_id": "B00CERXJNW", "context": "Is this the keyboard that has 16.8 million color schemes", "response": "No. This is NOT the upcoming RGB mechanical keyboard that Corsair will release later this year.   This keyboard has 1 color LEDs."}
{"product_id": "B00BM7NXMW", "context": "does it need batteries? Mine just \"Went off\" and I don't know what to do", "response": "Nope, it's wired. Try contacting Perixx"}
{"product_id": "B005EQE0YM", "context": "Are these headphones wireless?", "response": "No they are wired"}
{"product_id": "B004UJNN5G", "context": "can a 11 year old play it?", "response": "Totally, EA has made the game pretty kid friendly. Unless your child knows how to mod the game it's totally PG-13."}
{"product_id": "B00576U8CC", "context": "Why does it take long for Defiance  game to download when you start the game?", "response": "If I'm remembering right, it's because the game is being updated from a server not related to Microsoft, and that server has (at least had) very limited bandwidth; also be prepared for the actual gameplay to be as slow and stuttering as the download."}
{"product_id": "B00FATRKWM", "context": "Is the controller included ?", "response": "Yes, one wireless controller is included with the console. It uses two AA (double A) batteries."}
{"product_id": "B00FM5IY38", "context": "Is there a way to tell if an Xbox One game is exclusive? PS4 games say \"only on PS\" etc. Am I missing something? I want to pick exclusives to buy.....", "response": "Unfortunately, there is currently no indicator for Xbox One exclusives on the game covers themselves. I would recommend using a guide such as this: http://en.wikipedia.org/wiki/List_of_Xbox_One_games."}
{"product_id": "B00E88G054", "context": "Is there any way to turn the lights off? The lights stay on, even when my computer is off.", "response": "It stays on...only way to turn it off is pulling out out of the sub"}
{"product_id": "B00HVBPRUO", "context": "Is it worth trying if I wear glasses? I tried a few headsets before and almost every of them was uncomfortable.", "response": "I would try them before you by them. I don't wear glasses but they hug your head tightly so it might be uncomfortable by your ears and temple but other than that they are out of the way. So I recommend  trying them and seeing if they would work for you."}
{"product_id": "B008XHCLFO", "context": "Does this game help alleviate hand cramps playing Mario Kart 7?  I am getting lots of cramps in my index fingers keeping them on the shoulder buttons.", "response": "yes, i had the same cramping problem and this totally helped my hands stay more relaxed. your fingers will curl around the bottom cushion and not the small plastic console. it comes as two pieces, screen cover and finger pad cover. any more questions, let me know."}
{"product_id": "B006PP404Q", "context": "Will this perfectly fit on PS Vita 2000 (slim)??", "response": "Got about 2mm extra on each side of lines up correctly."}
{"product_id": "B00BXE4W4C", "context": "where are all of the boards needed to repair the bridge?", "response": "Sorry - I was never able to get this game to even install - something was wrong with it - try a Google search for \"Veil of Mystery walkthrough\" - good luck!  :)"}
{"product_id": "B000WCCURW", "context": "Can you play this on Vista with 64 bit?", "response": "I did it. Right now I have Win8 64bits and still running!!"}
{"product_id": "B007SRM5MO", "context": "So why does the box say Internet connection required if the DLC is on the disc? Or is it only required for the Harley Quinn content?", "response": "I believe it's just for the downloadable content"}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "This headset can connect to an Xbox One controller via the optional Xbox One Stereo Adapter or the new controllers with built in 3.5mm jack shipping July 2015. My friends have said my voice is very clear on Xbox One and I'd say it's a perfect headset for using with both PS4 and Xbox One, especially at $13."}
{"product_id": "B00E4MQODC", "context": "Is there a slot in the battery compartment to store the USB nano-receiver when on the road, as with other Logitech gaming mice?", "response": "Yes there is. Underneath the battery cover there's a place specifically to securely store the USB dongle."}
{"product_id": "B0098EVZZ8", "context": "Is Battle Pack#1 compatible with the PC version? I would hate to make this purchase for nothing.", "response": "I'm  not 100% on that, as far as I know all the giants figures work on all systems. We have it for wii"}
{"product_id": "B00GV0LR64", "context": "Is this safe to use on plasma TV ?", "response": "yes, dozens of hours used on my plasma with no issues, other than finger prints from finding that perfect center."}
{"product_id": "B0057S9SYY", "context": "Will this work on my PC? I have another headset I want but the battery packs are cool. If it works on pc, is it wireless?", "response": "Optical digital audio output terminal (square) is required, but there is no operation guarantee."}
{"product_id": "B00ATF5YYI", "context": "does the PC download work on mac", "response": "As far as I know it does not"}
{"product_id": "B000HZFCT2", "context": "Is this compatable with windows 7 ?", "response": "Yes, it works just fine on my desktop, which runs Windows 7"}
{"product_id": "B00FB45YFQ", "context": "why wont the LED lights work? and/or the software show a setting for it?", "response": "Not sure, you downloaded the software and all right?"}
{"product_id": "B007OVHW90", "context": "Will it work for X42's?", "response": "Yes! For a while."}
{"product_id": "B009SJR28W", "context": "What do the LED lights C, 1 and S represent?", "response": "C for caps lock (uppcase characters when typing without hitting shift for each)1 is for numlock (when active informs the user that the numeric keypad is in number mode)S is for scroll lock (this is a legacy of the original IBM standard key board layout and performs different tasks based on the operating system and applications being used)"}
{"product_id": "B00DNGQTFI", "context": "For dragon ball z battle of z is it in english or japanese when they speak?", "response": "btw you can download this game from the PlayStation network store for $20 bucks now."}
{"product_id": "B0086UK7IQ", "context": "Anybody but me use gaming mice for non-game stuff?", "response": "Like the AutoCAD user, I find is amazing for SolidWorks design software. Not only can I fit tons of hotkeys as well as enter, shift, ctrl, delete, etc., but I can switch functions on the fly to numerical inputs to enter values."}
{"product_id": "B009DYOPK0", "context": "How big is this mouse? Full grip? I have big hands and don't like having to use claw grip when mice are too small.", "response": "I have pretty big hands and when i palm the mouse my fingers don't go past the side. It gives a nice, full feel when holding it."}
{"product_id": "B00DT55P94", "context": "Are all full games?", "response": "Yes. They're full games, but without booklet inside the cases."}
{"product_id": "B00ECOBFA4", "context": "is there a free play mode", "response": "You have to unlock The free play mode by beating The levels im pretty sure."}
{"product_id": "B00GANWVJE", "context": "can link be controlled useing the d pad or just the circle pad", "response": "He can only be controlled with the circle pad"}
{"product_id": "B0050SYDEQ", "context": "does this game have free roam?", "response": "Absolutely. That's what seperates it from the motorsports."}
{"product_id": "B00B1N07QM", "context": "Is this the stealth version? If not, are you going to be offering the stealth version on Amazon?", "response": "No. If you look at the orbweaver stealth page on Razer's website, the top image says \"razer store exclusive\" in the corner. They must not be planning on distributing it as widely, and it doesn't look like they will be offering it on any other site but theirs."}
{"product_id": "B00GZ1GUSY", "context": "Excuse me Does this game include Chinese language？thanks！", "response": "I'm sorry, it's only in English since I bought it in the US."}
{"product_id": "B00ATHFLZS", "context": "What color are the light on top? It looks different in every picture.", "response": "There's also a switch on the bottom of the mouse to turn the LED lights off, if preferred."}
{"product_id": "B0072A4JVW", "context": "Does it work well with the PS Vita Slim?", "response": "It works well for me. I have the original PS Vita not the newer version. I've heard the new one isn't as thick, so it may not work with it."}
{"product_id": "B000FP0K0U", "context": "can I make calendars from this????", "response": "Yes and much more.  I have other Printmasters but love my Printmaster 17 most."}
{"product_id": "B0096L2SJ0", "context": "Can you use this as a gamepad for your PC or Mac as well?", "response": "You may be able to get the driver for a PC, because it uses bluetooth. Check online."}
{"product_id": "B00EI4V3FU", "context": "Can these be used on Xbox? I can't see what kind of connection it uses to attach to the controller/system", "response": "No these p4c Turtle Beaches use 3.5mm and will not fit a Xbox Controller."}
{"product_id": "B002CZ7P04", "context": "How can you reset the game to play it from the beginning after locating everything?", "response": "Yep, start a new game, new profile.  :)"}
{"product_id": "B006KYYOSO", "context": "Can you play as the ogre on this one?", "response": "Yes. There both ogre and true ogre. Both good characters."}
{"product_id": "B0095D1CM8", "context": "Is the pinkie rest included?", "response": "Yes, 2 are included, with different texture each"}
{"product_id": "B000B6MLPU", "context": "This is to make the graphics better correct?", "response": "Yes that is correct. I have one still in the bag that I don't need if you'd like it"}
{"product_id": "B004RMK4BC", "context": "I am trying to ender a psn card to my account but it is saying that it is  no longer valid but i just bought the card 20 mins ago what could be prob?", "response": "Have you exceeded the psn amount you can have on an account?"}
{"product_id": "B00FYIXMHQ", "context": "I've never played Infamous 1 - Should you find a way to play it ( even if you don't own a PS3 ) before attempting Second Son?", "response": "It could help but it is not necessary. Entirely different story."}
{"product_id": "B0098F1Y3K", "context": "Will this work with a plain old ds player?", "response": "No.  The 3DS can play the regular ds games.  But I am unsure about the other way around.  You could try it but it may mess up your game.  Let me know what you come up with."}
{"product_id": "B00562O8U0", "context": "where can i get a charger for these glasses?????", "response": "I would go to any game store and buy a PS3 controller charger.  They work as well.  If all else fails, contact SONY and the PS3 customer service can help you out."}
{"product_id": "B00D96BORK", "context": "Does this Call of Duty Turtle Beach Headset work with the PS4 out of the box with nothing extra?", "response": "Nothing extra. It has everything it needs to work on a ps4."}
{"product_id": "B00AR1LX9O", "context": "Can you use mic and audio on the PC with a 3.5mm AUX cable?", "response": "as far as I know you plug in the receiver to your computer and use a headset wirelessly also it a standard jack you could even use it for your cell phone if you wanted to"}
{"product_id": "B005M2KSLC", "context": "I'm looking for a mouse with a middle-mouse button that's very easy to press. I heard Kana has a low pressure one. Is it?", "response": "I love this mouse.  It has a low profile and it has sensitivity settings."}
{"product_id": "B003VAHYQY", "context": "How long is the length of the cable?", "response": "It's a little over 6 feet"}
{"product_id": "B004L6C6BK", "context": "Is this the 2013 version because the review pictures show it as a 2011 version?", "response": "It's the new version"}
{"product_id": "B00G0OYHCW", "context": "How many can play on this at one time?  Also, what other devices do I need for the extra kids to play?", "response": "5 people can play at a time (depending on the game).  That requires purchasing 4 more controllers or using old Wii controllers.  Most people seem to prefer the Pro controllers to the Wiimote.  A lot also love the included gamepad, but only 1 of those is supported."}
{"product_id": "B00886XQNQ", "context": "is it compatible with the ps4", "response": "Not sure. Looking at the user guide it notes that it's compatible with the Xbox 360 & PS3.  The transmitter connects to the game console via USB power cable and a digital optical cable."}
{"product_id": "B00F4GSAYI", "context": "Why does it have a M rating?", "response": "Lots of blood and mature language"}
{"product_id": "B00IYWV5HS", "context": "On the Wildstar website, it states that the game comes with 3 7 day guest passes. Does this download give the same guest passes?", "response": "It sure does! They'll email the passes to you after a couple days and then you're free to send them to your friends."}
{"product_id": "B00CD90R72", "context": "What about the teams from Argentina, Colombia or Brazil, are there in this game ???", "response": "I can't answer you because I received the game broken but I'm almost sure that doesn't include these teams. However, there's a version of the game that include All these teams. It has Falcao on the cover with messi and other guy from juventus."}
{"product_id": "B00HG0B8NA", "context": "didn't download correctly  computer says it is not a correct win 32 product", "response": "I did not have a download issue.  I am running Windows 7 and Windows 8.1."}
{"product_id": "B00004XRBB", "context": "Anyone run this on windows 8.1", "response": "I don't know? I have windows XP."}
{"product_id": "B00G0OYHCW", "context": "How many can play on this at one time?  Also, what other devices do I need for the extra kids to play?", "response": "Up to 5  but the 5th is limited as kind of a helper, you need any of the Wii U compatible Controllers such as the  wii u pro  controller, the Wii mote will also work for the included game. The Wii U pro is probably your best bet for usability for all games."}
{"product_id": "B001O3066U", "context": "does scrabble champion edition by encore work with windows 8.1?", "response": "When I bought mine, it wasn't clear if it would work on Windows 7. I took a leap of faith and bought it, and it has worked fine. Very nice program"}
{"product_id": "B00E9I1FPI", "context": "Does it works in w8.1?", "response": "Should work ok as far as I know. Anything from W7 on up should work fine."}
{"product_id": "B00CJD4HD2", "context": "Is there any REAL problems with the mouse right now? because i heard of problems back in early 2013 about this mouse and I want to know if it's fixed.", "response": "If you can hear 15kHz frequencies, you may hear a high-pitched whine from the mouse when not moving it. This is due to some engineering problems with the ceramic capacitors used in the mouse."}
{"product_id": "B00HG0B8NA", "context": "does it run on Windows 8", "response": "Sorry but no it doesn't"}
{"product_id": "B009SJR28W", "context": "Are the keys noisy", "response": "They make a little noise, not as much as our regular keyboard though."}
{"product_id": "B0009VXBAQ", "context": "what games go with it", "response": "comes with all cords and sensor bar; no controller; gamecube compatible version of wii; console onlyballard850"}
{"product_id": "B00D96BORK", "context": "I have a Mac Air, and wondering what the connector/cable options are... is it USB, classic speaker/mic?", "response": "Play On AnythingGo from a console player on Xbox 360 or PlayStation 3 to a PC or Mac gamer to playing on your phone, tablet or mobile gaming device and back again with a quick switch of wires.  3.5mm, 4-pole auxillary cable,   RCA splitter cable"}
{"product_id": "B009ZDPYKO", "context": "Can this skylander be used with the new skylanders trap team new traptanium portal?", "response": "Not to my knowledge."}
{"product_id": "B00BDS415I", "context": "how do you charge it", "response": "It's not wireless, you don't charge it."}
{"product_id": "B003VANOFY", "context": "does it work with mac?", "response": "The headset will work on Mac. However, you can't have the 7.1 software on your Mac, and therefore, you can't have 7.1 in your headset. Stereo and mic will work just fine, though."}
{"product_id": "B00BDS415I", "context": "Can this headset be used on desk top computers as well? Also is this set good for listening to music with?", "response": "Yes, and excellent for music"}
{"product_id": "B001IYR53W", "context": "will it work with Windows 8.1", "response": "Not sure. It works fine on Windows 7. It doesn't really say it works on 7 either, but it does."}
{"product_id": "B00BMFIXOW", "context": "what is the region ?", "response": "It takes place in the Caribbean. I know the Bahamas are a travelable location and I think even Florida is on the map but that's like the top."}
{"product_id": "B0096L2SJ0", "context": "Will it work on emulated games?", "response": "Yes with 3rd party driver that is free."}
{"product_id": "B004N7HSGU", "context": "Are these capable of using USB for a PC hookup or are they the green/pink cables?", "response": "If you could find drivers for a USB hookup, they would work, but this does not include one. It only includes the TRSS cable and a splitter if you need to plug them into a Mic and audio jack."}
{"product_id": "B0038PBF1W", "context": "Can I play this offline?", "response": "Yes you can, but understand there will be a point which most people can't appear to get by. There is a chat line just on this hurtle."}
{"product_id": "B00D3RBZHY", "context": "Does this game have a split screen option for two players?", "response": "no unfortunately it isnt"}
{"product_id": "B00D96BMV8", "context": "Does it play game sound through the headset?", "response": "Yes it plays the sounds from the game and whomever you are chatting with."}
{"product_id": "B00BGAA3S2", "context": "Does the camera come with a mount? I've read and watched reviews and they show a mount included. I just want to make sure it comes with one or not.", "response": "Yes it does. It has thin articulated (hinged might be a better word) plates the same with of the camera (like the samsung tv cameras) that can be shaped as a stand or that supports the camera if placed on top of the TV"}
{"product_id": "B00D5WDI3G", "context": "will this work with windows 7", "response": "I have it installed on windows 7 and it works fine."}
{"product_id": "B00BMFIXKQ", "context": "can u play offline?", "response": "Of course! There is an entire story campaign to go through and even a huge open world to explore"}
{"product_id": "B00FENJVOE", "context": "I have completed the D3 game in PS3. How do I import my profile to PC?", "response": "You cant. There is no cross server compatability between pc and ps3. So u would have to start from scratch on pc."}
{"product_id": "B00IIHU44E", "context": "does it have blu ray", "response": "Sorry for late reply, it has blu ray"}
{"product_id": "B000056SPM", "context": "Does the control rod extend out of the back of the case, or is it completely enclosed? Thanks...", "response": "It extends out the back. It's not much though."}
{"product_id": "B00886XQO0", "context": "I have the Headset Adapter that came with another set of Turtle Beach headphones, can I plug these into that for my Xbox One?", "response": "Yes. All you need is the Xbox One headset adpater!"}
{"product_id": "B007VTVRFA", "context": "How can I be sure I have a version that will let me play off-line. Mine still says on the box that \"persistent internet connection required\"", "response": "They made off-line play available after the initial release. Every version should be able to play off-line now."}
{"product_id": "B00FC1UH82", "context": "Is this wired or wireless?", "response": "Hi there! It's wired."}
{"product_id": "B00F27JN8Q", "context": "Does Conception 2 work with PS Vita TV?", "response": "Yes, the Japanese version does, but I don't have the game to know if the US version does or not."}
{"product_id": "B00CBQO930", "context": "Does the scroll wheel click to intervals, or is it completely smooth?", "response": "It has pretty soft, but definitely tactile, clicks as you scroll it."}
{"product_id": "B002L6HJCI", "context": "Will the software work on windows 8 ?", "response": "It does work on windows 8. No issues"}
{"product_id": "B00EVWZHLK", "context": "includes subtitles in spanish ???", "response": "Only when the chaacters spoke in spanish"}
{"product_id": "B00CX7FQ4I", "context": "is this the one with Bruce Lee?", "response": "Yes u have to buy him in the dlc"}
{"product_id": "B004S5PBM0", "context": "Can two people play this at the same time with two different guitars?", "response": "As long as you buy a second cord for the guitar, you should be able to play with two people and two separate guitars."}
{"product_id": "B00ENFVS5Y", "context": "Why my alienware said it can not recognize this device? somebody please help me. How to get this work on pc.", "response": "Did you install the driver?  Is the light on the left of the base turning on when its plugged in?  You have to have both the usb and power cable plugged in."}
{"product_id": "B0050SZBP6", "context": "Do you get 30 days access to the game with this expansion?", "response": "nope. I actually got this RIGHT after my subscription expired. it stayed locked for a month or so when I finally broke down and renewed it."}
{"product_id": "B009ZDPYKO", "context": "is this the RED Tree Rex?  Not The BLUE one.", "response": "Yes this is the Red one :)"}
{"product_id": "B0051UMYLW", "context": "Does this collection run on Windows 8?", "response": "don't know don't have"}
{"product_id": "B0090WBXSM", "context": "How do you get this device in pairing mode?  My android box doesn't see it at all?", "response": "U dont. It wont work. Waste of money"}
{"product_id": "B00D6PTMB4", "context": "Does it work in a PS4?", "response": "No as per my knowledge, but some ubisoft PS3 can be upgraded by purchasing some activation code like Assassin Creed IV, pleas see the link below http://youtu.be/q2_G6Pthje4I hope that helpedenjoy"}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "I don't know,  I have win 7."}
{"product_id": "B00BMFIXZG", "context": "online multi player training works good but regular game play is slooooow motion whats wrong?", "response": "I had no problems on ultra with NVidia 760ti 2gb in Win7 64bit"}
{"product_id": "B009K7OFSC", "context": "what kind of surface does it do good on?", "response": "i have the glass pad from steel series, works fine"}
{"product_id": "B00H72EMP8", "context": "Is this good for people with big heads?", "response": "Yea they actually are I have kinda of a big head"}
{"product_id": "B00IAVDPSA", "context": "Will this Remote work for with the Hulu Plus, Netflix, and Amazon Prime Intant Video Apps on the Xbox ONE?", "response": "I can verify that the remote works very well with Amazon Prime Instant. I believe it works with Hulu Plus and Netflix but I have not tried either services."}
{"product_id": "B00FRESQYG", "context": "does it let you level boost a character automatically or do you have to grind to 90", "response": "Not the one pictured,but the newest expansion gives you the option to boost ONE character to 90."}
{"product_id": "B00JFPO7JG", "context": "Why can't I start the application after installation? Mine is window 8.1", "response": "There is an error with the Kalypso launcher. There is a fix on their website if you search for it"}
{"product_id": "B0086V5UF0", "context": "Does this game requires video controller or the Active floor Mat?", "response": "This game just requires the wii remote"}
{"product_id": "B00GHTP4ZY", "context": "does this include the main game plus the expansion or just the expansion???", "response": "it includes both the main game and the expansion pack."}
{"product_id": "B00576U8CC", "context": "Why does it take long for Defiance  game to download when you start the game?", "response": "Because it is an mmo and ALL MMOS have patchers. What you are on is a patcher, once it is done patching it will take you to the game. When there is a new update, it will take you to the patcher everytime."}
{"product_id": "B0050SX7BQ", "context": "This game is in language or subtitles in Spanish?", "response": "Its in English sadly"}
{"product_id": "B00AWEMODK", "context": "Is this supported by windows 8.1?", "response": "Yes it is.  You WILL have to make sure to allow it to install directX 9 and whatever else it wants during install.  If you do not, it will cause problems as windows 8/8.1 do not have native DX9 support."}
{"product_id": "B00JC9SWSC", "context": "hello, its the fat version or slim version?", "response": "hi, is slim version !"}
{"product_id": "B003JETPHS", "context": "Does it work with PS2 Guitar Hero World Tour?", "response": "only using it on Wii Steph.  Sorry. Like the others though, I don't see why it wouldn't."}
{"product_id": "B002CZ7P04", "context": "is is appropriate for children?", "response": "I really don't know as I bought this as a gift for my 43 year old Sister. She requested it last Christmas. Best Wishes!"}
{"product_id": "B0091WIOJ2", "context": "these headphones work with ps3", "response": "international order ? can i order from the uk?"}
{"product_id": "B0080RAT42", "context": "Anyone know if this works on a Raspberry Pi? Or try this out running Linux?", "response": "I use it with Linux on a PC, but need to use a special Linux driver available at https://github.com/robmcmullen/hid-atari-retrobit otherwise only the computer only detects two directions from the joystick (down & right)."}
{"product_id": "B00BI83EVU", "context": "Is this a ps4 game? Is there any violence in it or is it just about training gaurd dogs? I enjoy training dogs so this looks fun.", "response": "As B. Tipton said, no violence and you will learn how to train all breeds of dogs. There is exciting DLC that features Cesar Millan, and you work beside him on 3 intense levels where you try to get this Nova Scotia Duck Tolling Retriever and Treeing Walker Coonhound to not fight while company is over."}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "No, the audio plays on the headset and television simultaneously. I find myself turning the television volume all the way down so you can't hear it anymore and just using the headset. It sure helps when don't want to wake anyone up at night."}
{"product_id": "B008SBZD9G", "context": "Can I use a Xbox 360 game controller for the PC version?", "response": "Yes, you can also use a wired 360 controller as well. Just plug it in through the usb."}
{"product_id": "B00F27JE1C", "context": "What does this come with?", "response": "It comes with the vita console, charger and instructions all in the official playstation vita console boxing"}
{"product_id": "B000QJ1NS8", "context": "Does this come with the tri point screw driver? I ordered one that came w/ a Philips that doesn't fit.", "response": "Yes it comes with the necessary tri-screwdriver.  Hope this helps, thanks."}
{"product_id": "B00GJXMRX0", "context": "Is it compatible with windows 7?", "response": "Should be. I run it on Windows 8.1 with no problems, and 8.1 has more issues with gaming than 7 did in my experience."}
{"product_id": "B000PD0HQE", "context": "Why did this xbox come only with the xbox console? and not the cords!!!!!!", "response": "Who sent this and you can send it back and get your money back and i have one for sale if you want another one"}
{"product_id": "B003981JQ4", "context": "will this hold a DSi XL?", "response": "Yes I think it can hold an xl. I do not recommend buying this case though it is pretty poorly made."}
{"product_id": "B00I9UVY7G", "context": "in order to play the worldcup tournament should we connect to xbox live or we can the play the game witout connecting xbox live?", "response": "There are two modes. One where you can play it online against other people, or offline where you can just play it offline alone"}
{"product_id": "B008RA5DIY", "context": "can I get on from a remote location as long as only 2 others are on?", "response": "The short answer is yes you can.  You have to have a server set up (which you must have done) and be able to get through your firewall.  Perhaps you have security set up already and will need to use tunneling software from a remote location."}
{"product_id": "B001AWBYRA", "context": "Does this work with Windows 7?", "response": "yes it dose work on windows 7"}
{"product_id": "B005LN5UOC", "context": "Hello. You can hear the audio of the game? or just the audio chat?", "response": "Just the audio chat"}
{"product_id": "B00CMC6HCY", "context": "Is this game easy enough to pick up and play? My son is 6, loves WWE, but I'm not sure if this is too advanced for him.", "response": "It is pretty simple to play it takes a little bit to get use to the controls but he will have fun playing it"}
{"product_id": "B002I0H2G0", "context": "the game is a physical cd? or is a code to download it?", "response": "Physical one I played"}
{"product_id": "B00BMFIXEW", "context": "can i play with the wii plus control like a sword?? i mean if i have to move  like if i were figthing??", "response": "i havent tryed, but i think you can't.i will try to day."}
{"product_id": "B005S0KH7I", "context": "Is this keyboard mechanical or rubber dome?", "response": "Its not rubber dome, its more plastics type of feeling"}
{"product_id": "B00F9RGFEY", "context": "This does come with the USB light up device just like the regular prismatic headphones? Or does the tower replace that?", "response": "Tower lights as does the headset.  The headset does have the adjustable colors on each ear.  Highly recommended."}
{"product_id": "B008CXTW5G", "context": "Is this keyboard really 24\" wide?", "response": "Both pieces together are 24\".  You can detach the num pad and attach via usb and place wherever you want or just leave it unattached.  That brings length of the main board to 18.5\"."}
{"product_id": "B00CX7FQ4I", "context": "does this game allow two players (in the same room) to play each other with two controllers on your local xbox.like the orginal xbox did.", "response": "Yea you should still"}
{"product_id": "B00B312UDU", "context": "is the mouse a silent click mouse ?", "response": "If your asking if it's like the sound of a mechanical one no. Other than that it has the normal click noise... (Also depends on how hard you hit it)"}
{"product_id": "B000B6MLTG", "context": "So will this connect an Xbox 360 to an older, non digital tv -picture and sound??", "response": "Non digital tv- picture? If it has a female VGA port then it should work. The red and white is for a separate sound output. So like speakers. You can also get av to aux 3.5mm cord."}
{"product_id": "B007SO6USW", "context": "Does it come with a USB cord because mine is broken", "response": "it does come with a cord but an adapter to plug into the wall.  you have to have something to plug it into the wall with."}
{"product_id": "B004NRN5EO", "context": "Someone would tell me if this game is in Spanish or with subtitles in Spanish thanks?", "response": "That I am not sure about"}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "Yes, it requires the adapter, but it comes with the headset so you don't need to buy a seperate one."}
{"product_id": "B000CBWQUY", "context": "wifi can you talk on your ds all around the world", "response": "With Clubhouse games, yes, you can pictochat on wifi."}
{"product_id": "B00GBCLG0E", "context": "I know the games come as their own discs, but can you tell me is the online code inside the paper case packaging or is it found in the manual/paperwork?", "response": "It comes as a separate sheet of cardboard paper along with the other paperwork included in the box."}
{"product_id": "B004RMK4BC", "context": "If I make a purchase do I get the code immediately? How would I get it Via Email ?", "response": "yes, in less than 2 minutes, just pay and put your email, basically just follow all the steps"}
{"product_id": "B00GHTP7SS", "context": "do i need game controller to play or can i use a keyboard", "response": "You can use your keyboard. I use it too, but it's not comfortable. When you want to do a bigger combo, it is impossibble to make it succesfull. So I recommend controller to play."}
{"product_id": "B007MM9E42", "context": "Can you play this game with two paintbrush controllers ? The clicker is very expensive and not very good.", "response": "already this game doesn't work ! and i send this issue for supplier, no answer !!!"}
{"product_id": "B00AJXEYOG", "context": "What games are included on this program?", "response": "Miss Red, Cougarlicious, White Song, Ladies, Wolf Run2, Billy Goat Bucks, Blackbeards, Boingy Beans, Bonus Bubbles and Crazy Chameleon, Wild Red Sevens."}
{"product_id": "B000J18SR2", "context": "can it run on windows 7 or 8.1", "response": "I had a problem with the first disc on windows 8. The second one worked fine. I don't have 8.1 because it was giving me problems so I downgraded to 8. I had to load the firs disc on my wife's xp desktop."}
{"product_id": "B00IJQJYHC", "context": "Does it have a good key response? I know it's not a mechanical one, but I like the mechanical, how does this compare?\"", "response": "It feels like a membrane. Kind of mashed potato like, no tactile."}
{"product_id": "B00GJ2HZ7E", "context": "Do you get separate Steam keys for each game?", "response": "Yes you get individual keys for each game and dlc."}
{"product_id": "B006QRMR4S", "context": "Is this a US 3DS? I bought US 3DS games, but can't play them on my Australian 3DS because the DS is region locked, so i'm looking for a US 3DS.", "response": "I couldn't say yes or no for sure. You'll want to contact the seller to double-check the region code on the console. I used a different seller & mine (in purple) plays all my US DS/3DS games just fine so far."}
{"product_id": "B001H4NMNA", "context": "Do you have to plug this into the PS3 or can you use a wall outlet to charge the remotes with this?", "response": "Plugs into the wall"}
{"product_id": "B0050SWBAE", "context": "Should I have played other Pikmin games before playing Pikmin 3?", "response": "Not really but those games are really great 2 is my favorite"}
{"product_id": "B00H8NS1K8", "context": "What systems do these work with? or just PC?", "response": "I think it can work with any system"}
{"product_id": "B009ZDPYKO", "context": "Is this figure for the Wii?", "response": "No. This is answer is coming from my 7 year old son. I cannot confirm it."}
{"product_id": "B0017KIBAI", "context": "Is this an official Nintendo Product and does it work with US Wii consoles even though it says \"Use in Japan only\"?", "response": "I'm from Uruguay and i had no problem at all. I don't know where my wii is from, but I'm sure is not from Japan."}
{"product_id": "B00ENFVJJO", "context": "does it charge one controller at a time even if you dock both at the same time, and automatically charge the second after the first?", "response": "it charges both at the same time with no issues"}
{"product_id": "B005FMLZQQ", "context": "Can you set the volume button to control your surround sound? Also can this turn on/off your surround sound box?", "response": "I have the Xbox 360 surround system made by Pioneer. Does anyone think it may control that surround system?"}
{"product_id": "B008J16AH4", "context": "does this game have multiplayer mode?", "response": "You cannot play two people at the same time."}
{"product_id": "B0022TNO7S", "context": "is it the same guy in GTA 5 name Mike :/", "response": "What? No. The name of the guy is on the box."}
{"product_id": "B00D96BPL0", "context": "What adaptor do I need to purchase to be able to use these on an xBox one?", "response": "The one with the headphone jack. GameStop has them if that helps."}
{"product_id": "B00BI9MDSO", "context": "It's been about 2 years since it was released. Can it now fit the PS Vita Slim comfortably or do you still have to push on it hard?", "response": "Fits very nice and snug."}
{"product_id": "B00GGUMV46", "context": "Is this the game and the extras or just the extras for the game", "response": "This season pass gives you access to paid exclusive content for The Last of Us. However, it is extras. While this pack makes additional content available to you, you still have to buy the full game. The season pass does not include it."}
{"product_id": "B0091A3AHA", "context": "Will it work with the Xbox One, PS3 & PC? Does it have speakers & HDMI? How is it powered?", "response": "It does have one HDMI connector.  The monitor has it's own speakers and hat are powered by the monitor's power supply.  It's supposed to work with the PS and the Xbox one but not having either of those I can't verify that."}
{"product_id": "B00IVHQ0KI", "context": "can i drift on that in forza horizon 2 ?", "response": "IT work real good  but real sensitive"}
{"product_id": "B009LGO88E", "context": "what does it do", "response": "That's easy, serves to simplify the gameplay by adding the use of a second stick instead of the touch screen, for games like resident evil, KI: Uprising, monster hunter, etc... :D"}
{"product_id": "B002I0J51U", "context": "Does this come with the charger, or do I need to buy one seperately?", "response": "If you buy new, then it will come with a charger cable that plugs in to the PlayStation. If you buy it used, it depends if the seller will include that cord with it or not."}
{"product_id": "B00CMSCTA2", "context": "Is there a suggested resolution at which to play the game?", "response": "can't even download it after paying let alone choose resolution"}
{"product_id": "B005UI8V6C", "context": "How do you get all three games to download only the Traitor Soul will download?", "response": "All three games are in one. To get to the other areas, through Druantia, click on the fountain in the middle of town."}
{"product_id": "B007TYC8MI", "context": "It is in Spanish or English ?", "response": "You can change the language in this one :)"}
{"product_id": "B00CTKHXFO", "context": "which to buy, Legacy or HD Collection? do I need both? differences? thanks in advance ~ from: a noob.", "response": "Basically the Legacy Collection is everything, the HD collection is only Metal Gear Solid 1,2 and 3. As far as I know the HD version of Metal Gear Solid 3 also includes Metal Gear 1 and 2. But if you want to play MGS 4 and Peacewalker as well, you gotta get the Legacy Collection."}
{"product_id": "B001EYU1WS", "context": "If i wanted to use this to control something on another game besides FS, Could i use a program similar to \"Xpadder\" to map the controls?", "response": "There maybe a chance you could, my recommendation is go to saitek website go to the support tab and ask them if they have a software download that would allow you to map the controls for the game you want before you buy it. This way you don't have a paperweight that you paid for."}
{"product_id": "B00AYBKQRW", "context": "My LG remote No. 6711A20111H has broken and I need a replacement. any ideas?", "response": "I bought 2 from Amazon and they work fine."}
{"product_id": "B00CTKHXFO", "context": "it really has all of the mgs games from mgs1 to mgs4? including snake eater?", "response": "It has all except mgs portable ops (psp) and metal gear acid 1 & 2 (psp)"}
{"product_id": "B00CTKHXFO", "context": "Do you need to download patches for both of the included discs?", "response": "Don't know yet.  Haven't made the time to start on them, but given that every game gets a patch of some type or another, it's a safe bet."}
{"product_id": "B004G5TUJM", "context": "does it work with midnight club", "response": "Usually I ships within 1-2 weeks."}
