{"product_id": "B00HG0B8NA", "context": "I get the following error while updating the game: \"The application could not be installed because an application with that name already exists...\"", "response": "It works OK except you can't change settings (like speeds,7 etc.)"}
{"product_id": "B00CD1FC6G", "context": "What dose the BIOS switch do on the top of the keyboard?", "response": "Crap, sorry didn't read the question all the way the first time. Bios switch is for the situations when your motherboard does not see your keyboard form the star. It has 4 different settings so older boards can recognize it too. I have no idea if it works correctly, did not try it myself."}
{"product_id": "B004NRN5DU", "context": "Is this game worth getting if you don't have online? I've really wanted to play it, but I don't want to feel like I've been \"shortchanged\".", "response": "I've only played offline and I would say definitely yes."}
{"product_id": "B00CRL9TU2", "context": "If I install GT6, can I still play GT5 on the same machine? I'd still like to race the awesome cars I earned in GT5 even if only in GT5.", "response": "Not sure with gt5. But I have gt4 installed with gt6 I just put in the dusk for the one I want and play it.  I would assume you can do the same with gt5.  Hope that helps."}
{"product_id": "B00D9FQ9CQ", "context": "Is this console compatible with the preconfigured xbox 360 flash drives you plug into the usb port?", "response": "I would have to a yes maybe since it's also a xbox 360 but do I know for sure no so for now buy it and try it if it's work then it's a yes if not sorry"}
{"product_id": "B00F27JE1C", "context": "Does this model come with a memory card?", "response": "Mine did not, what I can gather from the Japanese on the back of the box, I don't think it's suppose to."}
{"product_id": "B00E447L8C", "context": "Can you charge a tablet with the 3000 vs. the 6000?", "response": "Presumably yes- there shouldn't be any reason it can't work"}
{"product_id": "B004AM5RAW", "context": "Does it get hot? With the way it's shaped it seems like it would get a little hot...", "response": "YES! I found it got very hot sometimes. It stays fairly warm, but I can only recall one time it was actually uncomfortable. For the most part I didn't notice."}
{"product_id": "B00656HLGO", "context": "is this internal or external", "response": "It attaches to the console via proprietary port. So it's essentially external and snaps right on. However  It functions like an internal drive as its not USB connection."}
{"product_id": "B0076DO5A0", "context": "what are the system requirments on this game?", "response": "OS : Windows XP, Vista or Windows 7, with the latest Service PackCPU: Intel Core 2 Duo at 2Ghz, or AMD Athlon 64 x2 2Ghz, or betterRAM: 2GBVideo Card: NVidia 8800GT with 512MB RAM or betterHDD: 9GBDirectX: 9.0c and a DirectX Compatible Sound CardDVD-rom , mouse, keyboardInternet connection required"}
{"product_id": "B00G0OYHCW", "context": "How many can play on this at one time?  Also, what other devices do I need for the extra kids to play?", "response": "you will need wii u plus remotes to start off with then you can build up. the controllers like wii u pro controller and other accessories. good luck and have fun."}
{"product_id": "B00F27JDY0", "context": "Can you change it to American or is it only in japanese?", "response": "Alex said it perfectly"}
{"product_id": "B008UQWX0Q", "context": "Where is it manufactured?  Does it come with a charger and stylus?", "response": "I dont remember where its manufactured. I does not come with a stylus or charger, and mine came with a broken screen."}
{"product_id": "B009DYOPK0", "context": "I was wondering on a level 1-10 how loud the clicks are? odd question but gaming annoys the girl friend lol", "response": "Definitely not the quietest mouse... fair would be 5 or 6, but if u/ur gf is the type to complain about fan noise then easily a 10."}
{"product_id": "B00EF1OGOG", "context": "Do you HAVE to shake it to start the charge or will it start charging your phone as soon as you plug the cables in?", "response": "To be honest, It's been charging right when I plug it in at times."}
{"product_id": "B0038PBF1W", "context": "will this work on windows 7", "response": "Yes is does work very well on Windows 7. It is a frustrating game to get past the third mission. I've been on it for months with now success. Many are so frustrated they created a blog to solve it."}
{"product_id": "B00DHUUTEM", "context": "how do you turn the keyboard lights on", "response": "When you plug in the usb to your pc/laptop they automatically light up !!!"}
{"product_id": "B00EM5UFF4", "context": "Two Xbox live accounts needed to split screen for two players for online gameplay?", "response": "Xbox Live on the Xbox One is shared by the primary account.  So long as there is one Gold membership associated with the Xbox, any other Silver account can play online using the Gold accounts subscription."}
{"product_id": "B00BFOEY3Y", "context": "Does this G700s work on glass? I have the Logitech MX performance, and want more macro keys.", "response": "I have both. The G700 will not track on glass anywhere near as well as the MX. It does get some traction on glass but you will feel like a symphony conductor with the amount of arm waving necessary to move your cursor across the screen, messing with the DPI doesn't help this much."}
{"product_id": "B002AQNT96", "context": "is this redeemable on steam or do i just get the game and thats it i boot it from the disk", "response": "I got it from the disk I dont know if you can through steam"}
{"product_id": "B00BM7NXMW", "context": "Can the DPI buttons (+/-) be remappped, such as making them +/- zeroing for a scope?", "response": "yes they can be. you can map them from the config setting profile you can make up to 5 profiles"}
{"product_id": "B005EQE0YM", "context": "Are the cups on this headset circumaural (fit around the ears) or do they lay on the ears?", "response": "For me personally they fit around my ears.  The inside cavities (the inside part with the logo on them, not the cushions themselves) are approximately 3 inches high and 2 inches wide, if that helps."}
{"product_id": "B000BAVN14", "context": "Will this work for Macbook Pro? Running OS X Mavericks?", "response": "No. This is the PC version. You'd have to buy the MAC version. Just search 'The Sims Complete Collection Mac' I'm pretty sure there is in a Mac version for The Sims."}
{"product_id": "B00CH923NE", "context": "Is the dream world too cheesey? Or is it not?", "response": "My son, age 5 and my husband love it.  It's a little harder for my son because he can't read well yet."}
{"product_id": "B0000695GX", "context": "are any of the roller coaster tycoons playable on windows 8?", "response": "I know this isn't an answer but just wanted to say thank you for asking the question! I was about to ask the same thing and now I don't have to wait for a response! Excited to buy this now."}
{"product_id": "B008X73CE8", "context": "will this run on windows 8.1?", "response": "I am running it on 8.1.  Seems a little slow loading."}
{"product_id": "B000RA778G", "context": "I love this game but now Im not able to play it and Im not sure why please help I miss my game", "response": "also make sure there is no finger prints or dirt on the disc before reinstalling it  what os do u have"}
{"product_id": "B005QUQP80", "context": "Is this keyboard compatible with Windows 8?The Corsair Website says \"yes\" while the spec information here says \"no.\"", "response": "We've only used it with Windows 7. sorry."}
{"product_id": "B002DUCF7Q", "context": "can in work with Win8?", "response": "I don't know.  Personally, I think Windows 8 is bad for gaming in the first place.  It definitely works with Windows 7 home 64 bit though which is what I got.  I also refuse to use Windows 8 because of how bad it is for gaming."}
{"product_id": "B000WCCURW", "context": "I have windows 7 can I install it? I just bought it", "response": "If you optimize compatibility watch this video https://m.youtube.com/watch?v=xLiE-R7MCZk"}
{"product_id": "B009XZ1CTQ", "context": "Will the physical CD version work for Windows 8?", "response": "yes i have it on a windows 8"}
{"product_id": "B007LQG9A6", "context": "Does This Work With Windows 8 and I would like to know how this product preforms from a actual owner of this product thank you!", "response": "I have seen people use xbox controllers on the PC. They port over nicely and are probably the best controllers to use if you have a 360 already."}
{"product_id": "B005S0KHIC", "context": "Has logitech fixed the issues with their G9X mice having a high pitch whine?  My last G9X would emit a high pitch noise when it wasn't moving.", "response": "I havn't had this issue at all"}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "Thats correct. Lights up after starting simulator or the driver software program."}
{"product_id": "B008CP6Q6M", "context": "Does this game sold from the Official Amazon, will it include ALL Discs and DLC Codes? Alot of people have been complaining about missing games.", "response": "Yes all discs included but we have no guarantee that the codes have been used. It is a used item."}
{"product_id": "B004S5TDUQ", "context": "Does the game work on windows 8?", "response": "Yes. I'm currently using Rocksmith and Rocksmith 2014 on Windows 8."}
{"product_id": "B007WPM9GO", "context": "I just want to confirm this works with the regular nintendo 3ds?", "response": "Hi! Yes, this particular Nerf case protector will fit a regular size 3DS. You'll be pleased with it, if you plan to purchase it."}
{"product_id": "B00BGA9YZK", "context": "Is this just another graphical showcase like Ryse was for the X1 or is there an actual game hidden in here?", "response": "This is a good game. Visual, gameplay is great. I get a bit disappointed with the gameplay online. I love the PS3 KZ3 online play, which i consider much better than this one"}
{"product_id": "B00ERDGMSA", "context": "does it work with win8 or win 8.1", "response": "Work perfectly with win 8"}
{"product_id": "B00CD1FC6G", "context": "Is the wrist-rest removeable?", "response": "YES , wrist rest is removable."}
{"product_id": "B000056SPM", "context": "does it works with car simulation game?", "response": "I have no idea, Herman"}
{"product_id": "B00CJ7IUI6", "context": "Is the DLC in the disc or is it a download code?", "response": "Dlc is in the disc (no code)"}
{"product_id": "B00FOHP8XI", "context": "this \"PlayStation 3 250GB Console - Blue Azure\" includes the vertical stand?", "response": "No I don't believe it does"}
{"product_id": "B000VTQ3LU", "context": "does this have the tv clip or do you need one", "response": "You would need to purchase clip seperate but you can use Velcro it works fine ."}
{"product_id": "B0061PAZUS", "context": "does this work in Xbox 360 Kinect NTSC-J model?", "response": "it does not play in xbox 360 with NTSC-J model. I just tried mine now and it gives a wrong region error. SAD.. :("}
{"product_id": "B005EQE0YM", "context": "Would this be a useful headset for other PC applications, specifically Skype?", "response": "yes. they will work on a pc."}
{"product_id": "B00BHSTXV6", "context": "Approximately how long is the cord?", "response": "Its actually a pretty long cable for a keyboard. It is about 5 to 6  feet. I would measure it with a tape measure but it is zip-tied down to my desk."}
{"product_id": "B00BI9MDSO", "context": "soooo, my new Vita Slim PCH-2001 won't fit in this case? Thanks.", "response": "It fits my PCH-2000 slim perfectly. It seems the title is very deceiving as it doesn't fit any other version according to various reviews."}
{"product_id": "B003S9WJ9A", "context": "Do you need 2 xbox's to transfer? I want to move my games from my 120G HD to a new 320G", "response": "All you need is one xbox and a transfer cable. You install the hard drive you want on to your Xbox, then take your transfer cable and plug it into a USB slot, then you plug your old hard drive into the transfer cable and your xbox should ask you if you want to transfer data."}
{"product_id": "B00EEMLRTS", "context": "If I bought this and bought a xbox one later, can it be transferred later? I had read somewhere that it was possible.", "response": "Which do you mean? Going from Xbox 360 to Xbox ONE or Xbox 360 to Xbox 360? Destiny lets you keep content, I don't know about Call of Duty."}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "I first used it on Windows 2000 and it still works on my computer now with Windows 7. I would assume it works on all Windows systems between those two unless there is some quirk I am not aware of."}
{"product_id": "B0089NVTDM", "context": "Does this work on a Wii U to play the newest Smash Brothers? Can someone Confirm yes or no?", "response": "No, it does not work on the Wii U."}
{"product_id": "B009Q5XGO2", "context": "Does this work with the Energizer 3x Charing station?", "response": "I am not sure as I do not own that station. It does fit on the official Nintendo charging station that came with the Deluxe Wii U."}
{"product_id": "B007Y7OP8K", "context": "Is this game H or non-H?", "response": "This is an H game"}
{"product_id": "B006PP4136", "context": "Can the PSVita fit in it?", "response": "Yep! Fits just fine. However I must warn you that it only protects the Vita from scratches and minor things. There is no hard shell to keep it from shattering if dropped from a high height."}
{"product_id": "B00F27JE1C", "context": "can it play american games?", "response": "Yes, and the controls are the same when you play American games. X and O are not switch for American games."}
{"product_id": "B001AI7CF2", "context": "where do the gamecube controllers connect to the wii", "response": "There is a hinged cover on the top when the wii is in the stand."}
{"product_id": "B003ZSP0WW", "context": "I just got 2. I turned them on and their power buttons just blink - they don't connect. I tried hitting the console power button, too. What do I do??", "response": "There is a small black button on the console above the USB port that you push. Then you press the sync button on the controller as well and they should sync"}
{"product_id": "B0072A4JVW", "context": "Will the grips still fit on the vita if it has a case on it? I have the eForCity snap on crystal case", "response": "I don't have the eForCity crystal case, but looking at the pictures and thickness of it, I'm about 99% certain it wouldn't fit. The PDP trigger grip already fits very snugly. The Vita snaps in and pops out and doesn't have any room to move. The frame for the grips is hard plastic, so it really won't stretch."}
{"product_id": "B00886XQO0", "context": "This or turtle beach xp510 ? Is there differences between these two headsets?", "response": "Hi man! This two Turtle Beachs are good, and have no difference. The only difference in on the visual, cause Tango version, is a Call of Duty version of the same product."}
{"product_id": "B00BGA9V2Q", "context": "Does Diablo III on PS3 allow offline(Local) multiplay? In the other word, can 2 people play D3 on one PS3 at the same time?", "response": "yes you can online and also off line to. 2 people at the same time."}
{"product_id": "B001H4NMNA", "context": "Should I unplug this after my controllers are fully charged or just let the green light sit?I don't use my ps3 often so it kinda seems like a waist?", "response": "Yes, that would be fine.Because I left mine plugged up since the day I got it, and the green and the red lights are malfunctioning.If you leave it plugged up, chances are it could fry."}
{"product_id": "B00DBDPOZ4", "context": "Is this product essentially the same as putting 2 aa rechargeable batteries into the controller and just plugging a micro usb until charged?", "response": "No Only rechargeable batteries"}
{"product_id": "B0017HLYNC", "context": "Is this for adults or would it be appropriate (language, content, scariness, etc) for a 10 yr old? We've enjoyed the Nancy Drew games.", "response": "It's appropriate for a 10 yr old"}
{"product_id": "B00DGZDFLW", "context": "Is this game independent of Steam?", "response": "It IS independent of GFWL though, which we should all be grateful for."}
{"product_id": "B00F9RGFEY", "context": "Are these on-ear or over-ear headsets?", "response": "there are over-ear headsets"}
{"product_id": "B00D96BJSO", "context": "Is this headset also compatible with the Xbox 360?", "response": "Turtle beach xo seven are made specifically for Xbox one. But you can get any set except wireless to work by using the adaptor, witch is included in the seven box. AAC any store and they tell you the same."}
{"product_id": "B00EOUL7T0", "context": "Will this work with the Tritton TRIGGER headset?", "response": "It didn't for mine"}
{"product_id": "B000BU0F5Y", "context": "does it have onboard memory? so i can program a macro, and take it to the ps4?", "response": "Yes,the Manual will explane it better than I could.Your gona injoy this."}
{"product_id": "B001GROEEO", "context": "Is there any difference between \"Playstation Network Prepaid Game Card\" versus a \"PlayStation Store Gift Card\"? Is the PSN card just the old version?", "response": "the only difference I see is the price, it costs 57 black and blue 49.99"}
{"product_id": "B00009W5WB", "context": "What is that cable used for?", "response": "The original xbox controller.....the very first one"}
{"product_id": "B0050SX9I2", "context": "does anyone know if it works with vudu app?", "response": "I know it works on Netflix and Hula on ours so it should work on any apps on the PS3."}
{"product_id": "B00H3VJYD8", "context": "Does it work on Mac?", "response": "It does. It works better on a Mac, actually. If you have any trouble with it, you can download a driver for it from the Xbox site. Shouldn't be a problem loading it though. Once you plug the controller into the USB port, let it load. All of the drivers should automatically download for you."}
{"product_id": "B005UI8V6C", "context": "can i play this game solo", "response": "Yes. It's a one-person game. Very fun."}
{"product_id": "B004G5TUJM", "context": "does this work on all racing games even nedd for speed games", "response": "I haven't tried myself but reading in several other pages it seems that latest games of that series doesn't support wheel at any of their versions"}
{"product_id": "B0036WTVNG", "context": "I got one.......says to put in disc but it did not come with one.", "response": "Odd. i got my own cause it wasn't suppose to need a disk. however I found out that does need a profiler of some sort. i really prefer the microsoft x-box controller since it's easier to setup but i got this cause i wanted something that should work under linux"}
{"product_id": "B0058FAEAS", "context": "Is it compatible with Mac?", "response": "Yes; I got for it for use with X-Plane 10 on a MacBook Pro Retina running Mavericks."}
{"product_id": "B00AAQRNQ8", "context": "How does this feel in the hand? Cheap? Sturdy?", "response": "It feels good. make sure to put the weights in it :)"}
{"product_id": "B009XZ1CTQ", "context": "Some reviews say you need steam installed on computer to play---What is STEAM ?", "response": "it is a catalog of PC, Mac, and Linux games, many of which support Steam Play so you can buy once and play anywhere, and Cross-Platform Multiplayer so you can play with all your friends, no matter where they log in"}
{"product_id": "B00503EAG2", "context": "How long does this take to install complete?", "response": "About an hour and a 1/2, dep. on ISP and computer"}
{"product_id": "B002J9GDXI", "context": "Does this mouse have volume control?", "response": "you can configure it to ajust the volume"}
{"product_id": "B0057SDCLY", "context": "will the tritton trigger work on a mobil phone or tablet?", "response": "I don't think so. There is a wireless module that connects to the TV and transmits the audio. Don't know how u would hook that up to a cell. Get a Bluetooth wirelease head set."}
{"product_id": "B001BZ2F56", "context": "Is this software work well with Windows 7?  Based on reviews, it didn't seem like it.", "response": "my wife has a laptop that runs windows 7 thats 3 yrs old and it works great with no problems so far.... installed the game and operates well"}
{"product_id": "B003O6JJKY", "context": "comes with everything? Cable ready to play brings control and a 250gb hard drive? brings some game?", "response": "yeaah  comes w everything !! good deall"}
{"product_id": "B0053BCO00", "context": "Do both players need to have game cartridges for two people to play on wifi?", "response": "Yes, if you wish to play with someone far away from where you are, you both need cartridges...you can play on wireless though, without cartidges. Although the person without the cartridge will be a Shy Guy.Have a nice day :)"}
{"product_id": "B00BGAA3S2", "context": "Which the contents of the pack? Comes with the support?", "response": "Comes with a little thing to mount the camera on that sits nicely on top of a flat screen. I still don't know half the voice commands though."}
{"product_id": "B00D6PTMSW", "context": "I have an xbox360 with only 4gb of hard drive. Can this game be played directly from the Disc without requiring game installation in the hard drive?", "response": "Its okay. You do actually play a song  than you hit chords very strange.  Than you play a song it;s  off a little in the timing of the song. Thumps down. I guess thats why there is no 15 edition."}
{"product_id": "B005M0KSIM", "context": "I am thinking of buying the physical copy (since the pc download feature seems unavailable.) If i get the physical copy can i use it on steam?", "response": "Yes you can.  In fact you need Steam to unlock the game."}
{"product_id": "B00AKIPBNS", "context": "What's so special about Fire Emblem Awakening compared to it's predecessors?", "response": "I have not played any other Fire Emblem games.  This game is my favorite of all DS games because it is not childish, has adult voices, wonderful storyline and great interaction between characters.  I intend to play it over again, making different choices of character pair-ups, strengthening more characters.  It is an intelligent, well written game."}
{"product_id": "B00EW6QT76", "context": "what is the size of the hard drive", "response": "It has a 500 gigabit hard drive"}
{"product_id": "B00D6PTMSW", "context": "Aside from the game and guitar is there anything else you need to purchase? I know nothing about guitars and this is a gift... is an amp required?", "response": "No amp required.  Just plug in your guitar to your xbox and away you go."}
{"product_id": "B007LQG9A6", "context": "does it work on a xbox 360?", "response": "I sent mine back ten minutes after opening it and trying it out.. Very disappointed"}
{"product_id": "B00AIALGZK", "context": "is this download the full game or a free trial", "response": "Hello guys, I like to play it, you need a lot of time, Until you can go a long ways. Worth playing legit, it's not expensive."}
{"product_id": "B0005PHYPO", "context": "Will this load on Windows 7?", "response": "You will need to download a DOS emulator to run the game"}
{"product_id": "B00D9EPI38", "context": "do you have to pay for internet?", "response": "As of this past summer, you are no longer required to subscribe to Xbox Live to use apps such as Netflix, Amazon Video, and HBOGo. The only thing you need the subscription for now is multiplayer gaming."}
{"product_id": "B00J128FPA", "context": "Do you have to pay a subscription fee for the first month if you buy the collector's edition?", "response": "There is a trial period"}
{"product_id": "B007YLUCME", "context": "How do you turn it on after unplugging the usb?", "response": "Hi ^.^. Make sure that the wireless dongle is plugged into a computer usb port that your using. After that! If the controller is charged, just press the middle round button. That says ANALOG.. <<<< It's literally in caps. Just press it. And It will sync. Hope that helps! If it doesn't let me know."}
{"product_id": "B002I0JJ2U", "context": "does this game still work and can you play it on windows", "response": "No this game no longer works it is a scam. Many people have tried having this ad removed but they just keep sending copies. This game is a mmorpg with no online servers. You won't be able to play it."}
{"product_id": "B002672Z80", "context": "Do these Have Wii Motion Plus?", "response": "No and they don't work with the wii motion plus."}
{"product_id": "B00FE8WKPQ", "context": "Can you use this in a Wii?", "response": "The balance board itself is compatible with the Wii. However, the Wii Fit U game and fit meter are only compatible with the Wii U."}
{"product_id": "B00FQFFQ2Q", "context": "can you make you own cars in this game?", "response": "Just color and decal the prexisting car, with a small selection of options (most decals can't be colored)"}
{"product_id": "B00DPQ6GPO", "context": "I am a black ops 2 player on ps3. I like using single shot guns, like the FAL, and pistols, like the five-seven. Is this a good controller for me?", "response": "It works good for that it also has different auto fire options to fine tune it but I just use the first setting because it's as easy as just hiting the button once."}
{"product_id": "B00B98HBTA", "context": "is it two player", "response": "Yes, this is a 1-2 player game"}
{"product_id": "B000BD9PBQ", "context": "Palm Tungsten E2 Compatiblility Is this item good for a Palm Tungsten E2?I need to know before ordering it.Thank you", "response": "I am on the same situation with the Palm Tungsten T5. They never mentioned Palm OS as compatible :-("}
{"product_id": "B009YKVRYA", "context": "does it work with windows 8", "response": "I can't say; I have Windows 7."}
{"product_id": "B0098W4ZD4", "context": "does this work with mac", "response": "The mouse and its software work with Mac OS. Just as a side note, you will have to download the software for the mouse off of their downloads site in order to get the full benefit of the mouse (http://madcatz.com/downloads/)."}
{"product_id": "B006JSY3MI", "context": "Do you need internet when using this game?", "response": "If you are buying the PC version, then yes; you must have an internet connection. Also you have to have a Steam account otherwise game will not work. A steam account is free to set up if you do not have one."}
{"product_id": "B0083H4NG4", "context": "Does this mouse have a \"Sniper\" Function?  IE..can you lower the DPI by pressing a button, then release it and go back to your normal DPI?", "response": "No, it doesn't have a sniper function by default. I believe you can program one of the buttons on the sides to do what you're asking for but it's also very convenient to switch DPI through the switch-like control that's located just below the scroll wheel."}
{"product_id": "B00F27JDUY", "context": "Could i change the language", "response": "Yes we could! The default language is English, but you can choose any languages!"}
{"product_id": "B00ATHFLZS", "context": "Is this mouse compatible with mac?", "response": "If your using it for gaming yes. I'm sure it is compatible to the mac, it just a regular mouse nothing to special but the design, it's a great mouse."}
{"product_id": "B00004XRBB", "context": "Does this work with windows 7", "response": "Older copies of this do not work on windows 7 64 bit OS systems , however   I am happy to report that the particular version I recently purchased works fine on windows 7 , 64 bit :) - great game for the casual sim pilot."}
{"product_id": "B0027AP5S8", "context": "is it Jtaged for copy games? and can European/PAL games work on it?", "response": "it just a Case MOD, Basically an empty shell to replace your existing cover."}
{"product_id": "B00ECOBFA4", "context": "What is the age range on this? Would it be appropriate for a 6 yr old?", "response": "My 5 year old son plays this game with no problem. (and most all of the Lego video games are appropriate for young children)."}
{"product_id": "B000PD0HQE", "context": "will this xbox 360 include all listed items?", "response": "Since this is a second owner item, I don't believe it includes the silver membership.  It includes everything listed in my description."}
{"product_id": "B0086UK7IQ", "context": "Are all the buttons fully reprogrammable, particularly the ring finger button?", "response": "The larger button on top of the mouse furthest back from the front of the mouse"}
{"product_id": "B002BSA20M", "context": "can i multiplayer on halo reach", "response": "Yes, you can play multiplayer on Halo: Reach. Halo: Reach has a collection of multiplayer features, including Arena, Headhunter, Stockpile, and Invasion."}
{"product_id": "B0009SUW4W", "context": "Hoyle card games What games are on the cd?", "response": "Does this play in Window 7?"}
{"product_id": "B00DWXUYN0", "context": "I have a 3ds with a small case on it. Would it fit well inside of this carrying case?", "response": "I would think so. But I wouldn't know for sure, I only have an XL 3DS. But I don't see why it wouldn't be able to."}
{"product_id": "B00E3667XQ", "context": "what kind of videocard does it have?", "response": "The GPU is an Nvidia GeForce ULP (Ultra Low Power) with a total of 72 cores (48 pixel shader cores, 24 vertex shader cores) and 4 graphics pipelines.\"Tegra 4\" is the name of the SoC (system on a chip), which contains the CPU, GPU, memory controller and I/O controller."}
{"product_id": "B0098W4ZD4", "context": "Does this mouse have left,right and middle scroll buttons ?", "response": "Yes, this mouse does have a left-right and middle scroll buttons, but you may need to go to the website to get the newest drivers to get everything to work properly."}
{"product_id": "B007YLUCME", "context": "I am confused of plug and play. If the controller cannot turn on without having it plugged in, what's the point of having a rechargeable battery?", "response": "I have not used this product for over a year. sorry.good luck."}
{"product_id": "B000FQ2D5E", "context": "Can you play this on ps4?", "response": "Unfortunately, you are not able to play MGS4 (PS3 version) on PS4. If you insert the disk, a prompt will appear saying \"unsupported disk\"."}
{"product_id": "B00FB45YFQ", "context": "Will these work with a PS4? I am tired of this stringy little black wire that came with it. I need an upgrade, will these work?", "response": "I have a xbox one and it works with the 3.5 mm adapter for the controller. The only problem is the mic. My friends can't hear Mr that well."}
{"product_id": "B00HWMP0TU", "context": "does this version require me to load it via a cd drive or will it allow me to just download it on steam?", "response": "If you purchase this it will require the disk and code that come inside the box."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "If you're on PS3 going to PS4 or Xbox 360 going to Xbox One then yes, huge difference; now 1080p from 720p. Hate to be that guy but playing this at 2160p on a computer is still hugely preferable to consoles, doesn't stop me using a controller either! Hope this helps :)"}
{"product_id": "B00FC1UH82", "context": "does it work on ps2", "response": "Not without fairly heavy modding."}
{"product_id": "B004C4U1VI", "context": "We have an xbox one and these cables do not work?", "response": "It's for Xbox 360, not Xbox One."}
{"product_id": "B0079V29EI", "context": "What do you recomend to me to use the portable charger of ps vita or this grip? I play ps vita at home most of the time.", "response": "This grip is great.  The charging part of it is great for a couple charges and then it seems to fall apart or stop working.  I would get these for the grip, but not if you need the extended battery life or even to play while its being charged since connection broke after just a few uses."}
{"product_id": "B0029LJIFG", "context": "I received this and it has English and Chinese written on package. Is this product in English???", "response": "Connecting your xbox live subscription has nothing to do with that packaging. (You need the code on the back of that card so don't toss it) If your settings for your xbox is in English you should have no problems. Here is the YouTube tutorial on how to set it up. ENJOY. https://www.youtube.com/watch?v=zfo-v577QHQ"}
{"product_id": "B00FLZ4FS2", "context": "Can I use this code on my Xbox one and on our xbox 360 in the home or is it an either or code?", "response": "Please note: If you DO NOT own an Xbox 360 this is useless! You have to install on Xbox 360 first to install on XB1. I bought this and cannot install because I ONLY have XB1!!!!!! WARNING!!"}
{"product_id": "B0002L88HE", "context": "When I click on the Desktop icon to play The Titans Expansion it says \"please enter The Titans Expansion CD ROM. Any advice on what to do?", "response": "It sound a like your computer does not read the disk or something like that. You must have the CD Rom in the computer to play it!"}
{"product_id": "B005CELN8W", "context": "does anyone know if my favorite \"Hexbreaker\" is on any of these CDs?", "response": "I have played all the games on the Reel 'em In  DVD and it does not have Hexbreaker on it.  Sorry."}
{"product_id": "B00GD962OA", "context": "Can you play movies on the wii u console?", "response": "The Wii U has all the major streaming services, but it can't play any discs."}
{"product_id": "B00BGHUS58", "context": "Is the game worth it to buy it new, or is used a better deal? Also, does it have any istallation issues?", "response": "I bought it new, and don't regret the little extra cost. No installation issues, so far no glitches of any kind."}
{"product_id": "B002YVD3KM", "context": "Good for GBA emulation?", "response": "GBA has L/R shoulder buttons.  So an SNES controller would be better."}
{"product_id": "B005S0KH7I", "context": "How long is the wire?", "response": "I wanna say about eight feet. I didn't measure it but I need a pretty long chord myself and it is longer than I need."}
{"product_id": "B0053B5RGI", "context": "Hi. We're new to Pokemon. Just bought my daughter a 3DS. Would Pokemon X be a good game to learn about the game for a beginner? Any recommendations?", "response": "Yes its a wonderful game to start with. You can pet and feed the pokemon and the battles are better. If your daughter likes pokemon she'll love this game. And if this is her first pokemon game she'll still like it."}
{"product_id": "B00DC9T2J6", "context": "Is there a single player to Titanfall or is it just a multiplayer only?", "response": "It's multiplayer only, which was a big disappointment to us."}
{"product_id": "B009GZX49Y", "context": "is this a 3 games full disc set??  or  the games are for download?", "response": "The games are bundled in a single disc, you have to install the Assassin's Creed 2 and Brotherhood in your ps3's HDD, it takes arround 14gb both games, Revelations on the other hand plays directly from the disc, but you still need the disc in order to play AC 2 and Brotherhood"}
{"product_id": "B00503EAG2", "context": "Can you play this game offline?", "response": "You can play campaign offline but it's very short. A very good game though but you need direct X 11 so you better have a good video card."}
{"product_id": "B0041RR0TW", "context": "Do I have to set the buttons to play games like assassin creed 3 will this controller have already default setting just like consoles style", "response": "There are pre-set configurations for the most popular games available with the software drivers. Once you load the pre-configured layout you can customize it."}
{"product_id": "B006JKARP8", "context": "why does it say that maintains the charge for up yo 1 year?  it wont work after 1 year?", "response": "If you charge it, it will stay charged up to 1 year not that it will only work for a year."}
{"product_id": "B007TFOO6K", "context": "Compatibility chart does not list Windows 8, is this compatible?", "response": "My original CM Storm Trigger keyboard had a major electronic module failure.  CM could not replace it since the model has been discontinued.  They promised that I would receive a free replacement when the new model is released.  If works with Windows 8 is a question to ask CM."}
{"product_id": "B00JC9SWSC", "context": "Does the console include a way to charge the controllers or do you need to buy that seperately?", "response": "One charge cable that plugs into the usb port in the front."}
{"product_id": "B00BDS415I", "context": "Can this headset be used on desk top computers as well? Also is this set good for listening to music with?", "response": "Yes,  I use it all the time to game.  And listen to music"}
{"product_id": "B002I0H2AG", "context": "does this game really suck ballls", "response": "Almost on the level of donkey ball suckage, the only reason i bought it was because i followed  1,2, and 3 other wise not good"}
{"product_id": "B00EZPCX1A", "context": "is the 2ds screen the same size as the 3ds xl", "response": "No, the 2ds' screens are 3.52 and 3.02 inch and the 3ds xl 4.88 and 4.18 inch."}
{"product_id": "B0086UK7IQ", "context": "Anybody but me use gaming mice for non-game stuff?", "response": "Yep. Illustrator and photoshop. Most buttons are set up to just switch tools but I've got a few tied to actions for the more repetitive stuff."}
{"product_id": "B00DPJBTM6", "context": "i know you should buy this with the mix amp for best quality but I don't do Game Battles anymore. So is this headset great for just using stereo sound", "response": "I don't have the mix amp and I feel it still sounds good but I couldn't compare without having tried both. But.... you can always purchase it separately."}
{"product_id": "B0029LJIFG", "context": "if I make a purchase today, could you email code to me?", "response": "They will provide it to you as soon as you pay, it will show on the screen."}
{"product_id": "B001COU9I6", "context": "does it play ps2 games", "response": "It don't play at all"}
{"product_id": "B00292OW1U", "context": "Is this keyboard wireless.", "response": "No it has a USB cord. Wish they still made this one. Really like it"}
{"product_id": "B00BM7NXMW", "context": "do the colors cycle through -or fade into each diff color automaticly with a setting", "response": "The colors are static; you have to change between different colors through the control panel software packaged with the mouse. You can set the frequency at which a color pulses."}
{"product_id": "B00IAVDQCK", "context": "Can you use two of these at the same time with the same Xbox One console?", "response": "Unfortunately, you can't. But you can use it if you have a special Headphone Splitter."}
{"product_id": "B00C710AQO", "context": "Can this game be played by more than one player, offline. I mean, can my two sons play against each other or as a team offline with two controls?", "response": "I think yes, just like FIFA & NHL"}
{"product_id": "B00D3RBZHY", "context": "Direction of car can be controlled by motion of joy stick ??", "response": "Yes. U use the joystick to move the car."}
{"product_id": "B0002FGFHU", "context": "Hi, I am from Germany. Is this the US Version? I have the German an UK version, but theres no Honda Civic. Is here on this the Honda?", "response": "This is the US version of the game now since you're in Germany I don't know if the game will work on your system to find out more about this game and check out the coding for your region and also in the game there is a Honda civic"}
{"product_id": "B004QRKWLA", "context": "Do I need to calibrate or download programs and are the programs included?", "response": "It should be plug and play but if some reason a driver is corrupt, for example, you can go to microsoft's hardware site a download the driver package for the controller."}
{"product_id": "B000PS1TG6", "context": "Does this work on the pc or only ps3", "response": "Yes It works on pc also."}
{"product_id": "B0091A3AHA", "context": "Will it work with the Xbox One, PS3 & PC? Does it have speakers & HDMI? How is it powered?", "response": "Yes it works you just need the conversion kit off the gaems website to make it able to carry it securely."}
{"product_id": "B001NT9TK4", "context": "Does this wheel turn all the way around like a real car, or is it basically just the 190 degree rotation?", "response": "900 degrees of rotation similar to a real car.  I use it for iRacing and love it"}
{"product_id": "B00CQ9L1Z6", "context": "What's the difference between this one and the black one that says \"Pro\"? Is this for American cartriges?", "response": "I'm pretty sure it's just a marketing/labeling thing! I use this one with North American Carts and it works fine. From my research, there's no difference between this and the \"Pro\"."}
{"product_id": "B008BGXYBM", "context": "Can you change the color of the lights on this, or is it only green?", "response": "From what I remember its only green."}
{"product_id": "B005M2KSLC", "context": "does it have a DPI switch up AND down???", "response": "what is the DPI switch"}
{"product_id": "B00GHTP4ZY", "context": "We have a Windows 8 machine-will this work on it?", "response": "Yes, this works on Windows 8 (and 8.1)."}
{"product_id": "B007OVHW90", "context": "will it work with the px5", "response": "Yes, the Xbox 360 Talkback Cable will work with the PX5 headset."}
{"product_id": "B00CMQTUSS", "context": "Does it include a micro usb cable?", "response": "This is what your looking forMicrosoft Xbox One Controller + Cable for Windows"}
{"product_id": "B00I5LMSBK", "context": "For the North America pre-order of the game, was amazon supposed to give both the Shigechi & Kira DLC? I only received an email for Shigechi", "response": "IIRC, Amazon Pre-order gave you Shigechi but Campaign 1 DLC gives you Kira for free."}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "If you have the slim version you can just put it in but I wouldn't buy it because it didt work properly"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game", "response": "Yes.  Each figure unlocks several items in the game."}
{"product_id": "B0087ZMATE", "context": "Does it have a mute button for the mic?", "response": "No it does not"}
{"product_id": "B00ATF5YZM", "context": "I downloaded the game COD 4 MW but steam isnt working and i cant get to my game!!!!", "response": "That's not really a COD4-related question..."}
{"product_id": "B00FATRKWM", "context": "I will be purchasing the US x-box, will it work in Europe?", "response": "I'm not sure it will work in Europe. The console is NTSC which is made for US and Canada. The power plug is a two prong Input AC 100-127V 3.7A"}
{"product_id": "B002I090AG", "context": "Does it work with ds games?", "response": "Yeah, it works will all DS games."}
{"product_id": "B00B1VJZO4", "context": "The installation is not working !!!!!!! It says that you have to have sims 3 installed before? WASTE OF MONEY", "response": "University is an add on to Sims 3 meaning you must have the base game before you can have any of the expansion packs."}
{"product_id": "B000NJBD90", "context": "I know it says PS2 to PS3, but it's a USB, do you think it'll work if i plugged it into my Xbox 360?", "response": "Didn't work for my PS2 to PS3 so I doubt it."}
{"product_id": "B0087N222Q", "context": "How do you connect it to the PS3 because mine does not work ?", "response": "Same here!! I never figured it out. Other folks were able to get it up and running but I was never able to. So sorry I can't be of any help."}
{"product_id": "B004NRN5EO", "context": "this game comes with case, manual and artwork?", "response": "It even comes in the wrapping. I got mine brand new. No problems! It came with everything. No scratches or anything. I recommend it. Its cheaper here than gamestop"}
{"product_id": "B00HHAIY72", "context": "Will it work with the game \"Elite: Dangerous\"?", "response": "It even works with E:D on the Mac right out of the box, with no driver needed."}
{"product_id": "B00CJ7IUGS", "context": "What is the difference between the Legendary Edition and the other one?", "response": "I haven't played the other one so I don't know everything that's missing but there are several add-ons. You aren't capped at level 81. You can level up indefinitely. There are additional quests in legendary too I believe. This is a huge game. You will play it for months. Get the legendary version. It's worth it."}
{"product_id": "B00F27JGVA", "context": "Approximately how long does the shipping take for it to arrive in the US? Just trying to get a rough idea.", "response": "I ordered this with Prime shipping and got it in two days.  It originated in the US though, not Japan.  If it says Prime, I think you'll get it in two days.  Seller was Seitendo."}
{"product_id": "B009M72E5Q", "context": "Will this particular Wii play the GameCube games?  Does it have the ports to connect GameCube controlers?", "response": "I bought this black unit as a replacement for my original wii as I had heard stories of wii ending production. My original console does play the game cube discs and has ports for the game cube controllers. This new unit does not. I haven't tried the cube discs, but doubt they work without controller ports. Hope this helps."}
{"product_id": "B001GIOGBY", "context": "Has anyone tried it with Windows 8? Does it work like in Windows 7?", "response": "I have Windows 7.  Roy Chaffin on his web site has NOTHING good to say about Windows 8 or Windows 8.1.  I am very pleased with Windows 7 and will NEVER consider changing to Windows 8 or Windows 8.1.  Bob Lutker, a VERY long user of the CH Products Elipse Yoke."}
{"product_id": "B00AAS88K6", "context": "Will this work with windows 8.1?", "response": "It will work with all operating systems even without specific drivers, you will benefit most by getting the drivers direct from razerzone.com"}
{"product_id": "B006NU6HAS", "context": "Does it come with any liveries other than the default shown on the package?", "response": "It comes with a pretty decent number  of liveries...mostly all of the major airlines from what I recall. If there's one you don't see, you may be able to find it elsewhere online.If you can afford it, I'd also suggest the PMDG 777!!"}
{"product_id": "B0016897GS", "context": "does this work for the ps3 ?", "response": "It worked on my Xbox 360. Don't know about ps3"}
{"product_id": "B004JQK2E0", "context": "do i have to be on the internet to install port royale 3 pc game", "response": "Yes you have to be online"}
{"product_id": "B008X73CE8", "context": "what version will i be downloading", "response": "V 1.05 Silent Hunters Wolves of the Pacific"}
