{"product_id": "B00B0QONB0", "context": "is this for titanfall", "response": "this is a hard drive or memory that works perfectly for xbox360 only WILL NOT WORK FOR XBOX ONE and if your question is if this will save your titanfall game progress, yes butt only if you have it for xbox360, hope this help you"}
{"product_id": "B00BHSTXV6", "context": "Can the macro keys activate AutoHotKey scripts?", "response": "Absolutely. They can run any file that you link. Just link the script and it works, no problems. I've done this myself :D"}
{"product_id": "B00F27JE1C", "context": "Can I use a US PSN account on this Vita?", "response": "Yes. But remember you can use only one PSN account at a time in one PSV. Say now you use your US account on this Vita, and next time you want to switch to your JP account on the same Vita you'll need to reset the PSV first. This won't affect your PSN accounts though."}
{"product_id": "B00DH1KRQQ", "context": "does it have the rumble feature?", "response": "I have used this with Battlefield 4 with the driver installed from the disk. It doesnt rumble at all."}
{"product_id": "B0000A2TPE", "context": "Does it work on Mac? Is there a version of Zoo Tycoon that works on Mac?", "response": "My daughters 18 and still loves it!"}
{"product_id": "B00475AYUA", "context": "Are the expansion sets already installed when you open the game or do they get launched independently?", "response": "I recently installed them and they open independently."}
{"product_id": "B009RHEBWA", "context": "will H & R Block at home 2012 Deluve + State work on win xp home sp3?", "response": "Yup, it'll work on XP Home SP3. Just like everyone else said. I checked the box. Not sure about Win8 though. I filed on a Mac so it'll work on Mountain Lion without a problem."}
{"product_id": "B00BXE4W4C", "context": "cant get pickaxe shed wont open", "response": "I never bought that game-this was just a suggested games they put down that I might be interested in. Sorry."}
{"product_id": "B00H72EMP8", "context": "Does anyone knows if it works with WiiU, nintendo 3ds,and PC? It's because I've seen one of this model Kunai(advertise of the company)saying that.", "response": "It does, i have a 3ds and laptop and they work fine with it, but im not sure if the wii u tablet has a headphone jack. Its sold as a headset for ps consoles because of the  included to connect to the tv."}
{"product_id": "B006SVUQNQ", "context": "does this just plug into the back of your console?", "response": "it's a 4GB xbox 360 and yes"}
{"product_id": "B00C2B355W", "context": "My son plays games on his MacBook Air.  Are they compatible with a MacBook?", "response": "Yes, this will be compatible using the auxiliary cable provided but I will not recommend this headset for PC gaming because it has an external wireless transmitter which means a lot of extra wiring. This is more for console Gaming with a TV set up"}
{"product_id": "B00886XQO0", "context": "hi this work on mobile ? plz i need fast answer ^^ ty", "response": "Yes android for sure works"}
{"product_id": "B00AJZNUUI", "context": "WIll I need to purchase any additional remotes so that more than one person can play at a time?", "response": "Just like with any console, to add your player 2 you will need an additional controller for that person"}
{"product_id": "B00BFOEY3Y", "context": "Does this have an on/off switch?", "response": "Yes it does.  On that, the battery life is pretty bad.  Maybe 2 days if using only 500Hz (instead of the max 1000Hz).  I have to plug it in every night."}
{"product_id": "B0007U2CX6", "context": "is this for psp series 2000?", "response": "Yes I have that kind"}
{"product_id": "B00A750QIE", "context": "is it a fun game for a 9 year old boy", "response": "If he likes baseball and baseball video games then he will love MLB The Show.  There are ways to make it easier for beginners or younger players to play via in game options."}
{"product_id": "B000VLNXRU", "context": "Does the FIP work with DCS aircrafts, especially the A-10C?", "response": "Hello, this instrument supports P3D V2 it? Buy."}
{"product_id": "B0011E4J7O", "context": "Will it work without the battery pack?", "response": "yes it will work without it"}
{"product_id": "B00ERDGMT4", "context": "is the DCL on disk or is it code??", "response": "dcl is a disk; there's 2 disk"}
{"product_id": "B002RYLG4Q", "context": "How long are the cables? The distance from my TV to couch is 8 feet. I know I won't have a problem with the Original NES, not sure about this one.", "response": "They aren't very long. We have to sit on the floor to play or pull a chair close to the game system."}
{"product_id": "B001GIOGBY", "context": "my brother has had this yoke for a few years and it has worked fine.  recently it has begun \"pullling\" the plane to the left.  any ideas?", "response": "In X-Plane you can calibrate the yoke and center it again."}
{"product_id": "B00IAVDQCK", "context": "Can you hear your own voice when you speak ? (Like on Turtle Beaches, you can hear yourself through your own headset to allow voice moderation)", "response": "YES YOU CAN! Go to settings, accessories and devices, the controller you are signed into, and audio. you can adjust headset sound and VOICE MONITORING there!"}
{"product_id": "B0000CNUUP", "context": "Does anyone know if this game will play on Windows 7, 8, or Vista? Thanks.", "response": "Windows7 Ultimate 64bit just fine here."}
{"product_id": "B001EYU1WS", "context": "Is this product compatable with windows 8", "response": "yes it is.  it works fine with windows 8"}
{"product_id": "B008UQWX0Q", "context": "does this have a camera?", "response": "Yes it does works great"}
{"product_id": "B001AI7CF2", "context": "How long is each extension?", "response": "They are at least 6 to 8 feet long."}
{"product_id": "B000GCJ6MK", "context": "does fsx work on windows 8.1", "response": "It works fine on my Windows 7 XP.  My 11 yrs old son loves it !"}
{"product_id": "B007XVTR12", "context": "Are there any other FPS out right now that you might recommend after having played this game? Also, does this work with the XBOX PC controller?", "response": "Can you use a ps4 controller??"}
{"product_id": "B005CELN8W", "context": "Do you have to have the DVD in the drive in order to play the games, or can you download everything on to the computer?", "response": "You can download everything onto the computer.  You don't need to have the DVD in the drive after you've downloaded it."}
{"product_id": "B00IAVDQCK", "context": "Does the headset require Microsoft's stereo headset adapter that's $25?", "response": "The adapter is included in the headset package"}
{"product_id": "B0058FAEAS", "context": "Does it work on a MacBookPro?  I called Madcatz and they said NO. Do you need to use Parallels so Windows can be installed?", "response": "Not sure about MBP, however I do have Win 7 with FSX installed on my Early 2013 iMac via bootcamp. Everything works great."}
{"product_id": "B0047ERZ7Q", "context": "Which one is better this camera or the one from the ps vita?", "response": "sony psp takes a better picture,, it has a focus knob on it. and it can take macro pictures with zoom function"}
{"product_id": "B00FZ12F34", "context": "do you need the figures to play more of the game", "response": "Each figure opens locked content specific to that character within their game module. They enhance the gaming experience. Limited characters mean limited game experience and content"}
{"product_id": "B00DC9T2J6", "context": "Does this work on Win 8?", "response": "Yep, I use 8.1 And I there's no problems"}
{"product_id": "B008GEH8LQ", "context": "Is this like a store bought 3DS XL?", "response": "Yes it is. The outside covers are blue."}
{"product_id": "B008HPAXZ2", "context": "Is this compatible with the New 3DS XL that is coming out?", "response": "I just placed this screen protector on a US New Nintendo 3DS XL and it fit just fine, like how my older 3DS XL fit this screen protector before. Great!"}
{"product_id": "B0032MO77U", "context": "will these work on windows 8?", "response": "I have Windows 7 and it did not work on my computer"}
{"product_id": "B00BI4VVGY", "context": "I've got some 2 wire fans that don't register on the controller.  Only three wire fans are recognized.  Does anyone else have this problem?", "response": "Three wire fans have pwm (pulse width modulation), which means there voltage can be controlled digitally. Two wire fans just have positive and negative inputs"}
{"product_id": "B0011DCA6W", "context": "Will this run on Windows 7 (one of the answers seems to imply that it does but it's not explicit)?", "response": "The instructions say it runs on XP, Vista and Windows 7. It runs fine on Vista."}
{"product_id": "B004TTNTYW", "context": "How long is the actual chord?", "response": "I don't have it in front of me, but I think it's a standard charger cord--like a cellphone charger... maybe 12 inches."}
{"product_id": "B001BZ2F56", "context": "Does this work with a new windows 8 computer? Would like to know before i buy it.", "response": "Yes it does, I bought my windows 8 laptop within the year and am able to run this game fine."}
{"product_id": "B0009VXBAQ", "context": "what games go with it", "response": "I believe that the wii sports game was included."}
{"product_id": "B00FOGFP0A", "context": "Will a PS4 upscale the game or no?  Is this collection even playable on a PS4?", "response": "No ps4 is not backwards compatible, found that out firsthand unfortunately"}
{"product_id": "B00D84DRNC", "context": "Would this case fit a New Nintendo 3ds, this would be great for my new MH4 3ds if it does!", "response": "That's what's it's intended for originally..."}
{"product_id": "B000J18SR2", "context": "Has anyone been able to use this disk with Windows 7?  It works for a while then works partially until it needs to start a game", "response": "I have been using it Win 7/64 bit with no problems. Might want to check to see if there is a download at the game site."}
{"product_id": "B00009TW6R", "context": "Does this game require the use of the CD drive beyond installation?", "response": "Not anymore. Update 1.08 removed the CD check, and Update 1.10 was just released to allow Multiplayer after GameSpy shuts down :)"}
{"product_id": "B009K7OFSC", "context": "Will this work on a mac with all functions. Just need right,  left and center click and 4 way scroll", "response": "I want a mouse to buy a magic mouse mac"}
{"product_id": "B00HHUSNPU", "context": "Will it affect the movement of the thumb sticks?", "response": "nope. the opening will go directly around it and if anything it stops the analog from hitting the border. also it stops all those sticky hands that may touch it from messing it up. this is the best thing they ever invented lol. I love it. all the controls work exactly the way they were suppose to work."}
{"product_id": "B0050SVHZO", "context": "Can you play Super Smash Bros. Brawl?", "response": "Yes you can. Wii U is backwards compatible and plays all Wii games. It is also compatible with all Wii controllers and accessories."}
{"product_id": "B008TP1OKI", "context": "My xbox 360 S hard drive has a model number --1451. Is that what this product is also? Model 1451?", "response": "Its not OEM so model numbers won't help but I assure you it will work with your 360 s as it did with my 360 s to test for my nephews 360 e"}
{"product_id": "B00D6PTMSW", "context": "Aside from the game and guitar is there anything else you need to purchase? I know nothing about guitars and this is a gift... is an amp required?", "response": "We ordered the game and cable so nothing else was required.  well, the XBox, of course.  ;)  enjoy!"}
{"product_id": "B002DUCF8A", "context": "Should the unit light up as soon as its plugged into A USB port?  Nothing lights up.", "response": "Provided the computer is powered on, my mini-screen displays a dull red glow. Once I start MS-FLTSIM X, a test follows and then it displays what it's supposed to."}
{"product_id": "B002I0K3PM", "context": "Does it support off-tv play, meaning can you play with only the Gamepad and not the tv screen?", "response": "No... unfortunately not.  Gamepad is used as a device by your character in the game"}
{"product_id": "B00GPH7Y8S", "context": "When you got this did it come with 2 CD's?? Mine only has 1.", "response": "Yeah it's suppost to have 2 CD's. I don't like the game maybe you will."}
{"product_id": "B00HGAWFJG", "context": "Does this cause the PS4 to overheat? There is no vent", "response": "I havent had any issues with overheating. All other sides and vents are open, and the vents on the bottom are partially exposed cuz the ps4 does not fit flush onto the base. It is raised up just a bit for breathing. But it is still very stable."}
{"product_id": "B009O8HH3M", "context": "Will this fit my 12 year old son?", "response": "yes and they are very nice"}
{"product_id": "B000B6MLSM", "context": "I noticed the top picture has the Green MCE button and the second (bottom one in wrapper) does not have the Green MCE button.  Which is accurate?", "response": "I bought 2 of these (from a different seller) in 9/2013 and they both had the green mce button.  Go for it, if it doesn't have it then return it."}
{"product_id": "B000WCCURW", "context": "I have bought 2 titan quests games and cant seem to install this on to my laptop. Just curios if any one may know whats going on?", "response": "Unfortunately I can not help you.  I do not possess a laptop.  If your system meets the minimum requirements I would think it would be okay.  Wish you luck with this!!!"}
{"product_id": "B0050SYILE", "context": "Is this two discs?", "response": "Yes.  ONE for installation.  Other to play game."}
{"product_id": "B008KH7NZA", "context": "Is this headset durable?", "response": "In my opinion. No. I've had to get the actual headset replaced four times, and bought multiple parts. This is a huge hassle and customer service was very bad."}
{"product_id": "B00HVBPRUO", "context": "What is the average battery life of this headset?", "response": "Around 8-10 hours. Hope this helps these headphones are well worth the price"}
{"product_id": "B00BY0G0YU", "context": "Can I play the PS3 version on the Vita? I know the Vita version could play on the PS3, so I am wondering if it could be done the other way?", "response": "You have to buy the game for both consoles. Yes they are identical and you can cross save from the PS3 to the Vita and vice versa."}
{"product_id": "B007VPZR5U", "context": "can you program the buttons to be used as any key? or just numbers?", "response": "any key or combos of keys, record keystrokes with delays, etc."}
{"product_id": "B008VQ68C4", "context": "Is it Xbox One compatible?", "response": "It should be. It is compatible with the PS4. I would actually be surprised if it wasn't."}
{"product_id": "B00CPKUV7K", "context": "Which disc do I load first or all 4", "response": "Disc 1 is an install disc only. Use it first and install the game (it is mandatory). Once it is installed it will ask you to put in disc 2. Discs 2, 3, and 4 are the actual game. Once you reach a certain point on each disc it will ask you to put in the next one."}
{"product_id": "B002BRZ852", "context": "Are explicit sexual acts done in this game? I was told very detailed sex acts were shown.", "response": "Not as far as I know. I can't speak for the dlc however. Also don't trust me."}
{"product_id": "B0099OZR9W", "context": "I have a 4GB xbox 360 slim and am unable to install battlefield 4. Can I use this HDD and install it?", "response": "Yes we had the same problem and this hard drive did the trick.  It took about 30 seconds to install and the price is good"}
{"product_id": "B00A0EPNPI", "context": "Is it a mechanical keyboard?", "response": "No,  it's a membrane."}
{"product_id": "B002DUCF8A", "context": "Works on X plane 10 without downloading drivers?", "response": "No you must download drivers from xsaitekpanels thru x-plane.org/utilities/plugins"}
{"product_id": "B001TOQ8X4", "context": "Physical copy? If so, can I download the game and play while the game is shipping?", "response": "No Bc the Hard Copy gives you the code to Download the GameSo you have to wait in order to play the Downloadable copy"}
{"product_id": "B00CMSCTA2", "context": "can you download it on two seperate computers and play each other with only one purchase?", "response": "No, not if you tie it to your Steam account. You will need two licenses. Steam has a sale occasionally, got mine for $2.99 around Christmas.It's still worth the $20 if you like the game. I have put at least 50 hours into it playing multiplayer with the kids. No issues, no glitches, great graphics on Win7 and 8.1."}
{"product_id": "B00BT9B2LC", "context": "Why does this not work with American games?", "response": "For 3ds games no. This is for Japanese 3ds games also when I got this it didn't come with a charger (which was fine since I had my American one)"}
{"product_id": "B00D96BJSO", "context": "Does this headset require batteries or charging? It's not wireless, right? So if it's wired I don't need to worry? Ugh, sorry :(", "response": "the headset is wired to the controller, otherwise it is wireless to the Xbox 1. It does seem to make the batteries in the controller have shorter life."}
{"product_id": "B001UWGDPS", "context": "Will this run on W7 (64 bit)?", "response": "Yep. I have W7Pro 64bit. No issues."}
{"product_id": "B000AOJ7FK", "context": "Does it require steam?", "response": "What do you mean by steam?"}
{"product_id": "B00F27JE1C", "context": "Is this package with Japanese?", "response": "If you mean the welcome packet inside, then yes. It comes in both English and Japanese. The back of the box is also in Japanese, if that helps."}
{"product_id": "B00GJSUUC0", "context": "please can anyone tell me if this is a blue ray CD or PSN code?", "response": "Blue-Ray disc. Thats what all PS3 discs are built on."}
{"product_id": "B003O6N64Y", "context": "can I connect this headset to a tv,thankyou.", "response": "If your TV correspond to Bluetooth, you may be connected. However, this is basically an item is used by connecting to a PC or a gameThank you!!"}
{"product_id": "B006YDPU48", "context": "Can you dodge, block, and counter? Do you get health regain rings and necklace, and do you get health steal per hit armor?", "response": "Yes to all except armor.  There are life steal weapons however."}
{"product_id": "B004RMK4P8", "context": "do i get free movies?", "response": "I didn't even get to use the card, it's all empty and they won't refund my money"}
{"product_id": "B007W8S2MG", "context": "does this game have a setting where i can have japanese dialogue but english subtitles?", "response": "Hi there, I just looked and sadly no."}
{"product_id": "B002BRZ9G0", "context": "Is this compatible with a wii bought in Singapore?", "response": "You just have to make sure ur wii has american system i think if it's british this would not work this is from my experience I'm not sure if it's true or not"}
{"product_id": "B002L6HJCI", "context": "Is this made in USA?", "response": "Dont know - direct download"}
{"product_id": "B00519C7JC", "context": "Can I still play this game online as of July 2014?", "response": "Yes, you can play Zombies and Multiplayer online."}
{"product_id": "B008CP6MA2", "context": "im seeing people saying chains of olympus and ghost of sparta are psp games? is this true or are the voucher codes for the ps3 version?", "response": "Yes, two of the games are are PSN, (Play Station Network). They will download to your hard drive to be played on the PS3 or PSP. I don't play PSP, I have all 5 games at my disposal, 2 of them are on the hard drive."}
{"product_id": "B00GU4F4OM", "context": "What does it mean by \"selective DPI?\" For instance, are you able to have 2500 DPI? Or just 1,000, 2,000, 4,000 etc..", "response": "There are presets but the software allows you to adjust a slider or adjust with the arrow keys in increments of 50 DPI.  So you could do 2450, 2500, 2550, etc... anywhere between 50 and 16400 DPI."}
{"product_id": "B0087ZMATE", "context": "Are these loose on your head?", "response": "No. The headset fits snugly on the head. They're not too tight though."}
{"product_id": "B00D8S4GNS", "context": "Does the DLC from JD4 work with JD2014?", "response": "im not sure i got this game for my kids so im not really knowledgeable of any other systems"}
{"product_id": "B009XZ1CTQ", "context": "Okay so I've downloaded I think 4 mods for fs 2013 but can't find them during game play how do I find them?", "response": "Ok, if you have downloaded them, you have to copy the file (right click, copy) then go go your documents-my games-fs2013-mods, then paste the file in there and it should work"}
{"product_id": "B00IAVDPSA", "context": "Can I use this remote to instantly turn off the XBOX One when my son refuses to stop playing?", "response": "You can use the remote but it is not instant.  You hold the button and a message comes up and you have to arrow up to \"turn off console\".  Not instant but pretty quick."}
{"product_id": "B00CX9L30W", "context": "I have a question, even if this is an MMO, does this have a universal goal?", "response": "I wouldn't go so far as to say there is a universal goal.  Of course everyone wants to have the best equipment and be able to participate in \"end game\" activities. It just depends on what you want to spend your time doing while you play."}
{"product_id": "B00GY4OAIE", "context": "How do you save your game when you're not done with a level? Are there check points or something? My 8 year old is having a terrible time.", "response": "There are section of levels, each section has a concrete looking statue, when you walk up to the statue you press the circle button, you can save and continue or exit, the game also auto saves. Sometimes the statues aren't obvious but they are there, just don't bust it up until you use it. Good luck�"}
{"product_id": "B00DC7G3Q8", "context": "Is this a good game for a 5-7 year old", "response": "This game is DESIGNED for 5 - 7 year olds."}
{"product_id": "B00009TW6R", "context": "Does this game still have online support post-GameSpy shutdown?", "response": "It sure does, not all but a lot of the games that ran on gamespy got supported by new companies."}
{"product_id": "B001AI7CF2", "context": "How long is each extension?", "response": "The length is about 6ft.  I use two together and the Grand kids sit on the couch across the room to play."}
{"product_id": "B00B0QONB0", "context": "Do I just plug it into the Xbox or do I have to buy a cable to connect it?", "response": "It goes right in"}
{"product_id": "B00FLZ4FS2", "context": "Hi! Will this code work on a foreign account or just on an american one? Also, how long after the payment confirmation till the code is emailed?", "response": "Although I am not sure if it will work on a foreign account. I'm pretty sure it will though. The code does not get emailed, it is shipped to the address that you put in for the order. Enjoy! It's a great game."}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "Yes it's worth buying. It's fun and enjoyable while at the same time it is difficult staying alive as you move further .into the campaign ."}
{"product_id": "B000087H7T", "context": "is the screen bigger than original gameboy advance", "response": "Yes a little bit. But also is in color and lights up so it can be used in the dark."}
{"product_id": "B00DCDZM2I", "context": "Can 2 or more players play at the same time?", "response": "It's one player only."}
{"product_id": "B002I0GF72", "context": "How bad is the violence and \"Blood\"? I have a 6 yr old dying to get this game, but I want to make sure it's appropriate. Please help.", "response": "This is the best possible game for a young child's imagination, if they are curiosity and courage driven."}
{"product_id": "B00002SANH", "context": "Will this version work with a Windows XP, 3.3 GHz, 1.98 GB of Ram?", "response": "Far as I know it will, as I was using it on an XP.  May need a little bit of patience for it to get started."}
{"product_id": "B009CL6LA6", "context": "Can this connect directly to an iPhone wirelessly, or is the receiver needed?", "response": "It needs to be plugged in to the transmitter for it to work wirelessly   This is not a Bluetooth device but it does work with the cord nicely.     The receiver is USB 2.0 with a 3.5 mm male adapter  if you want to plug your phone in to the wireless connection."}
{"product_id": "B00AK4QB22", "context": "Why does it have a Teen rating vs. Mature?", "response": "There's no gore or nudity. Mild blood stains, oh noes...! Hopefully the rating doesn't turn you away though."}
{"product_id": "B0088MVODO", "context": "are these the games?", "response": "Yes, yes No movies, Just the games"}
{"product_id": "B000VRCNLG", "context": "Will it work on windows 7", "response": "i have window 7 and it loaded up and runs fine on my system.  I3 4 gig ram, a 57750 ati card."}
{"product_id": "B004IK24MU", "context": "is the wrist strap a problem while charging?", "response": "I second what Mark II said."}
{"product_id": "B00BGAA3S2", "context": "Is this similar to the Kinnect for the Xbox? How or how not?", "response": "No, its basically like the old PS2 Eye Toy. It has some similar functionality as the Kinnect, but its quite underpowered in comparison. Also, since its not mandatory, I doubt there will be much support for it from developers."}
{"product_id": "B009RXUOD4", "context": "How do these headphones connect to the Xbox360 controller?", "response": "For your current headphones?"}
{"product_id": "B0089NVTDM", "context": "Does anyone know if playing melee at a competetive level is possible with this? I want to start playing dolphin to get better but can I wavedash etc.?", "response": "The device recognizes all of the inputs like a real GameCube controller so it's possible. But using an emulator with it will give you some slight input lag. Consider getting a real GameCube or Wii instead."}
{"product_id": "B0079V29EI", "context": "Can I charge my vita with this grip on?", "response": "You can while the grip itself still works. However, this product is very unreliable... mine really only serves as a grip now. The battery side of it including the pass-through recharging capability it had all died within about a month of purchase. I'd junk it out if it wasn't a good grip on its own."}
{"product_id": "B008L3UUPS", "context": "I just need a controller to work with the Nintendo 64.  Will this also work on the Nintendo?", "response": "No this has a USB connection not a Nintendo 64 connection."}
{"product_id": "B00BXONG7G", "context": "can I use this game in Windows 7", "response": "I use Win7 64bit and this game runs great."}
{"product_id": "B001444IN6", "context": "will this run on windows 8", "response": "No, it does not work well on Windows 8."}
{"product_id": "B007VTVRFA", "context": "i am little confused by all these negetive reviews, can any one confirm if i can play this game offline as on today?", "response": "I thought the point of this version of Sim City was to play cooperatively with other people."}
{"product_id": "B00ERDGMT4", "context": "What DLC is not included in this? The Headhunter packs?", "response": "No, There are no headhunter packs. This is still an awesome deal because of the 4 DLC already included, each a game in itself. There are 5 headhunter packs total. Xbox live had the headhunter packs for 50% off yesterday. Might still be going on..."}
{"product_id": "B00FM5IY4W", "context": "Are all of the cars that you can buy be earned through playing the game, or are some only available through micro transactions alone ?", "response": "some of them you can only earn as you play, and some you can just buy, and they added some token currency."}
{"product_id": "B003BKWEHS", "context": "What does Jewel Quest 3 JC mean? Can I play this game on my PC Windows 7?", "response": "JC is \"jewel case\", the plastic box/cover it comes in."}
{"product_id": "B00GZ1GUSY", "context": "Are the graphics that different compared to last-gen (e.g. PS3)?", "response": "Definitely! If you ever played The Last of Us or Uncharted on ps3 you will be blown away at how much better graphics are on ps4.  There is no contest and you definitely see the difference.."}
{"product_id": "B001COU9I6", "context": "what it is the model ps3 cech-xxxx?", "response": "It means it can be a CECHExx, CECHKxx, CECHLxx, or CECHMxx. Those are different model codes for the 80gb Ps3. The difference? Colors and USB port number. It's most likely the CECHExx which has 4 ports and is piano black. It's the most common FAT version that plays Ps2 and Ps1 games."}
{"product_id": "B0086V5V8G", "context": "This game have Chinese language or sub?", "response": "I know not if it has \"Chinese language or subs\""}
{"product_id": "B0096L2SJ0", "context": "Will it work on emulated games?", "response": "Yep, you just have to assign the controls."}
{"product_id": "B00BGA9YZK", "context": "Is it worth it to buy this if my sole intention is to play the campaign?  Have no interest in KZ multiplayer.", "response": "Yes but campaign is going to long and hard. Not really easy at all because some enemies are smart."}
{"product_id": "B007TMFD7C", "context": "will it work on my old old mackbook from may 2006 or is it to old", "response": "Not if you really want to enjoy all the features. Runs great on 27 in iMac 2013 with all graphics turned up. In case you're thinking of upgrading."}
{"product_id": "B005BLAJ68", "context": "Does it have Alaska solitaire?", "response": "No, it does not Sorry."}
{"product_id": "B001AI7CF2", "context": "which wii has gamecube controller connections", "response": "All of them I think..."}
{"product_id": "B001EIA2LY", "context": "Is this compatible with Windows 8?", "response": "Yes it is.  That's what I have."}
{"product_id": "B006W41W3M", "context": "My Xbox 360 E has no digital optical port. Will these work?", "response": "USB goes in the Xbox, the digital optical port should be on your TV, which means yeah they work, and you can watch TV with them as well."}
{"product_id": "B00IAVDQCK", "context": "does the audio from your television, redirected into this headset once plugged in and setup?", "response": "Yes and no.  Once plugged in, the audio will immediately go to the headphones with any sound coming from the xbox, but it will also still come from the television.  When I want to be quiet I have to mute the TV volume.  A slight annoyance."}
{"product_id": "B00F27JE1C", "context": "can u play with friends", "response": "You sure can! You can wirelessly connect to your PS4 and remote play with them or you can just play PS Vita games that allow multiplayer."}
{"product_id": "B002L93F0A", "context": "can i use this with the wii u adapter", "response": "Yes! It's the same as the Normal GameCube controller port."}
{"product_id": "B000OYMYZQ", "context": "How long is the cord?", "response": "The cord is about 5'-5' 1/2\" feet. It's pretty long and since most computers sit next to you this really isn't a problem. Heck in fact one of my problems with this is cable management, making sure my gaming area doesn't get to cluttered."}
{"product_id": "B00FBV6V56", "context": "Does this come with the Mix amp ? and any issues connecting to ps3 or ps4 ?", "response": "Yes it comes with the mix amp It shouldn't have any problem connecting to ps3 or ps4 but I have no experience with that I have xb1 and xbox 360"}
{"product_id": "B00DBDPOZ4", "context": "does it work for pc ?", "response": "If you mean getting charge from PC , the answer is yes"}
{"product_id": "B00001LDBZ", "context": "Will this work on Windows 8.1?", "response": "I have this actual game on disc and it would \"not\" run in Windows 7.I tried compatibility mode and no luck there either.I went to theisozone.com and downloaded this game there and it works perfect on my windows 7.It`s a 7-zip file download from theisozone.com.Might work on Windows 8.1"}
{"product_id": "B0050SY4DG", "context": "This game comes with multi idioms included spanish?", "response": "If you're asking about language settings in the game. They have a language pack that comes on the second disk (xbox 360 version). So you just have to download it and change the settings then."}
{"product_id": "B00DH1KRQQ", "context": "how is this controller for playing lego lord of the rings pc game", "response": "You have to work the buttons around a little since the Lego games ask for more buttons to be set than the controller has but once you get past that they work great."}
{"product_id": "B00E9I1FPI", "context": "How big are the map posters that are included in this set?", "response": "Just over 16\" x 20\""}
{"product_id": "B00004XRBB", "context": "Will this program run on the XP system", "response": "yes. it ran on my xp system."}
{"product_id": "B00D96BMV8", "context": "Is the mic detachable?", "response": "Yes, the mic is detachable so you can use just the headphones if you want."}
{"product_id": "B00BHSTXV6", "context": "Is the space bar much louder than any other key?", "response": "Yes, but its no where near as loud as a mechanical keyboard. *MUCH*? not really, but it is louder."}
{"product_id": "B002VBWIP6", "context": "what is the difference between card and online game code?", "response": "There is no difference. The online game code is on the back of the card."}
{"product_id": "B00GHTP7SS", "context": "Does this game have multiplayer mode?", "response": "It has online pvp matches, but no work together type mutiplayer options."}
{"product_id": "B00292OW1U", "context": "Does the keyboard utilize mechanical switches?", "response": "No, it does not. I know a lot of newer high end keyboards will, but this one doesn't."}
{"product_id": "B0086UK7IQ", "context": "Is this mouse ok for smaller hands? Mine are, and though it's hard to tell from the photos, it looks rather large...", "response": "It's wider than most mice, but not as long. It would probably work though, you'd probably have to have some pretty short thumbs in order to not be able to use the G-buttons."}
{"product_id": "B00DC7G2W8", "context": "when will this game be shipped?", "response": "Amazon has notified pre-orderers that with the two-day shipping option selected, Mario Kart 8 will arrive at your house by 8:00PM on May 30, 2014!"}
{"product_id": "B0041RR0TW", "context": "will this work with 64bit os?", "response": "Yes; it is plug-and-play on both 32- and 64-bit OS."}
{"product_id": "B001NT9TK4", "context": "does this wheel work for consoles mainly the Xbox 360 or PS3?", "response": "I know it works for PS3 as that is what I used it with.  Don't know about xbox for sure as I don't own one but I would assume it will as xbox has racing games.  I'm sure an internet search will answer your question about the xbox compatibility."}
{"product_id": "B00D9EPI38", "context": "So, DOES it have hdmi output? (The Xbod itself is not a monitor so I can't \"watch movies right on it.\" I still have to connect to a screen)", "response": "Yes, but am I able to do that with an hdmi cable? And so I ask again, does this have an hdmi output so that I can get hi def image on my tv when I hook this up? Yes or no?"}
{"product_id": "B001Q55D5K", "context": "will it work with windows 7?", "response": "I have the italian version and this works well on Windows 7 64 bit edition."}
{"product_id": "B00CD1FCAC", "context": "A key's light already went out after a month. Is this a normal problem or i there a way to get a new one from the warranty?", "response": "It happens. Contact Corsair for RMA. They will send you a new one."}
{"product_id": "B00CMC6HCY", "context": "is sheamis on the game", "response": "yes.. he should be anyways.. i bought this game for my husband.. i personally only played a few times..."}
{"product_id": "B00A878J5I", "context": "can you charge the Wiimotes with the wrist strap still on the controller?", "response": "Yes there is a slot to hold the wrist strap to the side of the device. This has worked for me very well. You just need to make sure the strap is out of the way when you place the Wiimote into slot and a light will turn on indicating its charging."}
{"product_id": "B000RA778G", "context": "how many players are on this game?", "response": "there are three others , and then you have to choose two of them.  You also can play alone"}
{"product_id": "B00D8S4GNS", "context": "Do I need Kinect to use this game?", "response": "Yes you do. You can control the menu and things with the controller but the actual gameplay is all about your own movements."}
{"product_id": "B00519C7CE", "context": "Can a 12 year old boy play this game? And not have it to many curse words", "response": "I would not recommend this game for anyone under 18 years old because of the language and violence. Yes, it is a military based game but that doesn't mean a child should be playing it."}
{"product_id": "B00FLZ4FS2", "context": "Will you ship the case or just email the code?", "response": "I already shipped this back to you. It was a quick turnaround back to you. I shipped it back the same way that you sent this to me. It was a return to sender package. You did not have the disc inside."}
{"product_id": "B00BCEK2LK", "context": "what does the button do?", "response": "It is for changing the DPI.  Go to the help (?) in the software menu and read the results."}
{"product_id": "B004TTNTYW", "context": "How long is the actual chord?", "response": "think charger the cord wasn't the normal size that you get with a ds it was short you have to sit really close to the outlet"}
{"product_id": "B008UQWX0Q", "context": "does this have a camera?", "response": "has 2 cameras front and one in the back"}
{"product_id": "B00CMQTVK0", "context": "If I was to buy the used like new day one edition will I still be able to get the day one achievement?", "response": "That really depends on if the previous person didn't use it, more then likely they did! There is no difference between the regular one and day one edition besides the controller saying day one and the achievement. If you don't mind about that the other ones sell for a little less."}
{"product_id": "B0090ECASW", "context": "do you get the mad catz or cyborg version? Also, do the keys light up and (if so) are you able to choose the color?", "response": "The keys light up,very cool.  DOES NOT work with WINDOWS 8 OS"}
{"product_id": "B00H8NS1K8", "context": "Anyone else's ear cup joints a little loose/wiggly?", "response": "I have been using this headset for almost a year now and I dont have a loose ear cup joints"}
{"product_id": "B00AK4QB22", "context": "do you have to be on xbox live in order to play these dark souls games online?", "response": "Yes if you don't have xbox live gold when your at the main menu it will tell you that you will be switched to offline mode it won't effect your progress whenever you get xbox live gold subscription it'll pick up where ever you are in the game."}
{"product_id": "B00E0H5J8M", "context": "Can you adjust the polling rates?", "response": "On my mouse i can it has options for 125 hz. 250hz  500 or 1000 in the settings menu"}
{"product_id": "B0050SY77E", "context": "How long is this  campaign?", "response": "Pretty long. Have you played Crysis 2? If so it's about just as long."}
{"product_id": "B009AFLXZM", "context": "I know that the box says \"no,\" but will this mic work with the wii (as in not the wii u)?", "response": "I was thinking of using this microphone for something else. What type or size of plug in does it have?"}
{"product_id": "B00BFOEY3Y", "context": "can this be used on a mac?", "response": "Yes it can be used with Mac.Sincerely,Triple H Com, Inc."}
{"product_id": "B006LVZEN0", "context": "Does it have on-board memory for the profiles? I currently have a G700 and this feature has almost become a requirement for me (Plug 'N Play).", "response": "No it does not :-( you can save your profile to dropbox or something but you have to install the drivers and software on any machine you use it on"}
{"product_id": "B0058FAEAS", "context": "What is the purpose of the mode switch?  Is it simply to assign functions to/for different games?", "response": "In general, yes. However you'll need to use Saitek's SST software or Dowson's FSUIPC4 in order to assign different axis/button commands for each mode switch position."}
{"product_id": "B0096L2SJ0", "context": "Will it work on emulated games?", "response": "You will have to download an app and configure all the buttons to play emulated games.too much work if you ask me. It works best with the games it offers. Lots of games but still limited"}
{"product_id": "B00F2ENJY8", "context": "So this is an actual video game console? Cause the price difference between the Wii Mini and U is about 200 bucks. Can someone specify ?", "response": "Yes. I got this for my kids for Christmas and it is pretty much the same thing as a regular wii but can not connect to wifi. It is also just different color. Plays all the wii games but not wii u games. Hope this helps."}
{"product_id": "B00EPZ8POY", "context": "is this like a story mode or it's your standard fighting game?", "response": "I didnt buy it for myself but i do think its like a story mode in which you are figting you way up just like in the anime series"}
{"product_id": "B009XZ1CTQ", "context": "Okay so I've downloaded I think 4 mods for fs 2013 but can't find them during game play how do I find them?", "response": "It depends if you opened the file (not extract it). I have had lots of problems with my game as well"}
{"product_id": "B00CMSCWGS", "context": "what kind of controller do you use to play?  can you use a ps3 or similar controller?", "response": "I bought myself a Microsoft Xbox wireless receiver for an xbox controller and use it on my laptop. It works perfectly:) the receiver has a USB that you can just plug it in to your PC and it works for all xbox controller. I don't know about ps3 controllers tho sorry."}
{"product_id": "B00D9FQAM0", "context": "is there a headset included", "response": "Yes, but only when u buy it brand new but before you order check the details, it's should list all things you will get"}
{"product_id": "B00DGZDFO4", "context": "i have windows 8.1 will these game work or do i need to buy the disk", "response": "it works great on 8.1. no need to get a disk dude. if you're a fan, its worth getting, also the next mortal kombat game is coming out in april. mortal kombat x, check it out."}
{"product_id": "B0053BCML6", "context": "Can more then one person have a house in New Leaf just like in Animal Crossing City Folks?", "response": "Yup :) Up to four playable characters and houses, the first person created will be Mayor and the rest will just be villagers :)"}
{"product_id": "B00FNKMVUO", "context": "the thumb buttons, are they mechanical or membrane?", "response": "Mechanical - click to press"}
{"product_id": "B003JVF728", "context": "Does this game work on a Windows 7 laptop?", "response": "Yes, but the only problem is i can't play with other in Mac OS platforms this is the main issue and now i don't play it anymore."}
{"product_id": "B00IAVDPSA", "context": "Do the up and down arrows to the right of the volume change the channel?", "response": "Yeah they change the channel.Do different things depending on application too"}
{"product_id": "B002BRZ9G0", "context": "Myself and one other person I know purchased this game when it was first released. Now when we load it in Wii it won't work, says it's not readable(both games, no damage to them) ??", "response": "Maybe you have an older model Wii. If you have a Wii U, it works fine on that console."}
{"product_id": "B003NSLGW2", "context": "Will it fit a Gamecube controller?", "response": "I don't have a game cube controller to check the fit. But the grip it seems a little to small. So if the game cube stick is smaller then it should work pretty good."}
{"product_id": "B00EZPCWWA", "context": "Do you need wifi to operate the ds", "response": "You can play the 2DS without wifi.  For online multiplayer or for buying games through the online shop, you will need internet access."}
{"product_id": "B002QHDKE8", "context": "Should I play skate 1&2 before Skate 3? I usually like to play games in order but I only have $40 to spend. Thank you in advance if you answer.", "response": "No, there's really no story to the Skate series, just better gameplay and graphics. I'd say it would be great for you to skip the first two games and decide on Skate 3 instead. It's a great game, and definitely better than the other games!"}
{"product_id": "B0087ZMATE", "context": "Does it have a mute button for the mic?", "response": "No, you'll have to mute it via Windows or directly in the software (like skype)."}
{"product_id": "B00EZKNSTQ", "context": "does it work with pc?", "response": "yes absolutely in fact that's exactly why i bought it. you just plug it in and play;^) i use it to play skyrim at work when its slow lol. i have a Macbook Pro loaded up with Windows 7 via Bootcamp."}
{"product_id": "B005THAX5Q", "context": "Is it couch co-op?", "response": "Only in campaign mode"}
{"product_id": "B00DRKJBC8", "context": "I'm currently hospitalized and on a netbook. If i buy this will I be able to transfer this to my home computer?", "response": "This game is based on Steam, if u use steam then yes"}
